[{"isVegetarian": true, "title": "Pan-fried tomatoes", "url": "www_bbc_co_uk_food_recipes_panfriedtomatoes_84048", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["small bunch fresh basil ", "2 tbsp olive oil, plus 1 tbsp extra", "1 garlic clove, crushed", "sea salt and freshly ground black pepper", "2 tomatoes, thickly sliced", "25g/1oz plain flour"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the basil, oil and garlic into a food processor and blend until smooth. Season, to taste, with sea salt and freshly ground black pepper.", "Spoon the basil oil onto one side of the cut tomatoes.", "Place the extra tbsp oil into a frying pan over a high heat.", "Dredge the tomato slices in the flour, then place the tomatoes into the hot pan and fry for 2-3 minutes on each side, or until golden."]}, {"isVegetarian": false, "title": "Pan-fried squid with borlotti beans, chilli, anchovy, parsley and chopped rocket", "url": "www_bbc_co_uk_food_recipes_panfriedsquidwithbor_85600", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/11oz dried borlotti beans", "1 sprig sage", "1 red chilli, pricked with a knife", "1 garlic clove, cut into quarters", "2 tomatoes", "3 tbsp olive oil", "1 tsp red wine vinegar", "salt and freshly ground black pepper ", "6 whole fresh squid", "drizzle extra virgin olive oil", "1 red chilli, de-seeded and finely chopped", "3 anchovy fillets, chopped", "2 tbsp flatleaf parsley, chopped", "½ lemon, juice only", "salt and freshly ground black pepper", "handful chopped rocket, dressed with olive oil and lemon juice"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the beans, soak the borlotti beans overnight in plenty of clean cold water.", "Drain the beans and transfer to a large pan with three times the volume of water. Add the sage, chilli, garlic and tomatoes.", "Bring to the boil then reduce the heat to a simmer. Simmer gently for one hour or until the beans are tender (the time may vary depending on the age of the beans).", "Drain off three-quarters of the cooking liquor then transfer the beans and the remaining cooking liquor into a bowl. Remove and discard the chilli and sage. Remove the garlic, mash with a fork then return to the beans and stir through.", "Season with salt and black pepper and stir in the olive oil and vinegar.", "For the squid, peel off the wings and outer membrane and remove the head and intestines. Cut in half lengthways and scrape out the inside with a knife. Wash thoroughly with cold water and pat dry.", "Lay the squid pieces flat, skin-side down, and score with a sharp knife in a criss-cross pattern.", "Season the squid with salt and freshly ground black pepper and rub a little olive oil into the skin.", "Place a non-stick pan over a medium heat. When hot, add the squid, scored side down. Cook for one minute until golden-brown, then turn over. ", "Add the chilli, anchovy fillets, parsley and lemon juice to the pan. ", "Remove the squid and quickly slice into bite-sized pieces. Return immediately to the pan and toss briefly through the other ingredients.", "To serve, place a spoon of the borlotti bean mixture in the centre of a plate. Place a small amount of rocket on top and then the chopped squid."]}, {"isVegetarian": false, "title": "Pan-fried trout with almond purée", "url": "www_bbc_co_uk_food_recipes_panfriedtroutwithalm_86542", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["7g/½oz unsalted butter", "1 shallot, chopped ", "pinch salt", "600ml/1 pint 2fl oz milk", "200g/7oz almonds, flaked or whole, lightly toasted", "dash double or whipping cream", "dash almond oil", "freshly ground black pepper, to taste", "15g/½oz unsalted butter", "½ tbsp olive oil", "4 whole trout, scaled, gutted and heads removed ", "salt and freshly ground black pepper ", "1 lemon, juice only", "small bunch parsley, chopped"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5.", "For the almond purée, in a medium-sized pan melt the butter and sweat the chopped shallots until soft and transparent. Season with salt, to taste.", "Add the milk and almonds and bring to the boil. Cook for 30 minutes.", "Place the almonds and shallots into a blender with a few tablespoons of the milk they have been cooked in. Blend to make a fine purée. Adjust the consistency by adding more cooking liquid if required and a dash of cream and almond oil to taste.", "Return the purée to a smaller pan, season with salt and freshly ground black pepper and keep hot.", "For the trout, melt the butter with the olive oil in a non-stick, ovenproof pan. Heat until the butter is foaming. Season the trout with salt and freshly ground black pepper before placing them into the pan. Cook for approximately three minutes on the first side before carefully turning the trout over and transferring the pan to the oven for ten minutes.", "Remove the pan from the oven. Squeeze the lemon juice over the trout and leave to rest for a few minutes.", "To serve, spoon some of the hot almond purée onto each serving plate before placing the fish onto the plate. Add the parsley to the warm cooking oil in the pan, stir, then spoon over and around the fish."]}, {"isVegetarian": false, "title": "Pan-fried trout with orange hollandaise and fennel and grapefruit salad", "url": "www_bbc_co_uk_food_recipes_panfriedtroutwithora_92674", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tsp lemon juice", "2 tsp white wine vinegar", "2 large free-range egg yolks", "125g/4½oz butter", "pinch salt", "1 orange, zest only", "salt and freshly ground black pepper", "50g/2oz unsalted butter", "1 whole trout, filleted, skin removed", "1 orange, segmented (collect and reserve the juice released as you segment the orange in a bowl)", "1 pink grapefruit, segmented (collect and reserve the juice released as you segment the grapefruit in a bowl)", "1 fennel bulb, finely sliced", "2 shallots, peeled, finely sliced", "2 tbsp chopped fresh parsley", "2 tbsp extra virgin olive oil", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the orange hollandaise, heat the lemon juice and white wine vinegar in a non-reactive pan until just boiling. ", "Meanwhile, heat the butter in a heavy-based pan over a low to medium heat until melted. (NB: Do not overcook the butter or it will burn.) ", "Blend the egg yolks and salt in a food processor until well combined. ", "With the motor running, gradually add the hot lemon and vinegar mixture in a thin stream, until all of the mixture has been fully incorporated into the egg yolks.", "With the motor running, gradually add the melted butter in a thin stream, until all of the butter has been fully incorporated into the mixture and the sauce has thickened.", "Transfer the hollandaise sauce to a bowl, then stir in the orange zest and season, to taste, with salt and freshly ground black pepper. Set aside (keep warm).", "For the trout and orange salad, heat 25g/1oz of the butter in a pan over a medium heat. When the butter is foaming, add the trout fillets and fry for 2-3 minutes on each side, or until cooked through. (NB: The trout is cooked through when the flesh is opaque.) Remove from the pan and keep warm.", "Heat the remaining 25g/1oz of butter in a separate frying pan over a medium heat. When the butter is foaming, add the orange and grapefruit segments and fry on both sides until caramelised.", "Meanwhile, blanch the sliced fennel and shallots in a large pan of boiling, salted water. Drain well, then refresh in ice-cold water. Drain again.", "In a large bowl, mix together the blanched fennel and shallots, caramelised orange and grapefruit and chopped parsley until well combined.", "Whisk together the extra virgin olive oil and the juices reserved from the segmented orange and grapefruit. Season, to taste, with salt and freshly ground black pepper.", "To serve, divide the fennel and grapefruit salad equally between two serving plates. Place one trout fillet on top of each portion. Drizzle over the orange hollandaise. Drizzle the oil and citrus dressing around the edge of the plates."]}, {"isVegetarian": false, "title": "Pan fried trout with new potatoes and green beans", "url": "www_bbc_co_uk_food_recipes_panfriedtroutwithnew_76752", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["110g/4oz new potatoes", "110g/4oz French beans", "knob of butter", "2 trout fillets", "salt and freshly ground black pepper", "55g/2oz unsalted butter, melted"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Bring a pan of water to the boil and boil the new potatoes for 8-10 minutes, or until tender, and the beans for 3-4 minutes. Drain.", "Gently heat the butter in a non-stick frying pan. Season the trout fillet and pan fry for 2-3 minutes on each side. ", "Transfer the trout to a serving plate. Spoon the new potatoes and beans alongside and drizzle with the melted butter to serve."]}, {"isVegetarian": false, "title": "Pan-fried trout with rhubarb and mizuna and croûton salad", "url": "www_bbc_co_uk_food_recipes_panfriedtroutwithrhu_87935", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["40g/1½oz butter", "2 trout, filleted and skinned", "salt and freshly ground black pepper ", "2 stems rhubarb, sliced very thinly", "2 tsp caster sugar", "½ tsp ground ginger", "½ crusty white loaf", "2 tbsp olive oil", "salt and freshly ground black pepper ", "½ lemon, juice and zest", "1 tsp Dijon mustard", "salt and freshly ground black pepper ", "3-4 tbsp extra virgin olive oil", "50g/2oz mizuna leaves", "50g/2oz baby spinach leaves", "25g/1oz flatleaf parsley leaves"], "serves": "", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the trout, heat a frying pan until hot and add half of the butter.", "Season the trout with salt and freshly ground black pepper, to taste, and place in the pan.", "Cook for two minutes, before carefully turning over with a fish slice and frying for a minute more. Remove the fish from the pan and set aside in a warm place.", "Heat a separate frying pan and add the remaining butter. Add the rhubarb, sugar and ground ginger and stir fry briefly until the rhubarb has just softened and the sugar has dissolved. Set aside in a warm place.", "For the croûtons, slice the crusts from the bread and cut into 1cm/½in cubes.", "Heat a frying pan until hot and add the olive oil. Add the cubed bread and salt and freshly ground black pepper, to taste. Fry for 2-3 minutes until golden-brown and crunchy.", "Transfer the fried bread to a plate lined with kitchen paper.", "For the salad, place the lemon juice and zest into a small bowl and add the mustard. Season with salt and freshly ground black pepper and whisk in the olive oil.", "Place the mizuna, baby spinach and flatleaf parsley leaves into a bowl, along with the croutons and the dressing and mix to combine.", "Divide the trout equally among four plates and top with some of the rhubarb. Place a pile of salad alongside and serve."]}, {"isVegetarian": false, "title": "Pan-fried turbot with wild mushrooms, mashed potatoes and cream sauce", "url": "www_bbc_co_uk_food_recipes_panfriedturbotwithwi_87179", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["55g/2oz butter", "2 tbsp olive oil", "salt and freshly ground black pepper ", "4 x 150-175g/6-7oz turbot fillets, skinned", "175ml/6fl oz white wine", "175ml/6fl oz fish stock", "175ml/6fl oz double cream", "55g/2oz butter", "2 tbsp olive oil", "2 shallots, finely chopped", "1 garlic clove, finely chopped", "200g/8oz mixed wild mushrooms", "½ lemon, juice only", "2 tbsp flat leaf parsley, roughly chopped", "mashed potato"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a frying pan until hot and add the butter and the olive oil.", "Season the fish with salt and freshly ground black pepper and place into the pan when the oil and butter are sizzling hot. Cook the turbot fillets for 2-3 minutes on each side, or until golden brown all over.", "For the cream foam, pour the white wine into a pan over a medium heat and bring to the boil. Boil until reduced by two thirds, then add the fish stock. Bring back to the boil and cook until the liquid has reduced by two thirds.", "Add the cream, bring back to the boil and cook until the liquid has reduced by half, then season, to taste, with salt and freshly ground black pepper. Set aside and keep warm until ready to serve.", "For the mushrooms, heat a clean frying pan and add the butter and the olive oil. Once hot add the shallots and garlic and fry for 2-3 minutes, until softened.", "Add the mushrooms and cook for a further two minutes, then season, to taste, with salt and freshly ground black pepper and add the lemon juice and parsley.", "Using a hand blender, blend the cream sauce until light and foaming.", "To serve, place a large spoonful of mashed potato into the centre of each plate. Place a turbot fillet on top of each and spoon the mushroom mixture around the edge of the potato. Spoon a little of the sauce foam over the mushrooms and serve."]}, {"isVegetarian": false, "title": "Pan-fried veal fillet with wild mushrooms, asparagus, wild garlic and sherry sauce", "url": "www_bbc_co_uk_food_recipes_panfriedvealfilletwi_88996", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["110g/4oz unsalted butter ", "75g/3oz shallots, sliced ", "10 sprigs fresh thyme", "110g/4oz button mushrooms, sliced ", "200ml/7fl oz dry Amontillado sherry ", "200ml/7fl oz chicken stock ", "200ml/7fl oz double cream ", "salt and freshly ground black pepper", "4 x 175g/6oz rosé veal fillets, cut into medallions ", "salt and freshly ground black pepper", "110g/4oz butter ", "1 tbsp olive oil ", "20 garlic cloves, peeled and blanched 3 times (place in cold water, bring to the boil, drain and refresh in cold water and repeat twice more)", "sprig fresh thyme", "20 asparagus tips, peeled and trimmed", "150g/5oz mixed wild mushrooms (such as mousserons, girolles, pied blue)", "110g/4oz wild garlic", "110g/4oz baby spinach leaves"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the sauce, heat a frying pan until just hot, add half the butter and the shallots. Cook over a low heat until soft and transparent. ", "Add the thyme and mushrooms and cook until the mushrooms have softened.", "Add the sherry, turn up the heat and simmer until the liquid is reduced in volume by half.", "Add the chicken stock and simmer until the liquid has reduced in volume by half again.", "Add the cream and simmer until the liquid has reduce in volume by half again.", "Whisk in the remaining butter, pass through a fine sieve into a clean pan and season, to taste, with salt and freshly ground black pepper. Keep warm.", "For the veal, season the veal medallions with salt and freshly ground black pepper.", "Heat a frying pan until hot and add a third of the butter and all of the olive oil. Add the veal and fry gently for 2-3 minutes, without turning, until golden-brown on one side.", "Turn the veal over, add the garlic and thyme and fry for 2-3 minutes or until the veal is golden-brown on both sides and the garlic is golden in colour and soft.", "Remove the veal and garlic from the pan and leave to rest in a warm place.", "Spoon off any excess fat from the cooking juices in the pan and add a splash of water to the pan to deglaze, scraping off any brown bits stuck to the bottom of the pan.", "Add this liquid to the sherry sauce. Reheat the sauce, whisking all the time, until the cooking juices have been incorporated. Keep warm.", "Bring a shallow pan of water to the boil, add another third of the butter and the asparagus. Cook gently for 2-3 minutes, until just tender, and drain", "Heat a separate frying pan until hot, add the remaining butter, the mushrooms, wild garlic and spinach leaves and sauté for 2-3 minutes, or until the mushrooms are cooked and the leaves wilted. Season, to taste, with salt and freshly ground black pepper.", "To serve, spoon two-thirds of the mushroom mixture into the centre of a large warm serving platter. Top with the veal medallions and the remaining mushroom mixture. Place the asparagus to one side and spoon over the sauce."]}, {"isVegetarian": false, "title": "Pan-fried wild salmon with spiced shellfish butter", "url": "www_bbc_co_uk_food_recipes_panfriedwildsalmonwi_81726", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["35ml/1fl oz tomato ketchup", "25g/1oz English mustard", "25g/1oz capers", "2 shallots, finely chopped", "handful parsley, finely chopped", "1 tbsp snipped chives", "½ tsp chopped marjoram", "½ tsp thyme leaves", "6 tarragon leaves, finely chopped", "½ tsp chopped rosemary", "1 clove garlic, finely chopped", "6 anchovy fillets, finely chopped", "1 tbsp brandy", "1 tbsp Madeira", "½ tsp Worcestershire sauce", "1 tbsp paprika ", "½ tsp curry powder", "½ tsp cayenne", "1 lemon, zest and juice", "1 orange, zest only", "1 tsp salt", "450g/1lb butter, at room temperature, cut into small cubes", "150ml/5fl oz dry white wine ", "2 shallots, finely chopped", "1 clove garlic, finely chopped", "½ tsp soft thyme leaves ", "350g/12oz each small mussels and cockles or small clams ", "1 tsp olive oil ", "4 wild salmon fillets, each about 175g/6oz, skinned ", "salt and freshly ground black pepper ", "25g/1oz unsalted butter ", "1 tbsp reduced tomato passata or thinned tomato purée", "115g/4oz cooked brown shrimps, peeled ", "2 large diver-caught scallops, diced ", "8 Ratte or Pink Fir Apple potatoes, steamed until tender and peeled, to serve"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["First make the Café de Paris butter. Combine all the ingredients, except the butter, in a large bowl. Set aside for 4 hours. ", "Beat the butter until fluffy, then mix with the other ingredients. Transfer to a sheet of cling film and shape into a neat log about 2.5cm/1in in diameter. Wrap in the cling film and chill. (This will make more butter than you need for this recipe, but it can be kept in the freezer for up to 6 months; it is good on steaks, chicken and fish.)", "For the salmon, heat the wine with the shallots, garlic and thyme in a large saucepan over a low heat for 3 minutes. Turn the heat up and add the mussels and cockles or clams. Cover with a lid and give the pan a good shake, then cook for about 3 minutes or until all the shells have just opened. Discard any that do not open.", "Tip into a sieve or colander set over a bowl so you can retain the juices. When cool enough to handle, remove the mussels and cockles from their shells and set aside; retain a few in their shells for garnish.", "Return the juices to the pan and reduce over a high heat until you have 4 tablespoons left. Keep warm. ", "Heat a large frying pan until very hot. Add 1 tablespoon of the Café de Paris butter and the olive oil. Season the salmon with salt and freshly ground black pepper and place in the pan. Cook for 2-3 minutes on each side, depending on the thickness. Remove and keep warm. ", "Pour the shellfish juices into the hot fish pan and stir to combine with the pan juices. Add 2 tablespoons of the Café de Paris butter, the unsalted butter and the reduced passata and cook until emulsified. Check the seasoning. Add the shelled mussels and cockles, shrimps and scallops and warm through. ", "To serve, place the salmon on four warmed plates and spoon the shellfish butter over the fish. Garnish with the mussels and cockles in shell and the steamed potatoes."]}, {"isVegetarian": false, "title": "Pan-fried veal with creamy wild mushrooms and cavolo nero", "url": "www_bbc_co_uk_food_recipes_panfriedvealwithcrea_92850", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ veal escalope", "100g/3½oz wild mushrooms", "2 tbsp brandy", "25g/1oz butter", "50ml/2fl oz double cream", "salt and freshly ground black pepper", "2 tbsp chopped chives", "25g/1oz butter", "1 tbsp olive oil", "150g/5½oz cavolo nero, stalks removed, finely sliced", "200ml/7½fl oz vegetable stock"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the veal, heat the olive oil in an ovenproof frying pan, and fry veal for 4-5 minutes on both sides, or until golden-brown on all sides. Remove the veal from the pan and set aside. Keep warm.", "Add the mushrooms to the same pan used to cook the veal and fry for 5-6 minutes. Return the veal to the pan.", "Add the brandy, heat briefly, then set light with a match. Let the flames flare up, then die down. Cook for 3-4 mins longer until most of the liquid has evaporated. (CAUTION: Keep the flames away from the eyes and face. Do not leave unattended.)", "Add the butter and cream, bring to the boil and heat for one minute. Season, to taste, with salt and freshly ground black pepper, then stir in the chopped chives.", "For the cavolo nero, melt the butter and olive oil in a frying pan and add the cavolo nero. Fry for one minute, then pour in the stock, bring the mixture to the boil and boil for 4-5 minutes, or until tender. ", "To serve, spoon the veal and wild mushrooms onto a serving plate and serve the cavolo nero alongside."]}, {"isVegetarian": false, "title": "Pan-fried whole crab with chilli paste", "url": "www_bbc_co_uk_food_recipes_panfriedwholecrabwit_10111", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1-1.5kg cooked whole crab", "2 tbsp coconut cream", "200ml/7fl oz coconut milk", "2 kaffir lime leaves, in fine julienne", "small bunch sweet Thai basil, picked", "lime juice, to taste", "palm sugar, to taste", "fish sauce, to taste", "300ml/10fl oz vegetable oil", "Note: This recipe originally uses Australian measurements. Equivalent measurements are as accurate as possible.", "This dish serves 1 devoted crab eater or 4 persons as part of a shared meal with steamed jasmine rice."], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Pull off the top shell of the crab, discard the brown lungs and wash.", "Pull off the claws, chop the body in half, and crack the hard shell on the claws with the back of a cleaver.", "Preheat the vegetable oil to 180C/350F in a large wok and add the crabmeat.", "Stir fry the crabmeat for 1-2 minutes, then remove from the oil and drain well on kitchen paper.", "To a large wok, add 2 tbsp vegetable oil and the coconut cream. Cook on a high heat until the coconut cream fats separate and it becomes fragrant, about 3 minutes.", "Add the chilli paste, lime leaf julienne and chilli halves, fry out until fragrant. This should take about 2 minutes or a touch longer for the homemade paste.", "Add the palm sugar and allow to caramelise, then the fish sauce. The flavours of hot, salty, sour and sweet should be balanced.", "Add the coconut, bring to the boil and simmer for a minute. At this point, add the crab to the wok and continue to stir-fry until just cooked through, about 5 to 6 minutes. ", "Add the Thai basil and lime juice."]}, {"isVegetarian": false, "title": "Pan-grilled chicken breasts with parsley salad and sun-dried tomatoes", "url": "www_bbc_co_uk_food_recipes_pangrilledchickenbre_73924", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 chicken breasts", "olive oil ", "salt and freshly ground pepper", "1 handful of fresh basil", "600ml/1 pint olive oil", "150ml/¼ pint rice wine vinegar", "1 shallot, finely chopped", "2 garlic cloves crushed", "salt and freshly ground pepper", "4 handfuls Italian curly parsley, de-stalked", "Worcestershire sauce", "8 chopped sun-dried or blushed tomatoes", "parmesan cheese, slivers of"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["First make the basil dressing. Whiz the basil with the oil, vinegar, shallot, garlic and seasoning in a blender or food processor. Keep aside.", "Brush the chicken breast with olive oil and cook on a pre-heated grill pan until just cooked through. The chicken should be golden on both sides and criss-crossed with markings from the grill pan. Season.", "For the salad, toss the parsley in a little of the basil dressing, and sprinkle with a little Worcestershire sauce. Put a portion of parsley salad on each plate, sprinkle with a few pieces of sun-dried tomato and slivers of parmesan cheese. ", "Serve with rustic roast potatoes or buffalo chips."]}, {"isVegetarian": false, "title": "Panhaggerty", "url": "www_bbc_co_uk_food_recipes_panhaggerty_93163", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp vegetable oil", "250g/9oz streaky bacon", "6 potatoes, thinly sliced into rounds", "2 onions, peeled, sliced", "5 carrots, peeled, sliced", "500ml/17½fl oz chicken stock", "salt and freshly ground black pepper, to taste", "150g/5oz cheddar cheese, grated", "crusty bread, to serve"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the vegetable oil in a deep ovenproof pan. Fry the bacon for 3-4 minutes, or until golden-brown and slightly crisp. Remove from the pan and set aside to drain on kitchen paper. ", "In the same pan used to cook the bacon, arrange a layer of the sliced potatoes in the bottom of the pan. Cover the potatoes with a layer of sliced onions, then a layer of sliced carrots. Layer over some of the crisp bacon, then season with salt and freshly ground black pepper. ", "Repeat the process with the remaining potatoes, onions, carrots and bacon, finishing with a layer of potatoes on top. Season with salt and freshly ground black pepper. ", "Pour in the chicken stock so that all of the ingredients are covered, then bring to the boil. Cover the pan with a lid and reduce the heat to a simmer. Simmer for 15-25 minutes, or until the potatoes and carrots are tender. ", "Preheat the grill to high. ", "Uncover the pan and sprinkle over the grated cheese. Grill for 5-6 minutes, or until the cheese is bubbling and golden-brown. ", "To serve, spoon the panhaggerty into bowls and serve with some crusty bread to mop up the juices."]}, {"isVegetarian": false, "title": "Pan haggerty with smoked salmon", "url": "www_bbc_co_uk_food_recipes_panhaggertywithsmoke_90142", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 onion, peeled, very finely sliced ", "200g/7oz Maris Piper, or similar waxy potatoes, very finely sliced", "50g/2oz butter", "salt and freshly ground pepper", "100g/3½oz smoked salmon, sliced", "75g/2½oz mature cheddar cheese", "100ml/3½fl oz yoghurt", "1 lemon, zest and juice only", "1 tbsp chopped fresh dill", "salt and freshly ground black pepper", "100g/3½oz smoked salmon slices"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/360F/Gas 4.", "Melt half of the butter in a deep ovenproof frying pan over a medium heat. Add the sliced onion and fry until softened, then remove from the pan with a slotted spoon.", "Place a layer of the potato slices into the same pan and fry for a few minutes until golden-brown.", "Add a layer of the fried onion, then add another layer of the potato slices. ", "Continue to layer onion, potato, onion, until you are ready to add the final layer of potato.", "Add a layer of smoked salmon and finish with a layer of potato.", "Melt the remaining butter in a separate pan. Pour the melted butter over the layers of potatoes, salmon and onions.", "Place the pan into the oven and bake for 40-45 minutes, or until cooked through. Towards the end of the cooking, preheat the grill to its highest setting.", "Before serving, grate the cheese over the top and finish under the grill until the cheese is melted and golden-brown.", "For the dressing, whisk together the yoghurt, lemon zest and juice and dill in a bowl. Season, to taste, with salt and freshly ground black pepper. ", "To serve, cut out wedges of the pan haggerty from the pan and place onto plates. Top with curled slices of smoked salmon and drizzle with the dressing."]}, {"isVegetarian": false, "title": "Panko-coated squid with palm sugar and coriander pesto", "url": "www_bbc_co_uk_food_recipes_panko-coated_squid_with_94929", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 tbsp palm sugar", "4 garlic cloves, crushed", "2 tbsp finely grated fresh root ginger", "3 red chillies, finely diced", "6 tbsp fish sauce", "½ bunch fresh coriander", "½ bunch fresh mint", "3 limes, zest and juice only", "4 squid", "110g/4oz plain flour", "2 medium free-range eggs, beaten", "110g/4oz Japanese panko breadcrumbs", "vegetable oil, for deep-fat frying", "2 tbsp coriander cress ", "50g/1¾oz mitzuna leaves", "25ml/fl oz rapeseed oil", "2 limes, cut into wedges ", "4 spring onions", "1 red chilli, cut into rounds"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the palm sugar and coriander pesto, place all the ingredients in a pestle and mortar and pound to a paste.", "For the squid, clean, score and prepare the squid. Pull the tentacles away from the body of the squid and remove the quill. Rinse inside the body of the squid under cold running water. Pull the ears (wing-like flaps) from the body. Pull the purplish skin from the ears and body to leave only the white meat.", "Cut the tentacles away from the guts by slicing just below the eyes. Check the centre of the tentacles for the hard beak, which can be discarded. (Discard the guts of the squid or, if desired, retain the ink sack to use in seafood pasta or risotto.)", "Either slice the body of the squid into rings, or cut down one side of it, open it out, scrape away any traces of guts left inside the body, then score the inside lightly in a cross-hatch pattern.", "Dry off the squid with kitchen roll before cooking.", "Prepare a plate of flour, a bowl of the egg and a plate of breadcrumbs.", "Preheat the oil in a deep-fat fryer to 180C/350F (CAUTION: hot oil can be dangerous; do not leave unattended.)", "Dip the prepared squid in the flour, then the egg and panko breadcrumbs and place in the deep fat fryer. Cook for a couple of minutes until golden-brown and crisp. Tip onto a plate lined with kitchen roll to drain.", "To serve, place each squid on a serving plate and drizzle the pesto over. Garnish with coriander cress and mitzuna dressed with the rapeseed oil, topped with lime wedges, spring onions and chilli."]}, {"isVegetarian": false, "title": "Panna cotta with mini doughnuts and fresh raspberries", "url": "www_bbc_co_uk_food_recipes_panna_cotta_with_mini_79814", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300ml/10fl oz double cream", "1 vanilla pod, split in half lengthways and seeds scraped out", "100ml/3½fl oz condensed milk", "2 gelatine leaves, soaked in water for at least five minutes", "350ml/12fl oz buttermilk", "25ml/1fl oz vodka", "250g/9oz strong white flour", "pinch salt", "50g/1¾oz caster sugar", "30g/1oz butter, softened", "1 tsp fast-action yeast", "vegetable oil, for deep frying", "250g/9oz raspberries", "25g/1oz caster sugar"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the panna cotta, chill a jug in the freezer.", "Heat the double cream, vanilla pod and seeds and the condensed milk in a saucepan until just boiling. Remove the pan from heat, add the soaked gelatine and buttermilk. Whisk until well combined.", "Pass the mixture through a fine sieve into the chilled jug, stir in the vodka.", "Place the jug in the fridge to chill, whisking every five minutes until the mixture begins to set. Pour the mixture into dariole moulds or ramekins and chill in the fridge for at least two hours.", "For the mini doughnuts, combine the flour, salt, and caster sugar in a large bowl.", "Mix in the butter, 150ml/5fl oz water and yeast until the mixture comes together to form a smooth dough. Cover with cling film and set aside in a warm place for about an hour, or until doubled in size.", "Divide the dough into 12 equal portions and roll each into a ball.", "Line a baking tray with baking parchment and place the dough balls onto it, leaving plenty of room between each ball. Cover with a tea towel and set aside in a warm place to prove for a further 20 minutes.", "When the dough has proved, heat the oil in a deep-fat fryer to 150C/320F. Alternatively, heat the oil in a deep, heavy-based saucepan until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Carefully lower the doughnuts into the hot oil in batches and deep-fry for 3-4 minutes, or until golden-brown. Remove from the pan using a slotted spoon and set aside to drain on kitchen paper.", "When the excess oil has drained off the doughnuts, place them onto a plate and dust with the remaining caster sugar until completely coated.", "To serve, place the raspberries, sugar and 50ml/2fl oz water in a pan and cook for 3-4 minutes. Blend until smooth and pass through a fine sieve. ", "Remove the panna cotta from the moulds and turn out into the centre of serving plates (briefly dip the base of each mould into a bowl of hot water and gently slide a knife around the edge of each panna cotta to loosen them). Serve with the doughnuts and raspberry sauce."]}, {"isVegetarian": false, "title": "Panna cotta with pineapple and ginger salsa", "url": "www_bbc_co_uk_food_recipes_panna_cotta_with_86218", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/panna_cotta_with_86218_16x9.jpg", "ingredients": ["sunflower oil, for greasing", "6 leaves fine leaf gelatine (11g) ", "600ml/20fl oz single cream", "300ml/10fl oz double cream", "75g/2½oz caster sugar", "1 tbsp vanilla extract", "1 small ripe pineapple, finely chopped(size of a currant)", "4 bulbs stem ginger, finely chopped (size of a currant)", "6 tbsp ginger syrup, from the jar"], "serves": "Serves 6", "time": {"preparation": "overnight", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 10, "preparationMins": 0}, "recommendations": 0, "method": ["Oil the inside of six 150–175ml/5-6fl oz metal individual pudding basins (timbale moulds) with sunflower oil and leave upside down to drain on kitchen paper to remove any excess.", "To make the panna cotta, soak the gelatine leaves in a bowl of cold water for about 5 minutes, or until soft.", "Pour both creams and the sugar into a saucepan and gently heat, stirring until just about to boil. Remove from the hob before it boils.", "Remove the gelatine from the water and squeeze to remove any extra water. Add the gelatine to the warm cream and stir until it has completely dissolved. Stir in the vanilla.  ", "Decant into a jug and pour into the moulds then cover with cling film. Leave in the fridge for a minimum of 6 hours, or ideally overnight, until firm to the touch.", "To make the salsa, mix the ingredients together in a bowl. Carefully turn out the panna cotta and invert it into the centre of a small plate. Spoon the salsa on top and around the edges."]}, {"isVegetarian": false, "title": "Panna cotta with roasted rhubarb and dripping cake", "url": "www_bbc_co_uk_food_recipes_panna_cotta_with_roasted_37276", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300ml/10½fl oz double cream", "1 vanilla pod, split in half lengthways and seeds scraped out", "100g/3½oz caster sugar", "2-3 gelatine leaves, soaked in water for a few minutes", "350ml/12fl oz buttermilk", "25ml/1fl oz vodka", "oil, for greasing", "140g/5oz soft brown sugar", "85g/3oz clarified beef dripping", "225g/8oz mixed dried fruit and candied peel", "225g/8oz wholemeal flour", "1 tsp baking powder", "1 pinch ground cinnamon", "1 pinch freshly grated nutmeg", "1 pinch ground allspice", "½ tsp bicarbonate of soda", "500g/18fl oz rhubarb, cut into batons", "2 tbsp light soft brown sugar", "4 tbsp apple juice"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the panna cotta, chill a large jug or bowl in the freezer.", "Heat the double cream, vanilla pod and seeds and sugar in a saucepan until just boiling. Remove the pan from heat, add the soaked gelatine and buttermilk and whisk until well combined", "Pass the mixture through a fine sieve into the chilled jug, and then stir in the vodka.", "Return the jug to the fridge and whisk the mixture every five minutes until it begins to set. ", "Pour the mixture into dariole moulds and chill in the fridge for at least two hours, or until completely set.", "For the dripping cake, preheat the oven to 180C/350F/Gas 4. Grease and line an 18cm/7in cake tin.", "Put the sugar, dripping, dried fruit and candied peel into a saucepan. Add 225ml/8fl oz water and bring to the boil. Simmer gently for 10 minutes, then allow to cool in the pan.", "Sift the dry ingredients together in a large bowl. Make a well in the middle and add the cooled dried-fruit mixture. Stir with a wooden spoon, gradually drawing in the flour from around the edge of the well, until you have a smooth batter.", "Spoon the batter into the prepared tin and bake for about 40 minutes, or until a skewer inserted in the centre comes out clean.", "Leave in the tin for five minutes before turning out on to a wire rack to cool completely.", "For the roasted rhubarb, preheat the oven to 200C/400F/Gas 6.", "Place the rhubarb on a roasting tray, sprinkle over the sugar then drizzle over the apple juice. Roast in the oven for 8-12 minutes, or until just tender.", "Blend 125g/4½oz of the roasted rhubarb to a purée in a food processor. Reserve the remaining roasted rhubarb. ", "To serve, remove the panna cotta from their moulds, by briefly dipping the base of each mould into a bowl of boiled water. Gently slide a knife around the edge of each panna cotta and turn out into the centre of a serving plate. Serve with the rhubarb purée, a slice of dripping cake and roasted rhubarb. "]}, {"isVegetarian": false, "title": "Panna cotta with lavender", "url": "www_bbc_co_uk_food_recipes_pannacottawithlavend_85680", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225ml/8fl oz water", "100g/3½oz caster sugar", "handful lavender flowers", "600ml/1 pint 1½fl oz double cream", "50g/1¾oz vanilla sugar", "1 orange, zest only", "2 tsp gelatine"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the lavender flowers, heat the water and caster sugar together in a pan. ", "Stir until the sugar melts and then boil steadily, so that the liquid can reduce a little. ", "Take the pan off the heat and leave to cool.", "When the sugar has cooled, add the lavender flowers to the pan.", "For the panna cotta, line six ramekins with cling film and place on a tray. Warm three quarters of the cream with the vanilla sugar and orange zest in a pan, taking care not to boil the cream.", "Strain the mixture through a sieve into a mixing bowl. ", "Sprinkle the gelatine over two tablespoons of water until it becomes spongy. Heat very gently in a clean pan over a low heat until it dissolves. ", "Add the cream mixture to the gelatine and take off the heat. Leave to cool. ", "Softly whip the remaining cream and add the cream to the mixture.", "Pour the mixture into the lined ramekins and transfer to the fridge to chill.", "Chill for at least two hours until set. ", "Turn the panna cotta out onto individual serving plates and drizzle the lavender syrup over them. Decorate with the sugary lavender flowers."]}, {"isVegetarian": false, "title": "Panna e prosciutto (ham, mushroom and cream sauce)", "url": "www_bbc_co_uk_food_recipes_pannaeprosciuttohamm_71533", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300ml/10fl oz single cream", "200g/7oz ham, cut into cubes", "100g/4oz salted butter", "pinch of grated nutmeg", "2 handfuls of button mushrooms, sliced", "handful of grated parmesan ", "salt", "freshly ground black pepper", "400g/14oz fresh tagliatelle, cooked according to packet instructions", "grated parmesan to taste"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["In a frying pan, shallow-fry the mushrooms and ham in the butter until golden.  Add the cream, season with salt and pepper and a pinch of nutmeg and allow to cook for about one minute.  ", "Add the cooked pasta to the sauce and allow to thicken, but not too much. ", "Serve immediately with a sprinkle of grated or shaved parmesan cheese."]}, {"isVegetarian": false, "title": "Pan-roast chicken with crème fraîche spatzle", "url": "www_bbc_co_uk_food_recipes_panroastchickenwithc_83701", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 lemon, zest only", "2 garlic cloves, crushed", "2 sprigs fresh thyme", "75ml/2½fl oz white wine", "2 tbsp rapeseed oil", "4 chicken legs, bones removed, skin on", "2 chicken breasts, wing bone on, skin on", "250g/9oz plain flour", "½ tsp celery seeds", "½ tsp salt", "pinch freshly ground black pepper", "7 large free-range eggs", "3 tsp rapeseed oil", "1 tbsp olive oil", "2 shallots, finely chopped", "100ml/3½fl oz white wine", "350ml/12oz crème fraîche ", "1 lemon, juice only", "1 garlic clove, crushed", "salt and freshly ground black pepper", "150ml/5fl oz rapeseed oil", "½ hispi cabbage, finely sliced ", "bunch of fresh dill, roughly chopped"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the chicken, place the lemon zest, garlic, thyme and wine into a bowl and mix well.", "Smear the marinade mixture over the flesh of the chicken to cover, then place flesh-side down in a dish and place in the fridge to marinate for at least one hour, preferably overnight.", "Preheat the oven to 230C/445F/Gas 8.", "Place a large, ovenproof frying pan over a medium heat. When hot, add the rapeseed oil and the chicken pieces skin-side down. Fry for 3-4 minutes, until golden-brown, then turn the chicken over and transfer to the oven to roast for 8-10 minutes, until cooked through and tender.", "To make the spätzle, place the flour, celery seed, salt, pepper and eggs into a food processor and blend until combined into a smooth, thick batter.", "Bring a large saucepan of salted water to the boil. Add a teaspoon of the oil to the water.", "Spoon the batter mixture into a thin-nozzled piping bag and drizzle the batter across the boiling water. Boil for 2-3 minutes, until cooked through. ", "Place a frying pan over a medium heat. When hot add the remaining two teaspoons of rapeseed oil.", "Drain the spätzle and place straight into the hot frying pan. Fry the spätzle for 1-2 minutes, until just coloured, then remove and set aside in a bowl.", "To make the sauce, heat a small frying pan over a low heat. When warm add the olive oil and shallots and fry for 4-5 minutes, until softened.", "Add the wine, bring to the boil and reduce the liquid volume by a third.", "Add the crème fraîche, reduce the heat and warm the sauce through.", "Spoon half of the sauce over the spätzle and stir to combine.", "For the cabbage, whisk the lemon and garlic together in a bowl and season with salt and freshly ground black pepper. Add the oil and whisk again.", "Pour the dressing over the cabbage, add the dill and stir.", "To serve, carve the chicken into several pieces, place onto warmed plates with a spoonful each of spätzle and cabbage. Drizzle over the remaining sauce to taste."]}, {"isVegetarian": false, "title": "Pan-roasted chicken with beetroot and cauliflower with horseradish cream", "url": "www_bbc_co_uk_food_recipes_panroastedchickenwit_84338", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp butter", "1 tbsp olive oil", "salt and freshly ground black pepper", "4 chicken breasts, skin on", "1 tbsp olive oil", "4 shallots, finely chopped", "1 clove garlic, finely chopped", "2 tbsp balsamic vinegar", "75ml/3fl oz extra virgin olive oil", "10g/½oz fresh chives, roughly chopped", "10g/½oz fresh flatleaf parsley, roughly chopped", "10g/½oz fresh dill, roughly chopped", "8 beetroot, cooked until tender, peeled and cut into segments", "salt and freshly ground black pepper ", "1 large cauliflower, cut into florets", "4 tbsp horseradish cream from a jar", "1 lemon, juiced", "150ml/5fl oz double cream, lightly whipped", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 180C/355F/Gas 4.", "For the chicken, heat a large ovenproof frying pan and add the butter and olive oil.", "Season the chicken all over with salt and freshly ground black pepper and, once the butter is foaming, place into the pan, skin-side down. Fry for 3-4 minutes, until golden.", "Turn the chicken breasts over and transfer to the oven to roast for 12-15 minutes, or until completely cooked through.", "Meanwhile, for the beetroot, heat a small pan with the olive oil. Add the garlic and shallots and gently fry for 2-3 minutes, until tender but not browned.", "Add the balsamic vinegar, extra virgin olive oil and herbs and mix well. Place the beetroot into a serving bowl and pour the shallot mixture over. Stir to coat and season, to taste, with salt and freshly ground black pepper.", "Meanwhile, for the cauliflower, bring a pan of water to the boil and add the cauliflower. Boil for 4-5 minutes, until just tender, then drain and refresh in iced water. Drain the cauliflower and set aside.", "Place the horseradish and lemon juice into a large bowl and whisk together. Add the whipped cream and season, to taste, with salt and freshly ground black pepper.", "Add the cauliflower to the horseradish mixture and stir well.", "To serve, place a spoonful each of the beetroot mixture and cauliflower mixture beside each other onto four plates and place a chicken breast onto each."]}, {"isVegetarian": false, "title": "Pan-roasted duck with cherry sauce", "url": "www_bbc_co_uk_food_recipes_panroastedduckwithch_83341", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ duck breast", "1 tbsp olive oil", "salt and freshly ground black pepper ", "6 cherries, stones removed", "1 tsp caster sugar", "100ml/3½fl oz white wine", "1 tsp cornflour, mixed into a paste with a little water", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "To make the duck, rub the duck on both sides with the olive oil then season with salt and freshly ground black pepper.", "Heat a frying pan and cook the duck for five minutes skin-side down. Pour off excess fat and turn the duck breast over. Place in the oven and cook for eight minutes. Remove and rest for one minute.", "To make the sauce, heat the cherries in a frying pan and stir in the caster sugar.", "Add the wine and cornflour paste and cook to reduce by half.", "Serve the breast in the middle of the plate and spoon the cherry sauce around."]}, {"isVegetarian": false, "title": "Pan-roasted goose breast with roast swede and chestnuts and leek and cranberry sauce", "url": "www_bbc_co_uk_food_recipes_panroastedgoosewithr_78831", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ goose breast", "salt and freshly ground black pepper", "½ swede chopped into large chunks", "50g/1¾oz butter", "1 tbsp olive oil ", "1 tin cooked, whole chestnuts ", "25g/1oz butter", "1 tbsp olive oil", "1 leek, washed and roughly chopped ", "1 large handful cranberry ", "2 tbsp balsamic vinegar ", "4 tbsp soft brown sugar"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Season the goose breast with salt and freshly ground black pepper and place, skin-side down into a hot oven-proof frying pan. Cook for five minutes until golden. Turn and cook for another minute.", "Drain the fat from the goose pan and transfer to the preheated oven for ten minutes, or until cooked through. Take out once cooked and leave to rest.", "Meanwhile, place the swede into a saucepan of boiling water and cook for eight minutes. Drain and set aside.", "In a separate oven-proof frying pan, melt the butter with the oil. Add the chestnuts and cooked swede and transfer to the preheated oven to roast for five minutes, or until golden.", "For the leek and cranberry sauce, heat the oil and melt the butter in a saucepan. Add the leeks and cook for five minutes until soft.", "Add the cranberries, balsamic vinegar and brown sugar and cook for a further five minutes.", "To serve, place the goose breast on a warm plate with the roasted swede and chestnuts. Spoon over the leek and cranberry sauce."]}, {"isVegetarian": false, "title": "Roast monkfish, vegetable medley and cashew butter sauce", "url": "www_bbc_co_uk_food_recipes_panroastedmonkfishve_84265", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tsp chopped fresh rosemary", "1 tsp chopped fresh parsley", "1 tbsp olive oil", "150g/7oz monkfish fillet", "salt and freshly ground black pepper ", "2 slices Parma ham", "50g/2oz baby carrot, blanched", "50g/2oz peas, blanched", "50g/2oz peeled and chopped potato, cooked", "25g/1oz butter", "salt and freshly ground black pepper ", "50g/2oz unsalted butter", "50g/2oz cashew nuts, finely chopped", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the monkfish, mix the herbs with the oil in a bowl and add the monkfish. Mix well to coat and leave to marinate for 2-3 minutes.", "Season the fish with salt and freshly ground black pepper and wrap with the Parma ham.", "Heat an ovenproof frying pan and add the fillet. Cook for one minute on each side, until the ham beginning to take colour, then transfer to the oven and roast for 6-8 minutes, or until completely cooked through.", "For the vegetable medley, place the vegetables in a bowl with the butter, mix together and season with salt and freshly ground black pepper.", "To make the cashew butter sauce, melt the butter in a frying pan over a medium heat. Add the cashew nuts and fry until golden-brown and season, to taste, with salt and freshly ground black pepper.", "To serve, place the vegetable medley onto a plate, arrange the fish on top and spoon over some of the cashew butter sauce."]}, {"isVegetarian": false, "title": "Pan-roasted haddock with white onion sauce and fried onion rings", "url": "www_bbc_co_uk_food_recipes_panroastedhaddockwit_83324", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz unsalted butter", "1 clove garlic, finely chopped", "½ white onion, thinly sliced", "50g/1¾oz fresh peas", "50ml/2fl oz double cream", "salt and freshly ground black pepper", "100g/3½oz haddock", "1 tbsp olive oil", "salt and freshly ground black pepper", "500ml/18fl oz vegetable oil", "100g/3½oz self-raising flour", "30ml/1fl oz sparkling water", "1 onion, sliced into thick rings", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "To make the white sauce, melt the butter in a frying pan. Add the garlic and onion and fry for 2-3 minutes, until soft.", "Add the peas and cook for five minutes. ", "Add the double cream and simmer for 3-4 minutes, until thickened, then season with salt and freshly ground black pepper.", "To make the haddock, rub the haddock with the oil and season well on both sides with salt and freshly ground black pepper.", "Heat an ovenproof frying pan and when very hot, add the haddock, skin-side down, to fry for one minute, until golden. Turn the haddock and transfer to the oven to roast for 6-8 minutes, or until completely cooked through.", "To make the onion rings, heat the oil in a deep saucepan until a breadcrumb sizzles and browns when dropped in it. (CAUTION: hot oil can be dangerous. Do not leave unattended!)", "Place the flour in a large bowl, add the sparkling water and whisk vigorously to form a batter.", "Dip the onion rings in the batter then carefully place into the oil to deep-fry until crisp and golden. Carefully remove with a slotted spoon and drain on kitchen towels.", "To serve, spoon the sauce into the middle of a warm plate. Place the haddock onto the sauce and top with the onion rings."]}, {"isVegetarian": false, "title": "Pan roasted salmon with mango and tomato salsa", "url": "www_bbc_co_uk_food_recipes_panroastedsalmonwith_75891", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ mango, chopped", "1 tomato, chopped", "pinch dried chilli flakes", "handful fresh mint, chopped", "4 spring onions", "1 tbsp olive oil", "½ sweet potato, grated", "2 tbsp Greek-style yoghurt", "1 free-range egg yolk", "1 tbsp olive oil", "½ salmon steak"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the salsa, purée half the chopped mango and add to the remaining mango flesh.  Add the tomato, chilli flakes and mint.", "Heat the oven to 220C/425F/Gas 7. Place the spring onions in a baking tray dressed in the oil. Bake for ten minutes.", "To make the rösti, mix the potato, yoghurt and egg yolk. ", "Heat the oil in a frying pan and flatten the potato mix into a ring mould in the pan. Fry for 4-5 minutes.  Remove ring and fry on other side until golden.", "Meanwhile, in another pan heat a drizzle of olive oil. Pan-fry the salmon placed skin-side down for 2-3 minutes each side.", "Serve the salsa on top of the rösti, topped with the spring onions and salmon steak."]}, {"isVegetarian": true, "title": "Pansotti with ricotta and fennel and walnut sauce", "url": "www_bbc_co_uk_food_recipes_pansotti_with_ricotta_75156", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz plain ‘00’ flour", "50g/2oz fine semolina, plus extra for dusting", "2 large free-range eggs (preferably organic)", "3 large free-range egg yolks (preferably organic)", "200g/7oz ricotta (preferably sheep’s milk ricotta)\t\t", "2 tbsp chopped feathery fennel tops ", "sea salt and freshly ground black pepper\t\t\t\t", "½ garlic clove", "110g/4oz walnuts", "juice of ½ lemon", "75g/3oz parmesan, grated (or other vegetarian hard cheese)", "2 tbsp full-fat milk", "4 tbsp olive oil", "1 tbsp chopped parsley ", "50g/2oz unsalted butter"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 70, "preparationMins": 60}, "recommendations": 0, "method": ["For the pasta, place the flour and eggs and egg yolks into a food processor and process for one minute until the dough comes together.", "Cover in cling film and place in the fridge to rest for 30 minutes. When chilled, divide the dough in half and keep one portion for another meal.", "Roll the remaining half of the dough through a pasta machine, gradually reducing the thickness, until the pasta is rolled as thin as possible. Dust with the semolina and set aside in the fridge until needed.", "For the pansotti filling, beat the ricotta and chopped fennel together in a bowl and season to taste with salt and freshly ground black pepper. ", "Take the pasta from the fridge and lay out on the work surface. Working 2cm/1in from the edge of the longest side, place heaped teaspoons of the filling at intervals along the length of the pasta with a 3cm/1¼in gap between each one.  ", "Brush between each portion of filling with a pastry brush dipped in water, then fold the unfilled half of the pasta sheet over to cover. ", "Using your two little fingers, push the pasta down round each portion of filling to seal. Make sure that there is no trapped air inside or the pasta will burst during cooking.", "Using a round pastry cutter, cut around the filling to create half-moon shapes. Pick them up individually to make sure each one is airtight. They will keep in a fridge on a floured tray for up to two days, or you can cook them immediately. ", "For the walnut sauce, crush the garlic with a pinch of sea salt in a pestle and mortar, then add the walnuts. Pound until smooth, then mix in the lemon juice, parmesan, milk, olive oil and parsley. ", "Whisk until the sauce emulsifies, then season, to taste, with salt and freshly ground black pepper.", "Cook the pansotti in a large pan of salted boiling water for 3-4mins. The water should be at a fast, rolling boil.", "Meanwhile, melt the butter in a large frying pan. Drain the pasta, add to the frying pan and mix to coat in the butter. ", "Add a generous spoonful of the walnut sauce and stir the pasta to coat. Add a good grinding of black pepper and serve, with extra walnut sauce if desired."]}, {"isVegetarian": true, "title": "Panzanella", "url": "www_bbc_co_uk_food_recipes_panzanella_23604", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/panzanella_23604_16x9.jpg", "ingredients": ["handful fresh basil", "4 tbsp extra-virgin olive oil, plus extra for drizzling", "1 tbsp salted capers, rinsed ", "300g/10½oz stale sourdough, torn into chunks ", "500g/1lb 2oz ripe tomatoes (preferably heirloom, in variety of colours, shapes and sizes), washed and sliced, reserving the seeds and juice ", "55g/2oz Kalamata or other dark olives, stones removed, sliced", "½ red onion, thinly sliced", "1 tbsp red wine vinegar", "sea salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Blend most of the basil (reserving a few leaves for garnish) in a food processor with the oil and capers. (Alternatively, finely chop the basil and capers together by hand and stir into the oil).  ", "Transfer half the herby caper oil to a bowl, add the sourdough and mix well. ", "Place the tomatoes, squeezing some of them to release their juice, in a large salad bowl along with the reserved seeds and juice. Mix with most of the olives and red onion, and some more olive oil. Add the sourdough, herb oil mixture and vinegar, and combine to make sure the bread is coated in all the juices. ", "Transfer the salad to a serving platter, layering the tomato slices, olives, onion and sourdough. Drizzle over the remaining herb oil and garnish with basil leaves and the remaining red onion and olives. Season again with salt and pepper and serve immediately. "]}, {"isVegetarian": true, "title": "Panzanella", "url": "www_bbc_co_uk_food_recipes_panzanella_72070", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/panzanella_72070_16x9.jpg", "ingredients": ["2 red peppers ", "2 yellow peppers", "225ml/8fl oz extra virgin olive oil", "800g/1lb 12 oz ripe plum tomatoes", "1 tbsp large green olives", "1 tbsp capers, drained and rinsed", "1 ciabatta loaf", "3 tbsp red wine vinegar", "2 garlic cloves, crushed", "salt and freshly ground black pepper", "large handful of fresh basil leaves"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Place the peppers on a roasting tray, drizzle a splash of the olive oil over and roast for about 15-20 minutes, or until the peppers are softened but not charred. Place them in a large bowl and cover with cling film for about 20 minutes.  (When they have cooled the skin should peel away easily.)", "Cut the stalk out of the tomatoes and blanch them by plunging in to a jug of boiling water for 45 seconds, or until the skins start to peel away.  Using a slotted spoon, scoop out the tomatoes and plunge into a bowl of cold water.  Once they have cooled, the skins should easily peel away.  ", "Cut the skinned tomatoes into quarters. Remove the seeds and place them in a sieve over a bowl. Put the tomato quarters into a large bowl.", "Push the seeds into the sieve to release the juice.", "Peel the roasted peppers and remove and discard the seeds. Cut the flesh into large strips and put in the bowl with the tomatoes.", "Mix the olives and capers with the tomatoes and peppers.", "Rip the ciabatta into large chunks and put to one side.", "Mix the vinegar, garlic and remaining oil with the tomato juice. Add salt and pepper and stir to combine. Add the ciabatta pieces to the bowl and leave for at least an hour so that the bread soaks up all the juice.", "After an hour mix the ciabatta with the tomatoes and peppers. Tear in the basil leaves and using your hands gently combine all the ingredients.", "Serve in a large bowl in the centre of the table."]}, {"isVegetarian": false, "title": "Panzanella", "url": "www_bbc_co_uk_food_recipes_panzanella_87364", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/panzanella_87364_16x9.jpg", "ingredients": ["2 fist-sized pieces ciabatta bread, or any other unsliced loaf", "2 anchovy fillets", "3 tbsp drained capers", "4 tbsp olive oil", "1 tbsp red wine vinegar", "600g/1lb 2oz tomatoes, chopped", "1 bag mixed salad leaves", "salt and pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 110C/225F/Gas ¼ or its lowest setting.", "Rip the bread into bite-sized pieces, place on a baking tray and bake for about 20 minutes. Make sure it doesn't burn - what you're looking for is bread that comes out feeling a little stale.", "Meanwhile, put the anchovies, two tablespoons of the capers, the oil and vinegar in a pestle and mortar and smash it into a dressing.", "Grab yourself a big mixing bowl and put in the tomatoes and bread and pour on the dressing, then get stuck in with your hands. Give it all a gentle squeeze to make sure the spongy bread soaks up all the juices.", "Finally tip your salad leaves onto a serving plate and drop the contents of the bowl over the top, finishing off with the remaining capers and some salt and pepper."]}, {"isVegetarian": true, "title": "Panzanella (Tuscan tomato and bread salad)", "url": "www_bbc_co_uk_food_recipes_panzanella_tuscan_tomato_09380", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/panzanella_tuscan_tomato_09380_16x9.jpg", "ingredients": ["5 handfuls chunks of stale sourdough or other bread", "salt and freshly ground black pepper", "7 tbsp extra virgin olive oil", "2 tbsp red wine vinegar", "1 medium-sized cucumber, peeled, cut into small chunks", "1 medium-sized red onion", "6 vine tomatoes", "3 garlic cloves, finely chopped", "handful torn basil leaves"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Tip the bread into a bowl, season to taste with salt and pepper and add the olive oil and half of the red wine vinegar.", "Remove the tomato skins by placing the tomatoes into boiling water for a few seconds and refreshing in a bowl of ice cold water. The skins should now peel away easily. Add the tomatoes to the bread, along with the cucumber and red onion. Scatter over the finely chopped garlic and add a pinch of salt. Mix until well combined. ", "Pour in the remaining red wine vinegar, plus more to taste, add the basil leaves and mix together with your hands until well combined. Serve."]}, {"isVegetarian": false, "title": "Papaya mousse with raisin butterscotch sauce", "url": "www_bbc_co_uk_food_recipes_papayamoussewithrais_88611", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 papaya, peeled and de-seeded", "150ml/5fl oz double cream", "1 vanilla pod, seeds only", "2 tbsp caster sugar", "2 tbsp raisins", "55g/2oz butter", "75ml/2½fl oz double cream", "1 sprig fresh mint, to garnish"], "serves": "Serves 1-2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the mousse, place the papaya flesh into a blender and blend to a purée. Whip the cream together with the vanilla seeds until stiff peaks form when the whisk is removed. Fold in the puréed papaya and chill.", "For the raisin butterscotch sauce, heat the caster sugar in a frying pan. Add the raisins and cook over a gentle heat until the caramel begins to bubble. Stir in the butter and, when melted, stir in the cream. Cook for a few more minutes until the sauce thickens and turns a golden-brown colour.", "To serve, spoon the raisin butterscotch sauce into the base of a glass and fill up with the papaya mousse. Garnish with a sprig of fresh mint."]}, {"isVegetarian": true, "title": "Papaya mousse", "url": "www_bbc_co_uk_food_recipes_papayamousse_81583", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150ml/5fl oz double cream, whipped until stiff", "100g/3½oz papaya, peeled, seeds removed and finely chopped", "2 tbsp runny honey", "1 tbsp papaya, cut into small cubes, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the cream, chopped papaya and one tablespoon of honey into a bowl and fold together.", "Place an oiled 5cm/2in chefs' ring into the centre of a plate and spoon in some of the mixture.", "To serve, remove the chefs' ring, drizzle over the remaining tablespoon of honey and garnish with the papaya cubes on top."]}, {"isVegetarian": false, "title": "Pappa al pomodoro with squid, octopus and prawns", "url": "www_bbc_co_uk_food_recipes_pappa_al_pomodoro_with_15568", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 octopus tentacles (about 350g/12oz)", "5-6 baby squid, cleaned, tentacles separated", "2 tbsp extra virgin olive oil", "6 raw king prawns, ideally Sicilian red", "½ lemon, juice only", "2 anchovy fillets, finely chopped", "sea salt and black pepper", "2 tbsp olive oil", "½ onion, finely chopped", "2 x 400g jars skinned Italian tomatoes in water, drained (or use tinned tomatoes)", "handful baby plum tomatoes, skinned and roughly chopped", "5 slices stale sourdough, cut into chunks", "handful fresh basil leaves", "pinch caster sugar", "1 clove garlic, finely chopped", "handful fresh basil leaves, chopped", "1 unwaxed lemon, finely grated zest and juice", "6 tbsp extra virgin olive oil ", "1 red chilli, deseeded and finely chopped", "2 tbsp finely chopped basil leaves", "2 slices flatbread, ideally Sardinian pane carasau, toasted"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the seafood, start by boiling the octopus tentacles in water for 30 minutes, or until tender. Drain.", "Meanwhile, for the pappa al pomodoro, heat the oil in a saucepan over a medium-low heat. Add the onion and cook for a few minutes, until softened. Add the bottled and fresh tomatoes, sourdough, basil leaves, sugar and a pinch of salt. Cover and cook for a few minutes.", "For the salmoriglio, put all the ingredients apart from the chilli in a pestle and mortar and grind until amalgamated. Stir in the chilli and a pinch of salt, then set aside.", "Cut each octopus tentacle into bite-sized pieces. Score the squid across the body. Pat everything dry. Toss the octopus pieces and squid, with its tentacles, in the oil.", "Heat a frying pan over a medium-high heat. Put the octopus in the pan cut-side down. Add the squid and prawns and season with salt and pepper. Squeeze over the lemon juice and cook for 3-4 minutes, or until the prawns and squid are cooked through. Transfer to a bowl and toss with the anchovy and half the salmoriglio. ", "To serve, spoon the pappa al pomodoro into two deep serving plates, place the seafood on top and drizzle with the remaining salmoriglio. Sprinkle over the basil and serve with the toasted flatbread. "]}, {"isVegetarian": true, "title": "Pappardelle pasta", "url": "www_bbc_co_uk_food_recipes_pappardelle_pasta_94960", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz ‘00’ flour (pasta flour), plus extra for dusting", "2 tbsp olive oil", "3 large free-range eggs", "1 tsp fine sea salt", "extra virgin olive oil and freshly ground black pepper (optional)"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 60, "preparationMins": 60}, "recommendations": 0, "method": ["Put the flour, olive oil and eggs in a food mixer or food processor and blend until the ingredients come together and form a dough. Keep mixing for a minute, removing the lid and turning the dough every 15-20 seconds. This will help make the dough smoother. Take care to avoid cutting your fingers on the blade if using a food processor. ", "Alternatively, bring the ingredients together with your hands, working the eggs into the flour a little at a time.", "Turn the dough out onto a lightly floured surface and knead hard for 10 minutes, really pummelling and stretching the dough until it is silky with a slight sheen. Wrap in cling film and chill in the fridge for 30 minutes. Line a couple of large trays with baking parchment and sprinkle with a little sifted flour (these will be used to lay out the fresh pasta to dry).", "Take the pasta from the fridge and remove the cling film. Divide into three pieces and rewrap two of them. Form the remaining pasta into a block and roll out on a very lightly floured surface as thinly as you can – even thinner than a two pence piece. You want to end up with a rectangle roughly 48x30cm/19x12in. Turn the dough regularly and sprinkle with a tiny amount of flour if it begins to stick. Don’t worry if it isn’t perfect, as long as you can make some good, wide strips, no-one will notice.", "Cut the pasta into wide strips – you’ll need to make them roughly 2.5cm/1in wide and around 30cm/12in long. Arrange the strips on the trays, keeping each strand a few millimetres from the next. Repeat exactly the same process with the remaining pasta. ", "The pasta can be left to dry for a few hours at this point or used immediately. If your trays get too full, cover with another layer of baking parchment and a sprinkling of flour then create another layer. (You can also hang the pasta on a broom handle wrapped in cling film and suspended between two chairs.)", "When you are ready to cook the pasta, half-fill a very large saucepan with cold water, add the fine sea salt and bring to the boil. Drop the pasta gently into the hot water and return to the boil, swishing around with a long wooden spoon to separate the strands. ", "Cook for 2-3 minutes, or until the pasta is tender but firm, stirring occasionally. You can test the pasta by removing one of the pieces and cutting a little off one end to taste. (If your pan isn’t large enough for all the pasta, cook in two batches, tossing the first batch with a little olive oil once it has been drained.)", "Drain the pasta in a colander and return to the saucepan.  Toss with a little olive oil and seasoning or the pasta sauce of your choice. Tip into a warmed serving dish and serve immediately."]}, {"isVegetarian": false, "title": "Pappardelle and meatballs", "url": "www_bbc_co_uk_food_recipes_pappardelle_and_51772", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pappardelle_and_51772_16x9.jpg", "ingredients": ["1 large onion, finely chopped ", "5 tbsp olive oil", "salt and freshly ground pepper", "3 slices streaky bacon, chopped", "50g/1¾oz fresh white breadcrumbs", "handful parsley (or whatever herbs you prefer - oregano, thyme and sage all work well), chopped", "250g/9oz beef mince ", "250g/9oz pork mince ", "1 free-range egg yolk  ", "50ml/2fl oz red wine ", "3 large tomatoes, roughly chopped ", "1 x 400g/14oz tin chopped tomatoes ", "500g/1lb 2oz pappardelle", "grated cheese, to serve (hard cheeses such as parmesan, pecorino and mature cheddar work well)"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil a heavy-based casserole or large saucepan set over a low heat. Add the onion and season generously with salt and freshly ground black pepper. Increase the heat to medium and add the bacon. Cook until the onions are soft and translucent (do not colour). ", "Add the breadcrumbs and a generous handful of herbs to the pan. Stir and then remove half of the mixture and set aside in a bowl to use in the sauce later.  Transfer the remaining mixture to a blender.  ", "Add the minced beef and pork to the mixture and pulse to form a paste. Stir in the egg yolk to combine. Use your hands to mould the mixture into small balls about the size of ping pong balls. ", "Put the meatballs in the casserole and fry until brown all over (this can take up to 10 minutes). Remove from the pan and set aside.", "Add the reserved onion and bacon mixture to the pan. Deglaze by adding the red wine and scraping all the bits off the bottom of the pan. When the wine is boiling, add the chopped fresh tomatoes, keeping the heat high. Continue to cook, stirring all the time until they start to break down. Add the tinned tomatoes and a tin full of water. Bring back to the boil. ", "Taste to check the seasoning and cook for a further five minutes. Return the meatballs to the pan and bring to the boil, then lower the heat and simmer for 15 minutes. ", "Meanwhile, cook the pasta according to packet instructions.", "To serve, mix the meatballs and pasta together with grated cheese, or keep separate if you prefer. "]}, {"isVegetarian": false, "title": "Pappardelle with slow-cooked beef and mushrooms", "url": "www_bbc_co_uk_food_recipes_pappardellewithslowc_92023", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pappardellewithslowc_92023_16x9.jpg", "ingredients": ["2 tbsp olive oil", "400g/14oz stewing beef, cubed ", "700ml/1¼ pints hot water or beef stock", "300g/10½oz mixed mushrooms (such as oyster, button or shiitake), washed thoroughly, roughly sliced", "salt and freshly ground black pepper", "400g/14oz vine-ripened tomatoes, each cut into eight wedges ", "handful chopped fresh basil leaves", "handful chopped fresh flatleaf parsley leaves", "1½ tsp red wine vinegar", "salt and freshly ground black pepper", "250g/9oz dried egg pappardelle, cooked according to packet instructions, drained, to serve", "1 heaped tbsp butter, softened", "40g/1½oz freshly grated parmesan"], "serves": "4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a heavy-based pan. Add the beef and brown all over, stirring regularly.", "Add the mushrooms and pour over the water or beef stock. Bring the mixture to a simmer. Half-cover the pan with a lid and continue to cook the mixture over a high heat, stirring regularly, for 30-45 minutes, or until the volume of liquid has reduced, the sauce has thickened and the meat is tender enough to break down using a wooden spoon.  ", "For the tomato salsa, in a bowl, mix together all of the tomato salsa ingredients until well combined. ", "Add the cooked, drained pasta, softened butter and half of the grated parmesan to the slow-cooked beef and mushrooms, stirring well until the pasta is coated in the sauce and the butter has melted.", "Divide the pappardelle with slow-cooked beef and mushrooms equally among four serving bowls. Spoon over the tomato salsa and sprinkle over the remaining parmesan."]}, {"isVegetarian": false, "title": "Paprika monkfish with romesco sauce and padrón peppers", "url": "www_bbc_co_uk_food_recipes_paprika_monkfish_with_54566", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 plum tomatoes, halved", "3 tbsp olive oil", "salt and freshly ground black pepper", "1 red pepper", "40g/1½oz bread, cut into cubes", "110g/4oz piquillo peppers", "40g/1½oz almonds", "25g/1oz hazelnuts", "½ lemon, juice only", "1 tsp smoked sweet paprika", "3 tbsp chopped fresh flatleaf parsley", "4 x 200g/7oz monkfish fillets, trimmed", "1 tbsp smoked paprika", "1 tsp fine sea salt", "3 tbsp olive oil", "200g/7oz padrón peppers", "2 tbsp coriander cress"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the romesco sauce, preheat the oven to 225C/450F/Gas 8.", "Place the tomatoes onto a roasting tray and drizzle with a little of the olive oil, salt and black pepper. Roast in the oven for 15 minutes, or until tender.", "Using tongs, char the pepper on a gas ring for 4-5 minutes, or until charred all over.", "Place the pepper into a bowl, cover with cling film and set aside to steam for five minutes. Once cool enough to handle, remove the skin and seeds from the pepper and roughly chop.", "Heat a frying pan until hot and add some of the olive oil and the bread. Season with salt and freshly ground black pepper. Fry for 2-3 minutes, or until golden-brown and crisp. Remove the bread from the pan and set aside to drain on kitchen paper.", "Remove the tomatoes from the oven then remove the seeds.", "Blend the tomatoes, bread and chopped peppers with the remaining ingredients in a food processor until coarsely chopped. Season with salt and freshly ground black pepper.", "For the paprika monkfish, mix the paprika and salt on a plate. ", "Roll the monkfish in the paprika mixture until completely covered.", "Heat a frying pan until hot, add a little of the olive oil and seal the monkfish until golden-brown all over, cook for a further 3-4 minutes. Remove the monkfish from the pan and set aside to rest for 2-3 minutes.", "Heat a frying pan until hot then add the remaining olive oil and the peppers.", "Fry for 2-3 minutes, or until the peppers are golden-brown and puffed.", "To serve, carve the monkfish into thick slices.", "Spoon the romesco sauce into the centre of the serving plates and top with the pardon peppers. Place the sliced monkfish on top then finish with a scattering of coriander cress."]}, {"isVegetarian": false, "title": "Fruity paprika pork with cashew nut couscous", "url": "www_bbc_co_uk_food_recipes_paprikafruityporkwit_86356", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["750g/1lb 10oz boneless pork loin", "salt and freshly ground black pepper ", "75g/3oz prunes, roughly chopped", "75g/3oz apricots, roughly chopped", "3 tbsp flatleaf parsley, roughly chopped", "2 tbsp paprika", "1 tsp fresh oregano leaves", "1 tsp fresh thyme leaves", "1 garlic clove, finely chopped", "1 tsp Maldon sea salt, or other sea salt", "2 tbsp olive oil", "125g/4½ oz couscous", "150ml/5fl oz boiling water", "75g/3oz cashew nuts, roughly chopped", "75g/3oz apricots, roughly chopped", "1 lemon, juice only", "2 tbsp fresh mint, roughly chopped", "2 tbsp fresh flatleaf parsley, roughly chopped"], "serves": "Serves 4-6", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Lay the pork, flesh-side up, on a chopping board with the belly flap facing away from you. ", "With a sharp knife make an incision halfway down the meat, running parallel to the board, cutting almost all the way through.", "Open the loin up and season well with salt and freshly ground black pepper.", "Place the prunes, apricots and parsley into a bowl, season with salt and black pepper and mix well.", "Place the prune mixture onto the pork and roll the meat up around the stuffing, into a sausage shape and tie in three or four places with kitchen string.", "For the paprika paste, place all of the ingredients for the paste into a clean bowl and mix to form a paste.", "Smear the paprika paste over the pork and set aside to marinate for at least 30 minutes, longer if possible.", "Place the meat onto a heated griddle pan or barbecue and cook on each side for 2-3 minutes to brown all over.", "Reduce the heat and cook for a further 30-40 minutes, turning every ten minutes, or until the pork is completely cooked through. Remove from the heat and allow to rest for ten minutes.", "For the cashew nut couscous, place the couscous into a bowl and pour over the boiling water. Set aside and leave until all the water is absorbed.", "Stir the couscous with a fork. Add the remaining couscous ingredients and stir well to combine.", "To serve, cut the pork into thick slices. Place a large spoonful of the couscous onto each plate and top with a couple of slices of the pork."]}, {"isVegetarian": false, "title": "Paprika prawns with roasted pepper and coriander pasta salad", "url": "www_bbc_co_uk_food_recipes_paprikaprawnswithroa_87758", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ romano pepper, core and seeds removed", "1 tbsp olive oil", "salt and freshly ground black pepper", "2 tbsp olive oil", "squeeze lemon juice", "2 tbsp chopped fresh coriander", "½ red chilli, seeded and cut into long thin strips", "salt and freshly ground black pepper", "85g/3oz linguine pasta, cooked according to packet instructions", "1 tbsp olive oil", "knob of butter", "150g/5oz raw peeled tiger prawns", "pinch paprika", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "Place the pepper into an ovenproof frying pan or baking tray and drizzle over the olive oil, then season well with salt and freshly ground black pepper. Place into the oven to bake for 12-14 minutes, until cooked through and lightly charred.", "Remove from the oven, place the pepper into a bowl and cover with cling film for five minutes. Remove the cling film and peel away the pepper skin. Finely chop the pepper.", "For the linguine, mix the olive oil, lemon juice, coriander and chilli together in a bowl. Season, to taste, with salt and freshly ground black pepper and stir to combine.", "Add the pasta to the dressing and stir in the roasted red pepper until evenly combined. Set aside to allow the flavours to combine.", "Meanwhile, for the prawns, heat the rest of the olive oil in a frying pan. Add the olive oil and butter and once the butter is foaming, add the prawns.", "Sprinkle over the paprika, stirring well to coat, then fry the prawns for 1-2 minutes or until the prawns are cooked through. Season, to taste, with salt and freshly ground black pepper.", "To serve, place the pasta salad into a bowl and place the prawns on top."]}, {"isVegetarian": false, "title": "Paprika, mustard and orange chicken on sweet Brussels sprouts", "url": "www_bbc_co_uk_food_recipes_paprikamustardandora_84962", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 garlic clove ", "1 tbsp paprika ", "1 tbsp wholegrain mustard", "1 tbsp curry powder", "1 orange, zest only", "2 chicken thighs, bones removed", "salt and freshly ground black pepper", "1 orange, juice only", "1 tbsp olive oil", "25g/1oz unsalted butter", "1 tbsp olive oil", "25g/1oz unsalted butter", "100g/3½oz Brussels sprouts, blanched", "1 tbsp clear honey"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the chicken rub, place all the rub ingredients into a food processor and blend to a coarse paste.", "For the chicken, season the chicken well with salt and freshly ground black pepper and rub over with the rub mixture.", "Heat the olive oil and butter in an ovenproof frying pan, then add the chicken thighs and fry for one minute on each side. ", "Pour over the orange juice and transfer to the oven to roast for 15-20 minutes, or until the chicken is completely cooked through.", "For the Brussels sprouts, heat the olive oil and butter in a frying pan. Add the Brussels sprouts and fry, continuously shaking the pan, for three minutes, until golden all over.", "Drizzle over the honey, season with salt and freshly ground black pepper and stir well. ", "To serve, place the Brussels sprouts onto a plate with the chicken thighs arranged over the top."]}, {"isVegetarian": true, "title": "Paprika Quorn ragù with cheese dumplings", "url": "www_bbc_co_uk_food_recipes_paprikaquornraguwith_88882", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "1 onion, chopped", "2 garlic cloves, chopped", "1 tsp smoked paprika", "150g/5oz Quorn pieces", "150ml/5fl oz white wine", "150ml/5fl oz double cream", "85g/3oz cherry tomatoes, halved ", "150g/5oz self-raising flour", "1 tsp baking powder", "1 tbsp olive oil", "75ml/2½fl oz milk", "85g/3oz Double Gloucester cheese, grated"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/360F/Gas 4.", "For the ragu, heat the oil in a pan and gently fry the onion and garlic for 4-5 minutes, until soft. ", "Add the smoked paprika and Quorn pieces and stir well. Continue to fry for 5-7 minutes, then add the wine and bring to the boil.", "Add the cream and tomato halves and simmer for 3-4 minutes.", "For the dumplings, place the flour, baking powder, oil and enough milk to bind the mix into a food processor and pulse until just coming together as a dough. ", "Add the cheese and pulse again to just combine.", "Roll pieces of the mix into balls about the size of a tangerine, then place them onto a baking sheet. Press the dough balls down slightly, then transfer to the oven to bake for 8-10 minutes, or until golden-brown.", "To serve, place the ragu into a serving bowl with the dumplings alongside."]}, {"isVegetarian": false, "title": "Parathas stuffed with lamb", "url": "www_bbc_co_uk_food_recipes_parathas_stuffed_with_45963", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400g/14oz chapati flour, plus extra for dusting", "1 tsp salt", "1 tsp carom seeds", "5 tsp vegetable oil", "1 tbsp ghee or clarified butter", "3 tbsp vegetable oil", "1 bay leaf", "2 green cardamom pods", "2cm/¾in cinnamon stick", "2 cloves", "1 tsp cumin seeds", "1 large onion, finely chopped", "1 tbsp ginger and garlic paste", "1 tsp salt", "1 tsp red chilli powder", "1 tsp smoked paprika", "½ tsp turmeric powder", "½ tsp cumin powder", "1 tsp coriander powder", "2cm/¾in piece fresh root ginger, peeled and finely chopped", "2 green chillies, finely chopped", "400g/14oz lean lamb mince", "100g/3½oz boiled potatoes, grated", "2 tbsp chopped fresh coriander, leaves and stalks", "½ lemon, juice only ", "salt and freshly ground black pepper", "1 pomegranate, seeds removed", "300g/10½oz Greek yoghurt", "2½cm/1in piece fresh root ginger, chopped", "1 green chilli, chopped", "1 tsp cumin, toasted and ground", "1 tsp salt", "1 tsp sugar", "1 tbsp chopped coriander leaves"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Mix together the flour, salt, carom seeds, oil and 225ml/8fl oz water to make a smooth dough. Cover and rest for at least 15 minutes. ", "Meanwhile, to make the filling. Heat the oil in a large pan to smoking point, add the whole spices, followed by the cumin seeds. When they start to crackle, add the onions and cook on medium-low heat for 2–3 minutes. ", "Add the ginger and garlic paste, salt, ground spices, ginger, chillies and stir for 2–3 minutes to cook out the spices. Add the lamb and cook until dry and the liquid has evaporated. Add the potato and cook for a minute stirring to mix thoroughly. Adjust the seasoning and sprinkle with the coriander and lemon juice. Leave to cool completely. Discard the whole spices, divide into ten equal portions and roll into discs when cool enough to handle. ", "Divide the dough into ten balls. Take a ball of dough, make an indent and keep pressing and rotating the dough in your hand to make the hole slightly larger than the size of one of the lamb discs. The edges of the hole should be slightly thinner than the rest of it. Sit a lamb disc in the hole and bring together the edges to cover the stuffing from all sides. Do not leave any cracks or the filling will come out when rolled.", "Lightly dust a surface with flour, gently flatten a paratha then carefully roll out to a 20cm/8in diameter disc.", "Place a heavy-bottomed frying pan, preferably cast iron, over a medium-low heat. Cook for about 2–3 minutes on one side, flip over and repeat on the other side. As it cooks, roll out the next paratha. When both sides become dry and start to colour, brush with a little ghee to get an even colour. Remove from the heat and keep the parathas warm by loosely wrapping in foil.", "For the raita, combine all the ingredients, except a few pomegranate seeds and the coriander leaves, and mix well. Sprinkle the coriander and reserved seeds on top and put in the fridge until serving. ", "Serve the parathas with the raita on the side."]}, {"isVegetarian": false, "title": "Pardina lentils with white wine, Serrano ham and pimentón", "url": "www_bbc_co_uk_food_recipes_pardina_lentils_with_32549", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pardina_lentils_with_32549_16x9.jpg", "ingredients": ["225g/8oz green-brown lentils, such as pardina", "6 tbsp olive oil", "1 head garlic, cloves peeled and thinly sliced", "1 medium onion, finely chopped", "200g/7oz carrot, finely chopped", "100g/3½oz thinly sliced Serrano ham, finely chopped", "1 tbsp pimentón dulce (smoked sweet Spanish paprika)", "2 large vine-ripened tomatoes, skinned, chopped", "125ml/4fl oz dry white wine", "1 tbsp chopped flat-leaf parsley", "salt and freshly ground black pepper"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Check over the lentils for any little stones, then rinse in cold water. Tip them into a saucepan, add enough cold water to cover them by 5cm/2in and bring to the boil over a high heat. Reduce the heat ", "and leave them to simmer for about 30 minutes or until just tender but still a little al dente. Drain, reserving the cooking liquid, and set to one side. ", "Put the olive oil, garlic, onion and carrot in a wide, shallow pan over a medium heat and cook gently for 15 minutes or until the vegetables are soft and just beginning to colour. Add the Serrano ham and fry for another 5-6 minutes. ", "Stir in the pimentón, tomatoes and wine and simmer for 5-6 minutes or until the mixture cooks down into a thick sauce.", "Stir the lentils into the sauce with 150ml/5fl oz of the reserved cooking liquid, the chopped parsley, 1½ teaspoons of salt and some pepper. Simmer for a further 5-6 minutes."]}, {"isVegetarian": true, "title": "Parkin", "url": "www_bbc_co_uk_food_recipes_parkin_90139", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["85g/3oz unsalted butter", "85g/3oz soft dark brown sugar", "115g/4oz golden syrup", "175g/6oz plain flour", "1½tsp bicarbonate of soda", "1½tsp ground ginger", "55g/2oz medium oatmeal ", "1 large free-range egg", "splash milk"], "serves": "Serves 9", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 160C/325F/Gas 3.", "Grease a 20cm/8in square baking tin and line with baking parchment.", "Place the butter, sugar and golden syrup into a pan over a medium heat and cook until melted and combined. ", "Sift the flour, bicarbonate of soda and ground ginger into a bowl and mix well.", "Add the melted butter and sugar mixture to the dry ingredients. ", "Add the egg and beat the mixture to a thick pouring consistency. If the mixture is too stiff, add a little milk to loosen.", "Pour the cake mixture into the lined cake tin and bake in the oven for one hour, or until the centre is firm and springy to the touch.", "Allow to cool, then cut into squares. (This cake keeps in a tin for 2-3 weeks. The longer you leave it better it tastes.)"]}, {"isVegetarian": true, "title": "Paris-Brest", "url": "www_bbc_co_uk_food_recipes_paris-brest_76134", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["112g/4oz strong flour", "4 tbsp full-fat milk", "pinch table salt ", "pinch caster sugar", "55g/2oz unsalted butter", "4 medium free-range eggs, 3 lightly beaten and 1 for egg wash", "handful flaked almonds", "200g/7oz caster sugar", "100g/3½oz blanched hazelnuts ", "600ml/20fl oz double cream", "1 vanilla pod, sliced in half lengthways and seeds scraped out", "icing sugar, to dust"], "serves": "Makes 4 Paris-Brest pastries", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/200C Fan/Gas 7. Line a baking sheet with baking parchment and draw 4 circles, about 10cm/4in across. ", "Sift the flour onto a sheet of baking parchment. Put the milk, salt, sugar, butter and 80ml/2¾fl oz water in a pan and bring slowly to the boil over a medium heat, until the butter has just melted. ", "When the mixture is bubbling, remove quickly from the heat, tip in the flour all at once and beat vigorously until it forms a dough that leaves the side of the pan clean. Return to the heat and cook over a low heat for at least 5 minutes. ", "Leave to cool slightly, then gradually beat in the lightly beaten eggs, beating well between each addition until the dough is smooth and glossy. Spoon the dough into a disposable piping bag, and snip off the tip to make a generous hole. Pipe 4 thick rings approximately on to the circles (piping the rings in one motion). ", "Lightly brush the top with the egg wash, then sprinkle flaked almonds over the top of the choux.", "Bake for 10-15 minutes, then reduce the heat to 180C/160C Fan/Gas 4 and bake for a further 10 minutes until they are well risen and golden-brown. Once baked, remove from the oven and immediately slice the rings in half horizontally and return to the oven to dry out for approximately 3-4 minutes. ", "For the praline, melt the caster sugar in a pan over a medium heat until the sugar has melted to a caramel. Add the hazelnuts and swirl to coat the hazelnuts in the caramel. Carefully pour onto a silicon mat and leave to cool and harden (boiling sugar gets very hot - take care not to burn yourself). Once cool, pulse the praline to a fine dust in a food processor. ", "For the filling, pour the cream into a large mixing bowl. Add the vanilla seeds and whip until soft peaks form when the whisk is removed. Spoon into a piping bag fitted with a star nozzle. ", "Sprinkle half the praline onto the bottom halves of the choux rings, then pipe a generous amount of cream over the praline. Sprinkle the remaining praline over the cream and place the pastry lids on top. Dust with icing sugar and serve."]}, {"isVegetarian": true, "title": "Parkin", "url": "www_bbc_co_uk_food_recipes_parkin_28695", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["900g/2lb self-raising flour ", "450g/1lb demerara sugar", "4 tsp ground ginger ", "4 tsp bicarbonate of soda", "1 tsp salt ", "225g/8oz butter", "450g/1lb golden syrup", "4 free-range eggs ", "800ml/1 pint 8fl oz milk "], "serves": "Serves 48", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 150C/300F/Gas 2. ", "Grease and line six square 22cm/8in tins.", "Sieve the flour into the bowl of a large mixer fitted with the paddle attachment and add the sugar, ginger, bicarbonate of soda and salt.  Mix well with a spoon.", "Place the butter and syrup in a pan and heat until the butter has melted.", "Put the eggs and milk into a jug and beat together until well combined. ", "Gradually pour the butter and syrup into the flour and mix, then add the egg and milk mixture and beat until the mixture is smooth.  Pour into the lined tins. ", "Place in the oven for one hour or until a skewer comes out clean when inserted into the centre of the parkin."]}, {"isVegetarian": true, "title": "Parkin", "url": "www_bbc_co_uk_food_recipes_parkin_08211", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz self-raising flour ", "115g/4oz soft brown sugar", "1 tsp ground ginger ", "1 tsp bicarbonate of soda", "pinch salt ", "55g/2oz butter", "115g/4oz golden syrup", "1 free-range egg ", "200ml/7fl oz milk "], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 150C/300F/Gas 2. Line a 20cm/8in cake tin. ", "Sieve the flour into a large bowl and add the sugar, ginger, bicarbonate of soda and salt.", "Place the butter and golden syrup in a pan and heat until the butter has melted.", "Put the egg and milk into a jug and beat together. ", "Gradually pour the butter and syrup into the flour and stir, then add the egg and milk mixture and stir until smooth.  Pour into the lined tin. ", "Bake in the oven for one hour or until a skewer comes out clean when pieced in the centre of the parkin."]}, {"isVegetarian": false, "title": "Parma ham, goats’ cheese and rocket canapés", "url": "www_bbc_co_uk_food_recipes_parma_ham_goats_cheese_13654", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/parma_ham_goats_cheese_13654_16x9.jpg", "ingredients": ["8 slices Parma ham", "8-10 tsp soft goats’ cheese", "1 x 70g/2½oz bag rocket", "salt and freshly ground black pepper", "8 medium gherkins, quartered"], "serves": "Makes 16 canapés", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Lay each piece of Parma ham on a board, cut off any surplus fat and discard.  ", "Spread a good teaspoon of goats’ cheese over the end quarter.  Season with salt and pepper.  Take a small handful of rocket and lay on top, leaving some of the rocket sticking out of the ends.  Lay one piece of cucumber on top.", "Roll the Parma ham up into a cigar shape and transfer to the fridge until needed.", "Slice each roll in half and arrange standing up on the cut side on a serving platter. Serve cold."]}]