[{"ingredients": ["2 cucharadas de aceite de oliva", "1 kg / 2lb 4 oz espinilla de carne cortada en 2cm / ¾ en trozos", "2 cebollas, finamente picadas", "3 palitos de apio, finamente picados", "2 dientes de ajo, finamente picados", "1 ramita de tomillo, hojas retiradas", "1 hoja de laurel", "1 cucharada de puré de tomate", "250ml / 9fl oz de carne de ternera o de res", "440ml / 16fl oz Irish stout", "50g / 1¾oz de mantequilla", "2 papas, peladas y en cubos", "2 rebanadas de pan de soda irlandesa, cortezas eliminadas y cortadas en triángulos pequeños", "2 cucharaditas de mostaza Dijon", "1 cucharada de perejil de flatleaf fresco finamente picado", "3 ostras frescas, descascaradas", "1 cucharadita de jugo de limón", "1 diente de ajo, finamente picado", "1 cucharadita de estragón fresco picado", "2 cucharadas de cebolletas frescas cortadas", "2 cucharadas de hojas frescas de perifollo", "2 cucharadas de hojas frescas de estragón"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Para la carne estofada, caliente el aceite en una cazuela colocada a fuego alto. Agregue la carne y el sello en todos los lados hasta que estén coloreados. Retire la carne con una espumadera y déjela a un lado. Agregue la cebolla, el apio, el ajo, el tomillo y la hoja de laurel al plato y cocínelos por 2-3 minutos. Agregue el puré de tomate y cocine por otros 2 minutos.", "Regrese la carne a la cazuela y vierta el caldo y la cerveza fuerte. Cubra y cocine en el horno durante 2-3 horas, o hasta que la carne esté muy tierna. Una vez cocinado, separa la carne, cuela el caldo y colócala en una cacerola a fuego lento hasta que se reduzca a una consistencia espesa.", "Cocine las papas en agua hirviendo con sal durante 10-15 minutos o hasta que estén tiernas. Escurrir y apartar.", "Para el pan de soda de ostras, caliente 1 cucharada de mantequilla en una sartén pequeña. Agregue el pan de soda y fría hasta que esté crujiente. Agregue la mostaza Dijon y espolvoree con el perejil picado.", "Caliente la mantequilla restante en una sartén pequeña y saltee las ostras. Agregue el jugo de limón, el ajo, el estragón y las papas. Combine junto con los trozos de pan de soda y reserve.", "Divida el pan de ostra y las papas entre cuatro tazones de fuente. Cubra con la carne y la cuchara sobre el caldo reducido. Dispersar sobre las hierbas y servir."], "url": "www_bbc_co_uk_food_recipes_braised_beef_with_stout_47057", "title": "Ternera estofada con stout y ostras", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 x 3 kg / 6½ lb de pollo", "285ml / ½ pinta de caldo de pollo", "2 cucharadas de aceite vegetal", "110g / 4oz de mantequilla", "12 chipolatas", "Setas botón de 170 g / 6 oz, reducido a la mitad", "1 vaso de vino blanco seco", "4 tomates, despellejados y picados, sin semillas", "4 x 70 g / 2½ oz rodajas de pudín negro, cortado en rondas con un cortador de pastelería, cortes de sobras picadas", "2 rebanadas de pan blanco", "1 cucharada de perejil picado", "hojas de apio de los tallos centrales, picadas", "sal marina y pimienta negra recién molida"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4.", "Corte el pollo en ocho pedazos (dos pechos, piernas y muslos), sazone con sal y pimienta y déjelo a un lado.", "Pica el resto de las canales y las alitas, colócalas en una sartén con el caldo de pollo. Cocine a fuego lento durante 20 minutos.", "Mientras tanto, caliente una cucharada de aceite en una cazuela y agregue 30 g / 1 oz de mantequilla. Coloque las pechugas de pollo en la sartén con la piel hacia abajo, freír hasta que estén doradas, luego retire de la sartén y déjelas a un lado. Coloque las piezas para las patas en la cazuela y deje cocer durante cinco minutos, luego retírelas. Agregue los chipolatas, dore y elimine. Agregue los champiñones a la sartén para dorar, luego agregue el vino blanco y cocine para reducir el volumen a la mitad.", "Regrese el pollo y los chipolatas a la cazuela y cuele el caldo de pollo. Cubra con la tapa y transfiéralo al horno por 25-30 minutos, o hasta que esté cocido.", "Retire el pollo, chipolatas y champiñones de la sartén y colóquelos en un plato para servir.", "Agregue los tomates y los cortes de pudin negra al caldo. Cocine a fuego lento hasta que la salsa se reduzca en volumen en dos tercios. Agregue la mantequilla 55g / 2oz y sazone con sal y pimienta, al gusto.", "Mientras tanto, caliente un poco de aceite en una sartén y fríe las rondas de pudin negro hasta que estén cocidas, luego transfiéralo a la fuente con el pollo.", "Corta el pan en cuatro trozos o círculos en forma de corazón con un cortador de galletas. Caliente el aceite y la mantequilla restante en la sartén y fría hasta que doren por un lado. Sumerja los extremos en la salsa y luego en el perejil picado.", "Vierta la salsa sobre el plato. Espolvoree las hojas de apio en la parte superior, coloque los croutons en la parte superior y sirva."], "url": "www_bbc_co_uk_food_recipes_braised_chicken_turbigo_17260", "title": "Turbigo de pollo estofado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 x 1.35kg / 3lb patos y menudillos", "1 litro / 1¾ pintas de caldo de pollo", "150g / 5oz de mantequilla", "Tocino tocino de 225 g / 8 oz", "Cebollas de botones pequeños de 225g / 8oz", "Zanahorias 110 g / 4 oz, en cubitos", "110 g / 4 oz de puerros, cortados en cubitos", "1 cucharada de salvia fresca picada", "1 cucharada de menta fresca picada", "1 cucharada de perejil fresco picado", "450g / 1lb guisantes, envasadas", "1 lechuga, desmenuzada"], "method": ["Precalentar el horno a 150C / 300F / Gas 2.", "Coloque las menudencias y el caldo en una olla y cocine a fuego lento durante 30 minutos.", "Mientras tanto, caliente una cazuela grande a prueba de horno o una bandeja para asar en la placa. Agregue 25g / 1oz de la mantequilla y los lardons y fríalos por 1-2 minutos, luego agregue las cebollas del botón y fríe por 2-3 minutos más, o hasta que estén doradas. Retire el tocino y las cebollas y reserve.", "Pincha los patos con un cuchillo afilado y frota todo con un poco de sal. Freír los patos en la cazuela hasta que se doren por todos lados. Drene cualquier grasa.", "Colar el caldo en la cazuela, llevar a ebullición, cubrir con una tapa o papel de aluminio y estofar en el horno durante una hora.", "Regrese el botón de cebollas, el tocino a la cazuela con las zanahorias y los puerros y sofríalos por otros 15 minutos.", "Retire los patos de la cazuela y déjelos a un lado para descansar en un lugar cálido. Retire el exceso de grasa.", "Regrese la cazuela a la cocina y deje que hierva. Agregue las hierbas, los guisantes y la lechuga a la salsa y continúe cocinando hasta que el volumen del líquido se haya reducido en un tercio.", "Agregue la mantequilla restante y sazone al gusto con sal y pimienta negra recién molida.", "Para servir, esculpe los patos y colóquelos en un plato para servir, luego espolvoree la salsa."], "url": "www_bbc_co_uk_food_recipes_braised_duck_with_peas_18884", "title": "Pato estofado con guisantes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "4 asas de cordero (o codos de cordero)", "1 cebolla picada", "3 dientes de ajo, aplastados", "1 barra de apio, picada", "1 zanahoria, picada", "3 tallos de romero", "1 Tbsb al trono", "Vino tinto 200ml / 7floz", "1½ litro / 2½ pintas de caldo de cordero", "1 cucharada de aceite de oliva", "½ cebolla, picada", "2 dientes de ajo, pelados y picados", "½ zanahoria, cortada en cubitos", "Lentejas rojas 200g / 7oz", "stock de cordero (desde arriba)", "sal y pimienta negra recién molida", "1 cucharada de perejil picado", "1 chalote, cortado en anillos", "2 cucharadas de vinagre de vino blanco", "110ml / 4floz de aceite de oliva ligero", "8 filetes de anchoas", "1 cucharada de alcaparras", "sal y pimienta negra recién molida", "1 pequeño racimo de perejil (solo hojas)"], "method": ["Para el cordero, precaliente el horno a 220C / 425F / Gas 7.", "Caliente una cazuela hasta que esté caliente, luego agregue el aceite y el cordero y dore por todos lados. Retire del plato y colóquelo a un lado.", "Agregue todas las verduras y el romero. Saltear hasta que estén doradas, agregar el ras el hanout y cocinar por 30 segundos.", "Agregue el vino y cocine hasta que se reduzca a la mitad.", "Vuelva a colocar el cordero en el plato y cubra con caldo de cordero.", "Coloque la tapa en el plato y colóquelo en el horno durante 2 horas y media. Verifique a la mitad y agregue más stock si es necesario.", "Cuando esté cocido, retire el cordero del plato. Cuele el caldo a través de un tamiz fino en una sartén. Regrese al fuego y cocínelo hasta que el caldo se haya reducido a la mitad, luego déjelo a un lado.", "Para las lentejas, caliente una sartén hasta que estén calientes, agregue el aceite, la cebolla, el ajo y la zanahoria y sude unos minutos hasta que se ablanden.", "Agregue las lentejas y suficiente caldo para cubrir a medias y luego cocine a fuego lento.", "Cocine a fuego lento, añadiendo caldo hasta que las lentejas estén cocidas hasta obtener una consistencia de salsa, no demasiado seca.", "Sazonar con sal y pimienta negra y luego agregar el perejil picado.", "Para la ensalada de perejil, coloque los chalotes en un recipiente y vierta sobre el vinagre.", "Agregue el aceite de oliva, las anchoas y las alcaparras, mezcle bien y sazone.", "Vierta la mezcla sobre el perejil y mezcle para combinar.", "Para servir, sople el cordero hasta que se dore y luego colóquelo en un plato. Cubra con guiso de lentejas rojas y sirva con ensalada de perejil."], "url": "www_bbc_co_uk_food_recipes_braised_elbow_of_lamb_04295", "title": "Estofado de cordero, guiso de lentejas rojas y ensalada de perejil", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filete de hoja de pluma de 1 kg / 2 lb 2 oz, cortado y cortado en piezas de 250 g / 10 oz", "3 cucharadas de aceite", "3 chalotes de plátano o 1 cebolla mediana, en rodajas", "2 palitos de apio, cortados, rebanados", "2 zanahorias, en rodajas gruesas", "2 dientes de ajo, aplastados", "250ml / 10fl oz de vino tinto", "500ml / 17fl oz de caldo de carne", "2 cucharadas de puré de tomate", "4-5 ramitas de tomillo fresco", "1 hoja de laurel", "1 cucharadita de mostaza inglesa", "sal marina y pimienta negra recién molida"], "method": ["Precalentar el horno a 160 ° C / 320 ° F / Gas 3.", "Sazone la carne en ambos lados con sal y mucha pimienta negra recién molida. Caliente una cucharada de aceite en una sartén grande de base pesada. Freír los trozos de carne a fuego medio-alto durante 2-3 minutos en cada lado, o hasta que se doren. Transfiera los trozos de carne a una cazuela. (Puede necesitar hacer esto en lotes).", "Regrese la sartén a la placa y reduzca el fuego. Agregue el aceite restante y fríe con cuidado los chalotes, el apio y las zanahorias durante 6-8 minutos o hasta que se doren y ablanden. Agregue el ajo, cocine por un minuto más y agregue la mezcla a la cazuela.", "Desglasar la sartén con vino y dejar burbujear durante unos segundos, revolviendo constantemente y verter sobre la carne y las verduras. Revuelva el caldo y el puré de tomate. Quite las hojas de tomillo de los tallos y esparza en la sartén, agregue la hoja de laurel y la mostaza y mezcle hasta que estén bien combinados. Llevar a ebullición y quitar el plato del fuego.", "Cubra la superficie de la carne y el líquido cuidadosamente con un trozo de papel resistente a la grasa. Coloque una tapa en la parte superior y cocine en el horno durante 3-3 ½ horas o hasta que la carne esté tierna. Elimine cualquier grasa de la superficie que aparece durante la cocción.", "Transfiere la carne a un plato. Cuele el licor de cocina y las verduras a través de un colador en una sartén antiadherente grande. Presione las verduras con el fondo de un cucharón para extraer un puré rico y mezcle con el licor de cocción. Agregue sal y pimienta negra recién molida, al gusto.", "Llevar la mezcla a fuego lento durante 3-5 minutos, o hasta que la salsa esté bien reducida, espesa y brillante. Agregue la carne de res al líquido y caliente por 3-4 minutos, cubriéndola con la salsa para glasear. Sirva con vegetales verdes y puré de papas."], "url": "www_bbc_co_uk_food_recipes_braised_feather_blade_49306", "title": "Estofado de carne de paleta de plumas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/braised_feather_blade_49306_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Bulbos de hinojo 750g / 1½lb, cortado, reducido a la mitad, adornos reservados", "50g / 1¾oz de mantequilla", "sal y pimienta negra recién molida", "3 cucharadas de vermut seco", "splash pastis (opcional, como alternativa, agregue más vermut seco)", "60g / 2 oz de queso parmesano (o queso vegetariano similar), rallado, más extra para servir"], "method": ["Precalentar el horno a 170 C / 325 F / Gas 3.", "Derrita la mantequilla en una cazuela a fuego lento. Coloque el hinojo en la mantequilla con el lado del corte hacia abajo, y esparza alrededor de los adornos. Sazonar con sal y pimienta negra recién molida y aumentar el calor.", "Agregue el vermut y los pastis. Cubra con una hoja de papel de aluminio presionada flojamente sobre las verduras y coloque la tapa encima. Coloque en el horno para cocinar durante 30 minutos.", "Retire el plato del horno y voltee el hinojo. Regrese al horno y cocine por otros 30 minutos, o hasta que esté muy suave cuando lo toque con un cuchillo pequeño y afilado.", "Precalentar la parrilla a alto.", "Retire el hinojo del plato. Coloque en un plato templado a prueba de horno poco profundo con el lado cortado, cubra con papel de aluminio y colóquelo en el horno mientras prepara la salsa.", "Vierta los aderezos y los jugos de cocción a través de un tamiz fino suspendido sobre una sartén pequeña. Caliente y agregue 45 g / 1½ oz del queso parmesano. Mezcle con una batidora de mano hasta que quede suave y cremosa (aproximadamente la consistencia de la crema para verter).", "Vierta la mezcla sobre el hinojo y espolvoree con el queso restante. Colóquelo debajo de la parrilla y cocínelo hasta que la superficie esté pálida dorada y burbujee ligeramente alrededor de los bordes.", "Servir con parmesano extra para rociar."], "url": "www_bbc_co_uk_food_recipes_braised_fennel_with_81864", "title": "Hinojo estofado con mantequilla y parmesano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/braised_fennel_with_81864_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1.5kg / 3lb 5oz hombro deshuesado de cerdo", "6 chalotes, aproximadamente en rodajas", "2 cucharadas de puré de tomate", "2 dientes de ajo, aplastados", "4 zanahorias, en cubos", "2 tallos de apio, cortados en rodajas", "1 pequeño racimo de tomillo fresco, solo hojas", "Botella de 750 ml de vino tinto", "500ml / 18fl oz de caldo de carne", "Patatas cerosas de 1kg / 2lb 4oz, peladas y rebanadas gruesas", "50g / 2oz de mantequilla", "sal marina y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Sazonar todo el cerdo con abundante sal y pimienta.", "Caliente una cazuela grande y de base pesada a fuego medio. Cuando la sartén esté caliente, agregue el hogget y fría por un par de minutos en todos los lados, hasta que se dore por todas partes. Retire de la sartén y reserve.", "Agregue los chalotes y el puré de tomate a la cazuela y fríalos en los zumos de hogget durante 2-3 minutos, hasta que se ablanden, revolviendo bien.", "Agregue el ajo, las zanahorias y el apio y continúe freír durante 3-4 minutos, hasta que se ablanden, revolviendo bien.", "Agregue las hojas de tomillo y el vino tinto y lleve la mezcla a ebullición. Vuelva a colocar el colín en la sartén, vierta sobre el caldo de carne y luego devuelva la mezcla a ebullición. Transfiera la cazuela al horno y cocine durante 2 horas.", "Después de 2 horas, levante el cerdo de la cazuela con un par de horquillas para tallar y póngalo a un lado para enfriarlo ligeramente. Pruebe la salsa y agregue más sal y pimienta si es necesario.", "Triture el cerdo en tiras y regréselos a la cazuela, mezclándolos en la salsa.", "Coloque las papas rebanadas en la parte superior de la cazuela y salpique con la mantequilla. Condimentar con sal y pimienta.", "Regrese la cazuela al horno por otros 30 minutos o hasta que las papas estén blandas y doradas, y la cazuela esté burbujeando."], "url": "www_bbc_co_uk_food_recipes_braised_hogget_pie_16464", "title": "Pastel picado estofado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 litro / 1¾ pintas de cola", "150 g / 5 fl oz de salsa de soja oscura", "Salsa de barbacoa de 70 g / 2½ oz", "150g / 5½oz de salsa de tomate", "50ml / 2fl oz salsa Worcestershire", "1 pomelo rosado, solo jugo", "2 costillas cortas de Jacob's Ladder, cortadas en costillas individuales", "250g / 9oz de mantequilla sin sal, cortada en cubitos", "1 chalote grande de plátano, pelar y cortar finamente", "pizca de sal de cebolla", "Crema doble de 250g / 9oz", "25g / 1oz de mostaza integral", "sal al gusto", "100g / 3½oz de vinagre de frambuesa", "200 g / 7 oz de aceite de oliva ligero", "1 colinabo pequeño, pelado y en rodajas finas", "sal", "1 manojo de cohetes", "50 g / 1¾oz de queso parmesano, rallado"], "method": ["Precalentar el horno a 100C / 200F / Gas ¼.", "Para el licor de estofado y la Escala de Jacob, mezcle todos los ingredientes excepto las costillas en un plato resistente al horno que se ajuste perfectamente a las costillas. Agregue las costillas y la capa en el licor de estofado.", "Cubra el plato con papel de aluminio y cocínelo durante 6-7 horas, o hasta que la carne se pueda extraer fácilmente del hueso.", "Retirar del horno y dejar enfriar un poco.", "Retire la carne del hueso y colóquela en una sartén. Agregue suficiente del licor de estofado para llegar a un cuarto de camino de las costillas. Coloque a fuego medio y cocine hasta que el volumen del líquido se reduzca a una salsa espesa. Asegúrese de que la carne esté bien cubierta con la salsa. Mantener caliente", "Para los chalotes crujientes, derrita la mantequilla en una sartén de fondo grueso a fuego alto. Agregue los chalotes y revuelva constantemente.", "Cuando la chalota comience a colorear, retírela de la sartén y cuele a través de un colador. Sazonar con sal de cebolla y escurrir en el rollo de cocina.", "Para la crema de mostaza, bata la crema hasta que se formen picos suaves cuando se quite la batidora. Agregue la mostaza y una pizca de sal. Mezcle bien, teniendo cuidado de no batir la crema, luego transfiéralo a la nevera.", "Para el colinabo, mezcle el vinagre y el aceite hasta que esté emulsionado.", "Coloque el colinabo en un recipiente y cúbralo generosamente con la vinagreta. Déjelo a un lado durante 10 minutos para que se ablande.", "Para servir, divida la carne entre cuatro platos para servir. Esparce los chalotes crujientes sobre la carne y coloca una cucharada de crema de mostaza y el colirrábano al lado. Adorne con unas hojas de rúcula y parmesano finamente rallado."], "url": "www_bbc_co_uk_food_recipes_braised_jacobs_ladder_31819", "title": "Estofado Jacob's Ladder, colinabo, crema de mostaza y chalotes crujientes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cuello de cordero entero grande, alrededor de 1,6 kg / 3lb8 onzas, cortado por la mitad por carnicero", "2 cucharadas de aceite de oliva", "2 zanahorias, peladas y picadas", "2 tomates, picados", "1 cabeza de hinojo, cortada y picada", "1 cabeza de ajo, clavos divididos y pelados", "1 cebolla picada", "1 pimiento rojo, sin semillas y picado", "6 vainas de cardamomo verde, magulladas", "1 cucharadita de semillas de hinojo", "1 cucharada de curry en polvo", "1 cucharada de puré de tomate", "300ml / 10fl oz de vino blanco seco", "2 litros / 3½ pintas de caldo de cordero", "1 bouquet garni", "pellizcar el comino molido", "sal marina y pimienta negra recién molida", "2 zanahorias, peladas y cortadas en cubitos", "1 cucharada de aceite de oliva", "Tocino ahumado de 70 g / 2½ oz", "450 g / 1 libra de guisantes frescos o congelados", "1 lechuga Little Gem, picada"], "method": ["Para el cuello de cordero estofado, precaliente el horno a 200C / 180C / Gas 6.", "Pat el cuello de cordero seco. Caliente una cucharada de aceite de oliva en un gran salteado o sartén. Agregue el cuello de cordero y cocine por 2-3 minutos para sellar en todos los lados. Dejar de lado.", "Caliente el aceite restante en una cazuela a prueba de llamas grande. Agregue las zanahorias, los tomates, el hinojo, el ajo, la cebolla, el pimiento rojo, las vainas de cardamomo, las semillas de hinojo y el polvo de curry. Sazonar con una pizca de sal y freír suavemente durante 8-10 minutos, o hasta que los vegetales comiencen a ablandarse. Agregue el puré de tomate y revuelva por otro minuto.", "Agregue el vino, revuelva para desglasar la sartén y hierva hasta que el vino se evapore. Agregue el caldo de cordero, bouquet garni y el cuello de cordero. Condimentar con sal y pimienta. Cubra la cazuela y ponga a hervir el caldo. Transfiera al horno y deje el cordero a brasear durante 3-3½ horas, o hasta que la carne esté lo suficientemente tierna como para formar copos del hueso. Sazonar el cordero con sal, pimienta y comino. Cubra con papel de cocina y reserve.", "Mientras tanto, para el ragoût, ponga a hervir una olla pequeña de agua con sal y coloque un recipiente con agua helada en el fregadero. Agregue las zanahorias al agua hirviendo, pállese hasta que estén tiernas y drene bien. Sumérgete en el agua helada. Una vez que esté frío, escurrir bien y dejar de lado.", "Aproximadamente 10 minutos antes de servir, caliente el aceite en un sofrito o en una sartén. Agregue los lardons y fríe con cuidado hasta que rinden su grasa y se colorean por todas partes. Coloque la sartén a un lado.", "Cuele el cordero cociendo los jugos a través de un colador fino en una olla y hierva hasta que se reduzca a la mitad. Sazonar con sal y pimienta, si es necesario.", "Para terminar el ragoût, agregue los guisantes, zanahorias blanqueadas y 150 ml / 5 fl oz de los jugos de cocción reducidos a la sartén con los lardons. Dejar hervir a fuego lento durante 3-4 minutos, o hasta que los guisantes estén tiernos. Agregue la lechuga y continúe hirviendo hasta que se marchite. Sazonar con sal y pimienta, si es necesario.", "Transfiera el ragoût y el cuello de cordero a las placas calentadas y sirva inmediatamente con los jugos de cocción restantes al costado."], "url": "www_bbc_co_uk_food_recipes_braised_lamb_neck_with_23209", "title": "Cuello de cordero estofado con guisantes y lechugas ragoût", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 cucharadas de aceite de oliva", "4 piezas de ternera Jacob's Ladder (costilla corta)", "300g / 10oz de panceta, cortada en tocino", "400g / 14oz de chalotes enteros de bebé", "3 dientes de ajo, finamente picados", "2 ramitas de romero", "2 ramitas de tomillo", "300ml / 10½fl oz de vino tinto", "400g / 14oz de tomates picados", "Jus de ternera de 600 ml / 1 pinta", "50g / 1¾oz de mantequilla", "400g / 14oz de setas silvestres", "2 cucharadas de perejil picado", "500g / 1lb 2oz de papas King Edward, peladas y cortadas en trozos", "100 g / 3½ oz de mantequilla", "Crema doble de 200 ml / 7 fl oz", "500g / 1lb 2oz racimos zanahorias bebé", "50g / 1¾oz de mantequilla", "25 g / 1 oz de azúcar", "1 cucharadita de sal"], "method": ["Para la carne estofada precaliente el horno a 160 C / 325 F / Gas 3.", "Caliente una olla grande con tapa y agregue el aceite. Una vez caliente, agregue los trozos de carne, dos a la vez, y freírlos para dorarlos. Retire de la sartén y reserve.", "Agregue la panceta y cocine hasta que esté crujiente. Agregue los chalotes del bebé entero y revuelva hasta que tengan color en ellos.", "Agregue el ajo, el romero y el tomillo y cocine por dos minutos más.", "Vuelva a colocar toda la carne en la sartén, agregue el vino tinto y caliente hasta que el volumen del líquido se haya reducido a la mitad. Agregue los jitomates y jus y luego cocine en el horno precalentado con la tapa puesta durante 2-3 horas, o hasta que la carne esté cocida a su gusto.", "Para el puré, coloque las papas en una cacerola de agua fría y deje que hiervan. Cocine por 15-20 minutos, escurra y vuelva a ponerlos en la sartén caliente.", "Mantenga el fuego por un minuto y machaque la papa. Agregue la mantequilla y la crema y mastique hasta que quede suave.", "Para cocinar las zanahorias baby, coloque todos los ingredientes en una sartén con 500ml / 18fl de agua y cocine durante 4-6 minutos, o hasta que las zanahorias estén cocidas.", "Cuando esté listo para servir, retire la cazuela del horno, saque los trozos de carne y déjelos a un lado. Caliente la cacerola sobre la placa con la tapa apagada y reduzca el líquido en volumen a la mitad hasta obtener una consistencia almibarada.", "Mientras la salsa se reduce, en una sartén por separado caliente la mantequilla y, una vez derretida y caliente, agregue las setas y cocine por 2-3 minutos y luego espolvoree sobre el perejil picado.", "Agregue los champiñones en la salsa reducida.", "Sirva los trozos de ternera Jacob's Ladder con la salsa de champiñones, puré de papa y zanahorias pequeñas."], "url": "www_bbc_co_uk_food_recipes_braised_jacobs_ladder_51141", "title": "Ternera de Jacob estofada con setas y panceta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "2 corderos", "sal al gusto", "2 cebollas, más o menos picadas", "1 apio en barra, aproximadamente picado", "1 litro / 1¾ pinta de cordero marrón", "4 hojas de laurel", "2 limones", "50g / 1¾oz de azúcar", "2 cucharadas de aceite de oliva", "1 cebolla blanca picada", "2 salchichas de merguez, cocidas", "3 dientes de ajo picados", "1 x 400 g / 14 oz de judías borlotti, escurridas y enjuagadas con agua corriente fría", "2 cucharadas de perejil de flatillo picado", "1 cucharada de aceite de oliva", "2 dientes de ajo, en rodajas"], "method": ["Para el cordero estofado, precaliente el horno a 150C / 300F / Gas 2.", "Caliente el aceite en una sartén de base pesada y sazone las espigas con un poco de sal, luego agréguelos a la sartén caliente. Colorea todo lo posible y, una vez coloreado, agrégalo a una cazuela.", "Incline la cebolla y el apio en la sartén y cocine hasta que se ablanden. Agregue las verduras a la cazuela. Vierta el caldo y agregue las hojas de laurel. Llevar a ebullición y quitar las impurezas que se elevan a la parte superior de la sartén.", "Coloque una tapa en la cazuela y cueza en el horno durante 1½-2 horas.", "Retirar del horno y dejar reposar en el licor de estofado.", "Mida 500ml / 18fl oz del licor de cocción en una sartén y cocine hasta que el líquido se haya reducido a una consistencia de glaseado (o salsa).", "Para los frijoles borlotti, con un cuchillo, pele los limones y corte la cáscara en finas tiras (como mermelada). Blanquee la cáscara en una cacerola de agua hirviendo y revuelva en un tazón de agua helada tres veces.", "Juice los limones y colóquelos en una cacerola con el azúcar. Llevar a ebullición, luego agregue la cáscara y cocine hasta que se convierta en un almíbar ligero.", "Caliente una sartén grande y agregue el aceite. Una vez caliente, agregue la cebolla y freír con la salchicha merguez hasta que esté ligeramente coloreado. Agregue el ajo y cocine por otros dos minutos.", "Retire las salchichas y corte en trozos del tamaño de un bocado.", "Agregue los frijoles a la sartén con la mitad del licor de cocción reducido, el jarabe de limón y la mayor parte del perejil de hoja plana escogido.", "Para servir, caliente la cucharada de aceite de oliva en una sartén y fría el ajo hasta que esté crujiente. Escurrir en un plato forrado con papel de cocina.", "Divida los frijoles entre dos platos, coloque los tallos estofados en la parte superior y cepille las espigas con el glaseado restante. Adorne con el perejil restante, una de las hojas de laurel y el ajo crujiente."], "url": "www_bbc_co_uk_food_recipes_braised_lamb_shank_with_05514", "title": "Caña de cordero estofado con bayas y judías borlotti", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/braised_lamb_shank_with_05514_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharadita de aceite de oliva", "2 corderos", "1 cebolla, más o menos picada", "2 dientes de ajo, picados", "1 apio en barra, aproximadamente picado", "1 zanahoria, pelada y picada", "½ cucharadita de pimienta negra", "2 ramitas de tomillo fresco", "2 ramitas de romero fresco", "2 hojas de laurel", "300ml / 10fl oz de vino tinto", "1 litro / 1¾ pintas de caldo de cordero", "30g / 1oz de mantequilla salada", "Crema doble 600ml / 20fl oz", "2 ramitas de tomillo fresco", "2 dientes de ajo, en rodajas finas", "6 papas grandes (Maris Piper o similar), finamente cortadas en una mandolina", "sal y pimienta negra recién molida", "50g / 2oz de mantequilla sin sal", "½ hispi o repollo savoy, rallado"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Para hacer el cordero, caliente el aceite en una cazuela grande a prueba de horno a fuego medio. Dorar las patas del cordero por todos lados, luego transferirlas a un plato o tabla. Agregue la cebolla, el ajo, el apio, los granos de pimienta y las hierbas a la sartén y cocínelos durante 5 minutos.", "Agregue el cordero a la sartén. Vierta el vino y cocine a fuego lento hasta reducir a la mitad. Agregue el caldo, cubra con la tapa y hornee durante 2 horas y media, o hasta que esté tierno.", "Mientras tanto, para hacer el dauphinoise, coloque la crema, el tomillo y el ajo en una cacerola y sazone con sal y pimienta. Llevar a ebullición y retirar del fuego de inmediato.", "Coloque algunas de las papas en una sola capa en un plato resistente al horno y cubra con un poco de la mezcla de crema. Repita esto en capas hasta que todas las papas y la crema se hayan usado. Hornee durante 1-1¼ horas, o hasta que estén doradas, y un cuchillo atraviesa fácilmente.", "Cuando el cordero esté cocido, cuele el líquido en una cacerola. Coloque las patas de cordero en una lata de asar y tueste durante 10-15 minutos para dorar. Cocine a fuego lento el líquido a fuego medio hasta que se reduzca a la consistencia de la crema doble. Batir la mantequilla y mantener caliente.", "Si usa repollo hispi, caliente una sartén, agregue la mantequilla y cocine hasta que se marchite. Si usa repollo savoy, blanquee primero en agua hirviendo, escurra y luego cocine en mantequilla.", "Sirva el cordero con las patatas y col dauphinoise y vierta sobre la salsa."], "url": "www_bbc_co_uk_food_recipes_braised_lamb_shank_with_57818", "title": "Estofado de cordero con patatas dauphinoise", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["8 pequeños corderos (alrededor de 475 g cada uno)", "2 cucharadas de aceite de girasol", "2 cebollas, finamente picadas", "2 palitos de apio, finamente picados", "2 zanahorias, finamente picadas", "3 dientes de ajo, aplastados", "1-2 cucharadas de harina común", "375ml / 13fl oz de vino tinto", "1 cucharada de puré de tomate", "2 cucharadas de romero fresco aproximadamente picado", "2 hojas de laurel", "750ml / 1½ pinta de caldo de pollo", "4 cucharadas de menta fresca finamente picada", "2 cucharadas de ajo finamente picado", "2 cucharadas de ralladura de limón finamente rallada", "pequeñas hojas de perejil fresco de flatleaf", "1.25kg / 2lb 12 oz patatas harinosas, peladas y en cubos", "1 repollo savoy de cabeza, lavado y triturado", "75 g / 2½ oz de mantequilla", "100ml / 3½ fl oz de leche", "sal marina y pimienta negra recién molida"], "method": ["Para los corderos, coloque una cacerola muy grande a fuego alto. Sazonar todo el cordero. Agregue el aceite y, trabajando por lotes, cocine las patas de cordero hasta que estén doradas, transfiriéndolas a un plato grande sobre la marcha.", "A continuación, reduzca el fuego a medio y agregue las cebollas, el apio y las zanahorias a la sartén. Cocine por 6-8 minutos hasta que estén suaves pero no coloreados, agregando el ajo por el último minuto. Mezcle en la harina.", "Aumente el fuego y luego agregue el vino, permitiendo que burbujee durante uno o dos minutos. Ahora agregue el puré de tomate, luego el romero y la hoja de laurel. Sazonar bien con sal y pimienta.", "Vuelva a colocar las patas de cordero en la sartén, vierta sobre el caldo y cubra con una tapa ajustada. Llevar a ebullición y luego reducir a fuego lento a fuego lento durante aproximadamente 3 horas. Gire los mangos de vez en cuando durante este tiempo. Una vez cocida, la carne de las patas de cordero debe ser muy tierna y caer del hueso.", "Mientras tanto, prepara la gremolata. Simplemente mezcle la menta, la ralladura de limón, el perejil y el ajo en un tazón pequeño. Cubra y enfríe hasta servir.", "Media hora antes de servir, prepare el puré. Cocine las papas en una olla grande de agua hirviendo con sal durante 15-20 minutos o hasta que estén tiernas. Mientras se cocinan las papas, cocine al vapor el repollo hasta que esté tierno. Caliente la leche y la mantequilla en una olla pequeña hasta que hierva y retírela del fuego.", "Escurra bien las papas. Agregue la mezcla de leche y mantequilla y mastique hasta que quede suave. Revuelva la col hasta que se marchite completamente y sazone al gusto. Cúbralo y manténgalo caliente", "Para servir, coloca una cucharada grande de puré de crema en el centro de cada plato o plato para servir. Siéntate sobre una pierna de cordero, échale la salsa y espárcela generosamente con la gremolata."], "url": "www_bbc_co_uk_food_recipes_braised_lamb_shanks_with_80478", "title": "Asta de cordero estofado con puré de colcannon", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 x pechuga de cordero enrollada (500g / 1lb 2oz-750g / 1lb 10oz cada uno)", "750ml / 1⅓ pintas de caldo de pollo", "2 papas medianas para hornear", "200 g / 7 oz de grasa de cerdo", "100g / 3½oz de sal marina gruesa", "1 chile verde, aproximadamente picado, para servir", "1 manojo de cebolletas, finamente picado, para servir", "2 cucharadas de requesón", "2 cucharadas de yogur al estilo griego", "1 diente de ajo, aplastado", "1 cucharada de mostaza francesa oscura", "1 cucharada de mostaza integral"], "method": ["Vierta el caldo en una olla grande y cocine a fuego lento. Agregue las pechugas de cordero y cocine por 1-2 horas o hasta que estén tiernas. Saca la grasa derretida, colócala en un recipiente y refrigérala. Retire la carne y déjela enfriar. Desenrolle y apóyese sobre una bandeja de horno. Coloque otra bandeja para hornear encima del cordero y colóquelo en la nevera durante la noche hasta que se asiente.", "Precalentar el horno a 200C / 180C Fan / Gas 6.", "Ruede las papas en la grasa de cerdo. Rodar generosamente en la sal marina gruesa hasta que esté cubierto. Envuelva en papel de cocina y hornee durante 1 hora.", "Mientras tanto, mezcle todos los ingredientes del aderezo y reserve.", "Triture el cordero con dos tenedores.", "Coloque una sartén a fuego alto y agregue un poco de la grasa de cordero procesada. Agregue el cordero a la sartén y fría hasta que esté crujiente.", "Para servir, corte las papas a la mitad y divídalas entre cuatro platos. Cubra cada papa con 3 cucharadas de aderezo y un cuarto del cordero rallado. Adornar con el chile y las cebolletas, servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_braised_lamb_with_salt_86436", "title": "Estofado de cordero con patatas al horno de sal y aderezo de queso cottage", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["20g / 1¾oz de hojas de tomillo", "15g / ½ oz de pino abeto de Douglas", "20g / 1¾oz de semillas de cilantro", "20 g / 1¾oz de romero fresco picado", "200g / 7oz de sal marina", "2kg / 4lb 2oz hombro de cordero, cortado en 4 piezas", "1 cucharada de aceite de oliva", "1.5 litros / 2½ pintas de caldo de pollo", "50g / 2oz de mantequilla", "1 chalote, finamente picado", "2 cucharadas de finas alcaparras", "3 cucharadas de perifollo fresco picado, pamplina y hojas de cilantro", "50 g / 2 oz de azúcar en polvo", "50ml / 2fl oz de vinagre de vino blanco", "2 chalotes de plátano, en rodajas finas", "2 cebollas rojas, cortadas a la mitad, capas separadas", "2 cucharadas de aceite de cacahuete"], "method": ["Moler el tomillo, el pino, las semillas de cilantro y el romero en un molinillo de especias o mortero y mezclar hasta obtener una consistencia de polvo fino.", "Mezcle las especias con la sal en un tazón grande. Cubra las piezas de cordero con las especias, cubra con film transparente y déjelo marinar en la nevera durante 24 horas.", "Una vez que la carne se ha marinado, enjuague la sal con agua fría y luego seque la carne con una toalla de papel.", "Calentar el aceite en una sartén a fuego alto y freír los trozos de carne durante 2 o 3 minutos, o hasta que la carne externa se vuelva marrón oscura y empiece a caramelizar.", "Coloque la carne en una olla a presión y cubra con caldo de pollo.", "Caliente la olla hasta que alcance la presión máxima y cocine durante 45 minutos.", "Retire la olla a presión del fuego y cuele la carne a través de un colador, y junte los jugos en una olla limpia.", "Caliente los jugos de carne hasta que la mezcla se reduzca en dos tercios, o puede cubrir la parte posterior de una cuchara.", "Escama la carne con un tenedor. Agregue 150ml / 5fl oz del material reducido y mezcle hasta que estén bien combinados (reserve el material reducido restante). Sazone al gusto con sal y pimienta negra recién molida.", "Una vez que la carne se haya enfriado, enfríe en la nevera durante 1 hora o hasta que la mezcla esté firme al tacto.", "Corte una película adhesiva de 40cm x 30cm / 16in x 12in y colóquela en una superficie de trabajo. Forme la mezcla de carne de cordero en forma de cilindro y colóquela en el medio de la película adhesiva. Envuelva la película de cling firmemente alrededor de la mezcla de cordero y gire el extremo varias veces. Haga rodar la mezcla de cordero para obtener un cilindro liso. Enfriar en la nevera durante 2-3 horas.", "Freír la mantequilla en una sartén a fuego alto hasta que se vuelva de color marrón oscuro", "Agregue el licor de cocción reservado a la mantequilla, junto con los chalotes y las alcaparras. Sazone con sal y pimienta negro.", "Para los chalotes encurtidos, coloque el azúcar, el vinagre y los chalotes en un recipiente y mezcle hasta que estén bien combinados.", "Mientras tanto, para las cebollas asadas, caliente el aceite en una sartén y agregue las cebollas. Freír hasta que las cebollas se caramelicen y estén tiernas. Retire las cebollas de la sartén y drene en papel de cocina. Sazonar con sal y pimienta negra recién molida.", "Desenvuelve la película adhesiva del cordero y esculpe el cordero en rodajas gruesas.", "Freír el cordero en una sartén hasta que se dore por ambos lados y luego colóquelo en el horno para que se caliente. Agregue tres cucharadas de licor de cocción reducido para cubrir el cordero. Retire la carne de la sartén y enrolle las hierbas picadas.", "Para servir, coloque las cebollas asadas en la parte superior de la carne de cordero, rocíe con la salsa. Sirve con los chalotes encurtidos."], "url": "www_bbc_co_uk_food_recipes_braised_mutton_with_60536", "title": "Cordero estofado con alcaparras y cebollas caramelizadas", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 mejillas de buey, recortadas", "sal y pimienta negra recién molida", "50ml / 2fl oz de aceite vegetal", "100 g / 3½ oz de zanahoria, picada", "Cebolla 100g / 3½oz, picada", "50g / 1¾oz de apio, picado", "1 cabeza de ajo, cortado por la mitad horizontalmente", "375ml / 13fl oz de vino tinto", "150ml / 5fl oz Madeira", "100 g / 3½ oz pasado", "1.5 litros / 2½ pintas de caldo de carne", "4 ramitas de tomillo", "4 hojas de laurel", "15 g / ½ oz de ceps secos", "4 bayas de enebro, aplastadas", "4 filetes de anchoa ahumada", "3-4 nueces en escabeche, picadas", "2 cucharadas de perejil de flatillo picado", "Zanahorias Chantenay 300g / 11oz cortadas a la mitad", "75 g / 2½ oz de mantequilla", "sal", "Jugo de zanahoria 100g / 3½ oz", "1 ramita de estragón", "apretón de jugo de limón", "1kg / 2lb 4oz Maris Piper o patatas Yukon Gold", "150ml / 5fl oz de leche caliente", "150ml / 5fl oz de crema caliente", "250 g / 9 oz de mantequilla, cortada en cubitos, a temperatura ambiente"], "method": ["Sazone las mejillas de buey con sal y pimienta negra, cubra y deje en la nevera durante 24 horas hasta que esté listo para cocinar.", "Precalentar el horno a 160 ° C / 325 ° F / Gas 3.", "Calentar una sartén pesada a fuego alto, agregar el aceite vegetal y dorar las mejillas del buey por todos los lados para dar color. Transfiera a una cazuela.", "En la sartén que se utiliza para dorar las mejillas del buey, fríe con cuidado las verduras y el ajo hasta que estén ligeramente caramelizadas. Agregue el vino y Madeira y cocine hasta que el volumen del líquido se reduzca a la mitad. Agregue la passata y el caldo de carne. Llevar a ebullición y desnatada cualquier escoria que salga a la superficie.", "Agregue el tomillo, laurel, ceps, bayas de enebro, anchoas y dos de nueces.", "Cubra con una tapa o papel de aluminio, y cocine en el horno precalentado durante 2-2 ½ horas, o hasta que la carne esté tierna.", "Retire del horno, levante las mejillas cocidas en una bandeja y cubra con papel de aluminio. Mantener caliente", "Cuele el licor de cocción en una sartén limpia y caliente para reducir el volumen hasta que tenga un buen sabor y una consistencia de salsa. Mantenga la salsa caliente hasta que lo necesite.", "Para las zanahorias glaseadas, coloque las zanahorias en una sola capa en una sartén poco profunda, agregue la mantequilla, una pizca de sal y el jugo de zanahoria suficiente para cubrir. Llevar a ebullición, tapado con una tapa y cocinar hasta que esté tierno; es posible que deba agregar un poco de agua de vez en cuando. Cuando las zanahorias estén recién cocidas, retire la tapa y reduzca el líquido de cocción hasta que esté lo suficientemente espeso para glasear las zanahorias. Agregue un poco de jugo de limón al gusto.", "Para el puré, corte las papas en trozos de tamaño uniforme, colóquelas en una sartén con suficiente agua fría para cubrirlas y agregue una buena pizca de sal. Llevar a ebullición, luego reducir a fuego lento durante unos 20 minutos o hasta que estén tiernos.", "Escurrir bien, luego volver a la sartén y freír a fuego lento a fuego lento durante unos minutos.", "Mash las patatas. Mientras las papas aún estén calientes, agregue la leche, la crema y la mantequilla a su gusto y mezcle para combinar. Agregue sal si es necesario.", "Para servir, divida el puré, la mejilla de buey y las zanahorias entre cuatro platos para servir, caliente la salsa y agregue el resto de las nueces y el perejil picado justo antes de servir. Vierta la salsa sobre las mejillas."], "url": "www_bbc_co_uk_food_recipes_braised_ox_cheek_pickled_28513", "title": "Mejilla de buey estofado, nueces en escabeche, anchoa ahumada, zanahorias glaseadas y puré", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1-2 cucharadas de aceite de oliva, para freír", "750g / 1lb 10oz de mejillas de cerdo, preferiblemente cerdo ibérico o Gloucestershire Old Spot, recortado de grasa y tendones", "1 cebolla picada", "1 zanahoria, picada", "4 dientes de ajo, picados", "½ cucharadita de semillas de comino", "1 cucharadita de pimentón ahumado", "2 cucharaditas de pasas", "200ml / 7fl oz oloroso jerez", "750 ml / 1¼ pintas de carne de vacuno de buena calidad o caldo de pollo oscuro", "25g / 1oz de chocolate amargo", "Patatas cerosas de 700 g / 1 libra y 8 onzas, como papas Desirée, peladas, cortadas en cubos", "1 cucharada de aceite de oliva, para freír", "3 dientes de ajo, en rodajas finas", "1 cucharadita de semillas de comino molidas", "125 g / 4½ oz de mantequilla sin sal ablandada", "1 rebanada de pan blanco crujiente, cortezas eliminadas, cortadas en trozos", "70 g / 2½ oz de almendras blanqueadas, preferiblemente españolas", "1 cucharadita de hojas frescas de tomillo", "½ cucharadita de ralladura de naranja rallada", "pequeñas hojas de perejil fresco de flatleaf", "sal marina y pimienta negra recién molida"], "method": ["Para las mejillas de los cerdos, precaliente el horno a 150C / 130C Fan / Gas 2.", "Caliente el aceite en una cacerola a prueba de horno a fuego medio. Agregue las mejillas de los cerdos y fríalos durante 1-2 minutos por todos lados, o hasta que se doren por todos lados. Retire de la cazuela y reserve.", "Agregue la cebolla, las zanahorias y el ajo a la cazuela y freír durante 4-5 minutos, o hasta que estén doradas.", "Agregue el comino, el pimentón ahumado y las pasas, mezcle bien y continúe cocinando durante 1-2 minutos más.", "Verter el jerez y llevar a ebullición, raspando cualquier trozo quemado del fondo de la sartén con una cuchara de madera. Continúe hirviendo hasta que el volumen de jerez se haya reducido en dos tercios.", "Regrese las mejillas de los cerdos a la cazuela, vierta sobre el caldo y devuelva la mezcla a ebullición. Transfiera la cacerola al horno y cocine durante 2-2½ horas, o hasta que las mejillas de los cerdos estén tiernas y el líquido de cocción se haya reducido y espesado hasta formar una salsa.", "Mientras tanto, para las papas de ajo y comino, hierva los cubos de papa en una sartén de agua con sal durante 8-10 minutos o hasta que estén tiernos. Escurrir bien, machacar con un ricer de patata o trituradora, luego reservar para enfriar.", "Calentar el aceite en una sartén a fuego medio. Agregue el ajo y el comino y fría hasta que el ajo esté dorado.", "Mezcle el puré de papas, el ajo, el comino y el aceite de cocina en un tazón hasta que estén bien combinados. Agregue la mantequilla, luego condimente, al gusto, con sal y pimienta negra recién molida. Mantener caliente", "Para la picada, mezcle todos los ingredientes picada en una pasta espesa en un procesador de alimentos. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Cuando las mejillas de los cerdos estén cocidas, retire la cazuela del horno y colóquela en la placa a fuego medio. Agregue el chocolate y las tres cuartas partes de la picada y cocine a fuego lento durante 2-3 minutos, o hasta que el chocolate se haya derretido y la salsa se haya espesado un poco más. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, divida las mejillas de los cerdos por igual entre 4 tazones para servir. Coloque las papas al lado. Adorna cada plato con algo de la picada restante."], "url": "www_bbc_co_uk_food_recipes_braised_moorish-style_98800", "title": "Mejillas de cerdo estofadas con papas de ajo y comino", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 x mejillas de buey, grasa y piel eliminado, cortado en 6 piezas", "Harina normal de 50g / 2oz", "1 cucharada de aceite", "2 tallos de apio picados", "1 puerro, picado", "2 zanahorias picadas", "225ml / 8fl oz de vino tinto", "1 litro / 1¾ pintas de caldo de carne", "Filetes de anchoa salados 150 g / 5oz", "250 g / 9 oz de mantequilla, en cubos", "½ cucharadita de pimienta de cayena", "½ cucharadita de nuez moscada molida", "½ cucharadita de canela molida", "pimienta negra recién molida", "½ limón, solo jugo", "1 cucharada de salsa Worcestershire", "½ diente de ajo"], "method": ["Seca las mejillas de buey en harina y calienta el aceite en la cazuela. Freír las mejillas hasta que estén doradas por completo, luego retíralas del plato con una espumadera.", "Agregue las verduras a la cacerola y cocine por 2-3 minutos. Vierte el vino y raspa cualquier pedacito dorado con una cuchara de madera.", "Agregue el caldo y lleve a ebullición, devuelva las mejillas de buey al plato, deje hervir a fuego lento y cocine por 2-3 horas, o hasta que las mejillas del buey estén muy tiernas.", "Retire las mejillas de la salsa y deje hervir durante 4-5 minutos, o hasta que la salsa se espese. Cuele la salsa, luego devuelva las mejillas de buey a la salsa.", "Mientras tanto, para mayor deleite, mezcle todos los ingredientes en un procesador de alimentos hasta que estén bien combinados. Coloque la mantequilla en un pedazo grande de film transparente, enrolle en una salchicha larga y luego relájese en el refrigerador.", "Sirve las mejillas con una porción de condimento."], "url": "www_bbc_co_uk_food_recipes_braised_ox_cheeks_with_52702", "title": "Mejillas de buey estofado con gusto de caballero", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/braised_ox_cheeks_with_52702_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 mejillas de buey", "300ml / 10½fl oz de vino tinto", "Puerto de 100 ml / 3½ fl oz", "1 cebolla pequeña, más o menos picada", "2 tallos de apio, más o menos picados", "1 zanahoria grande, más o menos picada", "½ cabeza de ajo, aplastada", "¼ manojo de tomillo fresco", "3g de granos de pimienta negra, aplastados", "1 hoja de laurel", "150 g / 5½ oz de crema de rábano picante", "Patatas de rata 1kg / 2lb 4 oz", "75 g / 2½ oz de mantequilla", "Leche de 75g / 2½oz", "4 x 7.5cm / 3 en huesos de médula de ternera", "250g / 9oz de caldo de pollo", "125g / 4½oz de mantequilla sin sal", "sal y pimienta", "4 zanahorias pequeñas, dejadas enteras", "50 g / 1¾oz de mantequilla sin sal", "½ pan de masa fermentada, corteza eliminada, rota en pan rallado", "2 ramitas de tomillo fresco, hojas recogidas"], "method": ["Para las mejillas de buey estofadas, coloque todos los ingredientes en un tazón grande y marinado durante 24 horas.", "Cuando esté marinado, ponga todo en una olla grande y cocine a fuego lento. Elimine cualquier impureza que suba a la superficie.", "Cocine a fuego lento durante 2-2½ horas, o hasta que las mejillas del buey estén tiernas. Dejar enfriar en el licor de cocina.", "Una vez que se haya enfriado, retire las mejillas de buey del licor y cuele el licor a través de un colador fino. Coloque el licor tamizado en una olla limpia y deje que hierva. Reduzca a fuego lento y cocine hasta que el volumen de líquido se haya reducido y la salsa tenga una consistencia de glaseado. Mantenga caliente hasta que esté listo para servir.", "Para el puré de pomme de rábano picante, mezcle la crema de rábano picante en un procesador de alimentos durante cinco minutos, luego pase a través de un colador fino.", "En una sartén de agua salada hirviendo, cocine las papas Ratte hasta que estén tiernas. Escurrir y reservar para enfriar durante unos minutos. Cuando esté lo suficientemente frío como para manejarlo, pele las papas y póngalas en un ricer. Agregue la mantequilla, la leche y la crema de rábano picante al gusto.", "Para la médula ósea tostada, precaliente el horno a 180C / 350F / Gas 4. Coloque los huesos de la médula de ternera en una bandeja de horno y tueste en el horno durante aproximadamente 12 minutos, o hasta que la médula alcance una temperatura central de 70C / 158F. termómetro de carne Retire del horno y reserve.", "Para las zanahorias asadas, ponga el caldo de pollo y 75g / 2½ oz de mantequilla en una cacerola y deje que hierva. Batir para combinar y sazonar generosamente. Agregue las zanahorias y el hervor a la par. Agregue la mantequilla restante a una sartén y caliente hasta que haga espuma. Agregue las zanahorias y cocine hasta que estén tiernas.", "Para las migas de pan, derrita la mantequilla en una sartén hasta que forme espuma. Agregue las migas de pan y freír hasta que estén crujientes y doradas. Agregue las hojas de tomillo, revuelva y déjelas escurrir en un plato forrado con papel de cocina.", "Para servir, espolvoree el puré de rábano picante en un recipiente para servir poco profundo. Divida las mejillas de buey entre los cuencos, colocándolo en la parte superior. Coloque las zanahorias y los huesos de ternera al lado de la mejilla del buey. Rocíe la salsa y espolvoree con pan rallado."], "url": "www_bbc_co_uk_food_recipes_braised_ox_cheeks_with_73835", "title": "Mejillas de buey estofadas con médula ósea tostada, pomme puré de rábano picante y zanahorias asadas", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 corderos (alrededor de 350 g / 12 oz cada uno)", "1 cucharada de aceite de oliva", "2 cebollas, en rodajas finas", "1 diente de ajo, aplastado", "2 pizcas de azafrán", "2 cucharaditas de semillas de comino", "100 g / 3½ oz de tomates picados o passata", "250ml / 9fl oz de caldo de pollo", "sal y pimienta negra recién molida", "4 patatas dulces, peladas", "1-2 cucharaditas de copos de chile rojo seco", "sal marina", "aceite de oliva, para lloviznar", "4 dientes de ajo", "1 cucharadita de pimienta negra", "1 cucharadita de semillas de cilantro", "2 cucharadas de miel", "1 cucharada de aceite de oliva", "8 hojas de ladrillo o pasta de filo", "1 cucharada de pimentón ahumado"], "method": ["Sazonar el cordero con sal y pimienta. Agregue el aceite a una cazuela y colóquelo a fuego alto. Agregue las espigas de cordero y cocine por 10 minutos, o hasta que se dore por todas partes.", "Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4. Agregue las cebollas y el ajo a la cazuela, cocínelos durante 5 minutos y luego agregue el azafrán, las semillas de comino, los tomates y el caldo. Sazonar bien y llevar a ebullición. Cubra y cocine durante 2 horas. Aumente la temperatura del horno a 200C / 180C Fan / Gas 6.", "Para las batatas asadas, coloque las papas en una bandeja para hornear forrada con papel de cocina. Espolvorear sobre los copos de chile y sazonar con sal. Rocíe con aceite de oliva, selle las papas en papel de aluminio y hornee durante 45 minutos. Deja el horno encendido.", "Para las patatas fritas condimentadas, triture el ajo, los granos de pimienta y las semillas de cilantro en un mortero. Agregue la miel y el aceite para hacer una pasta. Cepille esta mezcla en las hojas de ladrillo. Transfiera las hojas de hojaldre a una bandeja para hornear y hornee durante 10-15 minutos, o hasta que estén crujientes. Polvo con el pimentón luego dejar enfriar y cortar en tiras.", "Sirva las piernas de cordero con las batatas asadas en el lateral y adornadas con las patatas fritas condimentadas."], "url": "www_bbc_co_uk_food_recipes_braised_lamb_shanks_with_48541", "title": "Estofado de cordero con batatas asadas y patatas fritas con especias", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]