[{"ingredients": ["arroz de grano largo medido al nivel de 400 ml / 14 fl oz en una jarra medidora y cocinado de acuerdo con las instrucciones del paquete", "2 cucharadas de aceite de maní o cacahuete", "225 g / 8 oz de carne de cerdo picada", "2 cucharadas de salsa de soja ligera", "sal y pimienta negra recién molida", "2 cucharadas de jengibre fresco finamente picado", "3 cucharadas de cebolletas finamente picadas", "1 cucharada de aceite de sésamo", "1 piña pequeña (aproximadamente 225 g / 8 oz), pelada, sin corazón y cortada en trozos de 1cm / ½ en trozos"], "method": ["Deje que el arroz cocido se enfríe completamente extendiéndolo en una bandeja para hornear. El arroz debe estar frío antes de usarlo en esta receta.", "Caliente un wok a fuego alto hasta que esté caliente. Agregue el aceite, y cuando esté muy caliente y ligeramente humeante, agregue el cerdo y saltee durante dos minutos. Agregue la salsa de soya, la sal, la pimienta, el jengibre y las cebolletas y continúe revolviendo por dos minutos.", "Agregue el arroz, mezcle bien y saltee la mezcla por otros cinco minutos hasta que el arroz esté bien caliente y bien mezclado.", "Agregue el aceite de sésamo, agregue las piezas de piña y saltee hasta que la piña se caliente pero no se cocine. Servir a la vez"], "url": "www_bbc_co_uk_food_recipes_pineapple_rice_29541", "title": "Arroz de piña", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharadita de semillas de comino, ligeramente tostadas", "2 cucharaditas de semillas de cilantro, ligeramente tostadas", "1 tallo de limoncillo, hojas externas duras retiradas, picadas", "1 cucharada de galanga picado", "1 lima (preferiblemente café), ralladura rallada y jugo solamente", "1 cucharada de ajo finamente picado", "1 chalote grande, picado", "3 cucharadas de raíz de cilantro picado (alternativamente, utilizar tallos de cilantro)", "1 cucharada de cúrcuma fresca picada", "1 cucharadita de cúrcuma molida", "1 cucharada de jengibre fresco picado", "4 chiles rojos tailandeses o de ave", "2 cucharaditas de kaapi (pasta de camarón seca)", "1 cucharada de polvo de curry medio", "2 cucharadas de aceite vegetal", "2 cucharadas de aceite de maní o vegetal", "3 cucharadas de pasta de curry de Laos (desde arriba)", "300g / 10oz de gambas crudas, peladas, limpias y desveladas", "Vieiras de 200g / 7oz, coral eliminado", "2 cucharadas de salsa de pescado", "1 cucharada de azúcar", "4 hojas de lima kaffir", "500ml / 18fl oz de leche de coco", "1 piña pequeña, pelada y cortada en cubitos", "4 cebollas de primavera, cortadas en piezas de 2.5cm / 1in", "puñado de albahaca santa u hojas de albahaca comunes, más extra para decorar", "250g / 9oz de tomates cherry, cortados a la mitad", "1 pepino, en rodajas", "1 manojo de cebollas en rodajas finas", "1 chile rojo, cortado en tiras largas", "1 lechuga iceberg, en rodajas", "1 limón, solo jugo"], "method": ["Para la pasta de curry de Laos, mezcle o machaque todos los ingredientes junto con una pequeña cantidad de agua para hacer una pasta suave. Puede conservarse, bien tapado, en la nevera durante 3-4 días o congelarse en bandejas de cubitos de hielo.", "Para el curry de piña, gambas y vieiras, caliente el aceite en un wok y fríe con cuidado la pasta de curry por un minuto hasta que quede fragante. Agregue los langostinos y las vieiras. Cocine por 2-3 minutos, luego agregue la salsa de pescado, el azúcar y las hojas de lima kaffir. Revuelva por un minuto. Use una cuchara con ranura para quitar los mariscos del wok y manténgalos calientes.", "Agregue la leche de coco al wok y lleve a ebullición, luego cocine a fuego lento durante 2-3 minutos. Agregue la piña y cocine a fuego lento durante cinco minutos. Regrese los mariscos al wok y agregue las cebolletas y las hojas de albahaca. Cocine, revolviendo, por un par de minutos, luego transfiera a los tazones para servir.", "Para la ensalada, coloque todos los ingredientes en un tazón grande y mezcle suavemente.", "Para servir, decorar cada plato de curry con una ramita de albahaca y servir con la ensalada."], "url": "www_bbc_co_uk_food_recipes_pinapple_prawn_and_02199", "title": "Curry de piña, gambas y vieiras", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Azúcar demerara 100 g / 3½ oz", "8 rebanadas de piña en conserva, reserva el jarabe en lata", "320 g / 11½ oz de hojaldre listo enrollado", "1 huevo de gallinas camperas, golpeado", "4 cucharadas de jarabe de arce", "4 cucharaditas de ron de coco", "4 cucharaditas de jugo de limón recién exprimido", "helado de vainilla", "1 lima, ralladura solamente"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6. Línea 4 anillos de crumpet (8cm / 3¼in de diámetro) con papel antigrasa.", "Calentar una sartén, derretir el azúcar en la sartén y luego retirar del fuego", "Mientras tanto, coloque las latas forradas en el horno durante 5 minutos. Luego retíralo del horno y vierte el caramelo caliente. Coloque 2 rodajas de piña en la parte superior del caramelo en cada anillo.", "Corta 4 círculos de la masa de hojaldre lo suficientemente grande como para cubrir el anillo. Cubra las rebanadas de piña con la masa, empujando la masa hasta el fondo de la piña, tocando la salsa de caramelo.", "Coloque los 4 anillos en una bandeja para hornear forrada con papel resistente a la grasa. Cepille la parte superior de la masa con un poco de huevo batido.", "Colóquelos en el horno y cocínelos durante 20 minutos hasta que la masa esté dorada.", "Mientras tanto, para el almíbar, en un tazón pequeño, mezcle el jarabe de arce, el ron, el jugo de lima y 4 cucharadas de jarabe de piña reservado.", "Incline la tarta boca abajo y retire el papel antigrasa. Coloque en un plato y sirva con una bola de helado de vainilla sobre la llovizna superior con algo de jarabe. Adorne con ralladura de lima y sirva."], "url": "www_bbc_co_uk_food_recipes_pineapple_tarte_tatin_54400", "title": "Tarta tatin de piña con jarabe de ron", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["568ml / 1 pinta de cartón crema doble", "1 vaina de vainilla, dividida longitudinalmente", "2 palitos de canela", "2 dientes", "6 yemas de huevo de rango medio", "150 g / 5½ oz de azúcar en polvo", "1 piña bebé, pelada y cortada en rodajas de 3 mm de grosor", "Harina normal de 250g / 9oz", "250 g / 9 oz de mantequilla muy fría, cortada en cubos pequeños", "½ cucharadita de sal", "125ml / 4fl oz de agua helada", "Azúcar en polvo de 110 g / 4 oz", "20 g / oz de mantequilla", "2 anillos de piña", "Azúcar en polvo de 110 g / 4 oz", "75ml / 2½ fl oz crema doble", "2 cucharadas de ron", "2 ramitas de menta fresca, más extra para adornar"], "method": ["Para el helado con especias, coloque la crema, la vaina de vainilla y las semillas, los palitos de canela y los clavos en una olla grande y caliente hasta que comience a hervir a fuego lento.", "Mientras tanto, coloca las yemas de huevo y el azúcar en un tazón grande y bate hasta que la mezcla se espese y se ponga pálida.", "Poco a poco agregue la mezcla de crema al recipiente, batiendo continuamente y, una vez que haya agregado todo el líquido, vuelva a verterlo en la sartén. Cocine hasta que espese, luego retire la vaina de vainilla, los palitos de canela y los clavos de olor. Coloque en una máquina para hacer helados y revuelva según las instrucciones del fabricante durante 40-50 minutos, o hasta que espese. Coloque el helado en el congelador.", "Para la piña seca, caliente el horno a 180 ° C / 350 ° F / Gas 4. Coloque las rodajas de piña en una bandeja para hornear y colóquelas en el horno.", "Hornee durante 20 minutos y luego apague el fuego. Deja en el horno durante 1-1½ horas, dando vuelta una vez.", "Retire la piña del horno y colóquela sobre una rejilla para enfriarla.", "Para la masa de hojaldre, coloque la harina en un montículo sobre una superficie de trabajo limpia y haga un pozo en el centro.", "Coloque la mantequilla y la sal en el pocillo y trabaje con las yemas de los dedos de una mano, y gradualmente arrastre la harina hacia el centro con la otra mano.", "Cuando los cubitos de mantequilla se hayan convertido en trozos pequeños y la masa esté granulosa, agregue gradualmente el agua helada y mezcle hasta que esté todo incorporado, pero no trabaje demasiado la masa; debe tener un efecto marmoleado con la mantequilla sin mezclarla adecuadamente. .", "Enrolle la mezcla en una bola, envuélvala en una película adhesiva y refrigérela durante 20 minutos.", "Hierva una superficie de trabajo limpia y extienda la masa en un rectángulo de 40x20cm / 16x8 pulgadas.", "Doble el tercio superior hacia el centro, luego el tercio inferior hacia arriba y sobre eso. Dale un cuarto de vuelta.", "Enrolle el bloque de masa en un rectángulo de 40x20 cm / 16x8 pulgadas como antes y vuelva a doblarlo en tres. Estos son los primeros dos turnos. Envuelva el bloque en una película adhesiva y refrigere durante 30 minutos.", "Dale a la masa helada otras dos vueltas, rodando y doblando como antes. Esto hace un total de cuatro giros. Envuelva la masa en una película adhesiva y refrigere durante al menos 30 minutos antes de usarla.", "Para tarta tatin de piña, precalentar el horno a 200C / 400F / Gas 6.", "Divida el azúcar de manera uniforme entre dos bandejas pequeñas blindadas a prueba de horno a fuego lento. Cocine sin remover, hasta que el azúcar se haya derretido y caramelizado en ambas sartenes, volviéndose marrón dorado.", "Retire del fuego y coloque la mitad de la mantequilla en cada sartén. Revuelva suavemente para combinar.", "Coloque un anillo de piña en el caramelo en cada sartén.", "Coloque la masa enrollada en una superficie limpia y enharinada y corte dos círculos ligeramente más grandes que la circunferencia de las bandejas blini.", "Cubra cada bandeja con una ronda de repostería, empujando el borde hacia abajo alrededor del anillo de piña. Transfiera el horno y hornee durante 10-12 minutos, hasta que la masa esté dorada y cocida. Retire y deje que se enfríe un poco.", "Para la salsa de caramelo caliente, coloque el azúcar en una cacerola y caliente suavemente sin revolver hasta que se haya derretido y haya dado un color caramelo dorado.", "Retire del fuego y coloque la base de la sartén en agua fría para evitar que el azúcar se cocine más.", "Agregue la crema doble, el ron y la menta y revuelva para combinar.", "Para servir, coloque una porción de cada tarta en un plato de servir y cubra con una bola de helado. Pon un pedazo de piña seca encima del helado y rocía sobre el caramelo. Adorne con menta."], "url": "www_bbc_co_uk_food_recipes_pineapple_tarte_tatin_68881", "title": "Tarta tatin de piña con helado de especias, piña seca y salsa de caramelo caliente", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 piña madura, pelada usando un cuchillo afilado, ojos y núcleo removidos, carne cortada en anillos de 1.5cm / ½ en", "200 g / 7 oz de azúcar en polvo", "1 vaina de vainilla, dividida longitudinalmente, semillas raspadas con un cuchillo y reservadas para el pastel (ver abajo)", "1 ramita de canela", "Anís de 2 estrellas", "2 hojas de laurel", "150 g / 5½ onzas de mantequilla, ablandadas, más extra para engrasar", "150g / 5½oz de azúcar morena oscura", "100g / 3½ oz fechas picadas, picadas", "3 cucharaditas de pimienta negra agrietada", "50ml / 2fl oz de ron oscuro (opcional)", "200g / 7oz de mantequilla, más extra para engrasar", "200g / 7oz de azúcar morena suave", "100 g / 3½ oz de harina de auto crianza, tamizada", "2 cucharaditas de polvo de hornear", "4 huevos de gallinas camperas, golpeados", "semillas de vainilla reservadas (del jarabe de azúcar)", "50ml / 2fl oz de ron oscuro (opcional)", "75 g / 2½ oz de mantequilla", "100g / 3½oz de azúcar morena suave", "Ron oscuro de 30ml / 1fl oz", "2 x 160 ml / 5½ fl oz latas crema de coco, refrigerado en la nevera durante la noche", "2 cucharadas de azúcar en polvo", "1 lima, ralladura finamente rallada solamente, para servir"], "method": ["Engrase ligeramente una lata cuadrada de pastel de 24cm / 9½ pulgadas con mantequilla. Alinee la base y los lados con papel para hornear.", "Para el jarabe de azúcar de piña, use dos cortadores de galletas para hacer que los bordes exteriores y los bordes interiores de cada anillo de piña tengan una forma uniforme, o bien córtelos con un cuchillo afilado. Necesitas 4-5 anillos de piña.", "Vierta 500ml / 18fl de agua en una olla grande y agregue el azúcar impalpable, las vainas de vainilla, la ramita de canela, el anís estrellado y las hojas de laurel. Llevar a ebullición, luego agregar los anillos de piña y reducir el fuego hasta que la mezcla esté hirviendo a fuego lento. Continúe cocinando a fuego lento durante 15-20 minutos, o hasta que la piña esté tierna. Coloque la sartén a un lado hasta que el contenido se haya enfriado por completo.", "Para el aderezo, coloca la mantequilla y el azúcar moreno oscuro en un tazón grande. Usando un batidor eléctrico, bata hasta que estén esponjosos, luego agregue las fechas, los granos de pimienta negra y el ron (si se usa).", "Escurra los anillos de piña enfriados y colóquelos en el fondo de la lata de la torta. Extiende la mezcla de cobertura sobre los anillos de piña en una capa uniforme.", "Para la torta, precaliente el horno a 180C / 350F / Gas 4.", "En un tazón limpio, bata la mantequilla y el azúcar hasta que estén esponjosos con un batidor eléctrico. Agregue la harina, el polvo de hornear, los huevos, las semillas de vainilla y el ron, si está usando, luego bata de nuevo hasta que se combinen.", "Con una cuchara, coloque la mezcla de torta en la lata de la torta y alise la parte superior con una espátula. Hornee por 45 minutos, o hasta que un pincho insertado en el centro del pastel salga limpio. Retire del horno y deje enfriar por 10-15 minutos.", "Cuando se enfríe, coloque la tarta boca abajo sobre un plato de servir y retire el pergamino para hornear.", "Para la salsa toffee, derrita todos los ingredientes de la salsa de caramelo en una cacerola pequeña a fuego lento. Aumente el fuego hasta que la mezcla esté hirviendo, luego retire la sartén del fuego.", "Para la crema de coco, en un tazón, mezcle la crema de coco fría y el azúcar impalpable hasta que se formen picos suaves cuando se quite la batidora.", "Para servir, corta el pastel de piña boca abajo. Coloque cada rebanada en un plato para servir, luego rocíe sobre una salsa pequeña de caramelo. Coloque una cucharada de crema de coco al lado (si está usando), luego espolvoree un poco de ralladura de limón."], "url": "www_bbc_co_uk_food_recipes_pineapple_upside-down_22072", "title": "Pastel al revés de piña", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Sirve 12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 250g / 9oz, más extra para espolvorear", "275g / 9¾ oz mantequilla muy fría, cortada en cubos pequeños", "½ cucharadita de sal", "125ml / 4fl oz de agua helada", "115 g / 4 oz de azúcar en polvo", "2 anillos de piña", "100 g / 3½ oz de mantequilla", "100g / 3½oz de azúcar morena suave", "100g / 3½ oz de jarabe dorado", "½ limón, solo jugo", "150ml / 5fl oz de crema doble", "2 cucharadas de licor de coco", "copos de coco", "helado de vainilla", "2 ramitas de menta fresca, hojas retiradas"], "method": ["Coloque la harina en un montículo sobre una superficie de trabajo limpia y haga un pozo en el centro.", "Agregue 250 g / 9 oz de mantequilla y la sal al pocillo y trabaje con las puntas de los dedos de una mano, dibujando gradualmente la harina en el centro con la otra mano. Cuando los cubos de mantequilla se han convertido en trozos pequeños y la masa es granulada, trabaje gradualmente en el agua y todo se incorpora. No trabajes demasiado la masa, deberías tener un efecto marmoleado con la mantequilla. Enrolle la mezcla en una bola, envuélvala en una película adhesiva y refrigérela durante 20 minutos.", "Hierva una superficie de trabajo limpia y extienda la masa en un rectángulo de 40x20cm / 16x8 pulgadas. Doble el tercio superior hacia el centro, luego el tercio inferior hacia arriba y sobre eso. Dale un cuarto de vuelta. Enrolle la masa en un rectángulo de 40x20cm / 16x8 pulgadas como antes, y vuelva a doblarla en tres. Estos son los primeros dos turnos. Envuelva el bloque en una película adhesiva y refrigere durante 30 minutos.", "Dale a la masa otras dos vueltas, rodando y doblando como antes. Esto hace un total de cuatro giros. Envuélvala en una película adhesiva y refrigere durante al menos 30 minutos.", "Precaliente el horno a 200 ° C / 180 ° Ventilador / Gas 6. Divida el azúcar de manera uniforme entre dos bandejas pequeñas blindadas para horno. Cocine a fuego lento sin remover, hasta que el azúcar se haya derretido y caramelizado en ambas sartenes, dorendo de marrón (PRECAUCIÓN: el azúcar hirviendo es extremadamente caliente. Maneje con mucho cuidado). Retire del fuego y ponga la mitad de la mantequilla restante en cada sartén. Revuelva suavemente. Coloque un anillo de piña en el caramelo en cada sartén.", "Coloque la masa enrollada sobre una superficie limpia y enharinada y corte dos círculos ligeramente más grandes que la circunferencia de las bandejas blini. Cubra cada bandeja con una ronda de repostería, empujando los bordes hacia abajo alrededor del anillo de piña. Hornee durante 10-12 minutos, o hasta que la masa esté dorada y cocida. Retirar y dejar enfriar un poco.", "Mientras tanto, para la salsa, en una cacerola pequeña caliente la mantequilla, el azúcar morena y el sirope dorado hasta que se combinen y el azúcar se disuelva. Llevar a fuego lento a fuego lento, luego retirar del fuego y agregar el jugo de limón al gusto. Agregue la crema y el licor de coco.", "Tueste el coco copos en una sartén seca durante 1-2 minutos, teniendo cuidado de asegurarse de que no se quema.", "Para servir, coloque una porción de cada tarta en un plato y cubra con una bola de helado. Rocíe la salsa y decore con hojas de menta y coco tostado."], "url": "www_bbc_co_uk_food_recipes_pineapple_tarte_tatin_71656", "title": "Tarta tatin de piña con salsa de coco y caramelo", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200g / 7oz de néctar de agave (ligero y suave), más 4 cucharadas para la base y para lloviznar", "1 x 425 g de rodajas de piña de lata en jugo de fruta, escurrido y secado con rodillo de cocina", "8 cerezas congeladas, descongeladas y sin piedras", "300g / 10½ oz de harina de auto crianza", "¼ de cucharadita de sal fina de mesa", "300g / 10½oz de mantequilla sin sal, derretida y enfriada", "5 huevos grandes de gallinas camperas, ligeramente golpeados", "500ml / 18fl oz de leche entera", "60g / 2¼ oz de jarabe de arce", "1 cucharadita de extracto de vainilla", "1 vaina de vainilla, solo semillas", "6 yemas de huevo de rango medio", "15g / ½ oz de harina de maíz"], "method": ["Para la torta, precaliente el horno a 170 ° C / 150 ° C Ventilador / Gas 3. Engrase una lata honda de 30x20 cm / 12 x 8 pulgadas y forre la base y los costados con papel para hornear. Dejar de lado.", "Extienda 2 cucharadas de néctar de agave sobre la base de la lata con la parte posterior de la cuchara. Arregle los anillos de piña en la lata. Llena los anillos de la piña con las cerezas.", "Tamiza la harina y la sal en un tazón. Haga un pozo en el medio y agregue la mantequilla derretida, el néctar de agave y los huevos ligeramente batidos. Doble la mezcla suavemente.", "Con cuidado, vierta la mezcla de la torta sobre las piñas y las cerezas preparadas, aligerando con la parte posterior de la cuchara y teniendo cuidado de no desalojar la fruta dispuesta. Alise la parte superior y hornee durante 35-40 minutos, o hasta que un pincho de madera insertado en la torta salga limpio.", "Deje que la lata se enfríe en una rejilla de alambre durante 5 minutos, luego gire suavemente la lata sobre la rejilla para que se enfríe por completo. Con cuidado, retire el papel de pergamino y rocíe con el néctar de agave restante.", "Para la salsa de crema de jarabe de arce, coloque la leche, el jarabe de arce, el extracto de vainilla y las semillas de vainilla en una cacerola mediana y lleve hasta casi el punto de ebullición.", "Batir las yemas de huevo y la harina de maíz en un bol hasta que quede suave. Temple las yemas de huevo suavemente agregando un cucharón de la mezcla de leche a la vez para aumentar la temperatura de los huevos.", "Vierta la leche restante sobre los huevos, luego vierta la mezcla de nuevo en la sartén y vuelva a calentar a fuego medio, revolviendo constantemente hasta que se espese y cubra la parte posterior de la cuchara. Retire del fuego y transfiera a una jarra, cubra con una película adhesiva para evitar que se forme la piel.", "Sirva rebanadas del pastel con la crema derramada."], "url": "www_bbc_co_uk_food_recipes_pineapple_upside-down_82924", "title": "Pastel al revés de piña", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 piña grande, pelada y cortada en rebanadas gruesas", "Azúcar demerara 200 g / 7 oz", "50g / 1¾oz de mantequilla", "pocos anís estrellado, desmenuzado", "1 limoncillo, toscamente picado", "1 pieza de ralladura de lima", "Ron 100ml / 3½fl oz", "crème fraîche, helados o helado sin lácteos con sabor a coco"], "method": ["Extienda el azúcar demerara sobre un plato y sumerja la piña en él, revistiendo ambos lados. Derrita la mantequilla en una sartén grande y pesada a fuego medio. Cuando la mantequilla esté espumosa, agregue la piña, el anís estrellado, la hierba de limón y la ralladura de lima y cocínelos hasta que se doren por ambos lados; usted desea que el azúcar se derrita en la piña y se vuelva marrón oscuro / casi negro.", "Calentar el ron en un cucharón, encender cuidadosamente, y verter sobre la piña. Espere a que se queme el ron, mantenga el fuego hasta que el contenido de la sartén se vea almibarado. Sirva la piña con los jugos almibarados derramados, con crema fresca, helado o helado sin lácteos con sabor de coco en el lateral."], "url": "www_bbc_co_uk_food_recipes_pineapple_with_star_29786", "title": "Piña con anís estrellado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de piñones", "1 cucharada de mantequilla", "25g / 1oz Stilton", "pan pequeño", "pequeñas hierbas frescas, como perifollo, cebollino, perejil y salvia, solo hojas", "1 x 100 g / 3½ oz de filete de ternera", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "1 cucharada de mantequilla", "¼ repollo savoy, finamente picado", "2 cucharaditas de mostaza integral", "2 tomates maduros, toscamente picados", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para la carne, coloque los piñones, mantequilla, Stilton, pan y hierbas en una licuadora y pulse para combinar.", "Sazone el filete de ternera con sal y pimienta negra recién molida. Presione la masa sobre la carne para cubrirla.", "Caliente el aceite de oliva en una sartén a prueba de horno a fuego medio-alto y fría el lado de la costra de res durante 2-3 minutos.", "Transfiera al horno para terminar de cocinar durante 5-6 minutos, o hasta que la masa esté dorada y la carne esté cocida a su gusto. Deja descansar durante cinco minutos.", "Para la ensalada de tomate y col tibia, caliente la mantequilla en una sartén y cocine suavemente la col hasta que esté tierna. Agregue la mostaza y los tomates, revuelva bien para combinar y caliente. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, coloque la ensalada de repollo en un plato y cubra con la carne."], "url": "www_bbc_co_uk_food_recipes_pinenutstiltonandher_85372", "title": "Nuez de pino, Stilton y carne con costra de hierbas con ensalada de tomate y col tibia", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["aceite vegetal, para freír", "50g / 1¾oz de harina natural", "1 huevo de gallinas camperas, golpeado", "75g / 3oz de piñones, finamente picados", "125g / 4½oz paneer, en rodajas", "2 cucharadas de aceite de oliva", "½ pimiento rojo, finamente picado", "3 dientes de ajo, finamente picados", "½ naranja, solo jugo", "2 cucharaditas de miel", "sal y pimienta negra recién molida", "150 g / 5½ oz de espinaca fresca", "½ limón, solo jugo", "3 cucharadas de aceite de oliva", "2 cucharaditas de vinagre de vino blanco", "1 naranja, segmentado", "sal y pimienta negra recién molida"], "method": ["Para el paneer, llene la mitad de una cacerola o freidora profunda con aceite vegetal y caliéntela hasta que un pequeño cubo de pan chisporrotee y se ponga dorado cuando se le caiga. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Coloque la harina común, el huevo batido y los piñones finamente picados en tres cuencos separados. Primero enrolle el paneer en la harina común, luego en el huevo y finalmente en los piñones.", "Coloque cuidadosamente el paneer en el aceite caliente y cocine hasta que se dore, luego quite con cuidado con una cuchara ranurada y escurra sobre papel de cocina.", "Para el aderezo, caliente el aceite en una cacerola a fuego medio, luego agregue el pimiento rojo y el ajo a la sartén y cocine durante tres minutos. Retirar del fuego y agregar el jugo de naranja y la miel y sazonar al gusto con sal y pimienta negra recién molida.", "Transfiera el aderezo a una mini-licuadora y mezcle hasta que quede suave, luego vierta en un tazón pequeño para servir.", "Para la ensalada de espinacas, combine todos los ingredientes en un tazón.", "Para servir, coloque la ensalada en un plato grande con el paneer en la parte superior y el tazón pequeño de salsa al lado."], "url": "www_bbc_co_uk_food_recipes_pinenutcrustedpaneer_84699", "title": "Paneer con corteza de nuez de pino con ensalada de espinacas y aderezo de miel y pimiento rojo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1-2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 cucharadas de aceite de oliva", "1 cebolla, finamente rebanada", "2 dientes de ajo, finamente picados", "2 pimientos verdes, finamente rebanados", "Pimientos asados ​​a 110g / 4oz, de una jarra, en rodajas finas (opcional)", "2 tomates, toscamente picados", "4 huevos de gallinas camperas, golpeados", "4 rebanadas de jamón, tocino o jamón", "2 rebanadas de pan crujiente, tostado", "sal y pimienta negra recién molida"], "method": ["Calentar una sartén hasta que se fume, luego agregar el aceite de oliva seguido de las cebollas, el ajo y los pimientos verdes. Cocine por 1-2 minutos, o hasta que las cebollas estén comenzando a ablandarse.", "Agregue los pimientos asados ​​(si usa) y los tomates, y cocine durante 1-2 minutos, luego sazone con sal y pimienta.", "Vierta los huevos y cocine por 2-3 minutos, revolviendo para revolver los huevos, hasta que los huevos estén listos.", "En una sartén limpia, fría el jamón por un minuto en ambos lados, o hasta que se dore por todas partes.", "Sirva los huevos encima de pan crujiente, cubierto con el jamón frito."], "url": "www_bbc_co_uk_food_recipes_piperadewitheggs_90495", "title": "Jamón y huevos con salsa de pimienta asada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/piperadewitheggs_90495_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 claras de huevo de gallinas camperas", "1 pizca de sal", "300 g / 10½ oz de azúcar en polvo", "½ cucharadita de extracto de vainilla", "colorante de comida rosa", "75g / 2½oz de frambuesas frescas o congeladas", "2 cucharadas de azúcar glas", "1 jugo de limón exprimido", "400ml / 14fl oz de crema batida"], "method": ["Precaliente el horno a 140C / 280F / Gas 1. Alinee dos bandejas para hornear con papel pergamino.", "Ponga las claras de huevo en un tazón grande inmaculadamente limpio con una pizca de sal. Batir hasta que se formen picos suaves cuando se quite la batidora. Poco a poco agregue el azúcar en polvo, una cucharada a la vez, batiendo entre cada adición, hasta que se haya agregado todo y el merengue esté satinado y forme picos rígidos cuando el batidor se levante de la mezcla.", "Agregue el extracto de vainilla con una cuchara grande de metal. Usando una manga pastelera equipada con una boquilla de 1½ cm / ¾in o una cuchara, pinte o recoja la mezcla en merengues individuales de aproximadamente 7cm / 2¾ de ancho en las bandejas de horneado preparadas.", "Para el efecto de ondulación del color, sumerja un pincho de madera o metal en el colorante de alimentos y agítelo a través de cada merengue.", "Hornee en el horno por 30 minutos. Prueba uno levantando y presionando suavemente en la base de un merengue; debe ser crujiente pero ceder con un poco de presión; se fríe más cuando se enfríe. Apague el horno y déjelo enfriar en el horno con la puerta del horno ligeramente entreabierta para obtener los mejores resultados. Si es posible, déjalos enfriar completamente en el horno.", "Cuando esté listo para servir, prepare la crema de frambuesa. Coloque las frambuesas o los arándanos y el azúcar en un procesador de alimentos y mezcle hasta que quede suave. Empuja la mezcla a través de un colador en un recipiente para eliminar las pepitas. Doble la cantidad de puré que desee a través de la crema batida, dejándola ondulada si lo desea.", "Ponga una generosa cucharada de crema en la mitad del merengue y sándwich junto con otro merengue. Sirva cualquier puré restante en el lado."], "url": "www_bbc_co_uk_food_recipes_pink_meringues_with_56085", "title": "Merengues rosados ​​con crema de frambuesa", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Hace 4 pares grandes u 8 pares más pequeños", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cebolla, más o menos picada", "4 dientes de ajo, picados", "2 limones, zumos y cáscaras sin cebar", "generosa salchicha Worcestershire salsa", "4 chiles rojos suaves, semillas retiradas y picadas", "2 chiles rojos de ojo de pájaro, semillas retiradas y picadas", "2 cucharadas de vinagre de vino blanco", "1 cucharadita de pimentón ahumado", "1 cucharadita de orégano seco", "1 cucharadita de azúcar moreno claro", "1 cucharadita de sal (opcional)", "pequeño racimo de perejil", "1 pollo, espolvoreado"], "method": ["Coloque todos los ingredientes, excepto el pollo, en un procesador de alimentos y pulse hasta que tenga un adobo suave.", "Coloque el pollo en un plato poco profundo y vierta sobre el adobo. Masajee el adobo en el pollo tanto como pueda, luego cúbralo y déjelo marinar en la nevera durante al menos 3 horas o preferiblemente durante la noche.", "Cuando esté listo para cocinar el pollo, prepare una barbacoa o precaliente su horno a 200C / 180C Fan / Gas 6.", "Para asar a la parilla, coloque el pollo espolvoreado sobre la parrilla y cocínelo durante unos 5 minutos a cada lado sobre el fuego directo, luego, deséchelo un poco para terminar; probablemente le tomará otros 20 minutos de giro regular. Rocíe regularmente con agua (o cerveza) si se está dorando demasiado rápido. Alternativamente, tueste en el horno durante 30-35 minutos, o hasta que los jugos salgan limpios."], "url": "www_bbc_co_uk_food_recipes_piri-piri_chicken_98511", "title": "Prison Pencil c", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/piri-piri_chicken_98511_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pollo entero (aproximadamente 1kg / 2lb 3oz), espolvoreado", "sal y pimienta negra recién molida", "6-12 chiles rojos frescos, dependiendo de qué tan caliente lo desee", "1 cucharada de ajo, escaldado y picado", "1 cucharadita de sal en escamas", "½ cucharadita de orégano", "½ cucharada de pimentón", "100ml / 3½fl oz de aceite de oliva", "50ml / 1¾fl oz de vinagre de vino tinto", "papas fritas", "ensalada"], "method": ["Para preparar la salsa de piri-piri, precaliente el horno a 180 ° C / 350 ° F / Gas 4. Coloque los chiles en una bandeja de asar y tápelos por 10 minutos.", "Enfriar y tostar los chiles. Coloque los chiles, el ajo, la sal, el orégano, el pimentón, el aceite de oliva y el vinagre en una cacerola, y cocine a fuego lento durante 2 o 3 minutos.", "Deje que la mezcla se enfríe, luego mezcle con un puré en una licuadora de jarras o en un procesador de alimentos. Almacenar en un recipiente con tapa a temperatura ambiente; se mantendrá durante aproximadamente un mes. Agitar antes de usar.", "Coloque el pollo espolvoreado en una bolsa de plástico con cierre hermético. Agregue la mitad de la salsa piri-piri, extendiéndola uniformemente sobre el pollo. Selle y deje marinar en el refrigerador durante al menos una hora.", "Precalienta el horno a 200 ° C / 390 ° F / Gas 6 y precalienta una sartén grande en la placa. Alternativamente, enciende tu barbacoa.", "Sazone el pollo marinado y cocínelo en la sartén durante 2-3 minutos por cada lado, hasta que se dore.", "Transfiera el pollo a la parrilla a una bandeja de asar y tueste en el horno durante 30 minutos, hasta que esté cocido. Alternativamente, coloque el pollo en una barbacoa de calor mediano, tapado, por 10-15 minutos en ambos lados o hasta que esté bien cocido, hilvanando regularmente con la salsa de piri-piri restante.", "Sirve con papas fritas y ensalada."], "url": "www_bbc_co_uk_food_recipes_piripirichicken_72310", "title": "Prison Pencil c", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "2-4", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/piripirichicken_72310_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 chiles rojos, sin semillas, picados", "1 chile seco, más o menos picado", "½ limón, solo jugo", "3 dientes de ajo, pelados", "1 cucharada de pimentón dulce ahumado", "4 cucharadas de aceite de oliva", "1 cucharada de vinagre de vino tinto", "1 cucharadita de sal marina", "½ cucharadita de pimienta negra recién molida", "12 gambas muy grandes, conchas eliminadas pero se dejan colas, limpiadas", "200g / 7oz de cuscús integral", "400ml / 14fl oz de agua hirviendo", "1 cucharadita de harissa", "1 cucharada de melaza de granada", "1 cucharadita de mezcla de especias Baharat (disponible en tiendas de Oriente Medio y algunos supermercados)", "½ limón, solo jugo", "1 cebolla roja, finamente rebanada", "1 granada, solo semillas carnosas", "1 cilantro de racimo pequeño, toscamente picado", "1 limón, descuartizado, para servir"], "method": ["Para las gambas piri-piri, coloque todos los ingredientes, excepto las gambas, en un procesador de alimentos y mezcle hasta que quede suave.", "Coloque las gambas en un plato y frote sobre la salsa piri-piri, reservando un poco para adornar. Dejar macerar en la nevera durante una hora.", "Caliente una sartén hasta que esté caliente y cocine las gambas durante 4-5 minutos en cada lado, dependiendo de su tamaño, hasta que las gambas se hayan puesto rosadas y estén bien cocidas.", "Para el cuscús, coloque el cuscús en un recipiente, vierta sobre el agua hirviendo y revuelva con un tenedor para combinar. Agregue la harissa, la melaza de granada, el baharat y el jugo de limón y revuelva una vez más. Cubra con película adhesiva y déjela a un lado por 3-4 minutos, hasta que todo el líquido haya sido absorbido por el cuscús.", "Retire la película adhesiva y esponje con un tenedor. Agregue la cebolla roja, las semillas de granada carnosas y el cilantro y mezcle bien.", "Para servir, coloque tres gambas en cada plato con una pila de cuscús. Rocíe la salsa piri-piri reservada y un chorrito de limón."], "url": "www_bbc_co_uk_food_recipes_piripiriprawnsandhar_86697", "title": "Langostinos piri piri y cuscús harissa", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "4", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/piripiriprawnsandhar_86697_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50ml / 1¾fl oz de pisco (aguardiente de uva)", "50ml / 1¾fl oz de jugo de limón", "25ml / 1fl oz de jarabe de azúcar", "1 punto de amargo", "½ huevo blanco de corral", "1 cereza, tallo adjunto", "1 rodaja de limón"], "method": ["Coloque todos los ingredientes excepto la rodaja de cereza y limón en una coctelera y agite.", "Colar en un vaso de roca y decorar con una cereza fresca en el tallo y una rodaja de limón."], "url": "www_bbc_co_uk_food_recipes_piscosour_85134", "title": "Pisco sour", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500g / 1lb 2oz guisantes de primavera (petit pois)", "1½ oz de mantequilla o aceite", "½ cebolla mediana picada", "200 g / 7 oz de jamón o panceta, en cubitos pequeños", "sal y pimienta negra recién molida"], "method": ["Derrita la mantequilla en una cacerola y agregue la cebolla picada y el jamón o la panceta.", "saltee durante unos minutos hasta que la cebolla se dore y el jamón esté dorado pero no crujiente.", "Agregue los guisantes, aún congelados, y un poco de agua. Remover.", "Cubra y cocine a fuego lento hasta que los guisantes estén tiernos, aproximadamente 15 minutos. Temporada para probar y servir."], "url": "www_bbc_co_uk_food_recipes_pisellinialprosciutt_10820", "title": "Pisellini al prosciutto (guisantes de primavera con jamón)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["250 g / 9 oz de hojaldre laminado", "25 g / 1oz de mantequilla sin sal", "1 cebolla, finamente rebanada", "6 filetes de anchoas en salazón, huesos extraídos, cortados a la mitad y lavados", "150g / 5½oz de aceitunas negras deshuesadas", "6 cucharadas de aceite de oliva", "1 limón, solo jugo", "2 cucharadas de aceite de oliva", "50 g / 1¾oz de mantequilla sin sal", "1 cañón de cordero, cortado", "1 ramita grande de romero fresco", "2 dientes de ajo, pelados y aplastados", "150ml / 5fl oz puerto", "300ml / 10fl oz de caldo de carne", "2 cucharadas de aceite de oliva", "100g / 3½oz de aceitunas negras, picadas", "1 tomate, picado", "2 cucharadas de perejil fresco, picado", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Para la tarta de pissaladière, corta dos círculos de 10 cm en la masa de hojaldre y colócalos en una bandeja para hornear. Dibuja los círculos con la punta de un cuchillo afilado.", "Calentar la mantequilla en una sartén y freír las cebollas durante 10 minutos hasta que estén crujientes.", "Ponga 6 de las mitades de anchoa y las aceitunas negras en un procesador de alimentos pequeño y mezcle hasta que quede suave. Poco a poco agregue el aceite de oliva y el jugo de limón y sazone con sal y pimienta. Extienda la pasta sobre la masa y cubra con las cebollas fritas. Coloque las anchoas restantes en un patrón entrecruzado sobre la parte superior de cada tarta. Hornee durante 15-20 minutos, o hasta que la masa esté crujiente y dorada. Mantenga caliente hasta que esté listo para servir.", "Para el cordero, reduzca la temperatura del horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Caliente una sartén a prueba de horno y agregue el aceite y la mantequilla. Una vez caliente, agregue el cordero, el romero y el ajo. Freír hasta que el cordero esté coloreado por todos lados. Transfiera al horno durante 6-8 minutos o hasta que esté cocido a su gusto, luego retírelo del horno y déjelo a un lado para que descanse. Mantenga la bandeja para reducir el puerto.", "Para la reducción del puerto, caliente la sartén utilizada para el cordero y agregue el puerto. Cocine hasta que el volumen de líquido se reduzca a la mitad. Agregue el stock y reduzca nuevamente a la mitad. Termine con el aceite de oliva, las aceitunas, los tomates picados y el perejil. Condimentar con sal y pimienta.", "Para servir, esculpe el cordero en rodajas. Coloque una tarta en cada plato de servir y cubra con la reducción de cordero cortado en rodajas."], "url": "www_bbc_co_uk_food_recipes_pissaladire_tart_with_56780", "title": "Tarta de pissaladière con tapenade de anchoas y cañón de cordero asado con romero y ajo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal de 250g / 9oz", "1 cucharadita de sal", "5 g de levadura instantánea", "1 cucharada de miel", "50ml / 2fl oz de aceite de oliva", "125ml / 4fl oz de agua tibia", "2 cucharadas de aceite de oliva", "botón de mantequilla", "1,25 kg / 2 lb cebollas de 12 oz, en rodajas finas", "pocas hojas de tomillo (opcional)", "2 tarros de 100g / 4oz de anchoas", "1 tarro pequeño de aceitunas negras sin hueso, escurridas"], "method": ["Para la masa, ponga la harina en un recipiente y agregue la sal. Agrega la levadura Mezcle la miel con el aceite y el agua, luego vierta esto sobre la harina.", "Mezcle hasta que tenga una masa pegajosa, luego saque la masa y amasar hasta que esté suave y pase la prueba del cristal de la ventana (estire una pieza pequeña hasta que pueda ver a través de ella; el gluten se desarrolla lo suficiente si le permite hacer esto). Vuelve al tazón y cúbrelo con una toalla de té húmeda. Deja doblar de tamaño, al menos una hora.", "Mientras tanto, haz el topping. Caliente el aceite de oliva y la mantequilla en una sartén muy grande. Cuando la mantequilla se haya derretido y esté espumante, agregue las cebollas y las hojas de tomillo (si está usando). Sazonar con sal. Revuelva con cuidado hasta que reduzcan su volumen; parecerá que es demasiado para comenzar con la sartén, pero se colapsarán con bastante rapidez. Continúe cocinando a fuego lento o medio durante al menos 45 minutos a una hora, revolviendo regularmente. Las cebollas se caramelizarán ligeramente sobre la base; raspe con regularidad cuando revuelva.", "Eventualmente tendrás cebollas marrones doradas muy suaves, casi puréadas. En su lugar, puede cubrir la sartén y dejar que las cebollas suden por un período de tiempo similar: se colapsarán de una manera similar pero serán de un color más claro.", "Precalentar el horno a 230C / 210C Fan / Gas 8.", "Voltea la masa y forma para llenar una bandeja grande para hornear - alrededor de 40x20cm / 16x8in. Extiende las cebollas sobre la masa, dejando un borde angosto, luego agrega las anchoas en un patrón de celosía, o más forma libre si lo prefieres (a menudo hago una pequeña cantidad, ya que siempre hay alguien a quien no le gustan las anchoas). Agregue las aceitunas a intervalos. Rocíe con un poco más de aceite de oliva, si lo desea. Hornee en el horno precalentado durante unos 20-25 minutos, o hasta que la masa esté bien cocida.", "Enfriar, cortar en rodajas y servir."], "url": "www_bbc_co_uk_food_recipes_pissaladire_with_olives_81173", "title": "Pissaladière con aceitunas y anchoas", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200ml / 7fl oz de aceite vegetal", "3 huevos de gallinas camperas", "Jarabe de agave 175ml / 6fl oz (también conocido como néctar de agave)", "Zanahorias 400 g / 14 oz, peladas y ralladas", "275g / 9¾oz de harina de auto crianza", "2 cucharaditas de polvo de hornear", "1 cucharadita de canela molida", "1 cucharadita de especias mixtas", "150 g / 5½ oz sultanas", "Piezas de 150g / 5½oz de nueces", "1 naranja, ralladura fina solamente", "400g / 14oz de queso crema con toda su grasa", "50 g / 1¾oz de mantequilla sin sal, ablandada", "50ml / 2fl oz de jarabe de arce", "Piezas de nogal de 25 g / 1 oz, picadas", "canela molida, para quitar el polvo"], "method": ["Precaliente el horno a 180C / 160C Fan / Gas 4. Aceite y línea 2 x 20cm / 8in sandwich.", "Vierta el aceite en un tazón grande para mezclar con los huevos y el jarabe de agave y bata juntos. Agregue las zanahorias y mezcle.", "En un recipiente aparte, colar la harina, el polvo de hornear, la canela y la mezcla de especias juntas. Agregue las pasas sultanas, las nueces y la ralladura de naranja y revuelva para cubrir con la harina.", "Incline la mezcla de harina en la mezcla de zanahoria y mezcle suavemente, hasta que esté bien combinada. Divida la mezcla entre las latas y hornee durante 40 minutos. Cubra con papel de aluminio después de 20-30 minutos para evitar que las partes superiores se quemen.", "Dejar enfriar en las latas durante 5 minutos, luego transferir a una rejilla y dejar enfriar por completo.", "Para el glaseado, coloque el queso crema en una pieza de muselina limpia o un paño de limpieza fino (como un paño J) y exprima cualquier líquido. (Esto elimina la humedad del queso para que el glaseado no esté demasiado húmedo). Coloque el queso crema en un bol y bata hasta que quede suave. Agregue la mantequilla y el jarabe de arce y bata al mismo tiempo. Refrigere hasta que sea necesario.", "Emparede las esponjas junto con la mitad del glaseado. Extienda una capa muy fina de glaseado sobre la parte superior de la torta y espolvoree el glaseado restante en una manga pastelera con una boquilla simple de 1 cm / ½ pulgada. Espolvorea las nueces picadas sobre la parte superior del glaseado.", "Vierte pequeños besos de glaseado alrededor del borde del pastel y espolvoréalos con canela."], "url": "www_bbc_co_uk_food_recipes_sugar-free_carrot_cake_71797", "title": "Pastel de zanahoria con azúcar reducido", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Sirve 8-10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/sugar-free_carrot_cake_71797_16x9.jpg", "isVegetarian": true, "recommendations": 0}]