[{"isVegetarian": false, "title": "Spicy chicken kebabs", "url": "www_bbc_co_uk_food_recipes_chickenbreastmarinat_83749", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickenbreastmarinat_83749_16x9.jpg", "ingredients": ["3 tbsp low-fat natural yoghurt", "1 tsp garam masala or curry powder", "1 tsp chilli powder", "2 tsp lime or lemon juice", "2 tsp fresh chopped coriander, optional", "1 fresh red chilli, finely chopped (optional)", "4 x 150g/5½ chicken breasts, cubed", "green salad", "pitta bread"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Mix together the yoghurt, garam masala, chilli powder, lime juice, coriander and red chilli. ", "Marinate the chicken in the yoghurt mixture for 5 minutes.", "Preheat the barbecue to hot. Alternatively you can cook the chicken under a hot grill.", "Thread the chicken onto the kebab skewers and cook on the barbecue until the chicken is tender and cooked all the way through.", "Serve with salad and pitta bread."]}, {"isVegetarian": false, "title": "Chicken breasts, muscat wine and black pudding served with steamed spinach", "url": "www_bbc_co_uk_food_recipes_chickenbreastsmuscat_71186", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["900ml/1½ pints chicken stock ", "4 boneless chicken breasts", "40g/1½oz butter", "1 x 225g/8-9oz black pudding", "175ml/6fl oz sweet Muscat wine, such as Muscat Beaumes de Venise", "1½ tsp lemon juice", "1½ tsp copped tarragon leaves", "salt ", "freshly ground black pepper", "900g/2lb fresh spinach, large stems removed", "25g/1oz butter", "freshly grated nutmeg", "salt", "freshly ground black pepper"], "serves": "4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Put the stock into a wide-based pan and boil it vigorously until it has reduced to 175ml/6fl oz.", "Season the chicken breasts on both sides with salt and pepper.", "Heat a small knob of the butter in a large frying pan and, when it is foaming, add the chicken breasts, skin-side down, and cook over a medium heat for six minutes until the skin is crisp and richly golden. Turn the chicken breasts over and continue to cook them for 6-7 minutes until cooked through.", "Thinly slice the black pudding into 16 or so slices. Remove the chicken from the pan and keep warm. Add the slices of black pudding to the pan and fry them for one minute on each side. Set them aside with the chicken.", "Add the sweet wine to the pan and boil, scraping up all the browned bits from the bottom of the pan with a wooden spoon, until reduced to about three tablespoons. Add the reduced chicken stock and boil for 1-2 minutes. Whisk in the rest of the butter a small piece at a time, then add the lemon juice and some seasoning to taste.", "Drop the spinach, a large handful at a time, into a large hot pan, adding another as each one wilts down. When all the spinach has been added, cook for one minute, tip into a colander and lightly press out the excess liquid. ", "Melt the butter in the pan, add the spinach, and season with freshly grated nutmeg and some salt and pepper. Toss briefly over a high heat to combine.", "To serve, slice the chicken breasts diagonally and at a slight angle and arrange the slices in the centre of each warmed plate with the black pudding. ", "Stir the tarragon leaves into the sauce and spoon some of it over the chicken and a little around the outside edge of the plates. Serve with the steamed spinach."]}, {"isVegetarian": false, "title": "Chicken breasts stuffed with sage and mustard", "url": "www_bbc_co_uk_food_recipes_chickenbreastsstuffe_90199", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickenbreastsstuffe_90199_16x9.jpg", "ingredients": ["12 fresh sage leaves", "100g/3½oz butter, softened", "4 tsp wholegrain mustard", "salt and freshly ground black pepper", "4 chicken breasts", "8 slices prosciutto", "1 tsp olive oil", "125ml/4½fl oz white wine", "1 garlic clove", "1 fresh sage leaf", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 170C/340F/Gas 3.", "For the sage butter, chop the sage leaves finely.", "Place the butter in a bowl, add the chopped sage leaves and mustard, and season, to taste, with salt and freshly ground black pepper. Mix together well.", "For the chicken, using a sharp knife, slice into the side of each chicken breast to form a pocket.", "Spoon a quarter of the butter mixture into each pocket and fold to enclose. If you have any of the flavoured butter left over you can roll it into a sausage shape, freeze and use (within a month) in another dish.", "Place two prosciutto slices on a clean board so that they overlap slightly. Wrap one of the chicken breasts in the slices and roll to enclose. Repeat with the remaining prosciutto slices and chicken breasts.", "Heat the olive oil in a heavy-bottomed frying pan. When hot, add the wrapped chicken breasts.", "Cook over a medium heat until the prosciutto is lightly golden, about two minutes.", "Turn the breasts over and brown the other side for another two minutes.", "Using tongs or a fish slice, place the chicken breasts onto a baking tray and place into the preheated oven. Retain the cooking juices in the pan, as these will be used to make the sauce.", "Cook the chicken breasts for 20 minutes, or until the chicken is completely cooked through (the chicken will feel firm to the touch and the juices will run clear when the chicken is pierced with a skewer in the thickest part).", "When the chicken is cooked, remove from the oven and put the breasts to one side to rest for ten minutes. Keep warm.", "While the chicken is resting, make the sauce. Heat the retained cooking juices in the pan the chicken breasts were cooked in and add the white wine. Crush the garlic clove and add to the pan. Add a sage leaf.", "Turn up the heat and cook, scraping up the brown bits from the bottom of the pan. Cook for a couple minutes until the sauce is reduced. Season, to taste, with salt and freshly ground black pepper.", "To serve, slice each breast into five slices on the diagonal, then pour the mustardy, buttery sauce over. Serve with mashed potato."]}, {"isVegetarian": false, "title": "Chicken breast stuffed with Cumberland sausagemeat, sun-dried tomato and basil", "url": "www_bbc_co_uk_food_recipes_chickenbreaststuffed_87822", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 plump free-range chicken breasts", "175g/6oz Cumberland sausagemeat ", "2 basil leaves, torn in half", "2 sun-dried tomatoes, cut into halves", "1 tbsp olive oil ", "½ lemon, juice only", "salt and freshly ground black pepper ", "150g/5oz Cumbrian air-dried ham (use Parma ham if none is available)", "simple green salad, to serve", "500g/1lb 1½oz potatoes, grated", "½ onion, grated", "salt and freshly ground black pepper ", "50g/1¾oz butter"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Use a sharp knife to cut a pocket into the side of each chicken breast. ", "Stuff a quarter of the sausagemeat into each chicken pocket and press a piece of basil and tomato into each breast.", "Drizzle a little olive oil, lemon juice and salt and freshly ground black pepper, to taste, over the chicken breasts and wrap each breast in the air-dried ham to form a neat roll. Wrap each bundle in aluminium foil, sealing each foil parcel.", "Bake in the pre-heated oven for about 30 minutes - to check the chicken is cooked, carefully unwrap the parcels and pierce the chicken with a metal skewer, if the juices run clear the meat is cooked all the way through. Rest the meat, still covered, for at least five minutes before serving.", "Meanwhile, make the rösti. Place the grated potato and onion in a large bowl and season well with salt and freshly ground black pepper. Tip the mixture into a tea towel and squeeze out the excess moisture with your hands.", "Divide the mixture into four equal-sized patties.", "Lightly grease four chefs' rings with butter and melt the remaining butter in a large frying pan. Divide the rösti mixture between the chefs' rings and fry over a medium heat for about ten minutes until golden-brown on one side. Remove the chefs' rings, turn over and cook until both sides are golden-brown on both sides.", "Serve each chicken parcel with a rösti and pour over any juices from the foil bundle. Serve with a simple green salad on the side."]}, {"isVegetarian": false, "title": "Chicken breasts with fennel", "url": "www_bbc_co_uk_food_recipes_chickenbreastswithfe_65543", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 boneless chicken breasts ", "2 fennel bulbs ", "2 large carrots, peeled ", "2 tbsp olive oil ", "30g/1oz butter ", "2 tbsp fresh fennel seeds ", "salt and freshly ground black pepper ", "2 tbsp clear honey ", "2 lemons, juice only ", "4 tbsp olive oil ", "pinch salt", "pinch cayenne pepper"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Mix all the marinade ingredients in a wide, shallow bowl, adding a little salt. Add the chicken breasts and turn them to coat thoroughly. Cover with cling film and leave for 1 hour, turning them halfway. ", "Cut the fennel lengthways into 5mm/¼in thick slices. Blanch in salted boiling water for 5 minutes, refresh and drain. ", "Cut the carrots into 5mm/¼in diagonal slices. Do not cook the vegetables together. Score the surface, then blanch for 3 minutes, refresh and drain. Lightly brush the fennel and carrots with olive oil. ", "Heat a griddle pan until smoking hot. Add the fennel first, then the carrots and griddle for 5-10 minutes, giving them a quarter-turn to mark attractively. Turn them over and repeat on the other side. Season, place on a plate and keep hot. ", "Put the chicken breasts in the hot griddle pan, skin side down. Once they are marked with lines, quarter-turn to make a lattice pattern. Turn them over, lower the heat and give them a quarter-turn as before. Cook for 12-15 minutes in total, depending on thickness. ", "Arrange the fennel slices on plates and top with the chicken. Place the carrots alongside. Put a knob of butter on each chicken breast and top with fennel seeds."]}, {"isVegetarian": false, "title": "Chicken breasts with lemon and saffron", "url": "www_bbc_co_uk_food_recipes_chickenbreastswithle_86699", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 chicken breasts, skins left on", "salt and freshly ground black pepper", "3 tbsp extra virgin olive oil", "1 lemon, zest only", "3 lemons, juice only", "175ml/6fl oz white wine", "2 tbsp white wine vinegar", "1 small red chilli, finely chopped", "2 fresh bay leaves, torn", "120ml/4fl oz extra virgin olive oil", "4 large shallots, cut into quarters", "2 carrots, cut into matchsticks", "150g/5oz fresh peas ", "pinch saffron strands, soaked in 5 tbsp warm water", "1 lemon, zest only, to garnish"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the chicken, season the chicken breasts with salt and freshly ground black pepper. ", "Place in a dish together with the rest of the marinade ingredients. Mix together well, then cover and place in the fridge to marinate for two hours, turning the chicken breasts over from time to time.", "To cook the chicken, preheat the oven to 180C/365F/Gas 4.", "Heat a large ovenproof frying pan until hot, then add 90ml/3fl oz of the extra virgin oil, the shallots, carrots and peas and gently fry over a low heat until the vegetables are just softened.", "Remove the vegetables from the pan with a slotted spoon and set aside. ", "Add the remaining 30ml/1fl oz of olive oil to the pan and heat.", "Remove the chicken from the marinade and pat dry. Add the chicken breasts to the pan and fry for 2-3 minutes on both sides, until golden-brown all over. ", "Remove from the heat and add the vegetables, then, using a sieve, strain the marinade over the chicken. Discard the solid marinade ingredients.", "Transfer to the oven and cook for one hour, or until the chicken is cooked through and the sauce has reduced by half.", "About 15 minutes before the end of cooking time, pour in the saffron and its soaking liquid.", "To serve, remove the chicken from the oven and place onto plates. Place spoonfuls of vegetables alongside and spoon the sauce over. Garnish with freshly grated lemon zest sprinkled over the top."]}, {"isVegetarian": false, "title": "Chicken and pea risotto", "url": "www_bbc_co_uk_food_recipes_chickenbreastwithpea_87568", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickenbreastwithpea_87568_16x9.jpg", "ingredients": ["olive oil, for frying", "2 onions, sliced", "400g/14oz arborio risotto rice", "splash white wine", "1 litre/1¾ pint hot vegetable stock", "salt and freshly ground black pepper", "200g/7oz fresh peas, blanched", "200g/7oz asparagus, blanched ", "400g/14oz baby spinach", "1 tbsp chopped fresh basil", "75ml/2½fl oz double cream", "oil, for frying", "salt and freshly ground black pepper", "4 chicken breasts, skin on", "chicken or vegetable stock, to cover", "parmesan shavings, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. ", "For the risotto, heat the oil in a pan and fry the onion until soft. Add the rice and stir well, then add the wine and simmer until reduced completely. Add a good ladleful of the hot stock and stir continuously. When all this has been absorbed, add more stock. Continue adding more stock, stirring continuously, until the rice is cooked.", "Season with salt and freshly ground black pepper and stir in the peas, asparagus, spinach, basil and cream", "For the chicken, season the chicken breasts well with salt and freshly ground black pepper. Heat the oil in a frying pan and place the chicken breasts skin-side down. Fry the chicken breasts on both sides until lightly browned. ", "Place the chicken breasts in an ovenproof dish and pour in enough stock to come one third of the way up the sides of the chicken breasts. Place in the oven for 15 minutes, or until completely cooked through.", "To serve, place the risotto into serving bowls. Slice the chicken and place on top of the risotto, then sprinkle with parmesan shavings."]}, {"isVegetarian": false, "title": "Chicken, Brie and rocket quesadilla with red pepper dressing", "url": "www_bbc_co_uk_food_recipes_chickenbrieandrocket_85651", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 ready-made tortilla wraps", "125g/4½oz Brie, sliced", "handful rocket", "1 tbsp olive oil", "salt and freshly ground black pepper", "2 chicken fillets, chopped", "140g/5oz roasted red peppers (from a jar), drained", "2 tbsp olive oil"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Place one tortilla wrap into an ovenproof frying pan and top with the Brie, rocket, olive oil, seasoning and chicken. ", "Place the other tortilla wrap on top and cook in the frying pan for three minutes on each side. ", "Place in the oven and cook for five minutes or until the chicken is completely cooked through. ", "Cut the quesadilla into wedges.", "For the red pepper dressing, place the roasted red peppers (reserving one) into a blender with the olive oil and a little juice from the jar and blend until almost smooth. ", "Chop the reserved roasted red pepper and stir into the mix.", "Serve the tortilla wedges piled onto a plate with the red pepper sauce over the top."]}, {"isVegetarian": false, "title": "Chicken with cheese, prosciutto and roasted courgettes", "url": "www_bbc_co_uk_food_recipes_chickenbreastwithros_83819", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickenbreastwithros_83819_16x9.jpg", "ingredients": ["1 skinless chicken breast, cut in half lengthways ", "2 slices fontina cheese, the same length as the chicken breast ", "2 slices prosciutto ham, the same length as the chicken breast ", "2 sprigs fresh rosemary, same length as the chicken breast", "plain flour, for dusting ", "10g/½oz butter ", "2 tbsp olive oil ", "salt and freshly ground black pepper ", "¼ glass white wine ", "3 tbsp extra virgin olive oil ", "2 courgettes, cut into rounds ", "2 tomatoes, sliced  ", "2 sprigs fresh marjoram, leaves picked", "2 tbsp grated parmesan  ", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat oven to 230C/445F/Gas 8.", "For the chicken, remove the needles from the rosemary and chop finely. Take the bare woody rosemary stem and sharpen the thickest point to create a skewer.", "Flatten the chicken halves slightly with a meat mallet or rolling pin, then season with salt and freshly ground black pepper and sprinkle with the chopped rosemary needles. ", "Place one slice of fontina on top of each chicken piece, followed by the prosciutto.", "Secure the stack with the rosemary branch as you would with a skewer or wooden toothpick.", "For the courgettes drizzle one tablespoon of the olive oil into a small ovenproof dish.", "Arrange alternate slices of tomato and courgette overlapping each other in the dish and season with salt and freshly ground black pepper.", "Drizzle with another one tablespoon olive oil, sprinkle with the marjoram leaves and top with parmesan.  ", "Place into the oven to bake for 4-5 minutes, until the cheese begins to melt and turn golden.", "Meanwhile, dredge the bare side of the chicken with plain flour and shake off any excess.", "Heat the butter and olive oil in a frying pan over a medium heat. When the butter is foaming add the chicken, flesh-side down first and cook on a medium heat for about two minutes, or until golden-brown, then turn the breast over and cook for one minute on the prosciutto side, until golden. ", "Turn the chicken breast over again and add the wine to the pan. Heat to boil and reduce the liquid until almost entirely evaporated. Check the chicken breast is completely cooked through, then remove the chicken and place on a plate to rest. ", "Add a small knob of butter to the pan and melt to thicken the sauce.", "Remove the courgettes and tomatoes from the oven and drizzle with the remaining tablespoon of the olive oil before serving.", "Pour the sauce over the rested chicken and serve immediately with baked courgette and tomato.  "]}, {"isVegetarian": false, "title": "Chicken and wild mushroom pie", "url": "www_bbc_co_uk_food_recipes_chickenandwildmushro_89626", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb plain flour, plus extra for dusting", "2 tsp baking powder", "½ tsp salt", "120g/4½oz unsalted butter, plus extra for greasing", "1 free-range egg yolk", "120ml/4fl oz water", "4 tbsp olive oil", "2 chicken breasts, bone and skin removed, flesh cut into pieces ", "500g/1lb 2oz chicken thighs, bone and skin removed, flesh cut into pieces", "100ml/3½fl oz dry white wine ", "100ml/3½fl oz water", "2 tsp chopped fresh tarragon", "2 tsp chopped fresh thyme", "salt and frehly ground black pepper", "200g/7oz fresh wild mushrooms, roughly chopped", "50ml/2fl oz soured cream", "1 free-range egg, beaten"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the pastry, pulse the flour, baking powder, salt, butter and egg yolk in a food processor until the mixture resembles breadcrumbs. ", "Gradually add the water, a tablespoon at a time, mixing continuously until the mixture just comes together as a dough. (You may not need to use all the water.) Roll the dough into a ball, then wrap it in cling film and chill in the fridge for an hour. ", "Meanwhile, for the filling, heat two tablespoons of the olive oil in a saucepan over a medium heat, add the chicken pieces and cook for 4-5 minutes, or until browned. Add the wine, water, tarragon and thyme, and season, to taste, with salt and freshly ground black pepper. Bring the mixture to the boil, reduce the heat, and simmer for 15-20 minutes, or until the volume of liquid has reduced by half and the chicken is cooked through. ", "Heat the remaining olive oil in a separate frying pan over a medium heat, add the mushrooms, and cook for 4-5 minutes, or until golden-brown, then season, to taste, with salt and freshly ground black pepper. ", "Remove the cooked chicken from the frying pan with a slotted spoon and place into a bowl, then add two spoonfuls of the residual juices from that pan. Add the mushrooms, then stir in the soured cream until well combined. Set aside to cool.", "Preheat the oven to 180C/350F/Gas 4. Grease a deep 20cm/8in pie tin with butter. Add a small amount of flour, then turn the tin to coat the base and sides, shaking out any excess.", "When the pastry has chilled, roll out two thirds of it onto a clean, floured work surface, until it is almost twice as wide as the diameter of the tin. Using the rolling pin, lift the pastry and lay it over the pie tin to line the base and sides. Gently press the pastry into the corners of the tin, trimming off any excess, then prick the base of the pastry case several times with a fork. ", "Cover the pastry with a sheet of greaseproof paper and fill it with rice or dried beans. Bake in the oven for 10-15 minutes, or until the pastry is pale golden-brown. Remove from the oven, discard the beans and greaseproof paper and set the pastry aside to cool. When cool, pour the pie filling into the pastry case.", "Roll the remaining one third of the pastry out onto a clean, floured work surface until it is a little bit larger than the diameter of the pie tin. Brush the rim of the cooked pastry case with some of the beaten egg and place the pastry lid on top of the pie. Trim off any excess pastry. Seal the pastry lid to the pastry case by crimping the edges of the pastry lid with a fork.", "With a knife, make two small holes in the centre of the pastry lid to allow steam to escape. Brush the pastry lid with the remaining beaten egg, then transfer to the oven and bake for 30-35 minutes, or until golden-brown."]}, {"isVegetarian": false, "title": "Chicken broth", "url": "www_bbc_co_uk_food_recipes_chickenbroth_92566", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "½ onion, chopped", "500ml/18fl oz chicken stock", "100g/3½oz basmati rice", "½ carrot, peeled and chopped", "½ courgette, chopped", "1 tbsp olive oil", "1 chicken thigh", "salt and freshly ground black pepper", "1 tbsp chopped fresh chives"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the broth, heat the oil in a pan over a medium heat and gently fry the onion for 3-4 minutes. Add the remaining ingredients and bring the mixture to the boil, then reduce the heat until the mixture is simmering and simmer for 10-12 minutes or until the rice is tender.", "Meanwhile, for the chicken, heat the oil in an ovenproof pan over a medium heat. Season the chicken with salt and freshly ground black pepper and fry for 2-3 minutes, until golden-brown on all sides. Transfer to the oven and roast for 12-15 minutes or until the chicken is cooked through. (The chicken is cooked through when the juices run clear when pierced in the thickest part with a skewer.)", "To serve, slice the chicken thigh meat. Spoon the broth into a bowl and top with the chicken thigh slices. Garnish with the chopped chives.."]}, {"isVegetarian": false, "title": "Chicken cacciatora", "url": "www_bbc_co_uk_food_recipes_chickencacciatora_89886", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75g/2¾oz plain flour", "salt and freshly ground black pepper", "1 x 1.5kg/3lb 5oz chicken, jointed into 8 pieces", "2 tbsp vegetable oil", "2 onions, sliced", "2 garlic cloves, chopped", "30g/1oz tomato purée", "800g/1lb 12oz ripe tomatoes, chopped", "2 sprigs fresh rosemary ", "1 bay leaf", "100ml/3½fl oz white wine", "150ml/5fl oz chicken stock", "1 tbsp red wine vinegar", "handful fresh parsley leaves", "roast potatoes"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Season the flour with salt and freshly ground black pepper, then dredge the chicken pieces in it.", "Heat the oil in a casserole dish over a medium heat, then fry the chicken for 2-3 minutes on each side, until brown on all sides. Remove and set aside.", "In the same casserole, fry the onion and garlic for 8-10 minutes over a low heat, until softened.", "Add the tomato purée and cook for five minutes.", "Add the tomatoes, rosemary, bay leaf, wine, stock and vinegar and bring to the boil. Reduce the heat and simmer for 20 minutes.", "Return the chicken pieces to the casserole and cover with a lid. Simmer over a low heat for 30-40 minutes, or until the chicken is tender. ", "To serve, remove the lid and sprinkle with parsley leaves. Spoon out onto plates and serve with roast potatoes."]}, {"isVegetarian": false, "title": "Chicken Caesar salad", "url": "www_bbc_co_uk_food_recipes_chickencaesarsalad_84099", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickencaesarsalad_84099_16x9.jpg", "ingredients": ["4 slices of speck (or prosciutto)", "2 cornfed chicken breasts, bone and skin removed", "knob of butter", "2 thick slices white bread, cubed", "2 cos lettuces", "2 garlic cloves", "75ml/3fl oz white wine", "2 eggs, yolks only", "1 anchovy fillet", "75g/3oz parmesan cheese, grated", "150ml/5fl oz extra virgin olive oil", "2 tsp Dijon mustard", "salt and pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to high.", "Place the speck or proscuitto onto a baking sheet and place under the grill for 3-4 minutes, or until crisp. Remove speck and place on a plate lined with kitchen paper to drain.", "Cut both chicken breasts through the middle, without cutting through, to form one large flat piece. Season, to taste, with salt and black pepper and brush with olive oil. ", "Heat a griddle pan until hot then place the chicken breasts on it and cook for 2-3 minutes on each side, or until just cooked through.", "Heat a frying pan until hot and add the butter and then the cubed bread. Fry until golden brown, then remove.", "Separate the leaves from the lettuce and cut into chunky pieces. ", "For the dressing, in a medium saucepan, bring the garlic and wine to a boil and simmer for about 5 minutes, until the garlic has softened. Leave to cool.  ", "Combine the wine and garlic with the egg yolks, anchovy and cheese in a mixing bowl. Blend with a hand blender or food processor until smooth.  Drizzle in the oil in a thin steady stream, taking care not to add it too quickly, otherwise it could split and curdle. Stir in the mustard and add seasoning to taste. ", "Add the crisp-fried speck, croutons and lettuce to the dressing and toss to combine. To serve, place salad on plate, top with chicken and pour the dressing over."]}, {"isVegetarian": false, "title": "Chicken carbonara", "url": "www_bbc_co_uk_food_recipes_chickencarbonara_90044", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickencarbonara_90044_16x9.jpg", "ingredients": ["1 tbsp olive oil", "50g/2oz pancetta cubes, or smoked streaky bacon, chopped finely", "125g/4½oz chicken breast, cut into strips", "200g/7oz dried spaghetti", "2 free-range eggs, beaten", "2 free-range egg yolks, beaten ", "75ml/2¾fl oz double cream", "75g/2¾oz Parmesan, grated, plus extra to serve", "freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a pan over a medium heat. Add the pancetta and fry until crisp and golden-brown. Remove from the pan with a slotted spoon and set aside.", "Add the chicken to the same pan and fry for 4-5 minutes, or until completely cooked through.", "Bring a large pan of salted water to the boil and cook the spaghetti according to packet instructions. Drain, reserving a little of the cooking water.", "Put the beaten eggs in a large bowl. Add the spaghetti to the eggs and a little of the reserved cooking water and mix well. Add the  cream, Parmesan, cooked chicken and cooked pancetta cubes and stir to combine. ", "To serve, divide the pasta and sauce between two bowls. Top with extra Parmesan and freshly ground black pepper."]}, {"isVegetarian": false, "title": "Chicken casserole", "url": "www_bbc_co_uk_food_recipes_chickencasserole_85719", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickencasserole_85719_16x9.jpg", "ingredients": ["4 chicken breasts, or 600g/1lb 5oz cooked leftover roast chicken", "2 onions, 1 roughly chopped, 1 thinly sliced", "1 carrot, roughly chopped", "1 celery stalk, roughly chopped", "6 whole peppercorns", "1 fresh bay leaf", "water, to cover", "55g/2oz butter", "30g/1oz plain flour", "salt and freshly ground black pepper", "1 small head broccoli, cut into florets and blanched", "1 x 225g/8oz tin water chestnuts, drained", "1 free-range egg yolk, lightly beaten", "2-3 tbsp double cream", "squeeze lemon juice", "1 tbsp chopped fresh parsley, to serve", "boiled baby carrots, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Place the chicken breasts, roughly chopped onion, carrot, celery, peppercorns and bay leaf into a large pan and add enough water to cover the ingredients.", "Bring the mixture slowly to the boil, then reduce the heat and simmer for 25-30 minutes, or until the chicken is completely cooked through. ", "Remove the chicken from the pan and set aside. Keep warm. Strain the cooking liquid and reserve 450ml/16fl oz of it. Set aside.", "Heat half of the butter in a large separate pan and add the flour. Stir over a low heat until the mixture forms a smooth paste that leaves the sides and base of the pan cleanly. Gradually add the reserved cooking liquid, stirring well after each addition, to make a sauce. Season, to taste, with salt and freshly ground black pepper. ", "Add the broccoli and water chestnuts to the sauce.", "In a bowl, mix the egg yolk with the cream and slowly add this mixture to the sauce. Add a squeeze of lemon juice and stir to combine. ", "Cut the cooked chicken into bite-sized pieces and return to the sauce. Stir well.", "In a separate pan, heat the remaining butter and fry the remaining thinly sliced onion until soft and golden-brown.", "To serve, sprinkle the onion over the casserole, garnish with parsley and serve with the boiled baby carrots."]}, {"isVegetarian": false, "title": "Chicken casserole with pilaff and green salad", "url": "www_bbc_co_uk_food_recipes_chickencasserolewith_88573", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 large chicken, about 2.5kg/5½lb, giblets removed", "1 carrot, peeled and halved", "1 onion, peeled and halved", "6 black peppercorns", "large sprig fresh parsley", "large sprig fresh thyme", "750ml/1¼ pints chicken stock", "250ml/8fl oz white wine", "salt and freshly ground black pepper ", "250ml/8fl oz single cream", "50g/2oz butter", "50g/2oz plain flour", "25g/1oz butter", "1 small onion, chopped", "300g/11oz basmati rice", "750ml/1¼ pints vegetable or chicken stock", "salt and freshly ground black pepper ", "selection of edible leaves and herbs and edible flowers, such as wild garlic, nasturtium, edible chrysanthemum and chives", "3 tbsp extra virgin olive oil", "1 tbsp white wine vinegar", "1 tsp wholegrain mustard", "1 tsp clear honey", "1 large garlic clove, finely chopped", "sprig fresh parsley", "few fresh chives, chopped", "salt and freshly ground black pepper"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 160C/325F/Gas 3.  ", "For the chicken casserole, place the chicken into a large ovenproof pan or casserole. Add the carrot, onion, peppercorns, herbs, stock and white wine and bring to the boil. Season, to taste, with salt and freshly ground black pepper.", "Cover with a lid and place into the oven to cook for 1½-2 hours, or until the chicken is completely cooked. You can test if the chicken is ready by gently pulling the leg away from the carcass - it should come away easily and the juices should run clear when pierced with a skewer or sharp knife. (For a larger chicken, cook for 20 minutes per 450g/1lb, plus 30 minutes extra.)", "Remove the chicken from the stock (reserving the stock) and place it onto a large plate. Remove all the meat from the carcass, discarding the skin and bones.", "Cut the chicken meat into strips approximately 1cm/½in wide and 5cm/2in long. Cover and keep warm.", "Strain the stock into a clean pan and discard the vegetables, peppercorns and herbs. Add the cream to the pan, bring up to the boil and boil, uncovered, for a few minutes. If the flavour is a little weak, boil for longer until reduced slightly. Season, to taste, with salt and freshly ground black pepper.", "Meanwhile, heat a saucepan over a medium heat and place the butter into the pan. When the butter has melted, add the flour, stirring continuously. Cook over a low heat for two minutes to form a roux.", "While the cream sauce is still boiling, gradually whisk in the roux - you need enough to thicken it so that it just coats the back of a spoon.", "Place the chicken and any juices back into the pan and season, to taste, with salt and freshly ground black pepper.", "Meanwhile, for the pilaff, heat the butter in a saucepan large enough to contain all of the rice. Add the chopped onion, put on the lid and cook over a low heat for about ten minutes, until the onion is soft.", "Add the rice and stir for about two minutes.", "Add the stock and season, to taste, with salt and freshly ground black pepper. Bring to the boil, then turn the heat right down and simmer gently for about ten minutes, or until the rice is just cooked and all the liquid is absorbed.", "For the salad, wash and dry the leaves and flowers and then tear them into bite-sized pieces. Place into a salad bowl.", "Place all of the remaining ingredients into a lidded jar, seal and shake to mix.", "Drizzle the dressing sparingly over the salad and stir to coat the leaves.", "To serve, pile the rice and salad onto serving plates and spoon the chicken casserole over the rice."]}, {"isVegetarian": false, "title": "Chicken cassoulet", "url": "www_bbc_co_uk_food_recipes_chickencassoulet_83807", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz dried white haricot beans", "1 onion, peeled", "1 large carrot", "250g/9oz piece of unsmoked bacon in the piece, with its fat and skin", "2-3 bay leaves", "a ham bone", "2-3 garlic cloves", "8-10 whole, black peppercorns", "2 tbsp duck fat, plus 1 tbsp for drizzling", "500g/1lb 2oz boned pork shoulder or leg, cubed", "4 Toulouse sausages", "4 chicken breasts, sliced ", "6 thick slices corned beef", "2 onions, thickly sliced", "4 fat garlic cloves, chopped", "3 large tomatoes, peeled and chopped", "4 bay leaves", "4 pieces duck confit, preferably legs", "80g white breadcrumbs"], "serves": "6-8", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Place the beans in a deep bowl and cover them with plenty of cold water. Leave overnight to plump up. ", "The next day, drain the beans and put them in a large saucepan. Add the onion, carrot and bacon to the pan. Tuck in the bay leaves, the ham bone and the garlic.", "Cover completely with water and bring to the boil. Skim any froth that appears on the surface and discard it. Turn the heat down to a simmer, cover then leave for an hour until the beans are almost tender.", "Meanwhile, melt the duck fat in a second large lidded saucepan over a moderately high heat.", "Add the cubed pork and fry it until its edges are golden. Remove with a slotted spoon and set aside. ", "Cut the sausages in half to give eight short pieces, then brown them in the fat as you did the pork and remove. ", "Cook the sliced chicken in the same way and remove with a slotted spoon, before doing the same with the corned beef.", "Cook the sliced onions in the duck fat for a few minutes until softenened, but not coloured. Add the garlic and tomatoes to the pan, along with the bay leaves. ", "Return the meats to the pan and cover with water. Bring to the boil, then simmer for about 45 minutes covered with a lid, until the liquid comes to a stew consistency.", "Preheat the oven to 160C/325F/Gas 3.", "Drain the beans, reserving the cooking liquor and bacon. Discard the carrot and onion.", "Cut the pork and its rind into thick strips. Chop the bacon that was cooked with the beans. Lay the meat in the bottom of a deep earthenware or enamelled cast iron casserole and cover with some of the beans. ", "Add a layer of the meat and onions, then another of beans. Tuck the pieces of duck in among the beans, then add more beans and meat until all is used up. Top up with any liquid from the meat and a splash of the cooking liquor from the beans. ", "Top with half of the breadcrumbs and transfer to the oven; cook for an hour. ", "Stir the cooked breadcrumbs into the cassoulet and top with the remaining crumbs. Drizzle a little of the bean liquor and a little more melted duck fat over the crumbs and return to the oven for a further half an hour or so, until the crust is golden."]}, {"isVegetarian": false, "title": "Chicken chasseur", "url": "www_bbc_co_uk_food_recipes_chickenchasseurwithc_89917", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1.5kg/3lb 5oz chicken, cut into 8 pieces", "salt and freshly ground black pepper", "50g/2oz plain flour", "2 tbsp olive oil", "110g/4oz butter", "175g/6oz button mushrooms", "150g/5oz shallots, thickly sliced", "40g/1½oz caster sugar", "175ml/6fl oz white wine", "350ml/12fl oz chicken stock", "3 tbsp tomato purée", "small handful fresh tarragon, half left as sprigs, half finely chopped", "2 tomatoes, peeled, seeds removed, chopped", "2 tbsp fresh flatleaf parsley, finely chopped", "1kg/2lb 2oz floury potatoes (such as King Edwards or Desiree), peeled, cut into chunks", "110g/4oz butter", "110ml/4fl oz full fat milk", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Season the chicken pieces with salt and freshly ground black pepper, then dredge in the flour to coat.", "Heat a large, deep frying pan over a medium heat. Add the oil, and a third of the butter and heat until the butter is foaming. ", "Add the chicken pieces and fry skin-side down for 1-2 minutes until golden-brown, then turn the chicken and fry on the other side for another 1-2 minutes.", "Meanwhile, heat a separate frying pan over a medium heat and add another third of the butter. When the butter is foaming add the button mushrooms and fry, stirring occasionally, until golden-brown all over.", "Add the mushrooms to the chicken pan.", "To the pan used to fry the mushrooms, add the remaining third of the butter, the shallots and the caster sugar and fry for 2-3 minutes until the shallots are golden-brown and caramelised.", "Add the wine and bring to the boil, scraping the base of the pan with a wooden spoon to dislodge any brown bits.", "Pour the shallots and wine mixture over the chicken, then add the stock, tomato purée and whole tarragon sprigs. Bring to the boil, then reduce the heat to simmer for 45 minutes to one hour, or until the chicken is completely cooked through and the sauce has reduced slightly.", "Add the tomatoes, flatleaf parsley and the chopped tarragon and season, to taste, with salt and freshly ground black pepper. Simmer for a further two minutes.", "Meanwhile, for the mashed potatoes, place the potatoes into a pan of salted water and bring to the boil. Reduce the heat and simmer for 12-15 minutes, or until the potatoes are tender.", "Drain the potatoes and return to the pan. Place over a low heat for one minute to drive off any excess moisture.", "Mash the potatoes well, then add the butter and milk, beating well to form a smooth mash. Season, to taste, with salt and freshly ground black pepper.", "To serve, place two pieces of chicken onto each plate. Drizzle the sauce over each and place a dollop of mashed potatoes alongside."]}, {"isVegetarian": false, "title": "Chicken chow mein", "url": "www_bbc_co_uk_food_recipes_chickenchowmein_89258", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickenchowmein_89258_16x9.jpg", "ingredients": ["150g/5oz dried yellow shi wheat flour noodles, or medium egg noodles", "dash toasted sesame oil ", "300g/11oz skinless chicken breast fillets, sliced into strips", "2 tbsp light soy sauce ", "1 tsp five-spice powder ", "1 tsp chilli sauce (optional)", "1 tbsp cornflour ", "1-2 tbsp groundnut oil ", "1 red pepper, seeds removed and finely sliced ", "150g/5oz bean sprouts", "1 spring onion, sliced lengthways", "freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the noodles in a pan of boiling water for 2-3 minutes until al dente, or according to packet instructions. Drain, then rinse under cold running water and drain again. Drizzle with a dash of sesame oil and toss through to prevent the noodles from sticking to each other. ", "Put the chicken strips in a bowl and season with a dash of light soy sauce, the five-spice powder and chilli sauce, if using. Mix well, then lightly dust the chicken strips with the cornflour.", "Heat a wok until smoking and add the groundnut oil, then add the chicken and stir fry for 3-4 minutes, or until the chicken is golden-brown and cooked through. ", "Add the red pepper and stir fry for 1 minute, then add the bean sprouts and spring onion and stir fry for 30 seconds. Stir in the cooked noodles and season with the soy sauce, a dash of sesame oil and freshly ground black pepper.", "Pile the noodles onto a serving plate and serve immediately."]}, {"isVegetarian": false, "title": "Chicken curry for one", "url": "www_bbc_co_uk_food_recipes_chickencurry_82610", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickencurry_82610_16x9.jpg", "ingredients": ["1 tbsp olive oil", "½ onion, diced", "100g/3½oz boneless chicken thighs, diced", "1 tsp curry powder", "pinch of chilli powder", "½ tsp turmeric", "70g/2½oz peas"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a pan and fry the onion for a few minutes, to soften. Add the chicken and fry until the chicken is browned all over.", "Add the curry powder, chilli powder and turmeric and stir to coat the chicken in the spices.", "Stir in the peas and 70ml/2½fl oz water. Reduce the heat and simmer gently for 10-12 minutes, or until the chicken is cooked through. ", "Remove from the heat and serve with boiled basmati rice, naan bread and any pickles or chutneys you have to hand."]}, {"isVegetarian": false, "title": "Baked chicken goujons", "url": "www_bbc_co_uk_food_recipes_chickengoujons_82608", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickengoujons_82608_16x9.jpg", "ingredients": ["125g/4½oz fresh fine breadcrumbs", "½ tsp cayenne pepper (optional)", "salt and pepper, to taste", "4 boneless and skinless chicken breasts, cut into strips", "50g/2oz plain flour", "3 medium free-range eggs, beaten", "2 tbsp vegetable oil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5. Oil two baking trays with vegetable oil.", "Mix the breadcrumbs, cayenne pepper  in a shallow bowl. Season, to taste, with salt and freshly ground black pepper. Place the flour in another shallow bowl.", "Dip the chicken pieces in plain flour, then in the beaten egg and finally coat in the breadcrumbs. Shake off the excess and lay the chicken goujons on the oiled baking tray. (The process is easier if you keep one hand clean of egg for dipping the chicken in the flour and breadcrumbs.)", "Drizzle the goujons all over with more of the vegetable oil.", "Bake in the oven for 30-35 minutes, turning once. Remove from the oven when completely cooked through and golden-brown all over.", "Serve the goujons with ketchip, barbecue sauce or in a soft white roll."]}, {"isVegetarian": false, "title": "Chicken forestiere", "url": "www_bbc_co_uk_food_recipes_chickenforestiere_67440", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 chicken breast", "good handful of dried and soaked morels (retain the soaking juices)", "1 shallot, finely chopped", "1 garlic clove, crushed", "2 knobs of butter", "seasoned flour", "½ glass white wine", "1 shot glass cognac", "double cream", "salt and pepper", "1 medium potato, peeled", "handful of chopped sage"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Dust the pieces of chicken breast cut into strips with seasoned flour, then sauté for about 1 minute in butter until well browned.  Remove the chicken from the pan and put into another frying pan with a knob of butter to keep cooking.  ", "Meanwhile, in the previous pan, add the morels, shallots and garlic to the pan with a little butter and sauté for 30 seconds.  Add a splash of white wine and cognac and flame off.  ", "Then add the double cream and reduce the sauce.  You can add some of the soaking juices if it is too thick.  ", "For the mash, place the potato in a pan of cold water and simmer until cooked.  Add the butter, cream and sage and mix well.", "Put a dollop of simple rich mashed potato and sage in the centre of the plate and arrange the chicken around it.  Pour over the sauce to serve."]}, {"isVegetarian": false, "title": "Chicken jalfrezi", "url": "www_bbc_co_uk_food_recipes_chickenjalfrezi_91772", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickenjalfrezi_91772_16x9.jpg", "ingredients": ["2 tbsp vegetable oil", "1 onion, peeled, finely chopped", "2 cloves garlic, peeled, sliced", "1 tsp chilli powder", "3 tsp ground turmeric", "pinch salt", "750g/1lb 10oz skinless chicken breast, cut into large chunks", "1 x 400g tin chopped tomatoes", "2 tsp ground ginger", "3 tsp ground cumin", "3 tsp ground coriander", "2 tbsp melted butter", "1 lemon, juice only", "basmati rice, cooked according to packet instructions", "6-8 ready-made chapatis or naan breads", "2 limes, cut into wedges", "2 handfuls chopped fresh coriander leaves", "1-2 red chillies, sliced"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a pan and fry the onion and garlic over a low to medium heat for 4-5 minutes, or until softened. ", "Mix the chilli powder, turmeric and salt together in a bowl until well combined, then add the chicken pieces and mix well to coat. Add the coated chicken to the pan and fry for 10-15 minutes, or until golden-brown and cooked through.", "Stir the tomatoes, ginger, cumin and coriander into the pan, then reduce the heat until the mixture is just simmering. Cover the pan with a lid and cook for 20-30 minutes, stirring occasionally and adding a tablespoon of water every so often if the mixture appears too dry. ", "Stir in the butter and add the lemon juice, to taste. ", "To serve, spoon the chicken jalfrezi onto serving plates. Serve with rice, naan and lime wedges on the side, then garnish with the chopped coriander and sliced red chillies."]}, {"isVegetarian": false, "title": "Chicken Kiev", "url": "www_bbc_co_uk_food_recipes_chickenkiev_5492", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 x 225g/8oz chicken suprêmes (chicken breasts with wingbone attached), skinned ", "45-60g/3-4 tbsp freshly chopped flat leaf parsley", "45-60g/3-4 tbsp freshly chopped chives", "1 tsp freshly chopped tarragon leaves", "115g/4oz unsalted butter, softened", "2 cloves garlic, peeled and crushed", "Salt and freshly ground black pepper", "¾ tsp English mustard", "50g/2oz plain flour", "4 eggs, beaten", "175g/6oz natural breadcrumbs", "25g/1oz parmesan cheese, grated", "Vegetable oil, for frying"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["To prepare the garlic herb butter: place the herbs in a bowl and add the softened butter. To crush the garlic sprinkle a little rock salt onto a chopping board. Using the edge of your knife and using a paddling motion crush the garlic into a smooth paste. Add to the butter mixture. Add the mustard and pepper and mix together with a fork. ", "Divide the butter into four and set aside until ready to use. Plunge your hands into a bowl of cold water before moulding the butter. Roll each in greaseproof paper to form a torpedo shape. Place in the fridge for 30 minutes to allow the butter to harden. (The herb butter may be used with fish, meat and chicken.)", "Place the chicken breasts, with the bone attached, smooth side down onto a cutting board. Remove the four baby (or excess) fillets and set aside. Make a vertical cut down the length of the chicken breast, but not all the way through.", "Place the four breasts between cling film and bash with a rolling pin to ensure an even fillet. Repeat the process with the smaller (baby) fillets. This will stop any garlic butter from leaking out from the sides of the chicken.", "Place the breast fillets onto a board, rough side up and season with pepper. Unwrap the garlic herb butter and place each garlic butter torpedo down the centre of each breast. Place the smaller fillets on top of the butter, pushing down to seal and roll up. Make a torpedo shape at the bottom of each fillet.", "Place the breadcrumbs into a shallow dish. Grate the parmesan cheese directly into the breadcrumbs and mix together. Place the flour and beaten eggs into two separate shallow dishes. ", "Dip each chicken breast into the flour, making sure each is coated. Repeat the process with the egg, and then the parmesan breadcrumbs, making sure at each stage each breast is well coated. Chill for 30 minutes. Repeat and chill for a further 30 minutes or until ready to cook.", "Heat the oil in a large pan or a deep fat fryer to 180C/350F/Gas4. Add the chicken breasts and fry until golden for 8-10 minutes and drain onto kitchen paper.", "Serve immediately with herbed rice. "]}, {"isVegetarian": false, "title": "Chicken kiev", "url": "www_bbc_co_uk_food_recipes_chickenkievs_86309", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickenkievs_86309_16x9.jpg", "ingredients": ["4 x 175g/6oz chicken breasts, skin removed", "3 garlic cloves, finely chopped ", "1 lemon, juice only", "salt and freshly ground black pepper", "1 tbsp chopped fresh tarragon", "230g/8oz butter, slightly softened ", "2 tbsp plain flour", "1 free-range egg, beaten ", "10-12 tbsp fresh breadcrumbs", "olive oil, for frying", "250g/9oz cooked white and wild rice (from a packet of mixed white and wild rice)", "100g/3½oz bacon lardons, fried until crisp ", "1 tbsp chopped fresh parsley", "100g/3½oz pine nuts, toasted ", "2 tbsp melted butter"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the chicken kiev, slice a piece out of the centre of the chicken breast to make a pocket using a sharp knife. Place the garlic, lemon juice, salt and freshly ground black pepper, tarragon and butter into a bowl and mix well. Stuff this mixture into the pocket in the chicken breasts.", "Dredge the chicken breasts in the flour, then dip into the beaten egg, then the breadcrumbs to coat completely, shaking off any excess.", "Heat the oil in an ovenproof frying pan and fry the chicken breasts on all sides until lightly browned. Transfer to the oven and bake for 18-20 minutes, or until golden-brown and completely cooked through.", "For the rice, place all the rice ingredients into a bowl and mix well. Pack the rice mixture into four cups or ramekins.", "To serve, turn the rice out onto serving plates with the chicken kiev alongside."]}]