[{"ingredients": ["75ml / 2½fl oz de aceite de maní, más 1 cucharada extra", "4 huevos grandes de gallinas camperas, golpeados", "1½ cucharada de jengibre finamente picado", "4 dientes de ajo, cortados en cubitos", "1 cebolla mediana marrón, finamente picada", "Lonchas de tocino sin corteza 125g / 4½oz o salchicha china, aproximadamente picada", "1 cucharadita de azúcar blanco", "2 cucharadas de shao hsing vino (vino de arroz chino)", "825 g / 1 libra 13 oz de arroz blanco de grano medio, cocido", "1 cucharada de salsa de ostras", "115 g / 4¼ oz de cebollas tiernas en rodajas finas (cebollín)", "3 cucharaditas de salsa de soja", "¼ cucharadita de aceite de sésamo", "2 cebollas tiernas (cebolla de verdeo) finamente cortadas en diagonal", "60ml / 2 ¼fl oz de salsa de soja ligera", "½ pimiento rojo grande, finamente cortado en diagonal"], "method": ["Caliente el aceite de cacahuete en un wok caliente hasta que la superficie parezca brillar levemente.", "Vierta los huevos batidos en el wok y cocínelos durante aproximadamente un minuto, revolviéndolos ligeramente y girando el wok para asegurar una cocción pareja.", "Cuando esté casi cocido, retire cuidadosamente la tortilla del wok con una rebanada de pescado y escurra sobre papel de cocina. Dejar de lado.", "Limpie el wok con papel de cocina, agregue el aceite de maní extra y saltee el jengibre y el ajo por un minuto, o hasta que esté muy aromático.", "Agregue la cebolla y sofría por dos minutos, o hasta que esté ligeramente dorado y tierno.", "Agregue el tocino y sofría por otro minuto, o hasta que esté ligeramente dorado.", "Agregue el azúcar y el vino, luego saltee por 30 segundos.", "Agregue el arroz, la tortilla reservada, la salsa de ostras, la cebolleta, la salsa de soja y el aceite de sésamo. Revuelva freír durante tres minutos, o hasta que el arroz se caliente. Cortar áspero la tortilla en pedazos más pequeños mientras revuelve.", "Divida el arroz entre los tazones individuales y adorne con cebollas extra de primavera.", "Combine la salsa de soja ligera y el chile en un tazón pequeño y sirva a un lado."], "url": "www_bbc_co_uk_food_recipes_deliciousfriedrice_72056", "title": "Delicioso arroz frito", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 2-4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["450g / 1lb de pepino, en rodajas", "1 cebolla grande, en rodajas", "½ pimiento rojo o verde, en rodajas", "Sal de 56g / 2oz", "215ml / 7½fl oz de vinagre de vino blanco", "175g / 6oz demerara azúcar", "¼ cucharadita de cúrcuma molida", "pellizcar clavos de tierra", "¼ de canela", "¼ cucharadita de hojuelas de pimiento rojo (si la pimienta no está roja)", "6 bayas de pimienta de Jamaica", "1 semillas de mostaza cucharadita colmada", "¼ cucharadita de semilla de apio"], "method": ["Cubra las verduras en rodajas con sal. Deja el mayor tiempo posible, al menos tres horas.", "Enjuague bien las verduras con agua fría y seque con papel de cocina.", "Coloque las verduras en una sartén preservadora. Agregue el vinagre de vino blanco y el azúcar y hierva por 20 minutos.", "Agregue las especias y las semillas y hierva por otros tres minutos. Vierta en frascos esterilizados.", "Este pepinillo también se puede enfriar y comer de inmediato."], "url": "www_bbc_co_uk_food_recipes_dentdale_pickle_74981", "title": "Pickle de Dentdale", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Filete de solomillo de 225g / 8oz", "2 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "2 rebanadas de pan", "½ cebolla roja, cortada en anillos", "4 cucharadas de aceite vegetal", "sal y pimienta negra recién molida", "5 cucharadas de vino blanco", "75 g / 2¾oz de queso Stilton", "2 cucharadas de crema doble"], "method": ["Para hacer el sándwich de carne, frote una cucharada de aceite de oliva en el bistec y sazone con sal y pimienta negra recién molida.", "En una sartén caliente, cocine la carne durante 3-4 minutos.", "Descansa la carne durante dos minutos y córtala a la mitad.", "Frote la otra cucharada de aceite en el pan y tueste en la sartén de la plancha.", "Para los aros de cebolla, mezcle las rodajas de cebolla con el aceite y la sal y la pimienta negra recién molida en un tazón.", "Coloque en la sartén de la plancha durante 5-6 minutos hasta que esté dorado y suave.", "Para hacer la salsa Stilton, en una cacerola pequeña agregue el vino y reduzca hasta la mitad. Agregue el queso hasta que se derrita y luego termine la salsa agregando la crema doble.", "Para servir, haga el emparedado colocando el filete sobre el pan tostado. Apile con cebollas, cubra con el otro pan tostado y rocíe con Stilton."], "url": "www_bbc_co_uk_food_recipes_deluxesteaksandwichs_76106", "title": "Sándwich de carne de lujo servido con salsa Stilton", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 hongos portobello, tallos eliminados", "85g / 3oz de queso de cabra", "rociar aceite de oliva", "sal y pimienta negra recién molida", "1 limón, ralladura solamente", "2 cucharadas de pan rallado blanco fresco", "2 ramitas de tomillo, solo hojas", "gran puñado de hojas frescas de albahaca", "gran puñado de hojas frescas de perejil", "gran puñado de hojas frescas de cilantro", "rociar aceite de oliva virgen extra", "1 limón, solo jugo"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para los champiñones rellenos, coloque los champiñones en un plato para servir, cubra con el queso de cabra y rocíe con aceite de oliva. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Coloque la ralladura de limón, pan rallado y el tomillo en una mini licuadora. Sazonar, al gusto, con sal y pimienta negra recién molida y mezclar para combinar.", "Coloque la mezcla de migas de pan sobre los champiñones y rocíe con un poco de aceite extra de oliva. Transfiera al horno para hornear durante diez minutos o hasta que las migas estén doradas en la parte superior y los champiñones estén bien cocidos.", "Para la ensalada de hierbas, mezcle las hierbas junto con un chorrito de aceite de oliva y un chorrito de jugo de limón, al gusto.", "Para servir, coloque un hongo en cada uno de los dos platos y decore con la ensalada de hierbas."], "url": "www_bbc_co_uk_food_recipes_dermotscrispstuffedm_89085", "title": "Champiñones rellenos de Dermot con queso de cabra y ensalada de hierbas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 cucharada de mantequilla sin sal", "1 calabaza grande, pelada y cortada en dados de 2cm / ¾in", "1 cucharada de raíz de jengibre recién rallado", "1 naranja, solo ralladura", "100ml / 3½ fl oz crema doble", "2 manzanas braeburn, peladas", "1 cucharada de jugo de limón, para agua acidulada", "2 cucharadas de mantequilla sin sal", "2 cucharadas de azúcar en polvo", "100ml / 3½fl oz de jarabe de arce", "100 ml / 3½ fl oz de salsa de soja", "100ml / 3½fl oz de vinagre balsámico", "100ml / 3½fl oz de jugo de naranja", "400g / 14oz nuevas patatas", "4 pechugas de pato, recortadas, mariposa y piel anotada", "200g / 7oz de col rizada, más o menos picada", "50 g / 1¾oz de mantequilla sin sal", "50 g / 1¾oz de grasa de pato (reservada para cocinar la pechuga de pato)", "sal y pimienta negra recién molida"], "method": ["Para el puré de calabaza, caliente el aceite y la mantequilla en una sartén grande. Una vez que la mantequilla se haya derretido, agrega la calabaza y fríela suavemente sin colorear. Agregue el jengibre y la ralladura de naranja y cocine hasta que la calabaza esté suave. Una vez ablandada, agregue la crema y sazone con sal y pimienta.", "Transfiera la calabaza cocida a una licuadora y puréela hasta que quede suave. Pasar a través de un tamiz fino en una sartén limpia para eliminar los grumos.", "Para las manzanas caramelizadas, tome una cucharada parisina y corte las esferas de manzana y colóquelas en un recipiente con agua acidulada.", "Coloque una sartén al fuego y agregue la mantequilla y el azúcar. Una vez derretido y el azúcar había comenzado a caramelizar, escurrir las bolitas de manzana y agregarlas a la sartén. Cubra el caramelo, luego retírelos del fuego y déjelos a un lado para que se enfríen.", "Para el glaseado de pato, hierva el jarabe de arce, la salsa de soja y el vinagre balsámico en una sartén hasta que se reduzca a un esmalte pegajoso. Agregue el jugo de naranja y reduzca nuevamente.", "Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Para el pato Derry, coloque las papas en una olla grande y cúbralas con agua fría. Llevar a ebullición y cocinar las papas hasta que estén suaves pero sin deshacerte. Una vez cocinado, retírelo de la sartén y reviértalo en agua helada para detener el proceso de cocción. Con cuidado, pele las patatas enfriadas y déjelas a un lado.", "Sazone las pechugas de pato con sal y pimienta, luego frítelas con la piel hacia abajo en una sartén a prueba de horno (puede necesitar hacer esto en tandas). Cocine con cuidado durante aproximadamente 8 minutos hasta que esté caramelizado por completo y la grasa haya salido de la piel. Vierta la grasa de la sartén en un tazón pequeño. Transfiera el pato al horno y cocine por 3 minutos.", "Retire la sartén del horno y agregue un poco del glaseado, cubra el pato en el glaseado, luego déjelo reposar durante 10 minutos antes de servir.", "Caliente una sartén grande y agregue la mantequilla, una vez derretida agregue la col rizada picada y revuelva para cubrir. Cocine hasta que la col rizada esté tierna, luego sazone con sal y pimienta.", "Caliente la grasa del pato en una sartén grande separada y agregue las papas peladas. Cocine suavemente hasta que se dore por todos lados. Condimentar con sal y pimienta.", "Para servir, recalentar las manzanas caramelizadas y el puré de calabaza. Vierta el puré en platos para servir. Cortar los pechugas de pato y colocar al lado del puré. Agregue las manzanas al lado del pato y las verduras marchitas en el medio."], "url": "www_bbc_co_uk_food_recipes_derry_duck_and_64105", "title": "Pato Derry y patatas Londonderry", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de girasol", "1 cebolla picada", "Col roja de 450 g / 1 libra, rallada", "225 g / 8 oz de manzanas de cocina, peladas, sin corazón y en cubitos", "Jengibre fresco de la raíz de los 2.5cm / 1in, pelado y rallado", "pizca de canela molida o pimienta de Jamaica", "150ml / ¼pt de caldo de verduras", "sal y pimienta negra recién molida"], "method": ["Calienta el aceite en una sartén grande. Agregue la cebolla, el repollo rojo y la manzana y cocine suavemente durante 5 minutos.", "Agregue el jengibre y la canela o la pimienta de Jamaica y el caldo de verduras. Llevar a ebullición, luego reduzca el fuego y cocine a fuego lento durante 15-20 minutos hasta que la mayoría del líquido se haya evaporado y las verduras estén tiernas.", "Temporada para probar y servir."], "url": "www_bbc_co_uk_food_recipes_devilishredcabbage_8076", "title": "Repollo rojo diabólico", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/devilishredcabbage_8076_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50g / 1¾oz de mantequilla", "2 chalotes, finamente picados", "1 diente de ajo, finamente picado", "Hígados de pollo 300g / 10½oz, recortados", "4 corderos riñones, recortados y cortados en trozos", "150 g / 5½ oz de hongos pied bleu, cortados y partidos a la mitad si son grandes", "200ml / 7fl oz de caldo de carne", "Crema doble 110ml / 4fl oz", "2 cucharaditas de mostaza inglesa", "1 cucharadita de salsa Worcestershire", "sal y pimienta negra recién molida", "4 rebanadas de pan blanco, tostado", "2 cucharadas de perejil de hoja plana, picado", "2 cabezas de lechuga Little Gem, hojas separadas", "½ pepino, finamente cortado", "1 puñado de cohetes", "1 cucharadita de mostaza francesa", "1 cucharada de vinagre de Jerez", "1 cucharada de vinagre de nuez", "2 cucharadas de aceite de nuez", "4 cucharadas de aceite de oliva"], "method": ["Para los hígados de pollo, caliente una sartén o una sartén grande hasta que estén medio calientes. Agregue la mantequilla, el chalote y el ajo y cocine durante 1-2 minutos hasta que se ablanden.", "Encienda el fuego y agregue los hígados de pollo y los riñones. Freír por 2-3 minutos hasta que estén dorados y casi cocidos.", "Agregue los champiñones y cocine por otro minuto.", "Agregue el caldo de carne y cocine hasta que se reduzca a la mitad. Agregue la crema, la salsa de mostaza y Worcestershire y cocine hasta que espese.", "Sazonar, al gusto, con sal y pimienta negra recién molida y cocinar por otros dos minutos", "Para la ensalada, mezcle la Pequeña Gema, el pepino y el cohete en un tazón.", "Coloque el resto de los ingredientes con una cucharada de agua en un tazón pequeño y mezcle hasta que esté emulsionado. Vierta sobre la ensalada y revuelva para cubrir.", "Para servir, coloque la tostada en platos para servir, cubra con hígados y riñones deformes y decore con perejil de hojas planas. Sirve la ensalada al lado."], "url": "www_bbc_co_uk_food_recipes_devilled_chicken_livers_06432", "title": "Devilled hígados de pollo, corderos riñones y champiñones en pan tostado con ensalada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["12 huevos grandes de gallinas camperas, a temperatura ambiente (ver la punta de la receta a continuación)", "4 cucharadas de mayonesa", "1-2 cucharaditas de mostaza inglesa", "1 cucharadita de copos de sal marina", "¼ de pimentón, más extra para rociar", "algunas gotas Tabasco", "2 cucharadas de aceite de oliva virgen extra", "2-3 cucharadas de agua de una tetera recién hervida", "2 cucharaditas de cebollines finamente picados"], "method": ["Ponga a hervir el agua en una cacerola grande y, una vez que esté hirviendo, agregue los huevos, uno por uno, en la sartén y vuelva a hervir. Hierva durante 1 minuto, luego apague el fuego y deje que los huevos reposen en la sartén por 12 minutos.", "Mientras espera que los huevos se cocinen, llene un recipiente grande con agua muy fría y tírelo con un puñado de cubitos de hielo si los tiene. Tan pronto como los huevos hayan tenido sus 12 minutos, colóquelos en el agua fría y déjelos durante 15 minutos, no más, antes de pelar con paciencia y cuidado.", "Dividir a la mitad los huevos a lo largo y suavemente separar la yema de cada mitad y meterlos en un tazón. Coloque los 18 blancos a la mitad más atractivos en un plato o dos.", "Agregue la mayonesa, una cucharadita de mostaza inglesa, la sal y el pimentón a las yemas de huevo, y agite unas gotas de Tabasco en la parte superior. Revuelva y mezcle con un tenedor, luego mezcle con una batidora o en un procesador de alimentos. Agregue el aceite y mezcle de nuevo hasta que quede suave. Será muy grueso. Verifique el condimento y también pruebe para ver si quiere más caliente. En general, le doy 2 cucharaditas de mostaza y un poco más de Tabasco, pero es mejor proceder lentamente. Ahora, con la mano, agregue tanta agua como necesite para ayudar a formar una consistencia de tubería.", "Con una cuchara, coloque la mezcla dorada en una manga pastelera con una boquilla de glaseado estrella, asegurándose de que esté densamente compactada en el fondo de la bolsa. Luego vierta el tubo, llenando los blancos ahuecados con rosetas doradas. O puede amontonar la mezcla de yema usando un par de cucharaditas. Espolvorear con pimentón y cebollino picado y servir con una floritura."], "url": "www_bbc_co_uk_food_recipes_devilled_eggs_96275", "title": "Huevos devilled", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Cumple 18 años", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/devilled_eggs_96275_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 yemas de huevo grandes de gallinas camperas", "1 cucharada de vinagre de vino blanco", "2 cucharaditas de mostaza Dijon", "½ cucharadita de azúcar en polvo", "½ cucharadita de sal marina en copos, más extra para sazonar", "pimienta negra recién molida", "150ml / 5fl oz de aceite de girasol", "1 chalota pequeña, pelada y descuartizada", "½ diente de ajo pequeño", "1 cucharada de alcaparras pequeñas, escurridas", "15g / ½ oz de perejil fresco", "15g / ½ oz de acedera fresca o albahaca", "10g / ¼ oz de menta fresca", "10g / ¼ oz de estragón fresco", "1 cucharadita de jugo de limón recién exprimido", "Filetes de arenque de 600 g / 1 lb 5 oz (alrededor de 6 arenques pequeños y medianos fileteados)", "750ml / 1⅓ pinta de aceite de girasol, para freír en grasa", "6 cucharadas de harina común", "3 cucharadas de sémola", "2 cucharaditas de mostaza inglesa en polvo", "1 cucharadita de pimienta de cayena", "1 cucharadita de sal marina fina", "½ limón, cortado en cuñas para exprimir"], "method": ["Para hacer la salsa verde, ponga las yemas de huevo, el vinagre, la mostaza y el azúcar en el tazón de un mini procesador de alimentos. (No use un procesador grande ya que la salsa no se combinará correctamente. Si no tiene un procesador de alimentos con un bol pequeño, puede usar una batidora o incluso batir con la mano.) Sazone al gusto con sal y pimienta negra recién molida.", "Pulso hasta que esté bien combinado, luego, con el motor en marcha, muy gradualmente vierta el aceite en una corriente muy fina sobre los huevos y mezcle hasta que quede suave y espeso.", "Agregue la chalota, el ajo, las alcaparras, todas las hierbas y el jugo de limón y mezcle de nuevo hasta que estén finamente picados y la salsa esté muy verde.", "Ajuste el condimento al gusto y agregue una cucharada de agua fría. Mezcle por unos segundos más hasta que la salsa tenga una consistencia suave y espesa, agregando un poco más de agua si es necesario. Divida entre cuatro tazones pequeños o moldes para servir y reserve hasta que esté listo para servir.", "Este próximo bit puede parecer un violín pero es muy fácil y rápido una vez que lo dominas. Tome uno de los filetes de arenque y coloque el lado de la piel sobre un tablero. Cortar por la mitad longitudinalmente en dos filetes. Tome una vez los filetes y pase los dedos arriba y abajo sobre la carne unas cuantas veces para tener una idea de dónde se encuentran los huesos de la uña. Corta el filete longitudinalmente por la mitad otra vez, a cada lado de los huesos de alfiler que encontrarás corriendo por la parte superior de cada filete. Pasa los dedos hacia arriba y hacia abajo otra vez para asegurarte de que los tienes todos, con unas pinzas para extraer los huesos extraviados. Repita con los filetes restantes.", "Luego, corte cada filete en 2-3 rebanadas diagonales dependiendo del tamaño. Enjuaga los pedazos de arenque con agua fría y escúrrelos.", "Vierta el aceite en una cacerola mediana o una freidora y caliente a 180 ° C / 350 ° F, controlando la temperatura con un termómetro de cocina. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Mientras el aceite se calienta, ponga la harina, la sémola, la mostaza en polvo, la pimienta de cayena y la sal en un tazón grande. Sazonar con mucha pimienta negra recién molida y mezclar bien.", "Cuando el aceite esté a la temperatura adecuada, drague una cuarta parte de los filetes de arenque húmedos en la harina sazonada (el pescado no debe estar demasiado seco o la harina no se pegará, así que enjuague con más agua y drene nuevamente si es necesario). Sacuda el exceso de harina y baje el pescado enharinado suavemente en el aceite. Freír durante 3-3½ minutos, o hasta que las piezas estén crujientes y doradas. Revuelva una vez hacia el final del tiempo de cocción para separar el pescado.", "Con cuidado, retire el pescado frito con una cuchara ranurada y coloque en una pila en un plato forrado con papel de cocina. Vigile la temperatura mientras fríe, ya que el aceite puede comenzar a calentarse y también se enfriará rápidamente una vez que se haya agregado el pescado.", "Saca cualquier trozo de pescado crujiente que flote hasta la parte superior del aceite y devuélvelo a 180 ° C / 350 ° F. Repita el proceso de recubrimiento y freído con el resto del pescado. Mantenga caliente el pescado cocinado en un horno bajo entre lotes si lo desea.", "Para servir, divida el pescado caliente entre cuatro platos o tazones y coloque la salsa a un lado. Agregue las rodajas de limón para exprimir."], "url": "www_bbc_co_uk_food_recipes_devilled_herrings_with_02770", "title": "Arenques maltratados con salsa verde", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Riñones de 6 corderos, aproximadamente 375 g / 13 oz, desollados", "2 cucharadas de harina normal", "25g / 1oz de mantequilla", "1 cebolla mediana, finamente rebanada", "1 cucharada de puré de tomate", "1 cucharada de mostaza inglesa", "1-2 cucharadas de salsa Worcestershire", "4 rebanadas gruesas de pan crujiente", "mantequilla, para difundir", "pequeño racimo de perejil fresco, picado (opcional)", "sal marina y pimienta recién molida"], "method": ["Enjuague los riñones con agua fría y séquelos con papel de cocina. Con unas tijeras, corte cuidadosamente los núcleos blancos de los riñones y deséchelos, luego corte los riñones en trozos gruesos.", "Incline la harina en una bolsa de congelador y sazone bien con sal y pimienta. Agregue los riñones y mezcle hasta que estén bien cubiertos con la harina.", "Derrita la mantequilla en una sartén antiadherente grande. Agregue la cebolla y fríasela suavemente durante 3-4 minutos, o hasta que esté suave y ligeramente dorada, revolviendo regularmente.", "Sacude el exceso de harina de los riñones y agrégalos a la sartén. Cocínelos con la cebolla a fuego medio-alto por 2-3 minutos, volteándolos de vez en cuando.", "Agregue el puré de tomate y la mostaza a la sartén, luego agregue gradualmente 300 ml / 10 fl oz de agua, revolviendo constantemente. Llevar a ebullición, agregar una cucharada de la salsa Worcestershire a la sartén y sazonar con sal y pimienta negra recién molida.", "Reduzca el fuego y cocine a fuego lento durante 15 minutos, o hasta que los riñones estén tiernos y la salsa espesa, revolviendo ocasionalmente. Agregue un poco más de salsa Worcestershire al gusto si lo desea.", "Mientras los riñones se cocinan, tueste el pan en ambos lados, luego unte con mantequilla y coloque cuatro platos pequeños. Coloque los riñones y la salsa sobre la tostada untada con mantequilla y espolvoree con perejil recién picado (si se usa). Sirva de inmediato mientras esté caliente."], "url": "www_bbc_co_uk_food_recipes_devilled_kidneys_58867", "title": "Riñones deformes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/devilled_kidneys_58867_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50 g / 1¾oz de mantequilla sin sal", "2 chalotes, finamente picados", "1 diente de ajo, en rodajas", "4 riñones de cordero, recortados y cortados en trozos", "Setas pied bleu de 150g / 5½oz, cortadas y sin núcleo", "5 cucharadas de aguardiente", "200ml / 7fl oz de caldo de carne", "Crema doble de 100ml / 3½oz", "2 cucharaditas de mostaza inglesa", "1 cucharadita de salsa Worcestershire", "pizca de cayena", "2 cucharadas de aceite de oliva", "2 rebanadas de pan de masa fermentada", "1 cucharada de perejil de flatillo picado", "2 cabezas de lechuga Little Gem", "2 cucharadas de aceite de oliva", "1 cucharada de aceite de nuez", "1 cucharadita de mostaza Dijon", "1 cucharada de vinagre de Jerez", "1 cucharada de vinagre de nuez"], "method": ["Para los riñones deformes, calienta una sartén grande. Una vez caliente, agregue la mantequilla y, cuando se derrita, agregue los chalotes. Cocine por unos minutos, luego agregue el ajo y cocine por un minuto más.", "Suba el fuego y agregue los riñones y cocine hasta que estén dorados. Agregue los champiñones y cocine por dos minutos. Desglaze la sartén agregando el brandy y raspando el fondo de la sartén con una cuchara para eliminar cualquier trozo carbonizado.", "Añadir el caldo y hervirlo. Cocine hasta que el volumen del líquido se haya reducido a la mitad, luego agregue la crema, la mostaza, la salsa Worcestershire y la pimienta de cayena. Revuelva y cocine por 2-3 minutos, o hasta que la salsa se haya reducido y espesado.", "Mientras tanto, caliente una sartén grande y rocíe el aceite sobre el pan. Coloque en la bandeja de la plancha y cocine por un minuto en cada lado, o hasta que aparezcan marcas en el pan.", "Para la ensalada verde y la vinagreta de jerez, separe las pequeñas hojas de gema y colóquelas en un tazón grande. Vierte los aceites, la mostaza y los vinagres en un tazón pequeño y bate. Ponga a un lado hasta que esté listo para servir.", "Justo antes de servir agregue el perejil picado a los riñones. Coloque una rebanada de pan en cada plato y espolvoree los riñones y los champiñones en la parte superior.", "Vierta el aderezo sobre la ensalada y mezcle. Sirva la ensalada al lado de los riñones en una tostada."], "url": "www_bbc_co_uk_food_recipes_devilled_kidneys_with_a_95590", "title": "Riñones endemoniados con ensalada verde y vinagreta de jerez", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 riñones de corderos, pieles y núcleo blanco eliminado", "leche, para remojar (opcional)", "4 cucharadas de harina normal", "1 cucharada de sal", "1 cucharadita de pimentón", "25g / 1oz de mantequilla", "½ cucharada de salsa Worcestershire", "150ml / 5¼fl oz de caldo de verduras", "2 cucharaditas de mostaza Dijon", "tostada con mantequilla caliente, para servir"], "method": ["Si no quieres que tus riñones tengan un sabor demasiado fuerte, sumérgelos en un tazón de leche durante 30 minutos y luego escúrrelos.", "Para evitar que los riñones se encrespen cuando cocine, sumerja en un recipiente de agua caliente durante 2-3 minutos, luego enjuague con agua fría para refrescar.", "Mezcle la harina, la sal y el pimentón en un tazón y use para desempolvar los riñones preparados.", "Derrita la mantequilla en una sartén pequeña y fríe los riñones a fuego lento durante 2 o 3 minutos por cada lado, o hasta que se doren por todas partes, pero aún un poco rosa por dentro.", "Rocíe la salsa Worcestershire, el caldo de verduras y la mostaza alrededor de los riñones y cocine a fuego lento hasta que el líquido se reduzca ligeramente y los riñones estén cocidos.", "Apila los riñones en una tostada con mantequilla caliente y sirve inmediatamente."], "url": "www_bbc_co_uk_food_recipes_devilledkidneys_89213", "title": "Riñones deformes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de mantequilla", "4 riñones de cordero, recortados y cortados en trozos", "1 cucharadita de salsa Worcestershire", "2 cucharaditas de puré de tomate", "2 cucharaditas de jugo de limón", "1 cucharadita de mostaza inglesa en polvo", "pizca de cayena", "sal y pimienta negra recién molida", "2 rebanadas de pan blanco, tostado", "1 cucharada de perejil de flatleaf fresco picado"], "method": ["Calentar una sartén hasta que esté caliente, luego agregar la mantequilla y los riñones y freír durante 2-3 minutos, hasta que se dore por todas partes.", "Coloque la salsa Worcestershire, el puré de tomate, el jugo de limón, la mostaza en polvo y el polvo de cayena en un tazón y mezcle bien.", "Vierta el aderezo en los riñones y revuelva bien para combinar. Cocine por uno o dos minutos más, hasta que los riñones estén completamente cocidos. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, coloque la tostada en dos platos y cubra cada rebanada con los riñones y los jugos de la sartén. Adorne con perejil de hojas planas."], "url": "www_bbc_co_uk_food_recipes_devilledkidneysontoa_85068", "title": "Devilled riñones en pan tostado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 bombilla de hinojo grande", "1 naranja grande", "1 pomelo rosado", "3 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "4 caballas enteras, limpiadas y evisceradas", "100 g / 3½ oz de mantequilla, ablandada", "1 cucharadita de pimienta de cayena", "2 cucharaditas de pimentón dulce ahumado", "1 cucharadita de semillas de cilantro molido", "1 cucharada de azúcar en polvo de oro", "½ cucharadita de mostaza en polvo inglesa", "2 cucharaditas de vinagre de vino blanco o rojo"], "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Para la ensalada de naranja e hinojo, corte la base de la bombilla de hinojo con un cuchillo, luego afeite el hinojo en rodajas muy finas con una mandolina.", "Sumerja las rodajas de hinojo en un recipiente con agua helada y deje en remojo y crujiente durante 10-12 minutos.", "Mientras tanto, pela la naranja, siguiendo la curva de la fruta.", "Sostenga la naranja pelada sobre un juego de tamices en la parte superior de un tazón para atrapar los jugos, y corte a lo largo de las membranas para eliminar la carne de cada segmento de naranja.", "Exprime cualquier jugo de la pulpa en el recipiente y descarta la pulpa.", "Repita el proceso de segmentación y recolección de jugo con el pomelo. Coloque los segmentos de naranja y pomelo en un recipiente y reserve.", "Batir los jugos de cítricos recogidos con el aceite de oliva y sazonar, al gusto, con sal y pimienta negra recién molida.", "Escurra las rodajas de hinojo y mezcle con los segmentos de cítricos. Vierta sobre el aderezo y mezcle bien.", "Para la caballa devilled, calentar la parrilla a su ajuste más alto.", "Con un cuchillo afilado, barra cada caballa a intervalos de 2 cm / 1 in a lo largo de ambos lados, luego coloque en una fuente para hornear.", "Mezcle la mantequilla, la pimienta de cayena, el pimentón dulce ahumado, el cilantro, el azúcar impalpable, el polvo de mostaza y el vinagre en un bol. Sazonar bien con sal y pimienta negra recién molida.", "Frote la mantequilla especiada sobre las caballas, incluso dentro de sus cavidades.", "Coloque la caballa en la bandeja de la parrilla y colóquela debajo de la parrilla para cocinar por 4-5 minutos a cada lado, hasta que el pescado esté firme y cocido.", "Para servir, coloque un pescado en cada plato y sirva con el hinojo, pomelo y ensalada de naranja en el lado."], "url": "www_bbc_co_uk_food_recipes_devilledmackerelwith_89421", "title": "Caballa Devilled con ensalada de hinojo, naranja y pomelo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["10 ciruelas", "10 lonchas de tocino", "pequeño puñado de perejil fresco, para adornar"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Envuelva cada ciruela con una loncha de tocino y tápelos en una bandeja para hornear durante ocho minutos, o hasta que estén cocidos.", "Para servir, coloque a los demonios a caballo en un plato limpio con el perejil dispuesto al costado."], "url": "www_bbc_co_uk_food_recipes_devilsonhorseback_84788", "title": "Diablos a caballo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50 g / 2 oz de cacao en polvo de mejor calidad, tamizado", "100g / 4 oz de azúcar mascabado oscuro", "250ml / 8fl oz de agua hirviendo", "125 g / 4½ oz de mantequilla sin sal, más algunos para engrasar", "150 g / 5 oz de azúcar en polvo", "Harina normal 225g / 8oz", "½ cucharadita de polvo de hornear", "½ cucharadita de bicarbonato de soda", "2 cucharaditas de extracto de vainilla", "2 huevos de gallinas camperas", "125ml / 4fl oz de agua", "30g / 1oz de azúcar moreno oscuro", "175g / 6oz de mantequilla sin sal, en cubos", "300g / 10oz de chocolate negro de mejor calidad, finamente picado"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Alinee los fondos de dos latas de bocadillo de 20 cm / 8 pulg con papel de hornear y unte los lados.", "Ponga el cacao y el azúcar moreno oscuro en un tazón grande y vierta el agua hirviendo. Batir para mezclar y reservar.", "Bata la mantequilla y el azúcar impalpable en un recipiente aparte, batiendo bien hasta que quede pálido y esponjoso; Encuentro esto más fácil con un mezclador independiente, pero a mano no te mataría.", "Mezcle la harina, el polvo de hornear y el bicarbonato de soda en otro recipiente y déjelos a un lado por un momento.", "Gotee el extracto de vainilla en la crema de mantequilla y azúcar, mezcle todo el tiempo, luego agregue un huevo, seguido de una cucharada de la mezcla de harina y luego el segundo huevo. Sigue mezclando después de cada adición.", "Incorpore el resto de la mezcla de harina poco a poco, luego mezcle y doble la mezcla de cacao, raspando bien el bol con una espátula.", "Divida esta mezcla fabulosamente chocolate entre las dos latas preparadas y ponga en el horno durante aproximadamente 30 minutos, o hasta que un probador de torta salga limpio. Saque las latas y déjelas en una rejilla de alambre durante 5-10 minutos, luego apague las tortas y déjelas enfriar.", "Tan pronto como los pasteles estén en el horno, comience con el glaseado. Ponga el agua, el azúcar mascabado y la mantequilla en una sartén a fuego lento hasta que se derrita.", "Cuando esta mezcla empiece a burbujear, retire la sartén del fuego y agregue el chocolate picado, agitando la sartén para que todo el chocolate se caliente con fuego y luego déjelo fundirse por un minuto. Una vez derretido, bate hasta que quede suave y brillante.", "Deje el glaseado a un lado durante aproximadamente una hora, batiendo de vez en cuando - cuando esté pasando la sartén - en ese momento las tortas se enfriarán, y listo para el glaseado.", "Coloque una de las tortas refrigeradas, con su lado superior hacia abajo, sobre un soporte de pastel o plato, y extiéndala con aproximadamente un tercio del glaseado. Cubra eso con la segunda torta, con la altura normal, y extienda el resto del glaseado sobre la parte superior y los lados, girando con su espátula. Puedes ir por una mirada suave, pero nunca lo hago y probablemente no pueda."], "url": "www_bbc_co_uk_food_recipes_devils_food_cake_49392", "title": "Pastel del diablo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 10-12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/devils_food_cake_49392_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["290ml / 10 fl oz de leche", "30g / 1oz de mantequilla", "Harina normal de 30g / 1oz", "3 yemas de huevo de gallinas camperas", "1-2 cucharaditas de mostaza Dijon, al gusto", "1 cucharada de salsa Worcestershire", "55 ml / 2 oz", "120 g / 4½ oz de queso cheddar, rallado", "4 rebanadas de pan de campo, tostado"], "method": ["Coloque la leche en una sartén y deje que hierva.", "En una sartén por separado, derrita la mantequilla, agregue la harina común y cocine a fuego lento, revolviendo con frecuencia, durante dos minutos.", "Poco a poco bata la leche caliente en la mezcla de mantequilla y harina. Regrese a ebullición, batiendo continuamente.", "Agregue las yemas de huevo y vuelva a hervir antes de agregar la mostaza, la salsa Worcestershire y la cerveza. Agregue el queso rallado y bata hasta que quede suave.", "Precalentar una parrilla a fuego medio.", "Extienda un lado de cada tostada con la mezcla de rareza. Coloque debajo de la parrilla hasta que estén doradas.", "Para servir, colocar en platos para servir."], "url": "www_bbc_co_uk_food_recipes_devonrarebitwithched_86529", "title": "Devon rarebit con salsa cheddar y Worcestershire", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "1 rebanada gruesa de pan de centeno", "50g / 1¾oz de queso de cabra", "sal y pimienta negra recién molida", "gran puñado de perejil fresco, solo hojas", "1 cucharada de vinagre balsámico", "150ml / ¼ pt de aceite vegetal", "150ml / ¼ pt de aceite de oliva", "½ berenjena, muy finamente rebanada", "sal marina"], "method": ["Precalienta una sartén hasta que esté caliente. Para hacer la ensalada, rocíe una cucharada de aceite de oliva sobre el pan de centeno y coloque sobre la sartén caliente. Planche durante 1-2 minutos en cada lado hasta que estén dorados.", "Extienda un lado del pan de centeno con queso de cabra, sazone con sal y pimienta negra recién molida y colóquelo bajo una parrilla caliente durante 2-3 minutos, o hasta que comience a dorarse en la parte superior.", "Coloque las hojas de perejil en un recipiente para servir y viértalas con la cucharada restante de aceite de oliva y el vinagre balsámico. Coloque el crostini de queso de cabra en la parte superior.", "Para hacer las patatas fritas de berenjena, vierta el aceite vegetal y el aceite de oliva en una olla profunda de base pesada y caliente hasta que un pequeño cubo de pan chisporrotee y se ponga dorado cuando se le caiga. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Agregue las rodajas de berenjena al aceite caliente y freír suavemente durante ocho minutos, o hasta que estén crujientes y doradas. Con cuidado, quite con una espumadera y escurra sobre papel de cocina.", "Para servir, esparza las patatas fritas de berenjena con sal marina y esparza alrededor del crostini en el tazón de servir."], "url": "www_bbc_co_uk_food_recipes_dgfg_87007", "title": "Crostini de queso de cabra con ensalada de perejil", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Helado de vainilla de buena calidad 200 g / 7 oz, preferiblemente Devonshire", "200 g / 7 oz de fresas frescas, cascadas o frambuesas", "3 cucharadas de miel clara", "140ml / 5fl oz de leche entera"], "method": ["Coloque todos los ingredientes en una licuadora y mezcle hasta que quede suave.", "Para servir, vierta en vasos refrigerados."], "url": "www_bbc_co_uk_food_recipes_devonshirevanillaice_86530", "title": "Helado de vainilla Devonshire y batidos de fruta de verano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 rebanadas pequeñas de pan de centeno", "100g / 3½oz de queso crema", "1 cucharadita de jugo de limón", "1 cucharada de eneldo picado, además de ramitas adicionales para adornar", "pimienta negra recién molida", "Arenques de 50 g / 1¾oz de eneldo, de un tarro, cortado en pequeños cuadrados", "6 huevos de codorniz, hervidos y pelados"], "method": ["Rebana cada rebanada de pan en 6 cuadrados pequeños y colócalos en un tablero.", "Coloque el queso crema, el jugo de limón, el eneldo y la pimienta en un bol y mezcle.", "Extienda una fina capa de la mezcla sobre cada cuadrado y cubra con un arenque de eneldo. Rebana cada huevo de codorniz en cuartos y coloca un cuarto en cada cuadrado. Adorne con una ramita de eneldo y sirva."], "url": "www_bbc_co_uk_food_recipes_dill_herrings_and_quails_42935", "title": "Aperitivos de eneldo y canapés de huevos de codorniz", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Hace 24 canpés", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]