[{"ingredients": ["3 cucharadas de salsa de pescado tailandesa", "1 cucharada de salsa de soja oscura", "2 cucharaditas de azúcar blanda oscura", "2 dientes de ajo, aplastados", "¼ cucharadita de cilantro molido", "¼ cucharadita de pimienta negra molida", "2 filetes de filete de x 175g / 6oz", "aceite de maní, para cocinar", "2 cucharadas de vinagre de vino de arroz", "1 cucharada de jugo de lima", "2 cucharaditas de salsa de pescado tailandesa", "2 cucharaditas de azúcar blanda de color marrón claro", "1 cucharada de cilantro fresco picado", "1 cucharadita de pasta de tamarindo", "1 chile rojo, finamente picado", "150g / 5½oz de fideos de huevo secos", "2 cucharadas de aceite de sésamo", "1 cucharada de aceite de maní", "1 cucharada de chile rojo picado", "150g / 5½oz de gambas cocidas", "1 cucharada de cilantro fresco picado", "2 cebollas de primavera, en rodajas finas", "1 cucharada de salsa de soja ligera", "Una pizca de sal marina", "pellizcar jengibre molido"], "method": ["Mezcle todos los ingredientes de la carne excepto la carne y el aceite en un bol hasta que el azúcar se haya disuelto.", "Coloque el bistec en una bolsa sellable, agregue el adobo y masajee suavemente en la carne. Selle la bolsa sin aire dentro y déjela marinar en el refrigerador durante 6-8 horas.", "Para hacer el aderezo, caliente el vinagre, el jugo de limón y la salsa de pescado en una cacerola pequeña a fuego lento. Agregue el azúcar y revuelva hasta que se disuelva, luego agregue el cilantro, la pasta de tamarindo y el chile rojo.", "Media hora antes de cocinar, retire el bistec de la bolsa y séquelo con papel de cocina.", "Coloque una sartén a fuego alto y frote con aceite de maní con papel de cocina. Cocine el bistec por 2 minutos en cada lado, luego gírelo y cocínelo por otro minuto, o hasta que se dore. Sácalo de la sartén y déjalo reposar por 10 minutos.", "Mientras tanto, cocine los fideos en una olla con agua hirviendo durante 2 minutos, luego drene y reserve. Caliente los aceites de sésamo y maní en una sartén grande a fuego medio. Agregue el chile y las gambas y cocine durante 3-4 minutos. Agregue los fideos, cilantro y cebollas tiernas y agregue la salsa de soja. Sazonar con sal y jengibre.", "Para servir, coloca un giro de fideos en el plato. Cortar el filete fino y colocarlo al lado de los fideos. Ponga un poco de aderezo sobre los fideos y sirva."], "url": "www_bbc_co_uk_food_recipes_weeping_tiger_fillet_47152", "title": "Solomillo de llanto tijereta con fideos y gambas", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina de levante 225g / 8oz", "110g / 4oz de mantequilla salada, cortada en cubitos", "85g / 3oz de azúcar en polvo, más extra para quitar el polvo", "puñado de sultanas", "1 huevo de gallinas camperas, golpeado", "leche, si es necesario", "mantequilla extra, para engrasar"], "method": ["Tamiza la harina en un bol y agrega la mantequilla picada.", "Frote con las yemas de los dedos, o pulse en un procesador de alimentos, hasta que la mezcla se asemeje a pan rallado.", "Agregue el azúcar, sultanas y huevo batido y mezcle bien para formar una bola de masa, usando un chorrito de leche si es necesario.", "Enrolle la masa sobre una tabla enharinada a un grosor de aproximadamente 5 mm / ½ pulg.", "Cortar en rondas con un cortador liso de 7.5-10cm / 3-4in.", "Frote una plancha de hierro o bakestone con mantequilla, limpie el exceso y coloque sobre la placa hasta que se caliente.", "Cocine los pasteles galeses unos a la vez durante 2-3 minutos en cada lado, o hasta que estén dorados.", "Retire de la plancha y espolvoree con azúcar en polvo mientras todavía está caliente."], "url": "www_bbc_co_uk_food_recipes_welsh_cakes_16706", "title": "Pasteles tradicionales de Gales", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Hace 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/welsh_cakes_16706_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100g / 3½oz de cerezas secas", "100ml / 3½fl oz de whisky galés", "Harina de 250g / 9oz de aumento automático, más extra para quitar el polvo", "50 g / 1¾oz de azúcar en polvo, más extra para quitar el polvo", "125g / 4½oz de mantequilla, enfriada y cortada en cubos", "1 cucharadita de ralladura de naranja", "1 huevo de gallinas camperas, golpeado", "manteca de cerdo o mantequilla, para engrasar"], "method": ["Pon las cerezas en una olla pequeña y vierte sobre el whisky. Caliente hasta que el whisky comience a hervir, luego déjelo a un lado para infundir durante 1 hora.", "Ponga la harina, el azúcar y una pizca de sal en un tazón. Agregue la mantequilla y frótela con las puntas de los dedos hasta que la mezcla se asemeje a migas de pan finas. Agregue la ralladura de naranja y las cerezas, junto con cualquier whisky que no haya sido absorbido. Agregue el huevo y córtelo en la mezcla con un cuchillo; tan pronto como la mezcla empiece a formar una masa, hágalo formando una bola con las manos.", "Extienda la masa sobre una superficie de trabajo ligeramente enharinada y extiéndala hasta un grosor de aproximadamente 5 mm-1 cm / ¼-½ pulgada. Con un cortador redondo de 6 cm / 2½ pulgadas, corte las rondas de la masa. Vuelve a unir cualquier masa sobrante y repite. La masa debe producir alrededor de 20 tortas.", "Caliente una sartén plana o una sartén pesada a fuego medio-bajo y engrase ligeramente la superficie con un poco de manteca o mantequilla. Cocine las tortas galesas por lotes, durante 2 a 3 minutos por cada lado, o hasta que estén doraditas y cocidas, no caliente demasiado o se quemarán por fuera antes de que estén cocidas. Cubra un plato con azúcar impalpable y cubra las tortas galesas todavía calientes en el azúcar. Sirve caliente o frío."], "url": "www_bbc_co_uk_food_recipes_welsh_cakes_28269", "title": "Tortas galés de cereza y whisky", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Hace 20 tortas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["30g / 1oz de mantequilla sin sal", "Harina normal de 20g / ¾oz", "75ml / 2½fl oz de grasa", "Cheddar fuerte 225 g / 8 oz, rallado", "1½ cucharadita de mostaza inglesa en polvo", "2 cucharaditas de salsa Worcestershire", "4 rebanadas gruesas de masa fermentada u otro pan", "sal y pimienta negra recién molida"], "method": ["Precalentar la parrilla a alto.", "Derrita la mantequilla en una sartén pequeña a fuego medio. Agregue la harina y mezcle, cocinando durante 1 minuto.", "Batir la stout hasta que no queden grumos. Agregue el queso, poco a poco, revolviendo hasta que se haya derretido en la salsa. Agregue el polvo de mostaza y la salsa Worcestershire y sazone al gusto.", "Tueste el pan y colóquelo en una bandeja para hornear. Cubra cada rebanada de pan tostado con una capa gruesa de la mezcla de queso, asegurándose de que vaya directo a los bordes. Coloque debajo de la parrilla y cocine hasta que burbujee y se dore."], "url": "www_bbc_co_uk_food_recipes_welsh_rarebit_12521", "title": "Welsh rarebit", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["algunos puñados de heno", "50ml / 2fl oz de aceite vegetal", "4 ramitas de romero", "1 bulbo de ajo, cortado por la mitad horizontalmente", "2 costillas de cordero, cortadas en chuletas (para hacer 14-16 chuletas)", "sal y pimienta negra", "botón de mantequilla", "250 g / 9 oz de trigo bulgur, empapado en agua fría durante 3-4 horas", "1-2 cucharadas de pasta harissa", "100g / 3½oz de almendras sin cáscara", "4 albaricoques, piedra quitada y picada", "100 g / 3½ oz de pistachos sin cáscara", "1 manojo grande de menta fresca, picada", "1 manojo grande de perejil fresco de flatleaf, picado", "1 granada, semillas retiradas", "1 limón, solo jugo", "sal y pimienta negra", "50ml / 2fl oz de aceite de oliva"], "method": ["Coloque una sartén grande a fuego medio y coloque el heno en la parte inferior. Agregue el aceite vegetal, el romero y el ajo. Cubra con las chuletas de cordero y sazone con sal y pimienta negra recién molida. Selle la bandeja con papel de aluminio y una tapa (para evitar que salga el humo). Cocine por 10-15 minutos, volteando el cordero a la mitad. Cuando esté cocido, agregue la mantequilla para glasear las chuletas.", "Para la ensalada, escurra el trigo bulgur, luego cubra con agua hirviendo y deje reposar por 10 minutos hasta que todo el líquido haya sido absorbido. Agregue la pasta Harissa y mezcle bien. Revuelva a través de todos los ingredientes restantes y sírvalos con las chuletas de cordero."], "url": "www_bbc_co_uk_food_recipes_welsh_lamb_in_hay_with_93565", "title": "Cordero galés en heno con ensalada tabbouleh", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/welsh_lamb_in_hay_with_93565_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["25g / 1oz de mantequilla", "Harina normal de 25g / 1oz", "l00ml / 3½fl oz fuerte, cerveza oscura", "150g / 5oz de queso Cheddar maduro, rallado", "1 yema de huevo de gallinas camperas", "1 cucharadita de mostaza inglesa", "4 cucharaditas de salsa Worcestershire", "pizca de cayena", "4 rebanadas gruesas de pan integral o de granero", "pimienta negra recién molida"], "method": ["Precalentar la parrilla a alto.", "Derrita la mantequilla en una olla antiadherente y agregue la harina. Cocine a fuego lento durante 30 segundos, revolviendo constantemente. Poco a poco agregue la cerveza. Cocine a fuego lento durante 2-3 minutos, revolviendo constantemente hasta que la salsa esté espesa y suave.", "Agregue el queso, la yema de huevo, la mostaza, la salsa Worcestershire y la pimienta de cayena, si los está usando. Cocine hasta que el queso se derrita, revolviendo constantemente. Sazonar con pimienta negra recién molida y reservar para enfriar.", "Coloque el pan en una bandeja para hornear forrada con papel de aluminio y tostadas en cada lado hasta que estén doradas. Extienda la salsa de queso sobre el pan, asegurándose de que las rebanadas estén completamente cubiertas para que los bordes no se quemen. Regrese a la parrilla de 20 a 30 segundos más hasta que se dore ligeramente y burbujee."], "url": "www_bbc_co_uk_food_recipes_welsh_rarebit_05821", "title": "Welsh rarebit", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["25g / 1oz de mantequilla", "1 cucharadita de harina común", "1 cucharadita de mostaza en polvo", "100ml / 3½fl oz de grasa", "1 cucharadita de salsa Worcestershire", "Queso cheddar 250 g / 9 oz, rallado", "3 yemas de huevo grandes, batidas", "6 rebanadas de pan de granero"], "method": ["Precalentar la parrilla a fuego medio.", "Derrita la mantequilla en una cacerola y mezcle la harina y el polvo de mostaza. Cocine por un minuto o dos, luego agregue gradualmente la salsa fuerte y la salsa Worcestershire, revolviendo constantemente hasta que esté suave. Llevar a ebullición e inmediatamente reducir el calor.", "Agregue el queso y revuelva hasta que se derrita. Retirar del fuego y dejar enfriar un poco. Agregue las yemas de huevo y mezcle bien.", "Tueste el pan y luego acomódelo sobre una rejilla o bandeja para hornear. Vierta la salsa sobre el pan tostado, extendiéndolo casi hasta los bordes. Ase a la parrilla hasta que esté dorado y ligeramente hinchado. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_welsh_rarebit_29163", "title": "Welsh rarebit", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 6 rebanadas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Azúcar en polvo de 110 g / 4 oz", "4 tomates de ciruela, picados", "2 cucharadas de vinagre de jerez", "½ cucharadita de hojuelas de chile seco", "Manzana de 50g / 2oz, pelada, sin núcleo, picada", "2 ramitas de tomillo fresco, solo hojas", "Queso Ogleshield de 110g / 4oz, o queso de leche de vaca firme similar", "Queso cheddar 110 g / 4 oz, rallado", "50ml / 2fl oz de leche entera", "Harina normal de 25g / 1oz", "Pan rallado de 25 g / 1 oz", "dash salsa Worcestershire", "1 huevo de gallinas camperas", "1 yema de huevo de gallinas camperas", "½ cucharadita de mostaza en polvo inglesa", "sal y pimienta negra recién molida", "4 rebanadas gruesas de pan blanco crujiente"], "method": ["Para la salsa picante de tomate, caliente una sartén hasta que esté caliente, agregue el azúcar impalpable y cocine durante 1-2 minutos, o hasta que el azúcar se haya derretido y tenga un color marrón dorado pálido.", "Agregue los tomates picados, el vinagre, los copos de chile, la manzana y el tomillo y cocine por 2-3 minutos. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para la rarebit galés, precalentar la parrilla a alta.", "Caliente el queso y la leche en una cacerola, revolviendo regularmente, hasta que el queso se haya derretido.", "Agregue la harina y las migas de pan y cocine durante 2-3 minutos más removiendo continuamente.", "Retire la sartén del fuego y déjela enfriar.", "Agregue la salsa Worcestershire, el huevo, la yema de huevo y la mostaza. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Mientras tanto, tuesta ligeramente el pan en un lado. Extienda la mezcla de queso en el lado no tostado del pan y ase a la parrilla durante 1-2 minutos, o hasta que el queso esté burbujeante y dorado. Sirve la rarebit caliente con chutney."], "url": "www_bbc_co_uk_food_recipes_welsh_rarebit_with_46839", "title": "Welsh rarebit con salsa picante de tomate y manzana", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50g / 2oz de mantequilla sin sal", "½ cucharada de azúcar moreno", "4 cebollas, peladas, finamente picadas", "1 cucharadita de mostaza en polvo", "250ml / 9fl oz de caldo de carne", "250ml / 9fl oz de cerveza fuerte o fuerte", "sal y pimienta negra recién molida, al gusto", "Harina normal de 120g / 4oz", "sal y pimienta negra recién molida", "1 huevo grande de gallinas camperas, golpeado", "300ml / 10½ fl oz de leche", "1 cucharada de mantequilla derretida", "2 cucharaditas de perejil fresco picado", "1 cucharadita de tomillo fresco picado", "1 cucharadita de perifollo fresco picado", "2-3 cucharadas de aceite de oliva", "100g / 3½oz de mantequilla sin sal", "3 chalotes, pelados, finamente picados", "Setas de 500g / 17½ oz, finamente picadas", "15g / ½ oz de hongos porcini secos, empapados en agua caliente para ablandar", "1 cucharada de crema doble", "1 huevo blanco de corral", "1 cucharada de perejil fresco picado", "1kg / 2lb filete de res de 2 oz, corte central (preferiblemente carne de vacuno galés)", "sal y pimienta negra recién molida", "1 cucharada de aceite vegetal", "1 paquete de hojaldre confeccionado", "1 huevo de gallinas camperas, golpeado", "2 cucharadas de mantequilla derretida", "2 dientes de ajo, pelados, ligeramente triturados", "1 kg / 2 lb 2 oz patatas harinosas, como Maris Piper o King Edward, peladas, picadas", "sal y pimienta blanca recién molida.", "2 cucharadas de crema doble", "100g / 3½oz de queso de cabra, cortado en cubos pequeños", "1 cucharada de perifollo fresco picado", "50g / 2oz de mantequilla", "2 chalotes, pelados, finamente picados", "Habas de 500g / 17½oz, fuera de sus vainas, membranas internas quitadas, blanqueadas", "150ml / 5fl oz de caldo de pollo", "4 cabezas de lechuga Baby Gem, ralladas"], "method": ["Para la salsa de cebolla, cerveza y mostaza, derrita la mantequilla en una sartén hasta hacer espuma, luego agregue el azúcar. Agregue las cebollas finamente picadas y cocine a fuego lento durante 20-30 minutos, o hasta que estén doradas y caramelizadas.", "Agregue el polvo de mostaza y vierta el caldo y la cerveza y cocine a fuego lento durante 15-20 minutos, o hasta que el líquido se reduzca en volumen a la mitad. Sazonar, al gusto, con sal y pimienta negra recién molida y mantener el calor.", "Para los panqueques, sazone la harina con sal y pimienta negra recién molida y mezcle con el huevo batido hasta que esté bien combinado. Poco a poco agregue la leche, batiendo continuamente, hasta que la mezcla se una como una mezcla suave con la consistencia de crema doble. Agregue la mantequilla derretida y bata hasta que quede suave. Agregue las hierbas picadas y déjelas reposar durante 20 minutos.", "Caliente el aceite de oliva en una sartén antiadherente y agregue unas cucharadas de la pasta de panqueque, extendiéndola en un círculo. Cocine por 1-2 minutos, o hasta que estén doradas por debajo, luego voltee cuidadosamente y cocine durante 1-2 minutos más, o hasta que estén doradas por completo y cocidas. Repita con la mezcla restante de panqueques para hacer 2-3 panqueques, agregando más aceite a la sartén según sea necesario.", "Cortar los panqueques en cuadrados, colocarlos sobre una bandeja del horno forrada con papel resistente a la grasa y dejarlos a un lado.", "Para los duxelles, derrita la mantequilla en una sartén hasta que forme espuma, luego agregue las chalotas y fría por 3-4 minutos, o hasta que se ablanden. Agregue los champiñones y cocine con la tapa durante 4-5 minutos, o hasta que estén tiernos.", "Escurrir los hongos porcini empapados y picar finamente, luego agregar a la sartén con los champiñones. Agregue la crema y cocine con la tapa durante 4-5 minutos, o hasta que la mayor parte del líquido se haya evaporado y la mezcla esté espesa y cremosa.", "Dejar de lado para enfriar. Una vez que se haya enfriado, agregue el perejil y la clara de huevo. Transfiera la mezcla a un procesador de alimentos y mezcle hasta que la mezcla forme una pasta gruesa.", "Extienda los hongos duxelles en una capa pareja sobre los panqueques, cubra la bandeja con film transparente y enfríe en el refrigerador hasta que los duxelles se hayan solidificado.", "Para la carne Wellington, precaliente el horno a 180 ° C / 350 ° F / Gas 4.", "Sazonar la carne con sal y pimienta negra recién molida. Caliente una sartén hasta que esté muy caliente, luego agregue el aceite vegetal. Dore la carne por 2-3 minutos, volteándola ocasionalmente, hasta que la carne esté dorada por todas partes. Dejar de lado para enfriar.", "Estirar la masa a un rectángulo de 20cm x 30cm / 8in x 10in y colocar los panqueques alineados en duxelles sobre la masa. Coloque el filete de carne sellada en el medio, luego dibuje la masa y los panqueques sobre la carne, envolviéndola por completo. Selle los extremos de la masa con algo del huevo batido.", "Corta unos agujeros en la parte superior de la masa para permitir que salga el vapor. Cepille todo el pastel con el huevo batido restante, luego coloque la carne Wellington en una bandeja para hornear. Hornee el Wellington en el horno durante 25-30 minutos (para carne rara) o hasta que la masa esté dorada y crujiente. Mantener caliente", "Para el puré de queso de cabra, ajo y perifollo, derrita la mantequilla en una sartén y agregue el ajo ligeramente triturado. Retire del fuego y deje en infusión durante 30 minutos.", "Cocine las papas en una sartén con agua salada hirviendo durante 10-12 minutos, o hasta que estén tiernas, luego escurra las papas y vuelva a la sartén. Vuelva a colocar sobre el calor para eliminar el exceso de humedad, luego mezcle con un machacador de papas hasta que quede suave.", "Agregue la crema, el queso de cabra y la mantequilla con ajo, luego doble el perifollo picado. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para las habas, lechuga y chalotes, derrita la mantequilla en una sartén y fríe los chalotes durante 3-4 minutos, o hasta que estén blandos.", "Agregue las habas blanqueadas y el caldo de pollo a la sartén y deje hervir a fuego lento. Mezcle la lechuga Baby Gem rallada en la sartén y cocine por 1-2 minutos, o hasta que esté tierna.", "Para servir, corte grueso la carne Wellington y divídala entre platos para servir. Ponga a un lado el puré de queso de cabra, ajo y perifollo, seguido de las habas, lechuga y chalotes. Rocíe la salsa de cebolla, cerveza y mostaza y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_welshblackbeefwellin_92243", "title": "Carne de vaca Welsh Black Wellington con queso de cabra, puré de ajo y perifollo y salsa de cerveza", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["225g / 8oz de harina de auto crianza, tamizada", "Mantequilla salada de 110 g / 4 oz (preferiblemente galés)", "1 huevo de gallinas camperas", "puñado de sultanas", "leche, si es necesario", "85g / 3oz de azúcar en polvo", "mantequilla extra, para engrasar"], "method": ["Frote la grasa en la harina tamizada para hacer migas de pan. Agregue el azúcar, la fruta seca y luego el huevo. Mezcle para combinar, luego forme una bola de masa, usando un chorrito de leche si es necesario.", "Estirar la masa hasta que tenga un grosor de 5 mm / ¼ pulgadas y cortar en rondas con un cortador acanalado de 7,5-10 cm.", "Ahora necesita una bakestone o una gruesa plancha de hierro. Frote con mantequilla y limpie el exceso de distancia. Póngalo a fuego directo y espere hasta que se caliente, coloque las tortas galesas en la plancha, dando vuelta una vez. Necesitan unos 2-3 minutos por cada lado. Cada lado debe ser de color caramelo antes de girar, aunque algunas personas que conozco casi se queman.", "Retire de la sartén y espolvoree con azúcar en polvo mientras todavía está caliente. Algunas personas dejan de lado la fruta seca, y los dividen cuando están fríos y los unen con mermelada."], "url": "www_bbc_co_uk_food_recipes_welshcakes_67264", "title": "Pasteles galeses clásicos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Hace aprox. 4-6 tortas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/welshcakes_67264_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["225g / 8oz de harina autoacabada, más extra para quitar el polvo", "½ cucharadita de especias mixtas", "pizca de sal", "85g / 3oz de azúcar en polvo", "1 limón, ralladura solamente", "115g / 4oz de mantequilla", "85g / 3oz sultanas", "1 huevo grande de gallinas camperas, golpeado", "leche si es necesario", "manteca de cerdo, para engrasar", "Yemas de huevo de granja de 175g / 6oz", "90 g / 3½ oz de azúcar en polvo", "375ml / 13fl oz crema batida", "125ml / 4fl de leche en oz", "1 vaina de vainilla, dividida longitudinalmente y semillas raspadas", "canela molida", "nuez moscada recién rallada", "12 albaricoques, cortados a la mitad y apedreados", "1 cucharada de azúcar en polvo", "botón de mantequilla sin sal"], "method": ["Primero haz los pasteles de Gales. Tamiza la harina, mezcla las especias y la sal en un tazón y agrega el azúcar y la ralladura de limón. Frote la mantequilla hasta que la mezcla tenga una textura similar a la miga. Agregue las sultaninas y mezcle, luego mezcle el huevo batido con un tenedor. Reunir en una masa. Si está demasiado seco, agregue una pizca de leche.", "Convierta la masa en una tabla ligeramente enharinada y extiéndala a aproximadamente 5 mm / ¼ de grosor. Usando una placa lateral grande o un cortador liso redondo de 10 cm / 4 in, corte cuatro rondas. También necesita cortar cuatro rondas de 2 cm / 1 in. Corte la masa restante en rondas u otras formas de cualquier tamaño, volviendo a enrollar las guarniciones según sea necesario (estas tortas se usarán para el helado).", "Engrase ligeramente una plancha con manteca y luego caliente a fuego lento. Comience con una torta o dos para el helado para probar el calor de la plancha. Cocine ligeramente todos los pasteles durante 20-30 segundos en cada lado o hasta que estén dorados. Deja enfriar.", "Para hacer el helado, bata los huevos y el azúcar en un bol hasta que estén pálidos. Pon la crema y la leche en una cacerola y raspa las semillas de la vaina de vainilla junto con la vaina. Caliente hasta que hierva, luego vierta un poco sobre la mezcla de huevo y mezcle.", "Vierta esta mezcla en el resto de la mezcla de crema caliente en la sartén y cocine, revolviendo, hasta que se espese lo suficiente como para cubrir el revés de una cuchara de madera. Tenga cuidado de no dejar hervir la crema. Retirar de la sartén y enfriar sobre hielo, luego colar.", "Batir la natilla en una máquina de helados. Tan pronto como esté listo, espolvoree 300 g / 10½ oz de tartas galés desmenuzadas y termine con canela molida y nuez moscada al gusto. Transfiera a un contenedor y congele durante aproximadamente dos horas para endurecer.", "Para los albaricoques, cocine los albaricoques con el azúcar y la mantequilla hasta que estén suaves.", "Para servir, espolvorea los albaricoques calientes encima de los grandes pasteles galeses. Agregue una bola de helado a cada plato y adorne cada uno con un pequeño pastel de Gales."], "url": "www_bbc_co_uk_food_recipes_welshcakeswithroaste_82041", "title": "Tortas galesas con albaricoques asados ​​y helado de pastel de Gales", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6 zanahorias baby, peladas y picadas", "2 cucharadas de vinagre", "2 cucharadas de azúcar moreno", "2 cucharadas de perejil picado", "¼ melocotón, picado", "55 g / 2 oz de mantequilla", "Harina normal de 55g / 2oz", "¼ de leche en polvo", "Queso cheddar 85 g / 3 oz, rallado", "dash worchester salsa", "guión de Tabasco", "1 cucharadita de mostaza en polvo", "sal", "pimienta negra recién molida", "2 rebanadas de chapata / pan tostado"], "method": ["Para hacer el chutney, caliente las zanahorias en una olla pequeña. Agregue el vinagre, el azúcar, el perejil y las piezas de melocotón. Reduzca el fuego y cocine a fuego lento durante 10-12 minutos, revolviendo ocasionalmente.", "Para la rarebit, derrita suavemente la mantequilla en una sartén. Agregue la harina para crear un roux. Vierta la leche y revuelva continuamente para crear una salsa espesa. Retire del fuego y agregue el queso hasta que se derrita.", "Agregue la salsa Worcester, el tabasco, la mostaza en polvo y el condimento, y mezcle, para crear una mezcla espesa, casi pegajosa.", "Extienda la mezcla rarebit en el pan tostado y ase a la parrilla durante 2-3 minutos, hasta que se dore.", "Transfiera a un plato de servir y espolvoree la salsa picante para servir."], "url": "www_bbc_co_uk_food_recipes_welshrarebitwithcarr_79156", "title": "Welsh rarebit con salsa picante de zanahoria", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4-5 manzanas grandes para cocinar", "100g / 3½ oz de azúcar", "1 cucharadita de manteca de cerdo", "Pasta de copos de 300g / 10½oz", "150g / 5oz de queso Wensleydale, rebanado", "crema batida, para servir"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Pelar las manzanas y cortar en rodajas gruesas.", "Coloque en una sartén con dos cucharadas de agua y cocine hasta que se ablanden: las manzanas deben conservar su forma, pero deben comenzar a desprenderse por los bordes.", "Retire del fuego y vierta el exceso de líquido. Agregue todo menos una cucharadita de azúcar a las manzanas y revuelva. Deja enfriar.", "Engrase un plato de pastel con manteca de cerdo. Extienda 200 g / 7 oz de la masa en un círculo con la forma de su plato de pastel, y luego con cuidado la línea del plato con la masa.", "Coloque la mitad de la mezcla de manzana en el molde para pastel y aplaste. Coloque las rebanadas de queso encima. Coloque las manzanas restantes encima del queso.", "Extienda el resto de la masa al tamaño del plato de tarta. Humedece el borde de la masa que recubre el plato de tarta con agua. Cubra con la tapa de pastelería preparada. Presione alrededor de los bordes con la yema del pulgar para sellar el pastel.", "Cepille la parte superior del pastel con agua y espolvoree la cucharada restante de azúcar sobre la parte superior.", "Corte dos ranuras en el centro del pastel para permitir que salga el vapor mientras se cocina el pastel.", "Coloque en el estante inferior del horno y cocínelo durante unos 35 minutos hasta que esté dorado - compruebe el pastel después de 20 minutos y si se está poniendo demasiado dorado, reduzca la temperatura a 160 ° C / 300 ° F / Gas 2).", "Dejar enfriar y servir caliente con crema batida."], "url": "www_bbc_co_uk_food_recipes_wensleydaleapplepie_83718", "title": "Pastel de manzana Wensleydale", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50g / 2oz de mantequilla", "150 g / 5 oz de champiñones, en rodajas", "3 lonchas de tocino ahumado, picadas", "Harina normal de 35g / 1oz", "190ml / 6½ fl oz de leche", "pimienta negra recién molida", "150g / 5oz de queso Wensleydale", "pan integral, para servir"], "method": ["Derrita la mantequilla a fuego medio, antes de agregar los champiñones y el tocino.", "Cuando los champiñones y el tocino estén cocidos, agregue la harina y mezcle bien. Continúe removiendo por un par de minutos más para cocinar la harina.", "Retire del fuego y vierta la leche y un poco de pimienta negra molida al gusto.", "Precalentar la parrilla a caliente.", "Vuelva a colocar la sartén sobre la placa y revuelva continuamente hasta que hierva. Retire del fuego y agregue tres cuartos del queso.", "Divida la mezcla en cuatro moldes, espolvoree sobre el queso restante y colóquelo bajo la parrilla caliente hasta que se dore y burbujee. Sirve con pan integral."], "url": "www_bbc_co_uk_food_recipes_wensleydalemushrooms_83714", "title": "Setas Wensleydale", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Queso duro de cabra duro de 110g / 4oz (como Blackwater), rallado", "½ cucharadita de pimienta negra agrietada", "2 cucharadas de aceite de oliva", "2 rebanadas de tocino rayado, cortado en rodajas de 5 mm / ¼ in de espesor", "1 diente de ajo, finamente cortado", "Pan de masa fermentada de 85 g / 3 oz (u otro pan de su elección), cortado en cubos de 1 cm / ½ en cubitos", "220g / 8oz de queso de cabra suave (como Mine Gabhar), cortado en trozos", "Fresas pequeñas de 110 g / 4 oz, mondadas y partidas por la mitad", "Frambuesas 110g / 4oz", "gran cantidad de hierbas frescas de verano mezcladas (por ejemplo, cebollino, eneldo, menta y orégano)", "50g / 2oz de hojas de ensalada mixta", "2-3 cucharadas de vinagreta de frambuesa"], "method": ["Para las cestas de queso, caliente una sartén antiadherente hasta que esté muy caliente. Espolvoree un cuarto del queso duro de cabra en el centro de la sartén en un círculo de unos 10 cm de diámetro. Espolvoree con un poco de pimienta negra y cocine por 2-3 minutos hasta que la grasa comience a separarse del queso y las burbujas. Retire del fuego y deje enfriar por un minuto.", "Usando una espátula, retire el disco de queso derretido de la sartén. Forme el disco de queso en una cesta alrededor del extremo de un vaso alto de lados rectos y sostenga durante 30 segundos a un minuto, o hasta que se endurezca lo suficiente como para mantener su forma. Transfiera a una rejilla de alambre y permita que se enfríe por completo.", "Repita con los ingredientes restantes hasta que tenga cuatro cestas de queso.", "Calentar una sartén hasta que esté caliente. Agregue el aceite de oliva y el tocino y fría por 1-2 minutos, hasta que estén dorados.", "Agregue el ajo y el pan de masa fermentada y saltee durante 3-4 minutos hasta que estén dorados y crujientes.", "Para elaborar la ensalada, coloque el queso de cabra suave, las fresas, las frambuesas, las hierbas y las hojas mezcladas en un tazón. Rocíe suficiente vinagreta de frambuesa para cubrir ligeramente los ingredientes en el tazón.", "Para servir, coloque las cestas de queso en los platos para servir y espolvoree la mezcla de ensalada de fruta y ensalada. Adorne con el tocino y los crotones."], "url": "www_bbc_co_uk_food_recipes_wexfordstrawberrysal_83818", "title": "Ensalada de fresas con una canasta de queso Blackwater con pimienta", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["150g / 5½oz de queso Wensleydale rallado", "2 cucharadas de mostaza integral", "2 yemas de huevo de gallinas camperas", "4 rebanadas de pan crujiente", "perejil fresco picado, para adornar"], "method": ["Precalentar la parrilla a mediano.", "Coloque el queso, la mostaza y las yemas de huevo en un tazón pequeño y mezcle bien.", "Coloque las rebanadas de pan en una bandeja para hornear y tueste debajo de la parrilla, dándoles vuelta una vez, hasta que estén ligeramente doradas en ambos lados.", "Extienda la mezcla de queso en un lado de cada rebanada de pan y colóquela debajo de la parrilla hasta que se dore y burbujee.", "Para servir, deje que se enfríe un poco, luego divida las raras entre dos platos y espolvoree con perejil."], "url": "www_bbc_co_uk_food_recipes_wensleydalerarebit_87211", "title": "Wensleydale rarebit", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Papas de 250g / 9oz, peladas y cortadas en cubos de 2.5cm / 1in", "2 zanahorias, peladas y cortadas en rodajas de 7,5 mm / ⅜ de grueso", "50g / 1¾oz de mantequilla", "1 puerro, cortado, limpiado y cortado en láminas finas", "200g / 7oz de piezas de tocino para cocinar / tocino para cocinar cortado en cubitos, piezas más grandes cortadas en cubos", "50g / 1¾oz de harina natural", "200ml / 7fl oz de jugo de manzana", "300ml / 10½ml de leche", "sal y pimienta negra", "1 manojo de tomillo fresco, hojas recogidas", "2 cucharadas de aceite de oliva"], "method": ["En una olla con agua hirviendo, hierva las papas durante siete minutos o hasta que estén medio cocidas. Agregue las zanahorias y continúe hirviendo durante 7-8 minutos más, o hasta que las zanahorias y las papas estén tiernas. Retire del fuego y drene.", "Mientras tanto, caliente una sartén grande a fuego medio. Agregue la mantequilla y, una vez derretida, fríe con cuidado el puerro y el tocino juntos durante 7-8 minutos, o hasta que los puerros estén suaves y el tocino dorado.", "Precalentar la parrilla a caliente.", "Espolvoree la harina en la sartén con el tocino, revuelva y cocine con el fuego durante un minuto. Poco a poco agregue el jugo de manzana y la leche, revolviendo a medida que agrega hasta que tenga una salsa suave. Deje que hierva a fuego lento y cocine a fuego lento durante dos minutos.", "Agregue las papas cocidas y las zanahorias a la sartén y mezcle bien para que todo quede cubierto con la salsa. Pruebe y sazone con sal y pimienta al gusto.", "Inclínelo en una fuente para horno mediana a prueba de horno (aproximadamente 28x22cm / 11x8½ pulgadas de tamaño). Espolvorear generosamente con hojas de tomillo frescas y un chorrito de aceite de oliva. Coloque debajo de la parrilla precalentada por 10 minutos, o hasta que esté dorado y caliente."], "url": "www_bbc_co_uk_food_recipes_west_country_gratin_08209", "title": "Gratén del oeste del país", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/west_country_gratin_08209_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pechuga de gallina de guinea alimentada con trigo (piel encendida)", "sal y pimienta negra recién molida", "dash light fruity aceite de oliva", "piel de 1 gallina de Guinea (desde arriba)", "20 g / ¾oz de brioche migas", "5 g de semillas de girasol tostadas, aplastadas", "Consomé de pollo claro 400ml / 14fl oz o caldo de pollo fuerte", "3 cucharaditas de puré de hierbas suaves", "1 mantequilla perilla", "2 cucharaditas de crème fraîche", "gran pizca de acedera salvaje finamente triturada", "dash aceite de oliva", "½ chalote, cortado en cubitos", "40 g / 1½ oz pequeñas setas de San Jorge", "½ diente de ajo asado, aplastado", "2 cucharaditas de cebollines cortados", "3 lanzas de espárragos, preferiblemente Formby", "azúcar pizca", "1 perilla de mantequilla derretida", "acelga silvestre triturada, al gusto", "pocas hojas de alazán de vena roja"], "method": ["Para las gallinas de Guinea, precaliente la parrilla a altura. Retire la piel de la pechuga de gallina de Guinea. Deja de lado el pecho de gallina de Guinea.", "Para la miga de brioche, precaliente el horno a 180C / 350F / Gas 4.", "Coloque la piel de gallina de Guinea plana en una bandeja de hornear antiadherente y coloque otra bandeja en la parte superior (esto es para cocinar la piel de manera uniforme).", "Coloque las bandejas en el horno y cocine de 5 a 8 minutos o hasta que estén crujientes. Retire del horno y retire la piel de la bandeja para que se enfríe.", "Cuando la piel esté fría, corte a fondo la piel para obtener una migaja áspera.", "Coloque en un tazón con las migas de brioche y las semillas de girasol tostadas. Sazone ligeramente con un poco de sal.", "Para las pintadas, coloque la pechuga de gallina de Guinea entre dos hojas de película adhesiva y golpee el pecho con un cuchillo pesado para igualar el grosor; intente conservar la forma.", "Precalentar la parrilla a caliente. Sazone ligeramente la pechuga de gallina de Guinea con sal y pimienta negra recién molida y colóquela en una bandeja de asar. Rocíe con un poco de aceite de oliva y cocine a la parrilla durante cinco minutos, o hasta que el pecho esté recién hecho.", "Una vez cocido, cubra uniformemente la parte superior de la gallina de Guinea con la miga de brioche y colóquela de nuevo debajo de la parrilla durante 1-2 minutos, o hasta que la miga del brioche esté ligeramente dorada.", "Para la salsa de acedera, caliente el consomé de pollo o el caldo en una sartén. Retire de la estufa y mezcle el puré suave de hierbas, la mantequilla y la crema fresca con una batidora de mano, hasta que se disuelva por completo. Pruebe y agregue sal y pimienta negra recién molida si es necesario. Agregue el alazán silvestre rallado.", "Para los hongos St George, caliente el aceite en una sartén pequeña y fría la chalota hasta que esté blanda pero sin color.", "Agregue los champiñones y el ajo y sazone con una pizca de sal", "Cocine por 2-3 minutos, o hasta que los champiñones estén tiernos. Retire de la sartén, revise el condimento y agregue sal o pimienta si es necesario, y termine con las cebolletas cortadas.", "Para los espárragos, doble cada barra de espárragos cerca del extremo. Se romperán naturalmente donde la lanza ya no sea dura. Para una presentación elegante, afeite uniformemente el extremo de cada barra de espárragos para hacer una lanza.", "Poner a hervir un recipiente con agua y sazonar con sal y azúcar", "Coloque los espárragos en el agua y cocine por 1-2 minutos, o hasta que los espárragos estén recién cocinados. Debería poder deslizar un cuchillo pequeño a través del tallo.", "Retire del agua con una cuchara ranurada, cepille con la mantequilla derretida y sazone con un poco de sal.", "Para servir, corte la pechuga de gallina de Guinea por la mitad en diagonal. Coloque en el centro del plato superponiendo ligeramente las dos piezas (lo que le da al plato un poco de altura)", "Coloque los champiñones y las puntas de espárragos alrededor del pecho. Rocíe la salsa delicadamente y espolvoree el alazán sobre las verduras. Coloque la acedera roja en la parte superior y sirva."], "url": "www_bbc_co_uk_food_recipes_wheat-fed_guinea_fowl_09962", "title": "Pintada alimentada con trigo, migas de brioche, grosellas espinosas, espárragos, setas de San Jorge y alazán silvestre", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200g / 7oz de trigo integral, remojado durante 24 horas en varios cambios de agua (o como alternativa, use 440g / 15 oz de trigo cocido en conserva, también llamado pastiera di grano, disponible en algunas tiendas de delicatessen italianas)", "500 ml / 1 litro de leche (si está remojando el trigo entero)", "½ limón, solo ralladura", "1 cucharadita de canela molida", "2 cucharaditas de azúcar de vainilla (haz tu propia adición agregando una vaina de vainilla a una olla de azúcar, deja durante 1-2 días para que se desarrolle el sabor)", "½ naranja, solo ralladura", "300g / 10oz de queso ricotta", "4 huevos grandes de gallinas camperas, separados", "125ml / 4½fl oz de agua de flor de naranja (disponible en grandes supermercados y delicatessen especializadas de Oriente Medio)", "Cáscara confitada de 150g / 5oz, finamente picada", "225 g / 8 oz de azúcar en polvo", "mantequilla, para engrasar", "azúcar en polvo, para quitar el polvo", "150 g / 5 oz de azúcar en polvo", "150 g / 5 oz mantequilla o manteca de cerdo", "3 yemas de huevo grandes de gallinas camperas", "Harina normal de 300g / 10oz"], "method": ["Para el llenado, escurra el trigo integral empapado (si está usando) y colóquelo en una sartén con la leche y la ralladura de limón. Cocine a fuego lento durante 3-4 horas a fuego lento.", "Cuando el grano esté tierno, agregue la canela molida, el azúcar de vainilla y la ralladura de naranja. Retirar del fuego, enfriar, tapar y colocar en la nevera hasta el día siguiente.", "Para la masa, coloque el azúcar, la mantequilla y los huevos en un bol y bata hasta que quede suave. Agregue la harina y revuelva para hacer una pasta suave. Reserve en un lugar fresco durante al menos una hora.", "Precalentar el horno a 190C / 375F / Gas 5.", "Para continuar con el llenado, si ha empapado el trigo integral (según las instrucciones anteriores), retírelo de la nevera. Si está utilizando el trigo cocido en lata, agréguelo a la ralladura de limón, la canela, el azúcar de vainilla y la ralladura de naranja.", "Batir la ricota en un tazón grande con las yemas de huevo y el agua de la flor de naranja. Agregue las piezas de cáscara confitada y el grano con sabor a la mezcla de ricotta.", "Batir las claras de huevo en un recipiente aparte con el azúcar hasta que estén suaves y esponjosas. Dóblalos suavemente en la ricota usando una cuchara grande de metal.", "Unte con mantequilla una lata de flan grande de 35cm / 14in de diámetro.", "Haga rodar dos tercios de la masa en un círculo que cubra la base de la lata, así como los lados. Presione esta masa en el molde de flan, cubriendo el fondo y los lados con el mismo grosor.", "Vierta la mezcla de ricotta en la caja de pastelería. Estirar los pasteles restantes, cortarlos en tiras largas y usarlos para hacer una tapa de celosía para la tarta.", "Hornee en el horno por unos 45 minutos.", "Dejar enfriar y espolvorear con azúcar glas. Servir en rebanadas"], "url": "www_bbc_co_uk_food_recipes_wheattartpastieradig_91172", "title": "Tarta de trigo (Pastiera di grano)", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Sirve 10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 galleta de trigo", "1 plátano pequeño (75 g / 2½ oz de peso pelado), en rodajas", "1 pasas de uva apiladas", "125ml / 4fl oz de leche desnatada"], "method": ["Coloque todos los ingredientes en un tazón de cereal y sirva."], "url": "www_bbc_co_uk_food_recipes_wheat_cereal_with_banana_94651", "title": "Cereal de trigo con plátano y pasas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]