[{"ingredients": ["300g / 10½ oz de harina natural, más extra para espolvorear", "1½ cucharada de polvo de curry Madras", "1½ cucharada de cúrcuma molida", "pizca de sal", "165 g / 5¾oz de mantequilla sin sal, refrigerada y en cubos", "1 huevo grande de gallinas camperas, golpeado", "2 cucharadas de aceite de colza", "1 cebolla, finamente picada", "4 dientes grandes de ajo, aplastados", "2 cucharaditas de polvo de curry Madras", "2½ cucharadas de cebollines cortados", "1½ cucharadas de hojas de tomillo picadas", "300 g / 10½ oz de carne picada magra", "125ml / 4fl oz de caldo de carne", "1 cucharadita de azúcar melaza", "1 cucharadita de salsa picante de bonete Scotch o 1cm / ½ en pieza de Scotch bonnet chilli, finamente picada", "1 rebanada de pan blanco o integral, desgarrado en pedazos pequeños", "sal y pimienta negra recién molida", "2 cucharadas de aceite de colza", "1 cucharada de jugo de naranja recién exprimido", "2 cucharadas de jugo de lima", "1½ cucharadita de miel", "1½ cucharadita de azúcar en polvo", "1½ cucharadita de jengibre rallado", "sal y pimienta negra recién molida", "8 tomates patrimonio, en rodajas", "4 naranjas pequeñas, peladas y en rodajas", "¼ cebolla roja, finamente rebanada", "sal y pimienta negra recién molida", "flores comestibles", "micro cilantro", "amaranto rojo"], "method": ["Precalentar el horno a 220 C / 200 Fan / Gas 7.", "Para la repostería, mezcle la harina, el polvo de curry, la cúrcuma y la sal en el recipiente de un procesador de alimentos. Agregue la mantequilla y el pulso hasta que la mezcla se vea como arena gruesa. Con el motor en marcha, agregue gradualmente 4-6 cucharadas de agua helada hasta que la masa comience a unirse. Agregue solo agua suficiente para unir la masa.", "Enrolla la masa en una bola y envuélvela en una película adhesiva. Déjalo reposar en la nevera durante 30 minutos. (También puede preparar los pasteles para esta receta por adelantado, simplemente vuelva a la temperatura ambiente antes de extenderlos).", "Para el relleno, caliente el aceite en una cacerola grande, agregue la cebolla y una pizca de sal y cocine durante unos 5-10 minutos hasta que se ablande. Agregue el ajo, el curry en polvo, el cebollino y el tomillo (y si usa un bonete escocés nuevo, agregue esto también). Deja cocinar por otro minuto, hasta que se liberen los aromas. Agregue la carne picada, rompiéndola con una cuchara de madera y deje que se dore por 5 minutos.", "Agregue la salsa picante, el azúcar y el bonete escocés, deje hervir y reduzca el fuego. Cubra la olla con una tapa y deje que la mezcla hierva a fuego lento durante aproximadamente 10 minutos. Agregue el pan, vuelva a colocar la tapa en la sartén y deje que la mezcla continúe cocinando a fuego lento por otros 10 minutos. Retire la sartén del fuego, sazone con sal y pimienta y deje enfriar.", "Retire la masa del refrigerador y extiéndala con un rodillo para harina sobre una hoja grande de papel resistente a la grasa con un espesor de aproximadamente 3 mm. Recorta seis círculos de la masa, usando una placa lateral como guía para el tamaño.", "Divida el relleno entre los seis círculos, agregando la mezcla a la mitad de cada círculo de repostería y dejando espacio alrededor del borde para permitir el sellado de la masa. Moje los bordes de la masa y doble la mitad no llena de la masa sobre la mitad llena y use una horquilla para presionar hacia abajo alrededor de los bordes. Dejar enfriar a temperatura ambiente.", "Coloque las hamburguesas en una bandeja para hornear, cepille con el huevo y hornee durante 20 minutos, o hasta que la masa esté dorada y cocida.", "Para el aderezo de jengibre y cítricos, mezcle todos los ingredientes, asegurándose de que estén bien combinados. Condimentar con sal y pimienta.", "Para la ensalada, coloque el tomate, la naranja y la cebolla roja en los platos para servir y vierta sobre el aderezo. Espolvorea una pizca de sal marina y pimienta. Dejar reposar durante 20 minutos a temperatura ambiente, para permitir que se desarrollen los sabores.", "Coloque las hamburguesas en los platos con la ensalada. Adorne con las flores, cilantro y amaranto rojo y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_jamaican_beef_patties_28917", "title": "Hamburguesas de carne de Jamaica con ensalada de jengibre, tomate y naranja", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharadita de semillas de cilantro", "1 cucharadita de semillas de comino", "1 cucharadita de semillas de mostaza negra", "1 cucharadita de pimienta negra", "½ cucharadita de pimienta de cayena", "½ cucharadita de cúrcuma molida", "3 cucharadas de aceite de girasol", "40 g / 1½ oz de mantequilla", "1 cebolla grande, finamente picada", "2 dientes de ajo, aplastados", "Jengibre fresco de la raíz de los 5cm / 2in, pelado y rallado fino", "1 cucharadita de azúcar blanda marrón claro", "1 x 200 g / 7 oz pueden cortar tomates", "1 lima, solo jugo", "1 x 400ml / 14fl oz de lata de leche de coco", "2 hojas de laurel", "4 x 225 g / 8 oz trozos de pargo rojo", "sal y pimienta negra recién molida", "350g / 12 oz de arroz basmati", "2 cucharadas de aceite de girasol", "4 dientes", "4 vainas de cardamomo verde, agrietadas", "Palo de canela de 5cm / 2in", "laurel", "600ml / 1 pinta de agua hirviendo", "½ cucharadita de sal", "Harina normal 225g / 8oz", "1 cucharadita de polvo de hornear", "1 cucharadita de sal", "40g / 1½ oz de mantequilla fría", "aceite vegetal o ghee para cocinar"], "method": ["Para el pargo al curry, moler las especias enteras en un polvo con un mortero o una mini batidora de alimentos y mezclar con la pimienta de cayena y la cúrcuma.", "Caliente el aceite y la mantequilla en una sartén grande y poco profunda. Agregue la cebolla y freír suavemente hasta que esté suave y apenas empiece a dorarse.", "Agregue el ajo, el jengibre, el azúcar y la mezcla de especias y cocine por otros 2-3 minutos.", "Agregue los tomates, jugo de lima, leche de coco, hojas de laurel y un poco de sal y pimienta negra recién molida y cocine a fuego lento durante 10 minutos, revolviendo de vez en cuando, hasta que espese un poco.", "Agregue los filetes de pargo, con la piel hacia abajo, y espolvoree un poco de salsa sobre ellos. Cocine a fuego lento destapado durante 10 minutos, girando cuidadosamente el pescado a la mitad. Retire las hojas de laurel antes de servir.", "Para el pilau, lava el arroz en varios cambios de agua fría hasta que el agua corra relativamente clara. Cúbralo con más agua fría y déjelo en remojo durante siete minutos, luego drene bien.", "Caliente el aceite de girasol en una sartén de fondo grueso de 20 cm (8 pulgadas), agregue los dientes, las vainas de cardamomo, la rama de canela y la hoja de laurel y cocine suavemente a fuego lento durante 2-3 minutos hasta que empiecen a oler aromáticamente.", "Agregue el arroz, agregue el agua hirviendo y la sal y rápidamente llévelo a ebullición. Revuelva una vez, cubra con una tapa ajustada y cocine a fuego lento durante 12 minutos.", "Descubre y esponja los granos con un tenedor.", "Para el roti, tamice la harina, el polvo de hornear y la sal en el tazón de un procesador de alimentos. Agregue la mantequilla y mezcle hasta que la mezcla se vea como pan rallado fino.", "Transfiera a un tazón y agregue cinco cucharadas de agua fría para hacer una masa dura pero suave. Cubra y deje en un lugar cálido durante 30 minutos.", "Cuando esté listo, amase la masa sobre una superficie ligeramente enharinada hasta que quede suave, luego forme cuatro bolas. Aplanar ligeramente y extender en rondas de 23 cm (9 pulgadas) de aproximadamente 5 mm (0,2 pulgadas) de espesor.", "Cepíllese con aceite o ghee, pliéguelo por la mitad, luego en cuartos, revuelva en forma de bolas y luego despliegue nuevamente.", "Caliente una sartén seca de base pesada o una plancha plana a fuego medio.", "Cepille cada roti por turno con un poco más de aceite o ghee, agregue un roti a la sartén y cocínelo durante 3-4 minutos, volteándolo con frecuencia y cepillándolo con aceite cada vez que lo haga.", "Retírelo de la sartén, colóquelo en la palma de su mano y aplauda con sus manos 3-4 veces, teniendo cuidado de no quemarse (es posible que deba usar guantes para el horno).", "Envuelva el roti en un paño de cocina y manténgalo caliente mientras cocina el resto.", "Sirva el pargo al curry con el pilau y el roti."], "url": "www_bbc_co_uk_food_recipes_jamaicancurriedsnapp_79925", "title": "Pargo al curry jamaicano con coco y lima servido con rotulador", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["250ml / 9fl oz de crema batida", "100g / 3½oz de chocolate con leche, finamente picado", "200 g / 7 oz de chocolate negro, finamente picado", "25 g / 1oz de mantequilla sin sal, cortada en cubitos", "2-3 cucharadas de ron oscuro", "5 cucharadas de cacao en polvo, para quitar el polvo"], "method": ["Calienta la crema en una sartén pequeña, retirándola del fuego justo antes de que hierva.", "Mientras tanto, ponga el chocolate con leche y el chocolate negro en un tazón grande y, una vez que la crema se haya desprendido del fuego, viértalo sobre el chocolate. Revuelva bien hasta que se derrita y suavice.", "Agregue la mantequilla y suficiente ron al gusto y mezcle bien. Deje enfriar y luego cubra la mezcla de chocolate con film transparente y transfiéralo a la nevera durante al menos cuatro horas, o durante la noche; el chocolate se endurecerá.", "Alinee una bandeja grande con papel pergamino. Tamiza la mitad del polvo de cacao en cada una de las dos placas grandes. Uno será para desempolvar sus manos y el otro para cubrir las trufas.", "Use una cucharilla o un baller de melón para recoger trozos del tamaño de una nuez (aproximadamente 15 g / ½ oz) de la mezcla de chocolate. Presione las palmas de sus manos en una de las placas de polvo de cacao para cubrir ligeramente y enrollar las piezas de trufa rápidamente en forma de bola. No enrolles el chocolate en tus manos demasiado tiempo o comenzará a derretirse.", "Enrolle la trufa en el polvo de cacao en la otra placa para cubrir ligeramente y colocar en la bandeja. Repita hasta que toda la mezcla se use para dar aproximadamente 40 trufas en total, presionando sus manos en más cacao en polvo cuando sea necesario para evitar que se pegue. Lo mejor es lavarse las manos varias veces durante el proceso, pero asegúrese de enjuagarlas con agua fría antes de secarlas para que queden frías y bonitas para evitar que se derritan las trufas.", "Cubra y deje enfriar en la nevera durante al menos 30 minutos antes de servir."], "url": "www_bbc_co_uk_food_recipes_jamaican_rum_truffles_09151", "title": "Trufas de ron de Jamaica", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 10}, "serves": "Hace 40 trufas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/jamaican_rum_truffles_09151_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["300g / 10½oz de macarrones secos", "40g / 1¾oz de mantequilla", "Harina simple de 40g / 1¾oz", "500ml / 18fl de leche en oz", "100g / 3½oz de queso azul, preferiblemente gorgonzola suave, rallado o cortado en cubitos finos", "Cheddar 150 g / 5½ oz, rallado", "100 g / 3½ oz Caerphilly, rallado", "½ cucharadita de nuez moscada recién rallada, o al gusto", "Tocino de 90g / 3oz, picado", "Mozzarella 100 g / 3½ oz, picada", "75g / 3oz de pan rallado fresco", "25g / 1oz de parmesano recién rallado", "grandes hojas de albahaca fresca, picadas, para servir", "1 cucharada de mostaza integral", "1 cucharada de vinagre de vino blanco", "3 cucharadas de aceite de oliva", "1 cabeza de lechuga romana, cortada en trozos", "sal marina y pimienta negra recién molida"], "method": ["Para el queso macaroni, precalentar la parrilla a su nivel más alto.", "Cocine los macarrones en una olla grande de agua hirviendo con sal, según las instrucciones del paquete.", "Mientras tanto, en una cacerola aparte, caliente la mantequilla hasta que se derrita, luego bata la harina hasta que quede suave y cocínela durante 1-2 minutos, o hasta que esté pálida dorada.", "Batir la leche poco a poco, esperando a que la mezcla se espese después de cada adición antes de agregar más y batir continuamente. Después de que se haya agregado toda la leche a la mezcla, debe tener una salsa suave con la consistencia de crema doble.", "Agregue todo el queso azul, 100 g / 3½ onzas del queso cheddar y todo el Caerphilly a la salsa y caliente suavemente, revolviendo todo el tiempo, hasta que se haya derretido. Sazonar, al gusto, con sal, pimienta negra recién molida y nuez moscada.", "Escurra la pasta cocida y colóquela en la sartén que contiene la salsa de queso. Revuelva bien para cubrir la pasta. Dejar de lado.", "Freír en seco la panceta picada en una sartén a fuego alto hasta que estén doradas y crujientes. Revuelva en la mezcla de queso de macarrones.", "Transfiera el queso macarrones a un plato grande a prueba de horno y cubra con la mozzarella picada, pan rallado y queso parmesano. Grill durante 2-3 minutos, o hasta que el relleno esté dorado y burbujeante.", "Mientras tanto, para la ensalada, en un bol, mezcle la mostaza, el vinagre y el aceite de oliva, y sazone al gusto con sal y pimienta negra recién molida. Agregue la lechuga y mezcle para cubrirlo en el aderezo.", "Sirva el queso macarrones con la ensalada al lado, espolvoreado con la albahaca picada."], "url": "www_bbc_co_uk_food_recipes_james_martins_ultimate_60657", "title": "El último queso de macarrones de James Martin", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 70}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["55 g / 2 oz de mantequilla, más extra para engrasar", "Azúcar demerara 170 g / 6 oz", "1 cucharada de jarabe de oro", "2 huevos de gallinas camperas", "2 cucharadas de melaza negra", "Harina de 200 g / 7 oz de levante automático, más extra para hacer harina", "200g / 7oz fechas picadas", "290ml / 10fl oz de agua hirviendo", "1 cucharadita de bicarbonato de soda", "½ cucharadita de extracto de vainilla", "Crema doble 110ml / 4fl oz", "55 g / 2 oz de mantequilla, en cubitos", "55g / 2oz de azúcar mascabado oscuro", "2 cucharadas de melaza negra", "1 cucharada de jarabe de oro", "helado de vainilla, para servir"], "method": ["Precalienta el horno a 200C / 400F / Gas 6. Engrasa y enharina 6 moldes individuales de budín.", "Ponga la mantequilla y el azúcar juntos en un procesador de alimentos hasta que estén pálidos y esponjosos. Agregue el jarabe dorado, la melaza y los huevos, poco a poco, y mezcle hasta que quede suave. Agregue la harina y mezcle, a baja velocidad, hasta que estén bien combinados. Transfiera a un tazón.", "Mientras tanto, mezcle las fechas y el agua hirviendo en un procesador de alimentos para obtener un puré suave. Agregue el bicarbonato de soda y la vainilla.", "Vierta la mezcla de la fecha en la masa de budín y revuelva hasta que esté bien combinado.", "Vierta la mezcla en los moldes y hornee durante 20-25 minutos, o hasta que la parte superior esté floja y dorada.", "Para hacer la salsa, caliente todos los ingredientes en una sartén, revolviendo ocasionalmente, hasta que hierva.", "Para servir, quite los budines de los moldes y colóquelos en cada una de las 6 placas para servir. Vierta sobre la salsa y sirva con una bola de helado de vainilla."], "url": "www_bbc_co_uk_food_recipes_jamesstickytoffeepud_67654", "title": "Budín de toffee pegajoso de James", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/jamesstickytoffeepud_67654_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["800g / 1lb 12oz de azúcar moreno claro y suave", "800 g / 1 libra de mantequilla de 12 oz, suavizada", "4 cucharadas de melaza", "Jarabe de oro de 400g / 14oz", "4 cucharadas de jengibre molido", "8 cucharaditas de especias mixtas molidas", "2 cucharaditas de clavo molido", "1 cucharadita de bicarbonato de soda", "2kg / 4lb 8 oz de harina natural, más extra para espolvorear", "4-6 cucharadas de agua fría", "Azúcar de formación de hielo 2kg / 4lb 8oz", "9 claras de huevo de gallinas camperas", "3 coches de juguete", "selección de dulces de chocolate y gelatina de colores brillantes", "selección de botones de leche y chocolate blanco", "800g / 1lb 12oz de azúcar moreno claro y suave", "800 g / 1 libra de mantequilla de 12 oz, suavizada", "4 cucharadas de melaza", "Jarabe de oro de 400g / 14oz", "4 cucharadas de jengibre molido", "8 cucharaditas de especias mixtas molidas", "2 cucharaditas de clavo molido", "1 cucharadita de bicarbonato de soda", "2kg / 4lb 8 oz de harina natural, más extra para espolvorear", "4-6 cucharadas de agua fría", "Azúcar de formación de hielo 2kg / 4lb 8oz", "9 claras de huevo de gallinas camperas", "3 coches de juguete", "selección de dulces de chocolate y gelatina de colores brillantes", "selección de botones de leche y chocolate blanco"], "method": ["Para el pan de jengibre, bata el azúcar y la mantequilla con una batidora de pie hasta que esté pálida, esponjosa y bien combinada.", "Agregue la melaza, el jarabe dorado, el jengibre molido, la especia mixta, los clavos molidos, el bicarbonato de soda y la harina. Batir lentamente al principio, luego rápidamente hasta que se una como una masa dura. Agregue un poco del agua y continúe batiendo para juntar la masa.", "Extienda la masa sobre una superficie de trabajo ligeramente enharinada y amase suavemente durante unos minutos hasta que quede suave y lisa. Dejar de lado en un recipiente, cubierto, para descansar.", "Mientras tanto, corte las plantillas para el garaje de piezas de cartón: una para los frontones de 20 cm / 8 pulgadas (ancho) x14 cm / 5½ pulgadas (alto) con un triángulo alto de 25 cm / 10 pulgadas en la parte superior; uno para la parte posterior de 30 cm / 12 pulgadas (ancho) x14½ cm / 6 pulgadas (alto) y otro para el frente de 30 cm / ancho (ancho) x 14½ cm / alto (altura) con 3 arcos de igual tamaño cortados en forma de puertas .", "Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Divida la masa en 3 piezas de tamaño manejable. Enrolle cada pieza en un trozo de papel de silicona para hornear hasta un grosor de 3 mm. Usando las plantillas, corte 4 formas de dos aguas, 2 formas de techo, 1 forma de espalda y 1 forma de frente. Transfiera cada forma, en su papel de silicona, a una bandeja para hornear. Hornee, en lotes si es necesario, durante 15-18 minutos, o hasta que comience a colorear en los bordes. Retírelo y déjelo a un lado para que se enfríe un poco antes de recortar los bordes para que queden rectos. Déjelo a un lado sobre una rejilla para que se enfríe por completo.", "Para la formación de hielo, coloque el azúcar glas en el tazón de un mezclador de alimentos; cubrir si es posible. Batir las claras de huevo y batir hasta que sea muy suave y lo suficientemente gruesa como para mantener su propia forma. Este proceso debe tomar de 7 a 10 minutos. Ponga un poco de la mezcla en una manga pastelera y déjelo a un lado. Reserve la guinda restante.", "Para armar el garaje, coloque todas las formas una al lado de la otra. Pegue las piezas una por una pasando una línea de hielo a lo largo de los bordes de los lados que está listo para pegar, colocándolas sobre una tabla rígida (o una tabla de presentación) y presionándolas juntas, manteniéndolas en su lugar hasta que se fijen. (o use pequeñas latas de comida para mantener las piezas en posición vertical mientras se preparan). Necesitas congelar las piezas como las necesites, no todas a la vez.", "Comience pegando un hastial a cada lado de la parte trasera del garaje, con dos a intervalos a lo largo de la pared trasera del garaje (evitando los espacios donde irán las puertas). Pegue la parte delantera del garaje en el otro lado de los frontones.", "Hiele los 4 bordes de una pieza del techo y presione suavemente en la parte superior de los frontones para cubrir la mitad posterior del garaje. Repita con la forma del techo restante, presionándola en la parte delantera del garaje.", "Deje el garaje para establecer durante 30 minutos, luego decorar con el resto del glaseado y los dulces de colores. Estaciona los autos de juguete en el garaje."], "url": "www_bbc_co_uk_food_recipes_jamess_gingerbread_92562", "title": "Gingerbread garage", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 1 gran garaje de pan de jengibre", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/jamess_gingerbread_92562_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50g / 2oz de harina", "1 huevo grande de gallinas camperas", "100ml / 3½fl oz de leche entera", "40 ml / 1½ fl oz de agua", "8 rebanadas de pan, untado con mantequilla", "3 cucharadas de mermelada de frambuesa, o al gusto", "25g / 1oz de azúcar glas", "80g / 3oz de mantequilla"], "method": ["Rompa el huevo en la harina en un tazón y agregue la leche y el agua hasta que se forme una mezcla suave. Deje reposar por una hora.", "Extienda las rebanadas de pan con mantequilla con mermelada de frambuesa, luego coloque dos rebanadas juntas, presionando bien hacia abajo. Repita con las rebanadas de pan restantes, luego recorte cuadrados o círculos de los sándwiches con un cortador de pasteles.", "Derrita la mantequilla en una sartén a fuego medio.", "Sumerja las formas de sándwich en la mezcla, luego agregue a la sartén para freír durante 2-3 minutos por cada lado, o hasta que estén doradas por todas partes. (Puede que tenga que hacer esto en lotes).", "Para servir, coloque en un plato grande y espolvoree con azúcar glas."], "url": "www_bbc_co_uk_food_recipes_jamfritters_89143", "title": "Buñuelos de atasco", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["150 g / 3½ oz de mantequilla, a temperatura ambiente, cortado en cubos, más extra para engrasar", "Azúcar 75g / 2¾oz", "1 vaina de vainilla, partido, semillas raspadas con la punta de un cuchillo", "225 g / 8 oz de harina, más extra para quitar el polvo", "100g / 3½oz de crema cuajada", "100g / 3½oz de mermelada de cereza o cereza confeccionada"], "method": ["Precalentar el horno a 170 C / 325 F / Gas 3.", "En un tazón, frote la mantequilla, el azúcar, las semillas de vainilla y la harina, con las yemas de los dedos.", "Junta la mezcla para formar una masa, ponla en una superficie de trabajo ligeramente enharinada y amasa hasta que la masa esté suave. Ruede en una bola, luego envuelva la masa en una película adhesiva y enfríe en la nevera por al menos 15 minutos.", "Cuando la masa se haya enfriado, extiéndala sobre una superficie de trabajo ligeramente enharinada hasta que tenga aproximadamente 6 mm de grosor.", "Corta discos de 7,5 cm en la masa con un cortador de galletas o una taza volteada.", "Divida los discos de hojaldre en dos porciones. Corta una pequeña forma de corazón de 1.5cm / 1¾ de cada disco en la primera porción usando un cortador de galletas con forma o un cuchillo afilado. Deje los discos de repostería restantes completos.", "Engrase ligeramente una bandeja para hornear y coloque todos los discos sobre ella. Hornee en el horno durante 12-15 minutos, o hasta que estén crujientes y doradas. Retire del horno y coloque en una rejilla de alambre. Dejar de lado para enfriar.", "Cuando los bizcochos se hayan enfriado, coloque una cucharadita de crema cuajada en cada uno de los bizcochos. Pon una cucharada de mermelada encima de la crema. Coloque los bizcochos con los agujeros en forma de corazón en la parte superior y apriete suavemente."], "url": "www_bbc_co_uk_food_recipes_jammybiscuits_92180", "title": "Galletas Jammy", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 16-20", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["250g / 8oz de harina de auto aumento", "pizca de sal", "50g / 2oz de azúcar moreno claro", "125g / 4oz de sebo triturado (los vegetarianos pueden sustituir el sebo vegetariano)", "6-8 cucharadas de agua", "5 cucharadas de mermelada de frambuesa, calentado", "leche, para cepillar", "1 huevo de gallinas camperas, golpeado", "azúcar demerara, glasear", "flan, para servir"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Tamiza la harina en un bol con la sal y agrega el azúcar moreno claro. Agregue el sebo y suficiente agua para crear una masa suave, pero no pegajosa.", "Coloque la masa sobre una superficie de trabajo enharinada y extiéndala en un rectángulo de aproximadamente 20 cm / 8 pulgadas x 30 cm / 12 pulgadas.", "Cepille un lado de la masa con el mermelada de frambuesa calentado, dejando un borde de 1 cm / ½ pulgada alrededor del borde. Doble el borde jamless y cepille con leche.", "Con el lado corto de la hoja de la pastelería hacia usted, enrolle la masa sin apretar y selle bien los extremos.", "Coloque el rollo de pastelería en una bandeja para hornear engrasada con el borde sellado debajo.", "Cepille la masa de bollería con huevo batido y espolvoree con azúcar demerara.", "Coloque en el horno para hornear durante 35-40 minutos, o hasta que estén doradas y cocidas.", "Retire del horno y espolvoree un poco más de azúcar demerara.", "Para servir, coloque rebanadas generosas del roly-poly en tazones y sirva caliente con crema pastelera."], "url": "www_bbc_co_uk_food_recipes_jamrolypoly_88984", "title": "Jam roly-poly", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["85g / 3oz de azúcar glasé", "Harina natural 170g / 6oz", "55g / 2oz de harina de maíz", "30 g / 1 oz de almendras molidas", "225 g / 8 oz de mantequilla, y extra para engrasar", "esencia de almendra", "azúcar glas para espolvorear", "frambuesa o mermelada de fresa"], "method": ["Precaliente el horno a 180C / 350F / Gas 4.", "Tamiza el azúcar glas, la harina y la harina de maíz en un bol. Agrega las almendras molidas.", "Corta la mantequilla en cubos y agrégala a los ingredientes secos. Con los dedos, una batidora o un procesador de alimentos, frote o mezcle la mantequilla hasta que no queden trozos visibles de mantequilla. Agrega la esencia de almendra.", "Voltee la mezcla sobre una superficie ligeramente enharinada y amasar unas pocas veces, solo para formar una masa suave.", "Mantequilla una lata de muffins. Enrolla la masa en bolitas y colócalas en los moldes para muffins, aplastando ligeramente las partes superiores con los dedos. La masa debe venir aproximadamente un tercio del camino hacia el lado de la sartén. 6. Hornee las tortas dulces hasta que tengan un color dorado claro, alrededor de 8-12 minutos. Retírelos del horno y, utilizando la herramienta que seleccionó, haga una pequeña muesca en la parte superior de cada galleta.", "Deje que las tortas dulces se enfríen durante unos minutos, luego gire el molde y golpéelo sobre el banco para que las tortas dulces se caigan. Sea gentil, ya que son frágiles mientras aún están calientes.", "Cuando todas las tortas estén horneadas y enfriadas, espolvorea la parte superior con un poco de azúcar glas. Usando una cucharilla, llene la sangría con mermelada o el relleno elegido."], "url": "www_bbc_co_uk_food_recipes_jamshortbreads_73974", "title": "Tortitas de mermelada", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Rinde 20", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["9-10 papas medianas", "2 cucharadas de mantequilla", "1 cebolla, finamente rebanada", "unos 20 filetes de espadín en conserva", "sal y pimienta", "150ml / 5fl oz de crema individual", "150ml / 5fl oz de leche entera", "1 cucharada de pan rallado seco"], "method": ["Precalentar el horno a alrededor de 200C / 400F / Gas 6.", "Pele las papas y córtelas en trozos pequeños de 0.5cm / ¼ in, un poco más delgados que las papas fritas.", "Derrita la mantequilla en una cacerola, agregue la cebolla y cocine hasta que esté suave. Tenga cuidado de no quemar la cebolla, debe cocinarse, pero no dorarse.", "Agregue las papas y cocine por unos minutos.", "Coloque la mitad de la mezcla de cebolla y papas en el fondo de un plato resistente al horno, luego cubra con 10 filetes de espadín uniformemente. Condimentar con sal y pimienta.", "Agregue otra capa de cebolla y papa, luego otros 10 espadines en la parte superior. Vierta el jugo de espadín restante sobre el plato.", "Vierta dos tercios de la leche y la crema sobre el plato, luego espolvoree las migas de pan en la parte superior. Sazonar de nuevo.", "Hornee por unos 45 minutos o hasta que las papas estén cocidas. A la mitad del tiempo de cocción, agregue el resto de la leche y la crema. Si el plato se ve seco, puede agregar más leche, el objetivo es obtener una consistencia cremosa.", "Sirve como parte de un smörgåsbord sueco tradicional."], "url": "www_bbc_co_uk_food_recipes_janssons_frestelse_24036", "title": "La tentación de Jansson (la tentación de Jansson)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/janssons_frestelse_24036_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 x 30 g de anchoas de estaño en aceite", "50g / 1¾oz de ajo asado (ver consejo)", "2 pastinacas medianas, finamente cortadas en mandolina", "2 papas medianas, finamente cortadas en mandolina", "1 cebolla blanca mediana, finamente cortada en la mandolina", "Crema doble 500ml / 18fl oz"], "method": ["Precalentar el horno a 150 ° C / 130 ° Ventilador / Gas 2.", "Incline las anchoas y el ajo en un tablero. Usando la parte posterior de un cuchillo, aplaste los dos para formar una pasta áspera.", "En una bandeja para hornear a prueba de horno, coloque las verduras: chirivías, patatas, cebolla blanca y luego un poco de anchoa y pasta de ajo. Repite las capas hasta que termines Vierta sobre la crema.", "Hornee durante 45 minutos, o hasta que los vegetales estén tiernos y la parte superior esté dorada."], "url": "www_bbc_co_uk_food_recipes_janssons_parsnip_52868", "title": "La tentación de la chirivía de Jansson", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200 g / 7 oz hierbas suaves, como perifollo, albahaca y perejil", "Mejillones 200g / 7oz", "200g / 7oz berberechos", "1 cucharadita de aceite de oliva", "1 diente de ajo, picado", "100ml / 3½fl oz de vino blanco", "1 cucharada de perejil fresco picado", "30g / 1oz de mantequilla sin sal, ablandada", "pequeño puñado de berros, blanqueado, refrescado y picado", "pequeño polvo de curry pizca", "2g de hinojo fresco finamente picado", "exprimir jugo de limón", "Una pizca de sal marina", "50 g / 1 oz de crema fresca", "1 lima, solo jugo", "1 cucharada de cebolletas frescas picadas", "1 cucharada de perifollo fresco picado", "½ enero col del rey", "50 g / 1¾oz de grasa de pollo", "exprimir jugo de limón"], "method": ["Precaliente el horno a 80C / 80C Fan / Gas ¼. Coloque las hierbas en una sola capa sobre una bandeja para hornear y cocine durante 1 hora o hasta que estén secas. Una vez seco, mezcle hasta obtener un polvo fino y colóquelo en un trapeador de harina.", "Para cocinar los mariscos, lavar los mejillones y quitar las barbas. Lavar los berberechos Deseche cualquier marisco abierto que no se cierre cuando se le da un golpecito fuerte.", "En una sartén caliente agregue el aceite de oliva y cocine el ajo durante 1 minuto. Agregue el resto de los ingredientes y los berberechos y los mejillones. Cubra con una tapa.", "Cocine por 2 minutos, o hasta que los berberechos y mejillones se hayan abierto. Descarta cualquiera que no se abra.", "Vierta a través de un colador forrado con una tela de muselina en una sartén limpia. Mantenga el líquido para hacer la salsa. Elija los mariscos. Pique 10g de los mejillones más grandes para la mantequilla de mejillón. Deje a un lado el resto de los mariscos.", "Para la mantequilla de mejillón, mezcle todos los ingredientes en un tazón con los 10 g de mejillones picados.", "Para la salsa de mejillones, en una olla, caliente el líquido de cocción de mariscos hasta que se reduzca a 50 ml. Agregue la crème fraîche y el jugo de lima. Agregue casi toda la manteca de mejillones, manteniendo una cucharada de repollo. Mezcle la salsa con una batidora. Agregue el cebollín y el perifollo.", "Para el repollo, precaliente el horno a 200C / 180C Fan / Gas 6. Corte el repollo en 8 cuñas. Caliente la grasa de pollo en una sartén antiadherente y resistente al horno hasta que esté caliente. Freír el repollo hasta que esté coloreado. Asar en el horno durante 5-7 minutos.", "Retira del horno y rocía con una cucharada de manteca de mejillón, hasta que se dore. Sazone con jugo de limón y sal.", "Para servir, coloque el repollo en el medio del plato. Vuelva a calentar los mariscos con un poco de salsa y espárzalos sobre el repollo. Vierta sobre la salsa restante y el polvo con el polvo verde."], "url": "www_bbc_co_uk_food_recipes_january_king_cabbage_07669", "title": "Repollo de enero con mejillones y berberechos", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 patas de pato de campo libre, piel, hueso", "1 cucharada de jengibre fresco de raíz rallado", "2 dientes de ajo, finamente picados", "4-6 cucharadas de salsa de soja ligera baja en sodio", "4-6 tbsp Sake japonés", "2 cucharadas de azúcar en polvo", "300g / 10½oz de arroz de sushi", "1 cucharada de vinagre de vino de arroz", "1 cucharada de mirin", "1 cucharadita de azúcar en polvo", "100 g / 3½ oz de harina de patata", "50g / 1¾oz de harina de maíz", "50g / 1¾oz de harina natural", "aceite vegetal, para freír", "hojas de shiso", "rodajas de limón", "semillas de sésamo negro", "Shibimi Petpe r f け s (Takashi Shikimi)", "hojas micro shiso", "amaranto rojo micro"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6", "Para hacer el adobo, mezcle el jengibre, el ajo, la salsa de soja y el sake en un tazón.", "Marque ambos lados del pato en un patrón entrecruzado, teniendo cuidado de no cortar la carne. Agregue el pato al adobo, cúbralo y déjelo marinar en la nevera durante al menos 30 minutos.", "Escurra el exceso de líquido del pato, reservando el adobo.", "Caliente al menos 1 cm / ½ in de aceite vegetal en un wok colocado a fuego alto. Freír el pato con la piel hacia abajo durante 5 minutos o hasta que la piel esté crujiente.", "Coloque el pato con la carne hacia abajo en una lata para asar y termine en el horno durante 30-35 minutos, o hasta que esté bien hecho, aumentando el calor hasta 220 C / 200 C Fan / Gas 7 durante los últimos 10 minutos. Permita descansar por 5 minutos.", "Lave bien el arroz de sushi hasta que el agua salga clara. Llene una olla con 500ml / 18fl oz de agua y llévela a ebullición. Coloque un vapor de bambú sobre la sartén y agregue el arroz. Ponlo, baja la temperatura a bajo y deja que el vapor de arroz se cocine durante 15 minutos.", "Mezcle el mirin, el vinagre de vino de arroz y el azúcar. Vierte el arroz con un tenedor, vierte el aderezo y revuelve bien.", "Justo antes de servir, cubra el pato con la mezcla de harina y sacuda el exceso. Cubra la harina una vez más.", "Precaliente una freidora a 180 ° C. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido). Freír el pato durante 2 minutos o hasta que esté dorado. Ponga el pato en un plato forrado con papel de cocina.", "Para servir, forra la placa con hojas de shiso. Agregue un montículo de arroz de sushi al vapor. Coloque las patas de pato en la parte superior y adorne con las semillas de sésamo negro, las hojuelas de pimiento shichimi y las hojas de cilantro y las rodajas de limón en el costado."], "url": "www_bbc_co_uk_food_recipes_japanese_fried_duck_04635", "title": "Recoger del carterista", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 filetes de atún de 175 g / 6 oz", "1 cucharada de jengibre rallado", "2 cucharadas de salsa de soja oscura", "2 cucharadas de salsa de pescado", "2 cucharadas de mirin", "1 cucharada de pimienta negra molida", "1 diente de ajo, en rodajas", "1 lima, solo jugo", "aceite vegetal, para freír", "50 g / 1¾oz de brotes de soja", "1 zanahoria, en juliana", "10 mangetout, en rodajas finas", "50g / 1¾oz mooli, finamente cortado", "2 cucharaditas de jengibre en escabeche, finamente picado", "2 cabezas pak choi, reducido a la mitad", "1 cucharada de jarabe de azúcar (50/50 de agua y azúcar disueltos)", "2 cucharaditas de caldo de sopa", "1 cucharada de vinagre de vino de arroz", "1 cucharada de salsa de pescado", "½ limón, solo jugo", "50ml / 2fl oz de salsa de soja oscura"], "method": ["Coloque los filetes de atún en una bolsa sellable, agregue todos los ingredientes del adobo, a excepción del aceite, y masajee suavemente en el atún. Selle la bolsa, asegurándose de que no haya aire atrapado adentro y colóquela en el refrigerador para marinar durante 6-8 horas.", "Para hacer la ensalada, ponga a hervir un sartén grande de agua con sal y blanquee los brotes de soja durante 2 minutos, luego revuelva en agua fría, escúrralos y déjelos a un lado.", "Mezcle los ingredientes restantes de la ensalada en un bol, agregue los brotes de soja y reserve.", "Para preparar el aderezo, mezcle el jarabe de azúcar, el dashi, el vinagre de vino de arroz, la salsa de pescado, una cucharada de jugo de limón y la salsa de soja en un bol.", "Retire el atún de la nevera al menos 30 minutos antes de cocinar.", "Caliente una sartén a fuego alto y frote con un poco de aceite vegetal. Retire el atún de la bolsa y seque, luego cocine el atún durante 2 minutos en cada lado. Retirar de la sartén y cortar en rodajas finas.", "Blanquee el pak choi en agua hirviendo durante 2 minutos y revuelva bajo agua fría. Drene y coloque en la sartén junto al atún durante 2 minutos por cada lado.", "Divida la ensalada entre los platos y cubra cada uno con algo del atún y el pak choi. Vierta el aderezo y sirva."], "url": "www_bbc_co_uk_food_recipes_japanese_marinated_tuna_62473", "title": "Atún marinado japonés con ensalada condimentada con jengibre y aderezo ponzu", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de salsa de soja", "2 cucharadas de mirin", "2 cucharadas de jugo de limón", "1 cucharada de copos de Bonito (disponibles en línea)", "1 pedazo de pulgar de algas secas (kombu) (disponible en línea)", "100g / 3½oz de gambas crudas, sin cáscara", "2 vieiras", "Filete de salmón de 150 g / 5½ oz, desollado y cortado en trozos del tamaño de un bocado", "Filete de fletán 150g / 5½ oz, pelado y cortado en trozos del tamaño de un bocado", "Filete de lubina de 150g / 5½oz, desollado y cortado en trozos del tamaño de un bocado", "Filete de salmonete de 150g / 5½oz, pelado y cortado en trozos del tamaño de un bocado", "puñado de hongos shiitake", "puñado de Setas de oreja de madera secas", "200g / 7oz de setas de ostra", "1 repollo chino, en rodajas finas", "2 zanahorias, en rodajas finas", "Brócoli brotación púrpura de 200g / 7oz", "racimo de cebollas en rodajas finas", "40 g / 1½ oz de algas dulse seco (disponible en línea), rehidratado en agua y escurrido, para adornar", "3 cucharadas de pasta de miso blanco", "2-3 cucharadas de miel que moquea", "3 cucharadas de mirin", "3 cucharadas de aceite de girasol", "1 limón, solo jugo", "1 berenjena, cortada en cubitos", "1 cabeza de brócoli, roto en pequeños floretes", "1 cucharada de semillas de sésamo, para adornar"], "method": ["Haga la salsa de inmersión mezclando todos los ingredientes en un tazón. Cubra y deje que se empape durante 24 horas.", "Para hacer las verduras de miso, precaliente el horno a 200C / 180C Fan / Gas 6.", "Mezcle la pasta de miso, la miel, el mirin, el aceite y el jugo de limón.", "Mezcle la berenjena y el brócoli con el aderezo de miso en una lata grande para asar. Asar durante 30 minutos, luego esparcir sobre las semillas de sésamo.", "Mientras tanto, para hacer el caldo de mariscos, ponga a hervir 400 ml / 14 fl oz de agua y agregue las algas secas. Dejar de lado por una hora.", "Pon el marisco y las verduras en un plato para servir. Colar el caldo y volver a verterlo en la sartén. Regrese a ebullición, deje caer el marisco y las verduras, luego retírelo del fuego y déjelo a un lado durante 15 minutos, o hasta que el marisco esté bien cocido. Adornar con las algas.", "Sirve el caldo con las verduras de miso y la salsa para mojar."], "url": "www_bbc_co_uk_food_recipes_japanese_seafood_hotpot_53471", "title": "Hotpot japonés de mariscos con verduras de miso", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ calabaza, picada", "1 cucharada de aceite de oliva", "2 dientes de ajo, aplastados", "1 cucharadita de salsa de soja", "150ml / 5fl oz de caldo de verduras o pollo", "1 cucharadita de aceite de sésamo"], "method": ["Coloque la calabaza en una sartén con aceite, ajo, soja, caldo de pollo y aceite de sésamo.", "Cubra la sartén y deje que hierva.", "Una vez que se alcanza el punto de ebullición, baje y hierva a fuego lento durante ocho minutos o hasta que se ablanden. Retire la tapa y termine de cocinar en alto durante 1-2 minutos o hasta que la calabaza tenga una apariencia acristalada."], "url": "www_bbc_co_uk_food_recipes_japaneseglazedsquash_77646", "title": "Squash glaseado de estilo japonés", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100ml / 3½fl oz de salsa teriyaki lista para usar", "4½ cucharadas de salsa de alubias amarillas machacadas ya preparadas", "1 tallo de hierba de limón, hojas exteriores duras retiradas, núcleo interior suave aplastado y finamente cortado", "1 cucharada de raíz de jengibre recién rallado", "Fideos soba 200g / 7oz", "2 huevos de gallinas camperas, golpeados", "½ pimiento verde, sin semillas, en rodajas", "½ pimiento rojo, semillas eliminadas, en rodajas", "1 cebolla, pelada, finamente cortada", "8 cebolletas, cortadas, cortadas", "10 champiñones, en rodajas", "2 dientes de ajo, pelados, finamente picados", "puñado de brotes de soja fresca", "4 cucharadas de salsa teriyaki lista para usar", "3 cucharadas de aceite vegetal", "½ cucharadita de semillas de sésamo, para servir (opcional)"], "method": ["Para el aderezo de yaki soba, revuelva bien la salsa teriyaki, la salsa de frijoles amarillos, el limoncillo y el jengibre en una sartén pequeña.", "Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento, luego continúe cocinando a fuego lento durante 8-10 minutos o hasta que la mezcla se espese. Ponga a un lado hasta que esté listo para servir.", "Mientras tanto, para los fideos, cocinar los fideos en una olla grande de agua hirviendo durante 2-3 minutos, o hasta que estén tiernos. Escurrir bien, luego refrescar con agua fría hasta que los fideos estén completamente fríos.", "En un tazón, mezcle los huevos, los pimientos, la cebolla, las cebolletas, los champiñones, el ajo y los brotes de soja hasta que las verduras estén cubiertas con los huevos. Agregue la salsa teriyaki hasta que esté bien combinada.", "Calentar el aceite en un wok a fuego medio. Agregue la mezcla de huevo y vegetales y los fideos cocidos y fríos, y saltee durante 3-4 minutos, o hasta que los fideos se hayan calentado y los huevos y vegetales estén bien cocidos.", "Para servir, divida las verduras y los fideos por igual entre dos tazones para servir. Rocíe sobre el aderezo yaki soba. Espolvorea sobre las semillas de sésamo, si las usas."], "url": "www_bbc_co_uk_food_recipes_japanesevegetablesti_92442", "title": "Hola amigo ___ ___ ___ ___ ___ ___ ___ 0", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/japanesevegetablesti_92442_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 raíz de loto fresca (tamaño mediano, aproximadamente 400 g / 14 oz)", "500ml / 18fl oz de aceite vegetal, más un poco más para cocinar", "sal marina copos", "Recoge camarones (Feliz cumpleaños)", "4 cucharadas de harina de arroz (o harina de maíz si no hay ninguna disponible)", "Tofu firme de 2 piezas, alrededor de 375 g / 13 oz, cortado en cuadrados de 2,5 cm.", "2 cucharadas de aceite de sésamo", "1 cebolla mediana, finamente picada", "2 puerros medianos, cortados, lavados y cortados en rodajas de 1 cm / ½ en diagonal", "2 berenjena japonesa, cortada en discos de 2 cm / ¾in (alternativamente puedes utilizar un corte de berenjena normal en discos de 2cm / ¾in)", "4 dientes de ajo, finamente rallados", "2 cucharadas de jengibre rallado", "150 g / 5½ oz de champiñones shimeji marrones, recortados", "2 cucharadas de pasta de miso apilada", "4 cucharadas de mirin", "5 cucharadas de salsa de soja"], "method": ["Ponga a hervir una olla grande de agua. Pele la raíz de loto, corte un tercio y déjelo a un lado. Agregue el resto de la raíz de loto a la sartén. Baje la temperatura y cocine la raíz durante 30 minutos a fuego lento a fuego lento. Asegúrese de cocinar la raíz inmediatamente después de pelar, ya que se oscurecerá rápidamente. Si lo prepara con anticipación, ponga la raíz de loto en agua con un poco de vinagre. La raíz de loto enlatada no necesita preparación de esta manera y se puede agregar directamente al estofado.", "Corta finamente el tercio restante de la raíz en una mandolina o, usando un cuchillo muy afilado, delgada para usarla para hacer patatas fritas.", "Para las patatas fritas de raíz de loto, caliente una sartén wok o de grasa con 500 ml de aceite vegetal a unos 180 ° C (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión). Cocine en dos la raíz de loto cortada finamente o tres lotes durante aproximadamente cinco minutos, o hasta que estén dorados. Retirar con una espumadera y escurrir sobre un plato forrado con papel de cocina. Sazonar con sal y shichimi togarashi y dejar de lado.", "Con cuidado, vierta el aceite caliente del wok que usó para las patatas fritas, reservando aproximadamente cinco cucharadas en la parte inferior.", "Espolvoree la harina de arroz en un plato y cubra el tofu de manera uniforme. Calentar el aceite en el wok y freír el tofu en un par de tandas a fuego medio, girando hasta que quede ligeramente dorado, ligeramente crujiente y un poco hinchado; esto llevará unos ocho minutos. Escurra en un plato forrado con papel de cocina para absorber el exceso de aceite y manténgalo caliente.", "Limpie el wok y agregue el aceite de sésamo y dos cucharadas de aceite vegetal fresco. Freír la cebolla por unos minutos, agregar los puerros y cocinar hasta que estén suaves y ligeramente dorados. Agregue la berenjena en rodajas y cocine por otros seis minutos, o hasta que esté suave.", "Agregue el ajo rallado y el jengibre rallado. Freír nuevamente durante un par de minutos más revolviendo continuamente, para que el ajo no se queme.", "Corta la raíz de loto cocida en rodajas de 5 mm y agrégala a la mezcla de cebolla y berenjena. Incline los champiñones shimeji, agregue dos cucharadas colmadas de pasta de miso y fría por un minuto. Agregue el mirin, salsa de soja y 300 ml / 10 fl oz de agua hirviendo.", "Vuelve a hervir y dobla cuidadosamente el tofu. Coloque en tazones para servir y cubra con las patatas fritas de raíz de loto."], "url": "www_bbc_co_uk_food_recipes_japanese_tofu_aubergine_65332", "title": "Guiso de tofu japonés, berenjena y raíz de loto", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100g / 3½ oz de espelta cruda", "300ml / 10fl oz de caldo de pollo", "2 x 150-200 g / 5½-7 oz de filetes de trucha, la piel en huesos de alfiler", "Té de jazmín 200 g / 7 oz", "1 filete de anguila ahumada, cortado en tiras muy delgadas", "Frijoles edamame de 150g / 5½ oz, frijoles retirados de sus vainas", "150 g / 5½ oz de guisantes frescos, retirados de sus vainas", "1 brotes de cilantro, tallos eliminados", "2 cucharadas de cilantro fresco picado", "100ml / 3½fl oz de crema agria", "¼ cucharadita de wasabi"], "method": ["Para la espelta coloque el caldo y póngalo deletreado en una cacerola y cocínelo según las instrucciones del paquete. Escurrir y dejar enfriar.", "Para la trucha, coloque un poco de estaño en el fondo de un ahumador y extienda el té de jazmín en la parte superior de la lámina. Pon el pescado en una rejilla sobre el té. Cocine por 4-8 minutos hasta que el pescado esté bien cocido.", "Mezcle todos los ingredientes de la ensalada y la espelta cocida en un tazón grande. Mezcle la crema agria y el wasabi para preparar el aderezo.", "Para servir, sirva la ensalada en el centro del plato y cubra con la trucha ahumada, pedazos de anguila ahumada y un poco de aderezo."], "url": "www_bbc_co_uk_food_recipes_jasmine_tea_smoked_trout_52946", "title": "Trucha ahumada con jazmín y ensalada de espelta y aderezo de wasabi", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]