[{"isVegetarian": false, "title": "Beer and honey mustard-encrusted steaks with rosemary aubergines", "url": "www_bbc_co_uk_food_recipes_beerandhoneymustarde_88998", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5oz yellow mustard seeds", "75g/3oz brown mustard seeds", "110ml/4fl oz white wine vinegar", "60g/2½oz English set honey", "200ml/7fl oz light ale", "4 x 175g/6oz fillet steaks", "25g/1oz butter", "4 tbsp olive oil", "2 aubergines, cut into 2.5cm/1in chunks", "2 large banana shallots, roughly chopped", "3 sprigs rosemary"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the mustard, place the mustard seeds into a bowl.", "Place the vinegar and honey into a non-reactive pan and heat until the honey has dissolved. Pour the vinegar and honey mixture over the mustard seeds and mix thoroughly.", "Add the ale and stir to combine. Cover with cling film and set aside for at least four hours, preferably overnight.", "Pour the mustard mixture into a food processor and blend until smooth. This will take time as all of the mustard seeds need to break down.", "Spoon into sterilised jars and seal.", "For the steaks, place the steaks between two pieces of cling film and bash lightly with a rolling pin to flatten the steaks slightly.", "Spread two tablespoons of the mustard over each steak.", "Heat a frying pan until hot, add the butter and two tablespoons of the olive oil. Once the butter has melted add the steaks and cook for 3-4 minutes on both sides, or until cooked to your liking. Remove from the pan and rest for at least five minutes.", "Meanwhile, heat a frying pan until hot and add the remaining olive oil. Add the aubergines, shallots and rosemary and fry for 5-6 minutes, stirring occasionally, until the aubergines are golden-brown and soft.", "To serve, place a steak onto each of four serving plates and top with a spoonful of the mustard. Place a couple of spoonfuls of the aubergine mixture alongside."]}, {"isVegetarian": false, "title": "Beer and dill-battered cod with mushy peas", "url": "www_bbc_co_uk_food_recipes_beeranddillbatteredc_92901", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/6oz marrowfat peas, soaked in cold water overnight", "25g/1oz butter", "1 lemon, juice only", "salt and freshly ground black pepper", "15g/½oz fresh yeast", "1 pinch caster sugar", "200ml/7fl oz beer", "1 tsp cider vinegar", "200g/7¼oz plain flour", "1 pinch salt, plus extra to season", "3 tbsp chopped fresh dill", "vegetable oil for deep frying", "4 x 200g/7oz cod fillets, skin and pin bones removed", "1 lemon, juice only", "50g pea shoots", "1 tbsp extra virgin olive oil"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the mushy peas, drain the peas and rinse well under running water. Place the peas into a large, lidded saucepan, cover with 600ml water and bring to the boil. Reduce the heat until the mixture is simmering, cover the pan with a lid,  then simmer for 25-30 minutes, or until tender. Remove the lid and continue to cook until most of the water has evaporated and the peas are very soft.", "Drain off any excess water from the cooked peas, then add the butter and lemon juice and mix well. Season, to taste, with salt and freshly ground black pepper.", "For the beer and dill-battered cod, sprinkle the yeast and sugar into a mixing bowl. Pour over the beer and vinegar, mix well, then whisk in the flour and salt until the mixture is well combined. ", "Set the mixture aside to ferment. (It is ready to use when the mixture starts to bubble.) ", "When the mixture has fermented, add the dill and stir until well combined.", "Heat the oil in a deep heavy-based frying pan until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Dip the cod into the batter, then fry in the oil for 3-5 minutes, or until golden-brown and crisp and cooked through. Remove the fish from the oil using a slotted spoon and set aside to drain on kitchen paper. Season, to taste, with salt and some of the lemon juice.", "Mix the olive oil and a teaspoon of the remaining lemon juice in a bowl until well combined. Add the pea shoots and   mix until well coated in the dressing", "To serve, spoon some of the mushy peas into the centre of four serving plates, then top with a piece of battered cod and a handful of pea shoots."]}, {"isVegetarian": false, "title": "Beer-battered fish", "url": "www_bbc_co_uk_food_recipes_beerbatteredfish_93119", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75g/2½oz cornflour", "200g/7¼oz plain flour", "1 tsp fine sea salt", "330ml/11½fl oz real ale", "2 tbsp white wine vinegar", "sunflower oil, for deep frying", "4 tbsp plain flour", "½ tsp fine sea salt", "4 x 200g/7¼oz thick white fish fillets, such as haddock or whiting", "chips, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the batter, mix the cornflour, plain flour and salt together in a large bowl. Make a well in the centre of the mixture and whisk in the ale and vinegar. Beat with a large metal whisk to make a smooth batter with the consistency of double cream.", "For the fish, heat a deep, heavy-bottomed saucepan half-full of the sunflower oil to 180C. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Alternatively, use an electric deep fat fryer heated to 180C.", "Put the flour into a large, strong polythene food bag and season with the salt. Add the fish fillets, one at a time, and shake until coated in the seasoned flour.", "When the oil has reached the right temperature, stir the batter well. Dip one floured fish fillet into the batter until thoroughly coated. Lift the fish out with a pair of tongs and gently lower into the hot oil. Watch out for splashes as the oil will be extremely hot.", "Repeat the process with a second fish fillet and cook with the first for 5-6 minutes (depending on the thickness of the fillets) or until golden-brown and crisp. It's important that the batter doesn't brown too quickly before the fish is cooked. Remove from the pan using a slotted spoon and transfer to a plate lined with kitchen paper to absorb any excess oil.", "Reheat the oil and cook the remaining two pieces of fish in exactly the same way. Serve with freshly cooked chips."]}, {"isVegetarian": false, "title": "Beer-battered haddock with mushy peas, sweet potato chips and tartare sauce", "url": "www_bbc_co_uk_food_recipes_beerbatteredhaddockw_89436", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300ml/½ pint vegetable oil, for deep frying", "6-8 tbsp plain flour, for dredging", "1 haddock fillet", "½ Spanish onion, peeled, cut into rings", "200g/7oz self-raising flour", "200ml/7fl oz bottled beer or ale", "pinch salt", "250g/9oz fresh peas", "2 tbsp olive oil", "1 sprig fresh mint, leaves only, chopped", "salt and freshly ground black pepper", "300ml/½ pint vegetable oil, for deep frying", "½ sweet potato, peeled, cut into chips", "plain flour, for dusting", "pinch salt", "2 free-range egg yolks", "4 tbsp chopped fresh chervil", "4 tbsp chopped fresh parsley ", "1 tbsp white wine vinegar", "salt and freshly ground black pepper ", "150ml/5fl oz vegetable oil", "2 tbsp chopped gherkins", "lemon wedges, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Bring a pan of salted water to the boil.", "For the beer-battered haddock, heat the oil in a deep heavy-based frying pan until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.) ", "Sprinkle the plain flour onto a plate. Dredge the haddock fillet and the onion rings into the flour to coat. Set the flour plate aside.", "Place the self-raising flour into a large bowl and gradually whisk in beer as necessary to make a thick batter the consistency of double cream. Season with salt. ", "Dip the haddock fillet and onion rings into the batter and carefully lower them into the hot oil. Fry for 8-10 minutes, or until golden-brown and crisp. Remove with a slotted spoon and drain on kitchen paper.", "For the mushy peas, add the peas to the boiling, salted water and cook for 4-5 minutes, or until tender. Drain the peas and put them into a bowl. Add the rest of the mushy pea ingredients and mashwith a fork until well combined.", "For the sweet potato chips, heat the oil in a deep heavy-based frying pan until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Press the sweet potato chips into the remaining plain flour to coat them, shake off any excess, then carefully lower the chips into the hot oil. Deep fry for 6-7 minutes or until golden-brown. Remove with a slotted spoon and drain on kitchen paper.", "For the tartare sauce, whisk the egg yolks in a bowl.", "Place the herbs, white wine vinegar, salt and freshly ground black pepper into a small microwave-safe bowl and warm in the microwave for 30 seconds on full power. Pour this warm mixture over the eggs and whisk until combined. Gradually add the vegetable oil in a thin stream and keep whisking until all the oil has been fully incorporated and the mixture has the consistency of mayonnaise. Stir in the chopped gherkins.", "To serve, place the haddock fillet onto a serving plate and arrange the sweet potato chips, onion rings and mushy peas alongside. Put the tartare sauce into a separate serving bowl on the side. Garnish with the lemon wedges."]}, {"isVegetarian": false, "title": "Beer-battered oysters with watercress and red onion salad", "url": "www_bbc_co_uk_food_recipes_beerbatteredoystersw_88731", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["vegetable oil, for deep frying", "1 tsp dried yeast", "300ml/11fl oz beer", "300g/11oz plain flour", "24 oysters", "1 tsp smoked sea salt", "110ml/4fl oz white wine vinegar", "110g/4oz caster sugar", "1 red onion, finely sliced", "1 large red chilli, finely sliced", "4 tbsp rapeseed oil", "salt and freshly ground black pepper", "200g/7oz watercress"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the oysters, heat a deep fat fryer to 190C/375F. Heat the vegetable oil in a deep heavy-based saucepan, until a breadcrumb sizzles and browns when dropped in it. (CAUTION: hot oil can be dangerous - do not leave unattended.)", "Place the yeast and beer into a bowl and whisk together.", "Add 200g/7oz of the plain flour and whisk to a smooth batter. Set aside for five minutes.", "Meanwhile, shuck the oysters, retaining the juice in a bowl.", "Place the remaining plain flour onto a plate and dust the oysters in the flour.", "Dip each oyster into the beer batter and drop directly into the hot fat, in batches.", "Cook for about two minutes until golden-brown and crisp, a few at a time. Carefully remove the oysters with a slotted spoon and transfer to kitchen paper.", "For the salad, place the vinegar and sugar into a non-reactive saucepan and bring to the boil. Simmer until the sugar has dissolved. ", "Place the red onions and chilli into a bowl, then pour the hot vinegar over them and stir to combine. Set aside for five minutes.", "Strain off two tablespoons of the onion pickling liquid and place in a bowl with two tablespoons of the reserved oyster juices. Add the rapeseed oil and whisk to combine. Season with salt and freshly ground black pepper, to taste.", "Place the watercress in a bowl. Drain the red onions, add them to the bowl, and add the dressing. Mix to combine.", "To serve, divide the salad equally among four plates, top each serving with six oysters and a sprinkle of smoked sea salt."]}, {"isVegetarian": true, "title": "Beetroot and chocolate traybake", "url": "www_bbc_co_uk_food_recipes_beetroot_and_chocolate_33061", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beetroot_and_chocolate_33061_16x9.jpg", "ingredients": ["250g/9oz self-raising flour", "4 tbsp cocoa powder", "2 tsp baking powder", "250g/9oz cooked beetroot in natural juices", "3 tbsp white wine vinegar", "160ml/5½fl oz buttermilk", "160g/5½oz butter, softened", "230g/8oz caster sugar", "3 large free-range eggs", "280g/10oz cream cheese", "50g/1¾oz unsalted butter, softened", "50g/1¾oz icing sugar, sifted", "½ tsp vanilla extract", "2 x raw beetroots", "200g/7oz caster sugar"], "serves": "Makes 12 slices", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. Grease and line a 30x20cm/12x8in traybake tin.", "Mix together the flour, cocoa powder and baking powder in a bowl.", "Blend the beetroot in a food processor until you have a rough purée. Put the purée in a bowl, add the vinegar and buttermilk. Mix to combine.", "Beat the butter and sugar together until light and fluffy. Gradually beat in the eggs, followed by half the dry mixture and half the beetroot mixture. ", "Continue to mix gently, adding the rest of the dry ingredients and the remaining beetroot. Pour the mixture into the tin and bake for 40-50 minutes. Leave to cool in the tin for 10 minutes before turning it out of the tin and leaving it to cool completely.", "Meanwhile make the icing. Beat together the cream cheese and butter until soft. Beat in the icing sugar and vanilla extract until they are combined, then spread the icing onto the cooled cake. ", "For the beetroot hearts, thinly slice the beetroot, and cut into 12 heart shapes.", "Boil the sugar in 200ml/7fl oz water until the sugar has dissolved, then add the beetroot hearts and simmer for about 10 minutes until soft and translucent. Using a fork, carefully remove the beetroot hearts from the hot sugar syrup and carefully lay them on paper towel to soak up any excess syrup.", "Slice the cake into 12 even squares, and then decorate each square with a beetroot heart."]}, {"isVegetarian": true, "title": "Beetroot and goats’ cheese risotto", "url": "www_bbc_co_uk_food_recipes_beetroot_and_goats_80522", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz cooked beetroot", "1 litre/1¾ pint chicken or vegetable stock", "2 tbsp olive oil", "30g/1oz butter", "1 onion, finely chopped", "2 garlic cloves, finely chopped", "300g/10½oz risotto rice", "1 large sprig thyme", "100ml/3½fl oz white wine", "small bunch parsley, finely chopped", "small bunch dill, finely chopped (optional)", "squeeze lemon juice (optional)", "salt and freshly ground black pepper", "oil, for deep-fat frying", "handful kale leaves, trimmed, washed and very thoroughly dried", "150g/5½oz creamy goats’ cheese, crumbled", "50g/1¾oz parmesan"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place half the beetroot with the stock into a food processor and blend until smooth. Pour into a saucepan and bring to a simmer. Grate or finely chop the remaining beetroot and leave to drain in a colander.", "Heat the olive oil and half the butter in a large casserole dish or saucepan. Add the onion and fry gently until very soft. Add the garlic and cook for 2–3 minutes. Stir in the risotto rice and thyme until coated in the oil and butter.", "Turn the heat to high and pour in the wine. Cook for 1–2 minutes until reduced. Turn the heat down to medium and add a ladleful of the beetroot stock. Season with salt and pepper. Stir continuously until the liquid has been absorbed. Repeat until all the stock has been added. At this point the rice will have a creamy texture but still be al dente.", "Beat in the remaining butter and grated beetroot. Stir through the herbs, if using, and check the seasoning, you might want to add a squeeze of lemon juice. Remove the thyme sprig.", "For the garnish, half fill a heavy-based saucepan or deep fat fryer with vegetable oil (CAUTION: hot oil can be dangerous. Do not leave unattended). When it has reached 170C, add the kale leaves a few at a time. Cook for 1 minute or until crisp and glossy. Drain on kitchen paper and sprinkle with salt.", "Divide the risotto between 4 warmed plates and crumble over the goats’ cheese and a sprinkle of parmesan at the table. Garnish with the kale."]}, {"isVegetarian": true, "title": "Beetroot, green bean and feta salad", "url": "www_bbc_co_uk_food_recipes_beetroot_green_bean_and_83225", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beetroot_green_bean_and_83225_16x9.jpg", "ingredients": ["50g/1oz green beans", "100g/3½oz cooked beetroot", "25g/1oz baby spinach", "40g/1¾oz lighter Greek-style cheese, crumbled"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Simmer the green beans in water for 4–5 minutes. Drain and rinse under cold running water until cool.", "Toss the beans with the beetroot and spinach in a small bowl. Top with the cheese and serve. "]}, {"isVegetarian": false, "title": "Beetroot layer cake", "url": "www_bbc_co_uk_food_recipes_beetroot_layer_cake_55402", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400g/1lb beetroot", "4 tbsp olive oil", "1 tsp English mustard", "100g/3½oz leek, finely chopped", "50g/1¾oz butter", "1 tbsp flour", "425ml/15fl oz milk", "nutmeg, grated", "freshly ground black pepper", "100g/3½oz mature Cheddar", "200g/7oz smoked roasted ham", "parmesan, grated"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Boil the beetroot in slightly salted water, peel and cut into 3mm/⅛in slices. Place the beetroot into a bowl and mix with two tablespoons of the olive oil and mustard. Fry the leek in the remaining oil until soft.", "Melt the butter in a saucepan over a medium heat, stir in the flour then add the milk in a steady stream until it is all incorporated. Add a grating of nutmeg and a pinch of black pepper then the Cheddar and finally the leeks. Mix until well combined and remove the pan from the heat.", "Put a layer of beetroot in the bottom of an ovenproof dish, spoon over some sauce then add a layer of ham. Repeat these layers, finishing with a layer of sauce and a scattering parmesan.", "Bake in the oven for 20 minutes, or until golden-brown. "]}, {"isVegetarian": true, "title": "Beetroot relish", "url": "www_bbc_co_uk_food_recipes_beetroot_relish_74771", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz beetroot, peeled", "½ onion, roughly chopped", "splash olive oil", "½ tsp yellow mustard seeds", "125ml/4fl oz balsamic vinegar", "125ml/4fl oz white wine vinegar", "225g/8oz sugar", "1 clove", "pinch sea salt", "pinch pepper"], "serves": "Makes 2 small jars", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Blend the beetroot and onion together in a food processor or blender. Set aside.", "Heat a little oil in a covered frying pan and fry the mustard seeds until popping. (CAUTION: when the mustard seeds pop, keep the pan well away from your face and eyes.)", "Add all the ingredients and 125ml/4fl oz water to a large deep frying pan or large saucepan. Place over a medium heat, cover and bring to the boil. ", "Cook for 30-60 minutes, or until the beetroot is soft and the liquid has reduced and thickened to the desired consistency. ", "Remove any excess liquid with a ladle as necessary, and remove the clove. Pour into sterilised jars, seal and let cool."]}, {"isVegetarian": true, "title": "Beetroot pie", "url": "www_bbc_co_uk_food_recipes_beetroot_pie_89195", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beetroot_pie_89195_16x9.jpg", "ingredients": ["200g/7oz plain flour", "2 tbsp icing sugar", "100g/3½oz unsalted butter, chilled, cut into roughly 1cm/½in cubes", "1 free-range egg, lightly beaten", "1 tsp lemon juice", "350g/12oz cooked and peeled beetroot (vacuum-packed is fine, but not pickled beetroot)", "125ml/4fl oz double cream", "2 large free-range eggs", "175g/6oz dark muscovado sugar", "1 tsp ground cinnamon", "½ tsp ground ginger", "1 lemon, finely grated zest only "], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the pastry, mix the flour and icing sugar together in a bowl. Add the butter and rub it in lightly with your fingertips until the mixture resembles fine breadcrumbs. Alternatively, do this in a food processor or a mixer and then transfer to a bowl.", "In a small bowl or jug, mix the egg with the lemon juice and two tablespoons of water. Make a well in the centre of the flour mixture and pour in the egg mix. Using a table knife, work the liquid into the flour to bring the pastry together. If it seems too dry, add a splash more water. When the dough begins to stick together, use your hands to gently knead it into a ball. Wrap in cling film and rest in the fridge for at least 15 minutes.", "Roll out the pastry on a lightly floured work surface to about a 3mm/⅛in thickness. Line a 23cm/9in tart tin with the pastry, leaving any excess pastry hanging over the edge. Reserve a little uncooked pastry in case you need to patch any cracks later.", "Line the pastry case with baking parchment or foil, then fill with baking beans, or uncooked rice or lentils. Bake blind for 15 minutes, then remove the parchment and baking beans and return to the oven for about eight minutes or until the pastry looks dry and faintly coloured. Using a small, sharp knife, trim away the excess pastry from the edge. Use a tiny bit of the reserved raw pastry to patch any cracks or holes if necessary.", "Turn the oven down to 180C/350F/Gas 4.", "For the filling, if you’re using pre-packed beetroot, drain away any excess liquid. Roughly chop the beetroot and put into a food processor with the cream. Blend to a thick purée.", "In a bowl, whisk the eggs and sugar together thoroughly. Add the beetroot purée, spices and lemon zest and mix well.", "Pour the mixture into the pastry case and bake for 30–40 minutes, or until the filling is set with a slight wobble in the middle. Leave to cool completely. "]}, {"isVegetarian": true, "title": "Beetroot, lentil and goats’ cheese salad", "url": "www_bbc_co_uk_food_recipes_beetroot_lentil_and_03289", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beetroot_lentil_and_03289_16x9.jpg", "ingredients": ["½ x 400g tin small green lentils, drained and rinsed", "2 tsp olive oil", "1 tsp wholegrain mustard", "½ bag mixed salad leaves (about 60g)", "100g/3½oz vacuum-packed cooked beetroot, quartered", "50g/1¾oz soft goats’ cheese, sliced ", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the lentils a saucepan with a teaspoon of olive oil until just warmed through. Add a splash of water if they start to stick. Remove from the heat and stir through the wholegrain mustard.", "Put the mixed leaves into a serving bowl and top with the hot lentils, the quartered beetroot and the sliced goats’ cheese. Drizzle the remaining olive oil over the top and season with salt and freshly ground black pepper. Serve with toast."]}, {"isVegetarian": true, "title": "Beetroot chocolate cake", "url": "www_bbc_co_uk_food_recipes_beetroot_chocolate_cake_82388", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beetroot_chocolate_cake_82388_16x9.jpg", "ingredients": ["200g/7oz butter, plus extra for greasing", "250g/9oz cooked and peeled beetroot", "200g/7oz dark chocolate (70% cocoa solids)", "4 tbsp hot espresso", "135g/5oz plain flour", "1 heaped tsp baking powder", "3 tbsp cocoa powder", "5 free-range eggs, separated", "190g/6½oz golden caster sugar", "crème fraîche or double cream, to serve "], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Grease a 20cm/8in cake tin with a little butter and line the bottom of the tin with a disc of baking parchment.", "Blend the beetroot in a food processor to a rough purée.", "Melt the chocolate in a bowl suspended over a pan of hot water (do not allow the bottom of the bowl to touch the water), then pour in the hot coffee.", "Stir in the butter in small pieces and leave to soften. Remove from the heat and allow to cool slightly.", "Meanwhile, sift the flour, baking powder and cocoa together in a bowl and set aside. ", "Separate the eggs. Whisk the yolks in a bowl until frothy.  Stir the eggs into the chocolate and butter mixture, then fold in the beetroot.", "Whisk the egg whites until still peaks form when the whisk is removed. Fold in the sugar.", "Fold the sugar and egg whites into the chocolate mixture, then fold in the flour and cocoa mixture.", "Pour the batter into the prepared tin and bake for 40 minutes, or until a skewer inserted into the cake comes out clean.", "Allow to cool in the tin, then serve with crème fraîche or double cream. "]}, {"isVegetarian": true, "title": "Beetroot salad", "url": "www_bbc_co_uk_food_recipes_beetroot_salad_06735", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beetroot_salad_06735_16x9.jpg", "ingredients": ["2 medium beetroot", "dash olive oil, for drizzling", "20g/1oz blanched almonds", "½ tsp cumin seeds", "1 red eating apple, cut into 2cm/1in cubes", "1 green eating apple, cut into 2cm/1in cubes", "½ small red onion, sliced ", "handful fresh herbs", "salt and freshly ground black pepper", "150g/5½oz plain yoghurt", "1 lime, zest and juice", "2 tsp honey"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Pre-heat the oven to 200C/180C Fan/Gas 6.", "Line a baking tray with kitchen foil and place the beetroots in the middle. Season with salt and pepper and drizzle with oil. Wrap the foil up around the beetroots, seal and bake for 1 hour.", "Place a small frying pan over a low heat and toast the nuts and cumin seeds for 2 minutes. Remove from the heat and allow to cool in the pan.", "Peel and cut the beetroot into 2cm/1in cubes and place in a large, glass bowl. Stir in the apple, nuts, seeds and herbs.", "To make the dressing, mix the ingredients together in a bowl. Just before serving, dress the salad and mix well. "]}, {"isVegetarian": true, "title": "Beetroot salad with buffalo curd cheese", "url": "www_bbc_co_uk_food_recipes_beetroot_salad_with_60687", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["5 whole raw beetroot, tops and leaves left on", "2 litres/3½ pints buffalo milk (available from delicatessens and specialist suppliers)", "50ml/2fl oz lemon juice", "6 tbsp extra virgin olive oil", "½ baguette, cut into small cubes", "2 sprigs fresh rosemary, leaves only", "2 sprigs fresh thyme, leaves only", "2 tbsp sherry vinegar", "1 tsp cumin seeds", "1 tbsp fresh tarragon leaves", "1 tbsp fresh oregano leaves, plus extra whole sprigs, to garnish", "1 tbsp fresh marjoram leaves", "1 tbsp flatleaf parsley leaves", "salt and freshly ground black pepper", "4 sprigs oilseed rape (optional)", "4 sprigs fresh dill, leaves only"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Cut the leaves from the tops of the beetroot and set aside. ", "Half-fill a saucepan with water, then add the whole beetroot and bring the water to the boil. Reduce the heat until the water is simmering, then simmer for 30-45 minutes, or until the beetroot are tender when pierced with the point of a knife. Drain well and set aside to cool.", "Meanwhile, bring the buffalo milk to the boil in a separate saucepan, without stirring. When the milk is just coming to the boil, whisk in the lemon juice – you will immediately see a reaction as the milk solidifies and separates into curds and whey.", "Carefully strain the buffalo milk curds and whey through a sieve suspended over a large bowl. Set aside to drain for 5 minutes - the longer you leave it to strain, the more solid a cheese it will become. Once strained, chill the solid curd cheese in the fridge until needed (discard the liquid whey). ", "Heat half the olive oil in a frying pan over a medium heat. When the oil is hot, add the bread cubes, rosemary and thyme leaves and fry, stirring well, until the bread is golden-brown and crisp. Transfer the pan contents to a bowl, then drizzle over the remaining olive oil and all of the sherry vinegar.", "Add the cumin seeds and reserved beetroot leaves to the pan used to cook the bread and stir-fry until the beetroot leaves have just wilted. Add the pan contents to the bowl with the bread cubes.", "When the beetroot are cool enough to handle, cut them into chunks and add them to the bowl containing the bread cubes. Mix in the remaining herbs and season, to taste, with salt and freshly ground black pepper. ", "To serve, divide the salad among four serving plates. Top with spoonfuls of the strained buffalo curd cheese. Drizzle over a little olive oil, then garnish with the oregano sprigs, oilseed rape, if using, and dill sprigs."]}, {"isVegetarian": true, "title": "Beetroot seed cake", "url": "www_bbc_co_uk_food_recipes_beetroot_seed_cake_50355", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beetroot_seed_cake_50355_16x9.jpg", "ingredients": ["butter or oil, for greasing", "225g/8oz self-raising flour ", "half a teaspoon bicarbonate of soda", "a level teaspoon baking powder", "half a teaspoon ground cinnamon", "180ml/6¼fl oz sunflower oil", "225g/8oz light muscovado sugar", "3 free-range eggs, separated", "150g/5oz raw beetroot, peeled", "juice of half a lemon", "75g/3oz sultanas or raisins", "75g/3oz mixed seeds (such as sunflower, pumpkin and linseed)", "8 tablespoons icing sugar", "a little lemon juice or orange blossom water", "poppy seeds, to garnish"], "serves": "Serves about 8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven at 180C/350F/Gas 4. Lightly grease a rectangular loaf tin (20cm x 9cm x 7cm/8in x 4in x 3in), then line the base with baking parchment.", "Sift together the flour, bicarbonate of soda, baking powder and cinnamon. ", "Beat the oil and sugar in a food mixer until well combined, then introduce the egg yolks one by one, mixing after you add each egg yolk. Grate the beetroot coarsely and fold it into the egg mixture, then add the lemon juice, sultanas (or raisins) and the assorted seeds. Pulse until combined.", "Fold the flour and raising agents into the egg mixture whilst the machine is on a slow setting.", "Beat the egg whites until light and almost stiff. Fold gently but thoroughly into the cake mixture, using a large metal spoon (a wooden one will knock the air out). Pour the mixture into the cake tin and bake for 50-55 minutes, covering the top with a piece of foil after thirty minutes. Test with a skewer for doneness. The cake should be moist inside but not sticky. Leave the cake to settle for a good twenty minutes before turning out of its tin onto a wire cooling rack.", "To make the icing, sift the icing sugar into a bowl and stir in enough lemon juice or orange blossom water to achieve a consistency where the icing will run over the top of the cake and drizzle slowly down the sides (about three teaspoonfuls), stirring to remove any lumps. Drizzle it over the cake and scatter with the poppy seeds. Leave to set before eating."]}, {"isVegetarian": false, "title": "Beetroot soufflé with anchovy sauce", "url": "www_bbc_co_uk_food_recipes_beetroot_souffl_with_45218", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["20g/¾oz butter, for greasing", "20g/¾oz fine dry breadcrumbs, for dusting", "400g/14oz cooked beetroot, peeled and diced", "150ml/5fl oz pink grapefruit juice", "1 tsp hot horseradish", "sea salt and freshly ground black pepper", "3 tbsp plain flour", "4 free-range eggs, separated", "125g/4½oz unsalted butter", "1 large garlic clove, cut into 3", "10 anchovy fillets in oil, drained", "100ml/3½fl oz double cream"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Grease six individual ramekins with the butter and dust the insides with the breadcrumbs. Preheat the oven to 220C/425F/Gas 7. ", "Place the beetroot, half the grapefruit juice, horseradish, sea salt and freshly ground black pepper into a blender and pulse until smooth.", "Heat the remaining grapefruit juice in a small pan, mix in the flour to make a paste and add it to the blender. Add the egg yolks to the mixture one at a time and blend until everything is smooth. Pour the mixture from the blender into a large bowl.", "Whisk the egg whites until stiff in a clean bowl and then carefully fold into the beetroot mixture. ", "Place the prepared ramekins onto a baking tray, pour in the soufflé mixture and bake in the oven for 20 – 25 minutes.", "For the anchovy sauce, put the butter and garlic into a pan, fry for one minute then discard the garlic. Lower the heat and add the anchovy fillets. When they have completely dissolved, stir in the cream and remove the pan from the heat.", "When the soufflés are cooked, make a small hole in the middle of each one, pour in two tablespoons of the sauce and serve immediately."]}, {"isVegetarian": true, "title": "Beetroot tart with salt and vinegar caramel goats’ curd", "url": "www_bbc_co_uk_food_recipes_beetroot_tart_with_salt_75327", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 large beetroot", "1 garlic bulb", "2 sprigs fresh thyme", "150g/5oz caster sugar ", "300g/11oz shop-bought puff pastry", "50g/2oz butter", "1 red onion, finely sliced", "50m/2fl oz port", "25ml/1fl oz red wine vinegar", "25ml/1fl oz sherry vinegar", "large pinch salt", "50g/2oz pine nuts, toasted in a dry frying pan", "150g/5oz fresh goats' curd", "25ml/1fl oz sherry vinegar", "110ml/4fl oz olive oil", "1 bunch fresh tarragon, leaves only", "1 bunch fresh basil, leaves only", "1 bunch fresh coriander, leaves only"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Place the beetroot onto a tray with the garlic, thyme and 50g/2oz of the sugar and roast in the oven for 1-1 ½ hours, or until tender. Once cooked allow the beetroot to cool before peeling.", "Cut into very thin slices on a mandolin, or use a very sharp knife.", "Roll the pastry out to a rectangle the thickness of pound coin and prick with a fork. Place onto a flat baking sheet and cover with a second tray to stop the pastry rising.", "Bake in the oven for 15-20 minutes or until the pastry is golden-brown.", "Heat the butter in a small saucepan and fry the onions for 3-4 minutes, or until just softened.", "Add the port and red wine vinegar and cook until reduced by half in volume. Blend the mixture in a food processor until smooth.", "Meanwhile, heat the remaining sugar in a small saucepan with two tablespoons of water. Once the sugar has dissolved, increase the temperature so that the mixture browns and caremalises. Once the mixture is dark brown in colour, remove the saucepan from the heat and add 20ml/¾fl oz water to stop the caramel from setting hard.", "Allow the caramel to cool slightly, then add the salt and sherry vinegar.", "Spread the red onion purée over the cooked pastry, then lay the beetroot on top in a fish scale pattern.", "Drizzle with the caramel and place in the oven for 2-3 minutes, or until hot.", "Meanwhile for the salad, whisk the sherry vinegar and olive oil until well combined and coat the herbs with the dressing.", "Remove the pastry from the oven, trim the ends and cut into triangle shapes.", "To serve, place a scoop of goats’ curd on top of the tart. .Sprinkle over the pine nuts and drizzle generously with the caramel. Serve alongside the herb salad."]}, {"isVegetarian": true, "title": "Beetroot tzatziki", "url": "www_bbc_co_uk_food_recipes_beetroot_tzatziki_01974", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 cooked (not pickled) beetroot, peeled", "500g/1lb 2oz plain Greek-style yoghurt", "1 lemon, juice only", "handful fresh dill", "2 tbsp chopped fresh mint leaves", "2 tbsp finely chopped cucumber", "salt and freshly ground black pepper", "vegetable chips, for dipping"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Put the beetroot in a mini food processor and blend until finely chopped. Transfer to a bowl and mix in all the remaining ingredients except the vegetable chips. Season with salt and black pepper.", "Serve with vegetable chips for dipping."]}, {"isVegetarian": false, "title": "Beetroot tartare with horseradish and beef", "url": "www_bbc_co_uk_food_recipes_beetroot_tartare_with_10362", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz raw beetroot, scrubbed and skin left on", "2 tbsp cherry vinegar ", "1 red onion, finely chopped", "1 Bramley apple, peeled and finely grated ", "1½ tbsp wholegrain mustard", "1 tbsp olive oil ", "2 tbsp horseradish, freshly grated ", "1 tbsp honey ", "handful foraged leaves (such as sea aster, sea beet or chickweed), chopped", "rapeseed oil, to taste", "250g/9oz best-quality rump steak, trimmed and finely diced", "sea salt flakes and freshly ground black pepper", "150g/5½oz smoked soft cheese", "75-100ml/2½-3½oz single cream", "50-100g/1¾-3½oz crème fraîche", "75g/2½oz unsalted butter", "150g/5½oz brown breadcrumbs", "foraged leaves (as above)"], "serves": "Serves 4 as a starter, or 2 as a main course", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the beetroot tartare, peel 100g/3½oz of the beetroot and cut it into very small cubes. Put the beetroot cubes in a bowl with the vinegar. Season with salt and pepper and set aside to marinade. ", "Cook the remaining beetroot in a saucepan of boiling water for 40-45 minutes, until soft. Drain, submerge in cold water and remove their skins – you can wear plastic gloves if you don’t want your hands to be stained red. ", "Cut the cooked beetroots into very small cubes and toss them with red onion, apple, mustard and olive oil in a bowl. Add the raw marinated beetroot, to taste, along with the horseradish, honey and the foraged leaves. Season to taste with salt and pepper. Drizzle with the rapeseed oil, to taste.", "For the smoked cheese, place the cheese in a bowl and mix in the cream and crème fraîche. Season with black pepper.", "To serve, melt the butter in a frying pan, add the breadcrumbs and fry until golden-brown.", "Dot the beef around the serving plates and place a small spoonful of the smoked cheese mix on top. Dot the beetroot mixture around the plates and garnish with the foraged leaves and toasted breadcrumbs."]}, {"isVegetarian": true, "title": "Beetroot and mascarpone risotto with crumbled Wensleydale cheese", "url": "www_bbc_co_uk_food_recipes_beetrootandmascarpon_85258", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 raw beetroot, peeled, roughly chopped", "750ml/1¼ pints vegetable stock", "30g/1oz butter", "2 shallots, peeled, finely chopped", "2 garlic cloves, peeled, finely chopped", "2 sprigs fresh thyme, leaves only", "250g/9oz arborio rice", "100ml/3½fl oz white wine", "3 tbsp mascarpone", "110g/4oz parmesan, grated", "small handful fresh parsley, chopped", "salt and freshly ground black pepper", "2 tbsp olive oil", "1 tsp butter", "1 beetroot, finely sliced ", "200g/7oz Wensleydale cheese, crumbled"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the risotto, blend the beetroot with half of the stock in a food processor until smooth. Transfer to a saucepan, bring the boil and reduce the heat so the liquid is at a simmer.", "Heat the butter in a large saucepan over a medium heat. Add the chopped shallots, garlic and thyme leaves.  Cook gently for 1-2 minutes until softened.", "Add the rice to the pan and stir to coat all the grains in the buttery mixture.  Cook, stirring, for another 1-2 minutes until the grains begin to look translucent.", "Add the wine to the pan and allow it to bubble up and reduce slightly.", "Add a ladleful of the simmering beetroot stock, and stir until all of the liquid has been absorbed. Continue adding the stock, a ladleful at a time, as the liquid is absorbed, stirring between each addition.", "When you have used all of the beetroot stock, heat the remaining vegetable stock and start adding that to the risotto in the same way (you may not need all of it).  Cook the rice until the grains are tender but retain some bite. This will take at least 20 minutes.", "When the rice is cooked, remove from the heat and stir in the mascarpone, parmesan, chopped parsley and season with salt and freshly ground black pepper.", "To serve, heat the olive oil and butter in a frying pan. Add beetroot slices and sauté for 3-4 minutes, until just tender.", "Serve the risotto topped with the beetroot slices and the crumbled Wensleydale cheese."]}, {"isVegetarian": false, "title": "Beetroot and potato rosti with smoked salmon", "url": "www_bbc_co_uk_food_recipes_beetrootandpotatoros_84607", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 large Maris Piper potatoes, scrubbed, not peeled", "2 beetroot, peeled, coarsely grated", "2 cloves garlic, crushed", "salt and freshly ground black pepper ", "5 tbsp olive oil", "100g/3½oz fresh horseradish", "200g/7oz crème fraîche", "1 lemon, juice only", "salt and freshly ground black pepper", "250g/10½oz smoked salmon", "8 sprigs fresh dill, to serve", "4 lemon wedges, to serve"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Place the potatoes into a saucepan of boiling salted water and boil for seven minutes, then drain and leave to cool.", "When the potatoes are cool enough to handle, peel them and grate them into a bowl.", "Add the grated beetroot and garlic, season, to taste, with salt and freshly ground black pepper, and mix together well.", "Divide and shape the potato mixture into six flat patties, place onto a baking sheet and transfer to the fridge to chill for one hour.", "Heat the oil in a large frying pan over a medium-high heat. Add the potato röstis and fry for 4-6 minutes on each side, or until golden-brown all over, then drain on kitchen paper.", "For the horseradish sauce, mix the horseradish, crème fraîche and lemon juice together in a clean bowl and season, to taste, with salt and freshly ground black pepper.", "To serve, place each rösti onto a plate. Top with a spoonful of horseradish sauce and a piece of salmon, then finish each plate with some sprigs of dill and a lemon wedge."]}, {"isVegetarian": true, "title": "Beetroot, carrot and blue cheese salad", "url": "www_bbc_co_uk_food_recipes_beetrootcarrotandblu_12159", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 medium carrots, peeled", "2 whole beetroots", "caster sugar", "sea salt and freshly ground pepper", "1 bunch flat leaf parsley, picked", "extra virgin olive oil", "red wine vinegar", "100g/3½oz blue cheese", "1 tbsp grated ginger"], "serves": "Serves 2 or 4 as a shared dish", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Bring a pot of boiling salted water to the boil and gently simmer the carrots until just cooked.", "Roast the beetroots with their skin on in a medium oven or simply boil them with the vinegar, sugar and salt until soft, about 40 minutes. ", "Allow to cool then peel and cut into wedges.", "In a bowl, place the parsley, beetroot and carrots.", "Dress the vegetables with extra virgin olive oil and about 1/3 the amount of red wine vinegar (3 parts oil to 1 part vinegar). Season with the salt and pepper, then add the blue cheese and grated ginger.  Gently mix to ensure the vinegar and oil coat all ingredients.", "Serve in a bowl as a shared salad or on individual plates as an entrie."]}, {"isVegetarian": false, "title": "Beetroot, bacon and goats' cheese salad", "url": "www_bbc_co_uk_food_recipes_beetrootbaconandgoat_92212", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 large beetroot, cooked, peeled and thinly sliced", "6 rashers smoked streaky bacon, cut into lardons", "2 tsp olive oil", "1 tsp English mustard", "1 tbsp white wine vinegar", "3 tbsp rapeseed oil", "salt and freshly ground black pepper", "caster sugar, to taste", "75g/3oz watercress, trimmed", "2 Little Gem lettuce, leaves separated", "4 x 1cm/½in thick slices goats' cheese, rind on"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Arrange the sliced beetroot around the edge four serving plates, overlapping the slices to form a circle.", "Bring a pan of water to the boil, add the bacon lardons and blanch for 1 minute. Drain and pat dry with kitchen paper. ", "Heat a frying pan until hot, add the bacon lardons and fry for 3-4 minutes, until golden-brown and crisp. Drain on kitchen paper. ", "Whisk the English mustard, white wine vinegar and rapeseed oil together in a bowl for the dressing. Season, to taste, with salt, freshly ground black pepper and the caster sugar.", "Place the watercress and Little Gem leaves in a bowl and mix together. Add the bacon lardons.", "Preheat the grill to high.", "Place the goats' cheese rounds onto a grill tray and cook under the grill for 1-2 minutes, or until golden-brown and bubbling. ", "To serve, drizzle the dressing over the salad leaves and toss well to coat. Pile the salad into the middle of the serving plates. Balance the goats' cheese rounds on to of the salad and drizzle some more dressing around the edges of the plate."]}, {"isVegetarian": true, "title": "Beetroot, cheese and cranberry pies with wasabi potatoes", "url": "www_bbc_co_uk_food_recipes_beetrootcheeseandcra_87572", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 1oz beetroot, scrubbed ", "oil, for drizzling", "salt and freshly ground black pepper ", "350g/12¼oz Wensleydale cheese, crumbled", "1 onion, sliced", "1 red chilli, de-seeded and chopped ", "100g/3½oz dried cranberries", "200g/7oz baby spinach, washed", "6 x 15cm/6in squares ready-rolled puff pastry", "1 free-range egg, beaten ", "poppy seeds, for sprinkling", "100ml/3½fl oz olive oil", "450g/1lb new potatoes, halved if large, par-boiled", "salt and freshly ground black pepper ", "200g/7oz butter, softened", "75g/2¾oz wasabi paste", "1 tbsp chopped fresh coriander", "cooked Brussels sprouts, to serve"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5.", "Place the beetroot into a roasting tin, drizzle with oil and season with salt and freshly ground black pepper.", "Transfer to the oven and roast for 45 minutes, or until softened. Set aside to cool, then cut into wedges and place into a large bowl.", "Increase the oven temperature to 200C/400F/Gas 6. ", "Add the cheese, onion, chilli, cranberries and spinach to the bowl with the beetroot. Season well with salt and freshly ground black pepper and stir well.", "Lay the pastry squares out on a non-stick baking sheet and divide the beetroot mixture equally among the squares.", "Draw the pastry up around the edges to completely enclose the filling in a tight ball.", "Brush the pastry all over with beaten egg and sprinkle over the poppy seeds.", "Transfer to the oven and bake for 15 minutes, or until crisp and golden-brown.", "Meanwhile, for the potatoes, heat an ovenproof dish until very hot. Add the oil and the par-boiled potatoes, season well with salt and freshly ground black pepper and stir.", "Place into the oven and roast for 25 minutes, or until crisp and golden-brown.", "In a bowl, mix together the butter and wasabi until well combined (you may not need all of the wasabi butter - save the rest for use in another dish.)", "When the potatoes are cooked and you're ready to serve, add the wasabi butter to the dish with the potatoes and stir well to coat. Sprinkle over the coriander.", "To serve, place a pie onto each serving plate with some wasabi potatoes and Brussels sprouts."]}, {"isVegetarian": true, "title": "Beetroot, goats' cheese and walnut salad", "url": "www_bbc_co_uk_food_recipes_beetrootgoatscheesea_85188", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 ready-cooked beetroot, chopped", "50g/1¾oz goats' cheese, crumbled", "50g/1¾oz green beans, cooked, drained", "1 tbsp chopped walnuts ", "handful fresh parsley", "1 tsp Dijon mustard", "1 tsp white wine vinegar", "3 tsp olive oil", "1 tsp goats' yoghurt", "50g/1¾oz goats' cheese, crumbled"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["For the salad, place the beetroot, goats' cheese, green beans and walnuts into a large bowl and mix well. ", "Place the parsley onto a serving plate and top with the beetroot mixture.", "For the dressing, place all the dressing ingredients into a bowl and mix well.", "To serve, pour the dressing over the salad."]}, {"isVegetarian": false, "title": "Beetroot gnocchi with butter, sage and orange sauce", "url": "www_bbc_co_uk_food_recipes_beetrootgnocchiwithb_91340", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 kg/2lb 4oz floury potatoes, such as King Edward, peeled and roughly chopped", "400g/14oz cooked beetroot, peeled and roughly chopped", "300g/11oz plain flour", "1 free-range egg, lightly beaten", "pinch salt", "110g/4oz butter", "6 sage leaves", "1 orange, juice only, plus zest of 2 oranges, to serve", "salt, to taste", "4 tbsp freshly grated parmesan cheese"], "serves": "Serves 4-6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the gnocchi, place the potatoes into a pan of salted water and bring to the boil. Simmer for 15-18 minutes, or until tender.", "Drain the potatoes and return them to the heat to drive off any excess moisture. Allow them to cool for a minute and then mash well using a potato masher or ricer.", "Blend the beetroot in a food processor to a purée. Pass the purée through a fine sieve.", "Tip the flour onto a clean work surface and make a well in the centre. Add the beaten egg, mashed potato, beetroot purée and salt to the well. ", "Using your hands, mix well until the dough reaches a smooth consistency.  Split the dough into 4-6 equal pieces and roll each piece out into a long sausage shape.", "With a sharp knife, cut the gnocchi 'sausages' into 2cm/1in pieces and set aside. ", "Bring a large saucepan of lightly salted water to the boil. Add the gnocchi and simmer until they float back up to the top. As they come to the surface, lift them out with a slotted spoon. As soon as you drop the gnocchi into the boiling water, start making the sauce - you need to work quickly because the gnocchi will rise to the top after only a minute or so. ", "For the sauce, melt the butter in a large frying pan and add the sage leaves. Allow the sage to infuse for about 30 seconds and then add the orange juice and salt, to taste. ", "Scoop out the cooked gnocchi with a slotted spoon, allowing them to drain a little, and then add them to the sauce, mixing well. Cook for a minute or so until the sauce begins to thicken slightly. ", "Remove the pan from the heat, stir in the parmesan and serve immediately, sprinkled with orange zest."]}, {"isVegetarian": true, "title": "Beetroot mayonnaise", "url": "www_bbc_co_uk_food_recipes_beetrootmayonnaise_81741", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp white wine vinegar", "1 tbsp parsley stalks, roughly chopped", "1 tbsp chervil, chopped", "2 free-range egg yolks", "1 tsp English mustard powder", "150ml/5fl oz light olive oil", "150ml/5fl oz vegetable oil", "salt and freshly ground black pepper", "squeeze lemon juice", "250g/9oz cooked beetroot, quartered", "1 tbsp chives, finely chopped", "50g/1¾oz rocket", "2 tsp olive oil"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the vinegar, parsley stalks and chervil into a small saucepan and bring to the boil. Simmer until the volume is reduced to one tablespoon of liquid. ", "Strain the liquid through a sieve and discard the parsley and chervil.", "Place the egg yolks, mustard powder and infused vinegar into a food processor and blend.", "With the blender still running, gradually add the oils. Continue to blend the mixture until all the oil has been incorporated and the mixture has thickened.", "Season with salt and freshly ground black pepper and add a squeeze of lemon juice.", "To serve, mix the cooked beetroot into the mayonnaise, stir in the chives and serve on a plate with fresh rocket drizzled with olive oil."]}, {"isVegetarian": true, "title": "Beetroot relish", "url": "www_bbc_co_uk_food_recipes_beetrootrelish_86997", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 cooked beetroot in vinegar, drained and chopped", "small handful fresh chervil, chopped", "1 tbsp olive oil", "salt and freshly ground black pepper"], "serves": "Serves 1-2", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place all the ingredients into a bowl and mix well."]}, {"isVegetarian": true, "title": "Beetroot soup", "url": "www_bbc_co_uk_food_recipes_beetrootsoup_82121", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "¼ red onion, chopped", "2 beetroot, peeled and sliced", "100ml/3½ fl oz chicken stock (vegetarians may substitute vegetable stock)", "1 tbsp fresh parsley, chopped", "1 tbsp canned borlotti beans, rinsed and drained", "salt and freshly ground black pepper", "1 tbsp Greek yoghurt, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a pan over a medium heat. Add the onions and then sauté for 3-4 minutes, until softened. ", "Add the beetroot, stock, fresh parsley and borlotti beans and bring to the boil. Reduce the heat to simmer gently for 10 minutes, or until the beetroot has softened and iscooked through. Season, to taste, with salt and freshly ground black pepper, then blend with a hand blender until smooth.", "To serve, pour into a bowl and garnish with a tablespoon of Greek yoghurt."]}, {"isVegetarian": true, "title": "Beetroot soup on the quick", "url": "www_bbc_co_uk_food_recipes_beetrootsouponthequi_72798", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["350g/12oz cooked, peeled beetroot, chopped", "1 onion, grated", "1 tsp grated horseradish", "750g/1lb 10oz low-fat Greek-style yoghurt", "½ tsp celery salt", "1 tbsp cider vinegar", "½ tsp ground black pepper", "up to 300ml/½ pint vegetable stock or milk", "4 spring onions, finely chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Blend the cooked beetroot, onion, horseradish, Greek-style yoghurt, celery salt, cider vinegar and black pepper in a food processor until smooth.", "Once at a desired consistency, use vegetable stock or milk to thin down the mixture.", "The soup can be served either hot or cold.  If preferred hot, warm through on a low flame, being careful not to boil. ", "Check for seasoning.", "To serve, pour into a warmed bowl and sprinkle with chopped spring onions."]}, {"isVegetarian": true, "title": "Beetroot soup with feta", "url": "www_bbc_co_uk_food_recipes_beetrootsoupwithfeta_13774", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beetrootsoupwithfeta_13774_16x9.jpg", "ingredients": ["3-4 medium (apple-sized) beetroot (about 500-600g/1lb 2oz-1lb5oz, grated coarsely, or choped into small dice", "500g/1lb 2oz ripe tomatoes, halved", "1 clove garlic, chopped roughly ", "1 medium onion, peeled and  finely chopped ", "2 tbsp olive or sunflower oil", "500ml/16½fl oz good strong stock (beef is best, but chicken or vegetable will do)", "salt and freshly ground black pepper", "125g/4oz real (i.e. Greek not Danish) feta cheese"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the halved tomatoes in an ovenproof dish. Throw over the garlic and drizzle over half the olive oil.", "Roast for 25-30 minutes in a fairly hot oven (190C/375F/Gas 5) until soft and pulpy. Rub through a sieve to remove the skin and pips. ", "Heat the remaining oil in a pan and sweat the onion for a few minutes until soft. Add the beetroot and the stock and bring to the boil. Season lightly with salt and freshly ground black pepper. Simmer gently for 7-10 minutes until the beetroot is tender.", "Stir in the tomato purée, transfer the soup to a blender and process until completely smooth. Taste and adjust the seasoning if necessary ", "To serve cold, chill the soup in the fridge, then divide between six bowls. Using your fingers, crumble a little feta into each bowl. A sprinkling of grated raw beetroot makes a good garnish for the cold version ", "To serve hot, reheat the soup until thoroughly hot but not boiling. Divide between warm bowls and crumble over a little feta into each bowl. Serve with crusty bread."]}, {"isVegetarian": false, "title": "Beetroot with green sauce", "url": "www_bbc_co_uk_food_recipes_beetrootwithgreensau_89906", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 medium raw beetroot", "olive oil", "large-flaked sea salt", "handful fresh mint, finely chopped", "handful fresh parsley, finely chopped ", "2 tbsp baby capers, rinsed and drained", "½ banana shallot (or 1 ordinary shallot), finely chopped", "1 garlic clove, finely chopped", "6 canned anchovy fillets in oil, drained, chopped", "½ tsp Dijon mustard", "4 tbsp olive oil", "½ lemon, juice only"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Put the beetroot into a large pan and cover with water. Bring to the boil, then reduce the heat and simmer for 40 minutes, or until tender. Drain and set aside until just cool enough to handle, then carefully rub off the beetroot skins. Discard the skins.", "Place the mint, parsley, capers, shallot and garlic into a bowl.", "Add the anchovies and the mustard and mix well.", "Add the olive oil and the lemon juice sparingly, adding more as required. Mix well and leave to stand.", "Chop each beetroot into eight equal wedges and place into a bowl. Sprinkle with a little salt and drizzle with the green sauce.", "Serve immediately."]}, {"isVegetarian": false, "title": "Belgian chocolate truffle cheesecake", "url": "www_bbc_co_uk_food_recipes_belgian_chocolate_02043", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz dark Belgian chocolate, broken into pieces", "500g/1lb 2oz full-fat soft cheese", "200ml/⅓ pint soured cream", "150g/5½oz caster sugar", "3 large eggs", "sunflower oil, for greasing", "300g/10½oz chocolate oat biscuits", "50g/2oz butter, melted", "Belgian chocolate truffles", "100g/4oz white cooking chocolate, for grating, or icing sugar"], "serves": "Serves 10", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["Lightly oil a 23cm loose-based spring-clip cake tin and line the base with baking parchment.", "Put the chocolate for the filling in a heatproof bowl and place it over a pan of simmering water. Check that the bottom of the bowl isn’t touching the water. When the chocolate has melted, remove it from the heat and stir until smooth, then set aside to cool for a few minutes.", "To make the crust, break up the biscuits roughly, then put them in a food processor and blitz them into crumbs. ", "Add the melted butter and blend until mixed. ", "Tip the mixture into the tin and press it firmly and evenly over the base. ", "Pop the tin into the freezer to harden.", "Preheat the oven to 180°C/Fan 160°C/Gas 4. ", "Bring a kettle of water to the boil. ", "Put the cheese, soured cream, sugar and eggs in a food processor and blend until smooth. With the motor running, slowly add the melted chocolate and blend until thoroughly combined.", "Remove the biscuit base from the freezer. Take 2 large sheets of foil and place them on the work surface, one across the other. Take the cake tin out of the freezer and place it in the centre of the foil and bring the foil up around it to create a bowl shape. Place the whole thing in a roasting tin. Pour the chocolate mixture on to the biscuit base. Then carefully pour hot water from the kettle into the roasting tin until it rises almost halfway up the sides of the cheesecake.", "Bake the cheesecake in the centre of the oven for 35–45 minutes. It’s ready when the chocolate mixture is almost firm but retains a slight wobble.", " Turn the oven off, but wedge a folded tea towel in the door and leave the cake to cool in the oven with the door ajar for at least 1 hour. Remove, cover with cling film and chill for at least 4 hours or overnight before serving. ", "To serve, loosen the sides of the tin with a knife and release the spring clip. Slide the dessert off the base of the tin on to a plate. ", "Decorate with the chocolate truffles and dust with grated white chocolate or icing sugar. For utter luxury, serve with some cream. Yum, yum!"]}, {"isVegetarian": true, "title": "Bellini cocktail", "url": "www_bbc_co_uk_food_recipes_bellinicocktail_67941", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bellinicocktail_67941_16x9.jpg", "ingredients": ["2 ripe peaches, peeled, halved and stone removed, or the equivalent using tinned peaches in natural juice", "chilled champagne or sparkling wine", "2 chilled champagne glasses"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the peaches in a small blender and purée until totally smooth. This can be done well in advance and kept in the fridge. Spoon half into the chilled champagne glasses and slowly top up with champagne, stirring as you pour. You should ideally have one third peach purée to two thirds champagne. Serve straight away as a pre-dinner drink with the Cupid's Caviar, leaving plenty of time for a second glass each."]}, {"isVegetarian": false, "title": "Belly pork with piccalilli purée", "url": "www_bbc_co_uk_food_recipes_belly_pork_with_75994", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": [" 650g/1lb 6oz pork belly", "150g/5oz salt ", "50ml/2fl oz soy sauce", "50g/2oz honey", "25ml/1fl oz mirin", "25ml/1fl oz sesame oil", "4 slices shonka ham (available from specialist butchers)", "½ cauliflower head, roughly chopped", "1 large onion, roughly chopped", "50g/2oz salt", "600ml/1pint 1fl oz white wine vinegar", "300ml/11fl oz malt vinegar", "pinch dried chilli", "2 tsp cornflour", "15g/½oz turmeric", "25g/1oz English mustard powder", "125g/4½oz sugar", "½ cucumber, peeled, seeds removed", "2 Granny Smith apples", "2 tsp lemon juice", "pinch salt", "1 tbsp apple balsamic vinegar", "4 large cauliflower florets, thinly sliced on a mandolin ", "1 lemon, juice only", "sea salt", "3 tbsp coriander cress", "1 tsp ground cumin"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Rub the meat side of the pork belly with the salt. Cover with clingfilm and chill in the fridge for 24 hours.", "Remove the pork from the fridge and rinse under cold running water for at least 20 minutes.", "Place the pork in a sous vide bag and vacuum seal.", "Heat a water bath to 72C/160F and place the pork in the bath for 24 hours. Alternatively, place into a pressure cooker, cover and cook for one hour.", "Once cooked, place the sealed pork between two baking trays.  Gently press down with a weight and chill in the fridge for a minimum of 12 hours. Once pressed cut the pork into squares.", "Place the soy, honey, mirin and sesame oil into a bowl and whisk together until fully emulsified into a teriyaki sauce.", "Heat a frying pan until hot. Add the pork skin-side down and fry on each side until caramelised. Spoon the teriyaki sauce over to glaze the pork. Remove the meat from the pan and place onto a chopping board. Place the shonka ham over the top and fold over the edges.", "For the piccalilli, place the cauliflower and onion into a colander. Cover with the salt and set aside for 24 hours. Rinse away the salt thoroughly under cold running water.", "Mix the cauliflower and onion with the cucumber until well combined.", "Bring the vinegars to the boil with the chilli, turn off the heat and set aside to infuse for 20 minutes.", "Bring the vinegar mixture to the boil again. Stir in the corn flour, turmeric, mustard and sugar and simmer for three minutes.", "Pour the simmering liquid over the vegetables, transfer to a food processor and blend until smooth. Pass through a fine sieve and chill in the fridge until required.", "Meanwhile, cut the apples into 1.5cm/½in cubes. Dress the cubes with the lemon juice, salt and a drop of apple balsamic.", "For the cauliflower salad, mix the cauliflower with lemon juice and sea salt.", "To serve, brush the piccalilli across the plate. Add a piece of pork on top and scatter over the apple and finish with the cauliflower salad."]}, {"isVegetarian": false, "title": "Bengali fish curry", "url": "www_bbc_co_uk_food_recipes_bengali_fish_curry_44820", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 sea bass or sea bream fillets (each around 200g/7oz), scales removed but skin on", "1 tsp flaked sea salt, plus extra to season", "¼ tsp cayenne pepper", "2½ tsp English mustard powder", "freshly ground black pepper", "4 tbsp sunflower oil", "1 heaped tsp yellow mustard seeds", "¾ tsp black mustard seeds", "¾ tsp cumin seeds", "1 medium onion, finely sliced", "2 long green chillies,  stalk trimmed and cut in half without deseeding", "1 bay leaf", "½ tsp ground turmeric", "½ tsp garam masala", "150g/5½oz ripe tomatoes, roughly chopped", "150g/5½oz rice, cooked according to packet instructions"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Cut the fish fillets into roughly 7cm/3in wide strips. Put in a bowl and toss with the salt, cayenne pepper, half a teaspoon of the mustard powder and lots of freshly ground black pepper. ", "Mix the remaining mustard powder with 300ml/10fl oz water, adding it gradually and stirring constantly until you have thin yellow liquid. Set aside.", "Heat the oil in a large non-stick frying pan and fry the fish over a high heat, skin-side down for a minute, or until the skin begins to crisp. Carefully turn over and cook on the other side for a further minute. Take the fish out of the pan and put on a plate. (Don’t let the fish get crowded in the pan or they will be difficult to turn. If your pan isn’t large enough, cook the fish in two batches instead. It’s nice to have the skin on the fish but you can easily remove it after frying if you prefer.)", "As soon as the fish is cooked, return the pan to the heat and add both the mustard seeds and cumin seeds. Cook for a few seconds, stirring constantly. Add the sliced onion, chillies and bay leaf. Cook for about five minutes, stirring constantly, until the onion is softened and pale golden-brown. Make sure you cook with the extractor on full-speed as the spices could make you sneeze! Sprinkle over the turmeric and garam masala, add the chopped tomatoes and cook for two minutes more, stirring constantly.", "Stir in the reserved mustard liquid and bring to a simmer. Cook for three minutes, or until the sauce has thickened and the volume of liquid has reduced by approximately one-third.  The spices should have mellowed and the sauce should coat the back of a spoon. Return the fish to the pan and warm through in the bubbling sauce for two minutes until hot. ", "Serve immediately with rice."]}, {"isVegetarian": true, "title": "Bengali butternut squash with chickpeas", "url": "www_bbc_co_uk_food_recipes_bengalibutternutsqua_89988", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bengalibutternutsqua_89988_16x9.jpg", "ingredients": ["3 tbsp vegetable oil", "large pinch ground asafoetida", "1 bay leaf", "½ tsp panch phoran (a blend of equal quantities of fenugreek, nigella seeds, fennel seeds, cumin and mustard seeds), available from Asian supermarkets, also known as Bengali five-spice ", "1-2 mild dried red chillies", "1 small onion, chopped", "½ tsp ground turmeric", "2 level tsp ground cumin", "1 heaped tsp ground coriander", "2 tsp ginger paste (available from Asian supermarkets, or make your own by crushing or blending fresh ginger to a rough paste, adding water if necessary to loosen)", "500g/1lb 2oz butternut squash, peeled, seeds removed, flesh cut into 4cm/1½in cubes", "200ml/7fl oz boiling water", "200g/7oz canned chickpeas, drained and washed", "1 tsp ground garam masala", "1 tsp ground fennel seeds", "salt, to taste", "sugar, to taste"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a large non-stick pan over a medium heat. Add the asafoetida, bay leaf, panch phoran and chillies and fry for 1-2 minutes, stirring well to combine.", "Add the onion, stir to coat in the spices, and fry for 2-3 minutes, or until softened and golden-brown. ", "Add the ground turmeric, cumin and coriander, the salt, sugar and ginger paste and stir well. Add a splash of water, stir and cook for a further 1-2 minutes.", "Add the butternut squash pieces and the boiling water. Bring the mixture to the boil, then reduce the heat to a simmer, cover the pan with a lid and simmer for 10-15 minutes, or until the butternut squash is tender.", "Add the chickpeas, ground garam masala and fennel seeds and another splash of water if necessary to keep the mixture loose. Add the salt and sugar, if using. Stir well and continue to cook for 1-2 minutes, or until warmed through. Serve immediately."]}, {"isVegetarian": true, "title": "Bengali-style aubergine cooked in yoghurt", "url": "www_bbc_co_uk_food_recipes_bengalistyleaubergin_86619", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400g/14oz small Japanese-style aubergines, thinly sliced into rounds ", "good pinch ground turmeric", "salt, to taste", "½ tsp red chilli powder", "2 tbsp vegetable oil", "250ml/9fl oz plain yoghurt", "1-1½ tsp sugar", "1 rounded tsp cumin seeds, toasted in a frying pan and ground in a clean coffee grinder or pestle and mortar", "handful fresh coriander leaves, chopped, to garnish"], "serves": "Serves 3-4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Dust the aubergine slices with the turmeric, salt and half the red chilli powder.", "Heat the oil in a large, non-stick frying pan and fry the aubergine pieces until soft (you may have to do this in two batches). Set aside.", "In a bowl, beat 200ml/7fl oz of the yoghurt with the sugar, salt and the remaining red chilli powder. Pour into a small saucepan and heat gently, stirring often to stop it from splitting, for about five minutes.", "Stir in the ground cumin and the aubergine slices. Heat gently and stir to combine.", "Stir in the remaining yoghurt, check the seasoning and serve garnished with the fresh coriander."]}, {"isVegetarian": true, "title": "Non-alcoholic Bloody Mary", "url": "www_bbc_co_uk_food_recipes_bensbloodymary_11199", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 litre/1¾ pint tomato juice", "1 bunch celery leaves (washed and picked from ½ a bunch of celery)", "dash Tabasco sauce (to taste)", "dash creamed horseradish", "dash HP sauce (to taste)", "2 limes, juice only", "crushed ice (optional)"], "serves": "Makes 1 litre jug", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Put everything in a big jug and mix", "Add a handful of crushed ice if you like but Ben has his without!"]}, {"isVegetarian": false, "title": "Boeuf en daube provençale", "url": "www_bbc_co_uk_food_recipes_beouf_en_daube_provenale_77740", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beouf_en_daube_provenale_77740_16x9.jpg", "ingredients": ["1.5kg/3lb 5oz beef brisket, trimmed of excess fat and cut into large 6cm/2½in chunks", "salt, to taste", "2 large onions, finely sliced", "4 carrots, peeled and cut into 1cm/½in rounds", "2 sticks celery, cut into 1cm/½in slices", "6 garlic cloves, finely chopped", "1 bottle red wine", "100ml/3½fl oz brandy or cognac", "50ml/2fl oz red wine vinegar", "4 bay leaves", "2 large sprigs thyme", "few sprigs parsley", "2 pieces pared orange zest", "4 cloves", "1 tsp black peppercorns", "2 x 4cm/1½in pieces cinnamon stick", "4 tbsp olive oil", "150g/5½oz bacon lardons", "1 onion, finely chopped", "2 tbsp tomato purée", "600ml/20fl oz beef stock", "150g/5½oz black olives", "300g/10½oz red camargue rice, cooked according to packet instructions"], "serves": "Serves 4-6", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Put the beef into a large fridge-friendly container. Sprinkle with salt, then add all the marinade ingredients. ", "Divide the ingredients for the bouquet garnis in half and tie into two separate parcels of muslin. Add one of these to the marinade and set the other one aside. Cover and put in the fridge. Leave for at least six hours, but preferably overnight.", "For the casserole, drain the meat, reserving the liquid and the rest of the marinade ingredients. Pat the meat dry and brush off any garlic. ", "Heat half of the olive oil in a large frying pan and fry the meat in batches until well browned. Deglaze the base of the frying pan with a little of the marinade liquid and set aside. ", "In a large casserole, add the remaining olive oil. Add the lardons and fry on a high heat for a few minutes until crisp and brown. Add the onion and reduce the heat to medium. Fry for around 10 minutes, or until the onion has softened and lightly coloured. Stir in the tomato purée. Add the beef to the casserole and stir to coat.", "Strain the marinade and pour over the liquid along with the deglazing liquid from the frying pan and the second bouquet garni. ", "Bring to the boil and simmer until the volume of liquid has reduced by around a third. ", "Add enough beef stock so that the beef is just covered. Return to the boil, then turn down the heat to low. Cover, and simmer for around three hours. ", "If you are able to, leave overnight – cool and leave in the fridge to chill. Once chilled, it will make skimming off any fat much easier. Otherwise, just skim off some of the fat which will collect at the top. ", "Add the olives, then simmer uncovered for a further hour to reduce down the sauce. Serve with red camargue rice."]}, {"isVegetarian": false, "title": "Berkswell toasty pudding", "url": "www_bbc_co_uk_food_recipes_berkswell_toasty_pudding_03447", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 slices white bread", "50g/1¾oz butter", "2 tsp wholegrain mustard ", "4 slices ready-to-eat ham", "2 tbsp ale, optional", "150ml/¼ pint double cream", "1 tsp Worcestershire sauce", "2 free-range egg yolks", "280g/10oz Berkswell cheese, grated ", "salt and freshly ground black pepper", "dressed salad leaves, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Butter the bread, spread with half the mustard and make four ham sandwiches. ", "Using a large circular cutter, cut each sandwich into a circle (if you don’t have a cutter, remove the crusts and cut the sandwiches into triangles). Place in a small oval ovenproof dish and pour a little ale over each sandwich, if using.", "In a pan, bring the cream up to the boil. When it starts to thicken, remove from the heat. Stir in the remaining mustard, the Worcestershire sauce, egg yolks and 225g/8oz of the cheese. Season with salt and pepper. ", "Pour the sauce over the sandwiches and scatter the remaining cheese over the top. ", "Bake for 12 minutes, or until golden-brown and bubbling. Serve with dressed salad leaves. "]}, {"isVegetarian": true, "title": "Berry crumble traybake", "url": "www_bbc_co_uk_food_recipes_berry_crumble_traybake_59984", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/berry_crumble_traybake_59984_16x9.jpg", "ingredients": ["200g/7oz frozen berries (raspberries, blackberries, cherries, blueberries, blackcurrants all work well, or a mix)", "50g/2oz caster sugar", "2 tbsp cornflour", "110g/4oz plain flour", "70g/2½oz cold unsalted butter, cut into smallish cubes", "30g/1oz caster sugar", "220g/8oz plain flour", "¾ tsp baking powder", "½ tsp cinnamon", "50g/2oz ground almonds", "200g/7oz caster sugar", "80g/3oz butter, melted", "2 free-range eggs", "40g/1½oz yoghurt thinned with 2 tbsp milk"], "serves": "Serves 10-12", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Grease and line a rectangular baking tin (approximately 26cm x 20cm/10½in x 8in). ", "In a saucepan combine the fruit with 50ml/2fl oz water. Bring the fruit just to the boil, reduce the heat and simmer for 2-3 minutes.", "In a mixing bowl combine the caster sugar with the cornflour.  Stir into the fruit and continue to cook for 2-3 minutes, stirring frequently, until the mixture is thick and jammy. Set aside to cool.", "For the crumble topping, add the flour to a mixing bowl and rub in the butter until the mixture resembles fine breadcrumbs and no large lumps of butter are left. Stir in the sugar and set aside.", "For the cake, in a large mixing bowl, sift together the flour, baking powder and cinnamon. Stir in the ground almonds until thoroughly combined.", "In another bowl beat together the sugar with the melted butter, eggs, yoghurt and milk mixture until thoroughly mixed.  Stir into the flour mixture just to combine. Don’t overmix it, but watch out for big lumps of unmixed flour.", "Spoon two-thirds of the mixture into the lined tin, gently spreading out evenly to the corners. Spoon the cooled fruit mixture evenly over the top.", "Using a teaspoon, dot the remaining cake batter evenly on top of the fruit.  This will not cover the entire cake, but make little hillocks with gaps in between.", "Sprinkle the crumble mixture over the top, filling in all the gaps to cover the fruit.", "Bake in the oven for 45-50 minutes, until the crumble topping is golden-brown. Allow to cool for ten minutes in the tin, then transfer the cake in its paper to a cooling rack. This is cake is beautiful eaten while still warm, with a dollop of crème fraîche or yoghurt – but is equally nice the next day with a cup of coffee."]}, {"isVegetarian": true, "title": "Berry cheesecake in a glass", "url": "www_bbc_co_uk_food_recipes_berrycheesecakeinagl_92447", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/berrycheesecakeinagl_92447_16x9.jpg", "ingredients": ["150g/5¼oz mixed seasonal berries (such as blackberries, blueberries, or strawberries)", "1 tbsp golden caster sugar", "1 lemon, zest and juice", "4 ginger biscuits", "1 tbsp butter", "2 tbsp icing sugar", "125g/4½oz mascarpone"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the berries, caster sugar and one tablespoon of the lemon juice in a small pan, stirring well to combine, for 3-4 minutes, or until the sugar has dissolved and the berries have broken down. Set aside to cool. ", "Place the biscuits into a freezer bag and crush using a rolling pin until they resemble breadcrumbs. ", "Melt the butter in a small saucepan over a low to medium heat. ", "Mix together the crushed biscuits and melted butter in a bowl until well combined. Spoon the mixture into the bottom of two large serving glasses. ", "Place the mascarpone into a large mixing bowl and fold in the lemon zest, remaining lemon juice and icing sugar. ", "Spoon the mascarpone into the glasses, then spoon over the berries and juice. Serve immediately."]}, {"isVegetarian": true, "title": "Best-ever banoffee pie", "url": "www_bbc_co_uk_food_recipes_best-ever_banoffee_pie_75984", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/best-ever_banoffee_pie_75984_16x9.jpg", "ingredients": ["75g/2½oz butter", "300g/10½oz chocolate oaty biscuits", "115g/4oz butter", "115g/4oz soft dark brown sugar", "397g/14oz can sweetened condensed milk", "450ml/16fl oz double cream", "5 ripe but firm medium bananas", "1 tsp fresh lemon juice", "25g/1oz coarsely grated plain dark chocolate or chocolate curls"], "serves": "Serves 12", "time": {"preparation": "1-2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["To make the base, melt the butter in a small pan. Break the biscuits into chunky pieces and put in a food processor. Blend into crumbs then add the melted butter and, with the motor running, blend until thoroughly mixed. Alternatively, put the biscuits in a strong polythene food bag and bash with a rolling pin. Tip into a bowl and stir in the melted butter.", "Tip the crumbs into the centre of a deep, 23cm/9in fluted loose-based tart tin or quiche dish and press firmly into the base and sides. (Make sure the biscuit base is evenly distributed, especially where the base meets the sides.) Chill in the fridge for 30 minutes, or until set.", "To make the filling, melt the butter in a medium non-stick saucepan and stir in the sugar. Cook over a low heat as the sugar dissolves, stirring constantly until the butter and sugar look smooth and no oil floats to the surface. Add the condensed milk and bring to a gentle simmer, stirring constantly. Cook for three minutes, stirring until the mixture turns a deep, creamy caramel brown. ", "Pour the toffee gently onto the biscuit base and quickly smooth the surface. Leave to chill for one hour (and up to eight hours) before topping.", "Just before serving, lightly whip the cream in a bowl. It should stand in soft peaks, any thicker and it will look over-whipped when mixed with the bananas. Diagonally slice four of the bananas and scatter half of them over the toffee. Fold the rest lightly into the cream and spoon gently on top. ", "Slice the remaining banana and put in a bowl. Pour the lemon juice over and very gently toss together (this will stop the banana turning brown). Decorate the top with the lemony banana, poking into the cream randomly, and sprinkle the pie with grated chocolate or decorate with chocolate curls. Serve in fairly thin slices as it is very rich."]}, {"isVegetarian": true, "title": "Berry yoghurt", "url": "www_bbc_co_uk_food_recipes_berry_yoghurt_95274", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/berry_yoghurt_95274_16x9.jpg", "ingredients": ["175g/6oz frozen mixed berries, defrosted", "340g/12oz fat-free Greek yoghurt", "10g/¼oz flaked almonds, toasted"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Spoon the yoghurt into two glasses, top with half the berries, and then repeat the layers.", "Sprinkle with the flaked almonds and serve."]}, {"isVegetarian": false, "title": "Best-ever spaghetti Bolognese", "url": "www_bbc_co_uk_food_recipes_besteverspaghettibol_89567", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp vegetable oil", "450g/1lb lean beef mince", "100g/3½oz chicken livers, trimmed ", "1 onion, finely chopped ", "2 garlic cloves, chopped", "1 red pepper, finely chopped ", "1 green pepper, finely chopped ", "150g/5oz button mushrooms, sliced ", "2 bay leaves", "200g/7oz tomato purée", "100ml/3½fl oz red wine", "1 x 400g/14oz can chopped tomatoes", "salt and freshly ground white pepper", "1 tsp fresh thyme leaves", "1 tsp fresh parsley", "1 tsp fresh oregano (or half teaspoon dried oregano)", "400g/14oz spaghetti, cooked according to packet instructions", "parmesan, finely grated"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the vegetable oil in a large pan over a medium heat.", "Add the mince and cook until golden-brown all over. Remove the mince from the pan with a slotted spoon and set aside.", "Add the chicken livers to the same pan and cook until browned all over. Remove the livers from the pan and chop into bite-sized pieces and set aside.", "Add the onion to the pan and fry for 4-5 minutes, to soften and colour.", "Add the garlic, red and green peppers and mushrooms and fry for 5-6 minutes, or until softened and lightly coloured.", "Add the cooked mince, the cooked livers, the tomato purée and bay leaves and continue to cook for eight minutes.", "Add the wine and tomatoes and bring to the boil. Reduce the heat and simmer for 30-45 minutes.", "Season, to taste, with salt and freshly ground white pepper.", "Add the thyme, parsley and oregano and stir well to combine.", "To serve, place equal portions of cooked spaghetti into four serving bowls. Spoon equal amounts of Bolognese sauce over each portion and sprinkle with finely grated parmesan."]}, {"isVegetarian": true, "title": "Bewitched", "url": "www_bbc_co_uk_food_recipes_bewitched_92643", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 medium-sized pumpkin, flesh scooped out and chopped, fibres removed; seeds removed, toasted and reserved for garnish", "1 litre/1¾ pints freshly squeezed orange juice", "2 tsp ground allspice", "2 tbsp clear honey", "35ml/1¼fl oz bourbon whiskey", "1 tbsp sour cherry liqueur", "2 tsp herb liqueur", "3 tbsp spiced pumpkin purée (see above)", "ice", "pumpkin seeds, toasted", "pinch freshly grated nutmeg"], "serves": "Makes 1 plus extra purée", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the spiced pumpkin purée, bring a small amount of water to a simmer in a pan. Suspend a steaming basket above the water (do not allow the base of the basket to touch the water). Add the chopped pumpkin and steam for 15-20 minutes, or until tender. Remove from the steaming basket and set aside to cool.", "When the pumpkin has cooled, transfer it to the bowl of a food processor. Add the orange juice, allspice and honey and blend until smooth and well combined.", "For the cocktail, pour the bourbon, sour cherry liqueur, herb liqueur and pumpkin purée into a cocktail shaker. Add ice and shake well.", "To serve, strain the mixture into a flute glass. Garnish the surface of the cocktail with a few toasted pumpkin seeds. Dust with a little freshly grated nutmeg."]}, {"isVegetarian": true, "title": "Big, fat salt and pepper breadsticks", "url": "www_bbc_co_uk_food_recipes_big_fat_salt_and_pepper_59413", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/big_fat_salt_and_pepper_59413_16x9.jpg", "ingredients": ["450g/1lb strong white bread flour, plus extra for dusting ", "1 x 7g/⅛oz sachet fast-action dried yeast ", "1½ tsp salt ", "250–275ml/9-10fl oz warm water ", "vegetable oil or spray oil, for oiling ", "2 tbsp extra virgin olive oil ", "2 tbsp sea salt ", "2 tbsp freshly ground black pepper "], "serves": "Makes 12", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Dust two large baking trays with flour. ", "Put the flour, yeast and the salt into a large bowl and add enough of the water to make a soft but not sticky dough. Knead well for 10 minutes by hand on a lightly floured work surface or for five minutes if using an electric mixer fitted with a dough hook. ", "Divide the mixture into 12 equal portions, each weighing about 60g/2½oz. Roll the portions into balls, then place each ball on a floured surface and roll into a long sausage shape about 25cmx2cm/10inx1in. (For the best visual results make the sausage shape an even thickness.)", "I like to shape half of them into twists. Run a knife down the centre to split the dough, leaving a bit at one end uncut. Braid or plait the two halves over each other to give a twisted effect. ", "Place the breadsticks on the prepared baking trays, spacing them 4cm/1½in apart.  Cover the breadsticks loosely with oiled clingfilm, making sure it is airtight. Leave in warm place for 30 minutes, or until the breadsticks have almost doubled in size.", "Preheat the oven to 200C/400F/Gas 6. ", "Remove the clingfilm and brush each breadstick with the extra virgin olive oil. Sprinkle half of the breadsticks with the sea salt and the remainder with the freshly ground black pepper. Bake on the top third of the oven for about 20 minutes, or until the breadsticks are lightly golden-brown and feel firm to the touch. Remove the breadsticks from the oven and leave to cool on the baking trays. "]}, {"isVegetarian": true, "title": "Bhindi bhaji", "url": "www_bbc_co_uk_food_recipes_bhindibhajji_74849", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp sunflower or vegetable oil", "1 onion, chopped", "½ tsp ground cumin", "½ tsp ground coriander", "½ tsp chilli powder", "¼ tsp ground turmeric", "150g/5¼ oz tomatoes, chopped", "450g/16oz okra, cut into 1in/3cm pieces"], "serves": "Serves 2-3", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a wok. Add the onions and spices and fry for 3-5 minutes until the onions are transparent.  Tip in the tomatoes and cook for a minute or two.  ", "Throw in the okra and simmer for 8-10 minutes or until the okra is cooked through.  ", "Season well and serve."]}]