[{"ingredients": ["Queso de cabra de 100 g / 3½ onzas, con corteza", "1 cucharadita de aceite de oliva", "pimienta negra recién molida", "ensalada de hierbas mixtas (cilantro, albahaca, perejil de hoja plana)", "aceite de oliva, para vestir ensalada"], "method": ["Calentar una sartén y rociar con el aceite.", "Moler abundante pimienta negra generosamente sobre el queso de cabra y colocar sobre la plancha durante 3-4 minutos, dando vuelta una vez.", "Coloque en la ensalada de hierbas y el vestido con aceite de oliva."], "url": "www_bbc_co_uk_food_recipes_pepperedgriddledgoat_78709", "title": "Queso de cabra a la plancha", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["30g / 1oz de mantequilla sin sal", "1 diente de ajo, pelado y aplastado", "½ batata, pelada y en rodajas", "1 cucharadita de hojas frescas de tomillo", "70ml / 2½fl oz de caldo de pollo o vegetal", "200g / 7oz de rape, cortados en trozos", "1 cucharada de pimienta fresca molida", "1 cucharadita de jengibre, rallado", "1 cucharada de aceite de oliva", "salpicaduras doble crema", "1 cucharadita de salsa de soja", "4 rebanadas de tocino", "cebollino, para adornar"], "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Para hacer el fondant, derrita suavemente la mantequilla en una sartén. Agregue el ajo y las rodajas de boniato. Espolvoree en el tomillo y luego vierta el caldo de pollo o verduras. Transfiera al horno y cocine por 10-15 minutos, o hasta que la papa esté tierna.", "Para el rape, espolvorea la pimienta y el jengibre sobre el pescado. Calentar el aceite en una sartén y cocinar el pescado durante 4-6 minutos. Agregue la crema y salsa de soya a la sartén y reduzca por unos minutos más.", "Caliente una sartén antiadherente hasta que esté caliente. Cocine la panceta por dos minutos en cada lado, hasta que quede crujiente.", "Para servir, retire la batata del horno y transfiérala a un plato de servir. Cubra con el rape sazonado con pimienta y sirva la panceta crujiente en la parte superior. Adornar con cebollino."], "url": "www_bbc_co_uk_food_recipes_pepperedmonkfishwith_76069", "title": "Rape con salsa picante de batata", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Solomillo de cerdo a 85 g / 3 oz, cortado en tres medallones", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "6 patatas Anya, cortadas en chips gruesos", "3 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "1 puñado de hojas de cohetes", "1 tomate, picado", "½ limón, solo jugo", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Coloque los medallones de cerdo entre dos hojas de película adhesiva y aplanar al grosor de una moneda de una libra, utilizando un mazo de carne o un rodillo. Retire la película adhesiva y sazone con sal y pimienta negra recién molida.", "Calentar el aceite en una sartén y freír los medallones durante 3-4 minutos en ambos lados, o hasta que estén dorados por completo y cocidos. Poner a un lado en un plato caliente para descansar.", "Para las patatas fritas, coloque los trozos de papa en una lata para asar, rocíe con aceite de oliva y sazone con sal y pimienta negra recién molida. Transfiera al horno para asar durante 12-15 minutos, volteando las papas de vez en cuando para asegurarse de que se doren uniformemente.", "Para la ensalada, combine todos los ingredientes de la ensalada en un tazón.", "Para servir, coloque los medallones de cerdo en un plato con las papas fritas y la ensalada al lado."], "url": "www_bbc_co_uk_food_recipes_pepperedporktenderlo_90711", "title": "Lomo de cerdo a la pimienta con patatas fritas y ensalada de rúcula", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 x 150 g / 5½ oz de chuletas de cerdo, huesos extraídos y grasa recortada", "1 cucharada de pimienta negra", "1 cucharada de semillas de cilantro", "1 cucharada de sal marina", "2 cucharadas de perejil fresco picado", "1 cucharada de aceite de oliva", "1 cucharada de aceite de oliva", "½ cebolla, finamente rebanada", "200g / 9 oz de patatas nuevas, hervidas hasta que estén tiernas y escurridas", "Habas de 50g / 1½oz, blanqueadas, pieles eliminadas", "50 g / 1½ oz de mantequilla sin sal", "1 cucharada de cebolletas frescas picadas", "sal y pimienta negra recién molida", "50 g / 1½ oz de mantequilla sin sal", "1 cucharada de aceite de oliva", "2 dientes de ajo, finamente picados", "50ml / 2fl oz de vino blanco", "1 naranja, solo jugo", "1 cucharada de aceite de oliva", "2 rodajas de naranja"], "method": ["Para el cerdo con pimientos, coloque las chuletas de cerdo entre dos hojas de película adhesiva y aplaste con un mazo de carne o un rodillo.", "Coloque los granos de pimienta, las semillas de cilantro y la sal en un almirez y mortero. Muela juntos, luego coloque la mezcla de especias en un tazón. Agregue el perejil y mezcle bien. Frote la mezcla de especias por todo el cerdo.", "Caliente el aceite en una sartén y cocine el cerdo durante 3-4 minutos por cada lado, o hasta que esté completamente cocido. Retirar de la sartén y dejar reposar.", "Para el puré de papas y frijoles, caliente el aceite en una sartén y fría la cebolla hasta que se ablande.", "Coloque las papas cocidas en un tazón grande con las habas y la mantequilla y mezcle con un machacador de papas. Agregue las cebolletas, sazone con sal y pimienta negra recién molida y mezcle bien.", "Para la salsa de ajo cítrico, caliente la mantequilla y el aceite en una sartén y fría el ajo por un minuto.", "Agregue el vino y el jugo de naranja y cocine a fuego lento hasta reducir a la mitad.", "Para las naranjas caramelizadas, caliente el aceite en una sartén y cocine las rodajas de naranja por un minuto en cada lado, hasta que estén caramelizadas.", "Para servir, coloque el puré de papas y frijoles en los platos y cubra con el cerdo salteado. Rocíe la salsa y cubra con las rodajas de naranja caramelizadas."], "url": "www_bbc_co_uk_food_recipes_pepperedporkwithcitr_85557", "title": "Cerdo a la pimienta con salsa de ajo y puré de patatas y frijoles", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filete de lomo 150 g / 5½ oz", "1 cucharada de aceite de oliva", "1 cucharada de granos de pimienta enteros, aplastados", "1 zanahoria, pelada, picada y blanqueada", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "25 g / 1oz de mantequilla sin sal", "1 cucharada de aceite de oliva", "½ cebolla roja picada", "1 cucharada de azúcar moreno", "50ml / 2fl oz de vino tinto", "1 cucharada de vinagre de vino tinto", "sal y pimienta negra recién molida", "25 g / 1oz de mantequilla sin sal", "1 cucharada de aceite de oliva", "50ml / 2fl oz de leche entera", "1 cucharada de mostaza integral", "1 patata, pelada, cortada en cubos y hervida hasta que esté tierna", "sal y pimienta negra recién molida"], "method": ["Precaliente una bandeja para hornear antiadherente en el horno a 200C / 400F / Gas 6.", "Para el bistec, frote todo el bistec con aceite y presione en los granos de pimienta para cubrir el bistec.", "Caliente una sartén hasta que esté muy caliente y dore la carne durante 2-3 minutos por cada lado. Coloque el bistec en la bandeja de hornear precalentada.", "Coloque las zanahorias en la bandeja para hornear con el bistec, rocíe con aceite, sazone con sal y pimienta negra recién molida y coloque en el horno para asar durante 4-5 minutos. Retire la carne del horno cuando esté cocido a su gusto y déjelo reposar. Deje las zanahorias para continuar tostando hasta que comiencen a dorarse.", "Para el condimento de cebolla roja, caliente la mantequilla y el aceite en una cacerola a fuego medio y cocine la cebolla hasta que esté blanda pero no coloreada.", "Agregue el azúcar morena, revuelva bien para cubrir las cebollas y cocine hasta que esté caramelizado. Agregue el vino tinto y el vinagre, deje hervir y cocine a fuego lento hasta que espese. Sazonar con sal y pimienta negra recién molida.", "Para el puré de mostaza, coloca la mantequilla, el aceite, la leche y la mostaza en un tazón grande con la papa. Sazonar con sal y pimienta negra recién molida y machacar con un machacador de papas hasta que quede suave.", "Para servir, coloca el bistec en un plato con las zanahorias y el puré y una cucharada de condimento."], "url": "www_bbc_co_uk_food_recipes_pepperedsteakwithroa_85345", "title": "Bistec a la pimienta con zanahorias asadas, salsa de cebolla roja y puré de mostaza", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filete de solomillo de 150 g / 5½ oz", "1 cucharada de aceite de oliva", "1 diente de ajo, finamente picado", "1 cucharadita de pimienta negra, agrietada en mortero y mortero", "1 manojo de espárragos, recortado", "2 tomates, cortados a la mitad", "3 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "2 cucharaditas de azúcar en polvo", "1 cucharada de aceite de oliva", "25g / 1oz de mantequilla", "100 g / 3½ oz de patatas Anya, cortadas en rodajas gruesas de 1 cm / ½ pulgadas", "75ml / 2½fl oz de vino blanco", "sal y pimienta negra recién molida", "75ml / 2½fl oz de vino blanco", "1 cucharadita de mostaza Dijon", "75ml / 2½ fl oz crema doble"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para el bistec con pimienta, frote la carne con el aceite y presione el ajo picado y la pimienta agrietada en un lado. Caliente una sartén hasta que esté caliente y caliente la carne en ambos lados, luego transfiera la sartén al horno para continuar cocinando durante unos cinco minutos o hasta que esté cocida a su gusto. Retire del horno y deje reposar en un lugar cálido.", "Para los espárragos y tomates asados, coloque los espárragos y los tomates en una bandeja para hornear y rocíe sobre el aceite de oliva. Sazonar con sal y pimienta negra recién molida. Espolvorea el azúcar sobre los tomates. Coloque en el horno para asar durante aproximadamente 6-7 minutos, o hasta que estén tiernos.", "Para las papas 'borrachas', caliente el aceite y la mantequilla en una sartén a prueba de horno y freír las rodajas de patata hasta que comiencen a colorear. Agregue el vino y sazone, al gusto, con sal y pimienta negra recién molida. Transfiera la sartén al horno durante aproximadamente 5-7 minutos, o hasta que las papas estén tiernas.", "Para la salsa de mostaza, caliente el vino en una olla pequeña y cocine a fuego lento hasta reducir a la mitad. Agregue la mostaza y la crema y cocine a fuego lento.", "Para servir, coloque las papas \"borrachas\" en un plato de servir. Cortar la carne y colocar en la parte superior, seguido de los espárragos y los tomates. Rocíe sobre la salsa de mostaza."], "url": "www_bbc_co_uk_food_recipes_pepperedsteakwithroa_88528", "title": "Bistec a la pimienta con espárragos asados, patatas \"borrachas\", tomates asados ​​y salsa de mostaza", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 filete de solomillo de 250 g / 9 oz", "1 diente de ajo, reducido a la mitad", "aceite de oliva, para lloviznar", "2 cucharaditas de pimienta negra, aplastadas", "1 cucharada de aceite de oliva", "25g / 1oz de mantequilla", "½ cebolla, en rodajas", "1 diente de ajo, picado", "70 g / 2½ oz de setas silvestres mezcladas, picadas", "salpicar vino blanco", "3 cucharadas de crema doble", "sal y pimienta negra recién molida", "1 camote mediano, pelado, cortado en pedacitos", "2 cucharadas de aceite de oliva", "sal marina, para rociar", "1 cucharada de perejil fresco picado, para servir"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para el bistec con pimientos, frote la carne con el lado cortado del ajo, frote con aceite de oliva y revuelva en los granos de pimienta para cubrir todo.", "Caliente una sartén y fríe la carne durante 3-4 minutos por cada lado, o hasta que esté cocida a su gusto. Retire del fuego y deje reposar en un lugar cálido.", "Para la salsa de champiñones silvestres, caliente el aceite de oliva y la mantequilla en una sartén, agregue la cebolla y saltee durante 3-4 minutos.", "Agregue el ajo y fría por un minuto.", "Agregue los champiñones y cocine por 3-4 minutos. Agregue el vino y cocine a fuego lento durante 2-3 minutos, luego agregue la crema y sazone bien con sal y pimienta negra recién molida.", "Para las patatas fritas, coloque las batatas fritas en una bandeja para hornear, rocíe con aceite y espolvoree sal marina.", "Transfiera al horno y hornee durante 15-20 minutos, o hasta que estén crujientes.", "Para servir, coloque las papas fritas en un plato para servir, cubra con el bistec y vierta sobre la salsa de hongos silvestres. Adorne con perejil."], "url": "www_bbc_co_uk_food_recipes_pepperedsteakwithwil_86269", "title": "Bistec a la pimienta con salsa de champiñones y chips de batata", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filete de venado 150 g / 5½ oz", "1 cucharadita de pimienta negra, aplastada", "pizca de sal", "1 cucharada de aceite de oliva, más extra para frotar", "150ml / ¼ de pinta de vino tinto", "½ chalote grande de plátano, pelado, picado", "2 cucharadas de vinagre de vino tinto", "pizca de azúcar en polvo", "puñado de cilantro fresco, perejil y cebollín, picados", "200g / 7oz de tomates cherry", "3 dientes de ajo sin pelar", "2 cucharadas de aceite de oliva", "1 cucharada de cocos, sin cáscara, picados", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Frote un poco de aceite de oliva sobre el filete de venado. Coloque los granos de pimienta negra triturados en un plato y enrolle la carne de venado sobre los granos de pimienta para cubrirlos, luego espolvoree con sal.", "Caliente el aceite de oliva de 1 cucharada en una sartén y coloque el venado en la sartén para freír durante 2-3 minutos en cada lado, o hasta que esté cocido a su gusto. Reserve para descansar en un lugar cálido.", "Para la vinagreta de vino tinto, coloque el vino tinto, la chalota picada, el vinagre y el azúcar en una cacerola pequeña y deje hervir a fuego fuerte durante 8-10 minutos, o hasta que se reduzca a la mitad. Retire la sartén del fuego, agregue las hierbas a la vinagreta y reserve en un lugar cálido.", "Para los tomates asados, coloque los tomates, el ajo, el aceite de oliva y los cocos en una lata pequeña para asar, sazone bien con sal y pimienta negra recién molida y revuelva para mezclar.", "Transfiera los tomates al horno para asar durante 10-12 minutos, o hasta que estén blandos y ligeramente carbonizados en los bordes. Retire los dientes de ajo y deseche.", "Para servir, corte el filete de venado en rodajas gruesas y colóquelo en un plato para servir con los tomates asados ​​en la parte superior y vierta la vinagreta."], "url": "www_bbc_co_uk_food_recipes_pepperedvenisonwithr_84746", "title": "Venado a la pimienta con tomates asados ​​y vinagreta de vino tinto", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 huevo blanco de corral", "½ limón, solo jugo", "1 cucharadita de aroma de menta", "425 g / 15 oz de azúcar glas, más extra para quitar el polvo", "175g / 6¼ oz de chocolate negro"], "method": ["Batir la clara de huevo en un bol hasta que se formen picos rígidos cuando se quite la batidora. Bata lentamente el jugo de limón, la menta y el azúcar glas hasta obtener una pasta dura.", "Incline la mezcla de menta en una superficie de trabajo espolvoreada abundantemente con azúcar glas y extiéndala finamente.", "Use un cortador de 5 cm / 2 pulgadas para recortar círculos y colocarlos en una bandeja para hornear. Enfríe en la nevera durante 1-2 horas, o hasta que la mezcla se haya solidificado.", "Mientras tanto, derrita el chocolate en un recipiente colocado sobre una fuente de agua hirviendo. (No permita que la base del recipiente toque el agua).", "Sumerja cada crema de menta en el chocolate derretido y déjela a un lado en una bandeja para hornear. Enfríe las cremas de menta hasta que se solidifiquen."], "url": "www_bbc_co_uk_food_recipes_peppermint_creams_00124", "title": "Cremas de menta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Hace 15-20", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/peppermint_creams_00124_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["300g / 10½oz de harina blanca fuerte, más extra para quitar el polvo", "Levadura de acción rápida con bolsita 1x7g", "1½ cucharadita de sal", "175ml / 6fl oz de agua tibia", "3 cucharadas de aceite de oliva virgen extra, más extra para engrasar", "100ml / 3½fl oz pasado", "1 pimiento rojo asado, sin piel, rebanado (o frasco pequeño de 200g / 7oz, pimientos asados ​​picantes, disponible en delicatessen y en línea)", "200 g / 7 oz de pepperoni, en rodajas", "200 g / 7 oz de mozzarella, roto en trozos o en rodajas", "rociar aceite de oliva virgen extra", "algunas ramitas hojas de albahaca fresca", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 240C / 220 Ventilador / Gas 9.", "Para la masa de pizza, coloque la harina, la levadura y la sal en un tazón grande y revuelva para combinar. Haga un pozo en el centro de los ingredientes secos y vierta el agua tibia y el aceite. Mezcle los ingredientes húmedos con los ingredientes secos usando primero una cuchara de madera, luego las manos, hasta que la mezcla se una como una suave bola de masa.", "Extienda la masa sobre una superficie de trabajo ligeramente enharinada y amásala bien durante 8-10 minutos, o hasta que la masa se haya vuelto lisa y elástica al tacto y ya no esté pegajosa. Use un dedo enharinado para hacer una sangría en la superficie de la masa; debería retroceder cuando la masa esté lista.", "Cubra la superficie de trabajo con un poco más de harina, luego extienda la masa de pizza, moviéndola sobre la superficie de trabajo mientras rueda para mantener la forma circular y evitar que la masa se pegue, hasta que tenga un disco grande y delgado. Presione la punta de sus dedos hacia abajo en la masa en toda la base de la pizza. Esto evita que suba demasiado durante la cocción.", "Para el relleno, extienda la salsa sobre la base de la pizza, dejando un espacio de 2 cm / 1 pulgada alrededor del borde. Sazonar, al gusto, con sal y pimienta negra recién molida. Esparce sobre las rodajas de pimiento asado, rodajas de pepperoni y trozos de mozzarella.", "Hornee la pizza en el horno durante 10-15 minutos, o hasta que la base esté crujiente y comenzando a chamuscar alrededor de los bordes. Antes de servir, rocíe un poco de aceite de oliva, decore con las ramitas de albahaca y sazone de nuevo con un chorro de pimienta negra."], "url": "www_bbc_co_uk_food_recipes_pepperoni_pizza_46786", "title": "Pizza de peperoni", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["600g / 1lb 5oz de carne de res guisado, como espinilla, grasa y tendones recortados, cortados en trozos pequeños", "4 ramitas de tomillo fresco, solo hojas", "6 bayas de pimienta de Jamaica", "1 hoja de laurel", "1 diente de ajo, pelado, finamente picado", "Jengibre de raíz de 10 cm / 4 in, pelado, muy finamente cortado", "1 cebolla, pelada, picada", "1,2 litros / 2 pintas de caldo de carne o agua, mezclado con 2 cucharaditas de extracto de levadura", "sal y pimienta negra recién molida", "450 g / 1 libra de ñame o papa, pelado, cortado en pedazos de 3cm / 1¼in", "400g / 14oz de camote, pelado, cortado en pedazos de 4cm / 1¾in", "Calabaza de 450 g / 1 libra o calabaza, pelada, cortada en trozos de 4 cm / 1 pulgada", "4 cebollas grandes de primavera, cortadas, ligeramente aplastadas con el filo de un cuchillo", "2-4 chiles Scotch bonnet, finamente picados", "1 x 400 ml / 14fl oz puede leche de coco", "1 x 400 g / 14 oz puede mantequilla frijoles, escurridos y enjuagados", "150 g / 5½ oz de espinaca o callaloo, solo hojas, lavado, triturado", "Harina normal 150g / 5½ oz", "pizca de sal", "4-5 cucharadas de agua fría"], "method": ["Para el guisado de pepperpot, coloque la carne de ternera, las hojas de tomillo, la pimienta de Jamaica, el langostino, el ajo, el jengibre, la cebolla y el caldo en una olla grande con tapa y con base gruesa. Sazonar, al gusto, con sal y pimienta negra recién molida. Llevar la mezcla a ebullición, luego reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento. Cubra y cocine a fuego lento durante 20-25 minutos.", "Agregue las verduras, los chiles Scotnet bonnet, la leche de coco y los frijoles a la sartén y mezcle bien. Regrese la mezcla a fuego lento y continúe cocinando, tapada, por otros 15-20 minutos.", "Mientras tanto, para las albóndigas de los spillers, en un tazón grande, mezcle la harina y la sal. Agregue el agua, poco a poco, revolviendo hasta que la mezcla se una como una masa suave. Dejar de lado.", "Después de que el guisado se haya cocinado durante 20 minutos, agregue el callaloo o la espinaca, revuelva bien y continúe cocinando a fuego lento durante 4-5 minutos.", "Mientras tanto, pellizque 20-24 piezas pequeñas de la masa y enrolle cada una en una bola, usando toda la masa. Agregue cada bola de masa a la olla inmediatamente después de enrollarla y vuelva a colocar la tapa. Continúe cocinando a fuego lento el guiso y las albóndigas durante 8-10 minutos, o hasta que la carne y las verduras estén tiernas, la salsa se haya espesado y las albóndigas estén bien cocidas."], "url": "www_bbc_co_uk_food_recipes_pepperpotstewwithspi_91703", "title": "Guiso de guisado de pimienta con albóndigas spillers", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 pimiento rojo, sin semillas y cortado en ocho tiras", "1 pimiento amarillo, sin semillas y cortado en ocho tiras", "10 tomates cherry, cortados a la mitad", "2 cucharaditas de pasta harissa", "450g / 1lb tarro de garbanzos cocidos en agua", "sal", "½ limón, solo jugo", "puñado de hojas de albahaca fresca"], "method": ["Vierta el aceite de oliva en una sartén grande a fuego medio.", "Agregue las rodajas de pimiento rojo y amarillo a la sartén y deje ablandar durante 2-3 minutos.", "Agregue los tomates cherry a la sartén y cocine por otros dos minutos, aplastando suavemente los tomates con una cuchara de madera para liberar sus jugos.", "Mezcle en la pasta harissa.", "Con cuidado, vierta los garbanzos y el agua en la que se almacenaron en la sartén. Revuelva, luego permita que se calienten a fondo durante 3-4 minutos.", "Sazonar con sal y el jugo de medio limón.", "Agregue un puñado de hojas frescas de albahaca justo al final de la cocción, para que se marchiten bajo el calor residual. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_peppers_with_chickpeas_85763", "title": "Pimientos con garbanzos y harissa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/peppers_with_chickpeas_85763_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2.5ml / ½ cucharada de aceite vegetal", "1 cebolla pequeña, pelada y finamente picada", "150ml / 5fl oz de vino blanco seco", "150ml / 5fl oz crème fraîche o crema doble", "2 cucharadas de granos de pimienta verde, enjuagados", "sal y pimienta negra recién molida para sazonar"], "method": ["Caliente el aceite en una sartén pequeña y cocine suavemente la cebolla hasta que esté suave.", "Agregue el vino y reduzca a la mitad.", "Agregue la crème fraîche y los granos de pimienta.", "Sazonar con sal y un montón de pimienta negra recién molida."], "url": "www_bbc_co_uk_food_recipes_peppersauce_1301", "title": "Salsa de pimienta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de pimienta entera mixta", "Sal marina de Maldon y pimienta negra recién molida", "4 filetes de solomillo de 4 x 175-225g / 6-8oz, al menos 2.5cm / 1in de espesor", "12 tomates de bebé en la vid", "3 cucharadas de aceite de oliva virgen extra", "200g / 7oz de judías verdes, coronadas y partidas en dos diagonalmente", "200 g / 7 oz de guisantes frescos (o congelados de buena calidad)", "200g / 7oz de espárrago inglés mediano, recortado", "200 g / 7 oz de habas frescas, o congeladas, descongeladas", "2 cucharadas de menta fresca picada", "2 cucharadas de cebolletas frescas cortadas", "150g / 5½ oz de ricotta", "2 cucharadas de parmesano recién rallado", "1 cucharada de aceite de oliva light", "botón de mantequilla"], "method": ["Coloque los granos de pimienta enteros en un almirez y mortero y aplaste ligeramente, luego agregue una cucharadita de sal marina de Maldon y combínelo suavemente, asegurándose de que deje algo de textura.", "Incline sobre un plato plano. Coloque los filetes secos con el rollo de cocina y presione la mezcla de pimienta mezclada en ambos lados de los filetes, con las manos.", "Si tiene tiempo, cúbralo con una película adhesiva y déjelo a temperatura ambiente durante 2-3 horas para permitir que los sabores se infundan.", "Corta los tomates para bebés en cuatro porciones de tres y coloca en una lata pequeña para asar.", "Rocíe una cucharada de aceite de oliva virgen extra y sazone al gusto.", "Asar durante 12-15 minutos hasta que estén ligeramente tostados y comiencen a suavizarse. Retirar.", "Para preparar el puré de verano, hierva una olla grande de agua salada.", "Agregue los ejotes y los guisantes frescos (si los usa congelados, no los agregue hasta aproximadamente un minuto antes de que termine el tiempo de cocción). Un minuto más tarde, agregue los espárragos y cocine por otros cinco minutos, luego escurra y deje enfriar con agua corriente fría.", "Retire las pieles de las habas. Corte las puntas de los espárragos, luego déjelos a un lado con aproximadamente una cuarta parte de las otras verduras.", "Incline las verduras restantes, incluidas las lanzas de espárragos, en un procesador de alimentos o licuadora con menta, cebollín, ricota y las restantes dos cucharadas de aceite de oliva virgen extra.", "Sazone generosamente con sal y pimienta negra recién molida. Licuar hasta obtener un puré áspero y luego verter en una sartén de base pesada.", "Doble el parmesano y las verduras blanqueadas reservadas.", "Reserve a un lado hasta que esté listo para usar.", "Para cocinar los filetes, caliente el aceite de oliva ligero en una sartén grande de base pesada a fuego alto. Agregue los filetes y cocine por dos minutos en cada lado, luego reduzca el fuego, agregue un poco de mantequilla y cocine los filetes durante 4-6 minutos, volteándolos una vez, dependiendo de qué tan raro o bien hecho le guste su carne.", "Transfiere los filetes a un plato. Reserve en un lugar cálido para descansar.", "Mientras los filetes descansan, caliente suavemente el puré. Para servir, divida el puré entre cuatro platos. Agregue un bistec a cada uno y termine con una pila de tomates y un chorrito de aceite de oliva."], "url": "www_bbc_co_uk_food_recipes_peppersteakwithroast_74816", "title": "Filete de pimienta con tomates asados ​​y puré de verano", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite vegetal", "pequeña asafoetida (disponible en tiendas asiáticas y algunos supermercados)", "¾ cucharadita de semillas de mostaza marrón", "¾ semillas de nigella (disponible en tiendas asiáticas y algunos supermercados)", "2 pequeños chiles rojos secos, enteros", "1 cucharadita de lentejas negras (urad dal), despellejado, partido y lavado", "1 cucharada de maní picado", "10 hojas de curry (disponibles frescas o secas de tenderos asiáticos)", "½ cabeza de repollo grande, finamente triturada", "sal al gusto"], "method": ["En un wok grande o en una cacerola antiadherente, caliente el aceite hasta que esté humeando (Nota: no deje el aceite caliente desatendido). Retire la sartén del fuego y deje que el aceite se enfríe durante diez segundos. Regrese la sartén a la placa, baje la temperatura y fría las semillas de asafoetida, mostaza y nigella durante 30 segundos. Agregue los chiles, las lentejas y los cacahuetes y fría por otro minuto o hasta que las lentejas hayan comenzado a colorear.", "Una vez cocido, agregue las hojas de curry, el repollo y la sal, al gusto. Revuelva freír durante diez minutos asegurándose de que el repollo conserva algo de firmeza.", "Para servir, distribuya la col entre 2-3 platos para servir."], "url": "www_bbc_co_uk_food_recipes_pepperyhotcabbagesal_86575", "title": "Ensalada de col picante", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 2-3", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["5 cucharadas de aceite de oliva", "1 cebolla, finamente picada", "sal y pimienta negra recién molida", "4 x 250 g / 9 oz de filetes de perca", "harina simple, para recubrimiento", "900ml / 1½ pintas de tomate pasado", "Alcaparras saladas de 100 g / 3½ oz, enjuagadas", "2 dientes de ajo, aplastados", "200ml / 7fl oz de caldo de pescado", "perejil fresco picado, para adornar"], "method": ["Calienta la mitad del aceite de oliva en una sartén y freír la cebolla picada con un poco de pimienta negra hasta que se dore.", "Sazonar la perca con sal y pimienta negra recién molida y dar a los filetes una ligera capa de harina.", "Calentar el aceite restante en una sartén por separado y freír el pescado hasta que esté dorado.", "Agregue el passata, las alcaparras, el ajo y el caldo de pescado a las cebollas, luego coloque el pescado en la salsa y cocine, sin tapa, a fuego lento durante 15 minutos. Agregue un poco más de stock si comienza a secarse.", "Sazonar con sal y pimienta negra recién molida al gusto, decorar con perejil fresco y servir."], "url": "www_bbc_co_uk_food_recipes_perchwithtomatoandca_82386", "title": "Perca con tomate y alcaparras", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["5 oz de azúcar en polvo de oro, más 1 cucharada para rociar", "1 cucharadita de canela molida", "2 cucharadas de harina de maíz", "600 g / 1 lb 5 oz Bramley manzanas de cocina, peladas, sin corazón, en rodajas", "Harina normal de 400 g / 14 oz, más laminado adicional", "2 cucharadas de azúcar en polvo", "1 limón, ralladura solamente", "250g / 10oz de mantequilla fría, cortada en cubos", "1 huevo de gallina, batido con 2 cucharadas de agua fría, más 1 huevo de gallina, batido, para esmaltar"], "method": ["Para la masa, coloque la harina, el azúcar y la ralladura de limón en un tazón y frote la mantequilla hasta que la mezcla se asemeje a pan rallado. Agregue el huevo batido y revuelva con un cuchillo de hoja redonda hasta que la mezcla forme una masa.", "Reserve un tercio de la masa para la tapa.", "Extienda la masa restante sobre una superficie ligeramente enharinada hasta obtener el grosor de una moneda de libra y 5-7 cm / 2-3 pulgadas más grande que el plato para pastel. Levante la masa sobre el rodillo y bájela suavemente en el plato para pastel.", "Presione firmemente la masa dentro del plato y hacia arriba, asegurándose de que no haya burbujas de aire. Enfríe la nevera por unos minutos.", "Precaliente el horno a 200C / 180 (ventilador) / Gas 6. Coloque una bandeja para hornear en el horno para precalentar.", "Para el relleno, mezcle el azúcar, la canela y la harina de maíz en un tazón grande. Revuelva en las manzanas.", "Coloque el relleno de manzana en el plato para pastel, asegurándose de que se eleve por encima del borde. Cepille el borde del plato con huevo batido.", "Estirar la bola de pastelería reservada. Cubra el pastel con la masa y presione los bordes juntos para sellar. Con un cuchillo afilado, corte el exceso de masa y, a continuación, apriete suavemente alrededor del borde. Haga algunos pequeños agujeros en el centro del pastel con la punta de un cuchillo. Glasear la parte superior con huevo batido.", "Amasar ligeramente los recortes de repostería y volver a enrollar. Cortar en forma de hojas coloque todo alrededor del borde del pastel, superponiéndose ligeramente entre sí, y glaseado con más huevo. Espolvorea el pastel con azúcar y hornea en el centro del horno durante 45-55 minutos o doradito por todas partes y las manzanas estén tiernas."], "url": "www_bbc_co_uk_food_recipes_perfect_apple_pie_73735", "title": "Pastel de manzana perfecto", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/perfect_apple_pie_73735_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Coliflor de 1 cabeza, cortada y rota en florecillas", "Tocino rayado ahumado de 250 g / 9 oz, cortado en tiras de 1cm / ½ pulgada", "250 g / 9 oz de champiñones castaños, finamente en rodajas", "25g / 1oz de mantequilla", "Harina normal de 50g / 2oz", "250ml / 9fl oz de leche entera", "pizca de mostaza inglesa en polvo", "Queso gruyere 200g / 7oz, rallado", "Crema doble 55ml / 2fl oz", "sal y pimienta negra recién molida", "pellizcar nuez moscada molida", "50g / 2oz ciabatta breadcrumbs", "50g / 2oz de queso parmesano, finamente rallado", "ensalada verde", "pan crujiente"], "method": ["Para la coliflor, cocine los floretes en una olla grande de agua hirviendo durante aproximadamente 10 minutos, o hasta que estén tiernos. Escurrir y apartar.", "Mientras tanto, para la salsa bechamel, freír las tiras de tocino en una sartén seca hasta que estén coloreados pero no crujientes. Retire el tocino con una cuchara ranurada y déjelo a un lado, manteniendo la grasa del tocino en la sartén.", "Agregue los champiñones a la sartén de grasa de tocino y fría por 2-3 minutos, o hasta que estén dorados. Retire de la sartén y reserve.", "Derrita la mantequilla en una cacerola limpia y bata en la harina hasta que quede suave. Bata lentamente en la leche hasta que quede suave, luego agregue el polvo de mostaza, el queso rallado y la crema doble. Continúe revolviendo hasta que el queso se haya derretido y la mezcla esté espesa y cremosa. Sazone al gusto con sal y pimienta negra recién molida, luego doble el tocino y los champiñones.", "Precalentar el horno a 180C / 350F / Gas 4.", "Coloque las florecillas de coliflor en una cazuela para horno y vierta sobre la salsa caseosa. Espolvorea una pizca de nuez moscada recién molida.", "Para el relleno, mezcle las migas de pan ciabatta con el queso parmesano, luego espolvoree la mezcla sobre la coliflor. Coloque en el horno durante 15 minutos, o hasta que el relleno esté dorado y burbujeante.", "Coloque el queso de coliflor en platos y sirva con una ensalada verde crujiente y pan crujiente."], "url": "www_bbc_co_uk_food_recipes_perfect_cauliflower_27405", "title": "Queso de coliflor perfecto con tocino y champiñones", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/perfect_cauliflower_27405_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["8 papas medianas para hornear", "1 cucharada de aceite vegetal", "600 g / 1 libra de carne picada de 5 oz", "2 cebollas, finamente picadas", "3 dientes de ajo, finamente picados", "4 ramitas de tomillo, hojas recogidas y finamente picadas", "1 apio, finamente cortado en cubitos", "2 cucharadas de puré de tomate", "guisa salsa Worcestershire, al gusto", "9 zanahorias, sin pelar, cortadas (1 finamente picada, 8 dejadas enteras)", "100 ml / 3½ fl oz de vino tinto", "500ml / 18fl oz de caldo de carne", "50 g / 1 oz de azúcar en polvo", "125 g / 4½ oz de mantequilla", "150ml / 5fl de leche en oz", "sal y pimienta negra recién molida"], "method": ["Precaliente el horno a 190C / 170C Fan / Gas 5.", "Pinche las papas con un tenedor, frote con un poco de aceite y hornee durante 1-1½ horas, o hasta que estén tiernas.", "Caliente una sartén grande hasta que esté caliente, agregue el aceite vegetal y fría la carne en tandas hasta que se dore. Agregue las cebollas, el ajo, el tomillo y el apio y fría por un par de minutos hasta que se ablanden.", "Agregue el puré de tomate y cocine durante 1-2 minutos, luego agregue la salsa Worcestershire y la zanahoria finamente picada. Agregue el vino tinto y cocine hasta que reduzca su volumen en un tercio, luego agregue el caldo de carne y cocine a fuego lento, revolviendo ocasionalmente. Cocine a fuego lento durante 30 minutos hasta que la carne esté tierna y la salsa se haya espesado.", "Mientras tanto, ponga las zanahorias restantes en una olla con agua, agregue una pizca de sal, el azúcar y un poco de mantequilla. Llevar a ebullición, luego reducir a fuego lento y cocinar durante 30-40 minutos hasta que esté suave.", "Una vez cocinado, incline la carne en un bol. Sazone al gusto con sal y pimienta negra y la salsa Worcestershire que desee.", "Déjalo enfriar mientras preparas el puré.", "Cuando las papas estén cocidas, sáquelas del horno para que se enfríen. Encienda el horno a 220C / 200C Fan / Gas 7.", "Cuando las papas estén lo suficientemente frías como para manipularlas, córtelas por la mitad, saque la carne y páselos en un cuenco, o tritúrelos con un tenedor.", "Agregue la mitad de la mantequilla restante a las papas y caliente la leche en una cacerola hasta que esté hirviendo a fuego lento. Verter sobre las papas y batir hasta que el puré esté suave y cremoso. Sazone al gusto con sal y pimienta negra.", "Vierta la carne picada fría en un molde para hornear y cuchara el puré caliente sobre la parte superior, esponjando la parte superior con un tenedor. Esparce unos cuantos puntos de mantequilla sobre la parte superior y luego colócalos en el horno de 10 a 15 minutos hasta que estén dorados y calientes.", "Sirve con las zanahorias cocidas."], "url": "www_bbc_co_uk_food_recipes_perfect_cottage_pie_78408", "title": "Pastel de casa perfecto", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2kg / 4lb 4oz vientre de cerdo deshuesado, piel anotada", "1 cebolla, cortada en trozos", "1 zanahoria, cortada en trozos", "1 apio, cortado en cuatro pedazos", "4 ramitas de hojas planas de perejil", "2 ramitas de tomillo", "Anís de 3 estrellas", "1 palito de canela, partido por la mitad", "110g / 4oz de mantequilla", "2 cucharadas de miel", "110ml / 4fl oz de vino tinto", "250ml / 9fl oz de caldo de carne", "sal y pimienta negra recién molida", "50g / 2oz de mantequilla", "4 rebanadas de tocino rayado ahumado, finamente cortado", "1 repollo verde, preferiblemente Hispie, finamente triturado", "150 g / 5 oz de coles de Bruselas, finamente en rodajas", "75ml / 3fl oz de agua", "2 cucharadas de perifollo fresco picado", "25g / 1oz de mantequilla", "1 manzana Bramley grande, pelada, picada"], "method": ["Para el vientre de cerdo, coloque la barriga de cerdo, la cebolla, la zanahoria, el apio, el perejil, el tomillo, el anís estrellado y los palitos de canela en una olla grande. Cubra con agua fría hasta que el cerdo esté cubierto.", "Llevar la mezcla a ebullición, luego reduzca el fuego y cocine a fuego lento durante dos horas.", "Retire la barriga de cerdo de la mezcla y colóquela entre dos bandejas de hornear pesadas. Enfriar en la nevera durante al menos dos horas.", "Precalentar el horno a 225C / 450F / Gas 8.", "Retire la carne de cerdo de la nevera y córtela en cuatro cuadrados.", "Caliente una sartén a prueba de horno hasta que esté caliente, agregue la mitad de la mantequilla y las piezas de la panceta de cerdo, con la piel hacia abajo. Freír por 2-3 minutos.", "Con cuidado, voltee las piezas de panza de cerdo y vierta sobre la miel. Ase el vientre de cerdo en el horno durante 10-12 minutos, o hasta que la piel de cerdo esté crujiente.", "Mientras tanto, ponga a hervir el vino tinto y el caldo de carne en una cacerola y cocine hasta que el volumen del líquido se haya reducido a la mitad. Agregue la mantequilla restante y sazone con sal y pimienta negra recién molida.", "Mientras tanto, para el repollo salteado y el tocino, caliente la mantequilla en una sartén hasta que haga espuma y fríe el tocino hasta que esté crujiente y dorado. Agregue el repollo y las coles de Bruselas y saltee por un minuto más. Agregue el agua y cocine por otros 4-5 minutos, o hasta que la col esté tierna.", "Agregue el perifollo y sazone con sal y pimienta negra recién molida.", "Para la salsa de manzana, caliente la mantequilla y las manzanas Bramley en una cacerola con tapa a fuego suave. Cubra y cocine por 2-4 minutos, o hasta que las manzanas se hayan derrumbado y estén suaves y esponjosas. Revuelva la mezcla para formar un puré suave.", "Para servir, espolvorea el repollo salteado sobre los platos para servir y cúbrelo con un trozo de panza de cerdo.", "Vierta la salsa de vino tinto y sirva la salsa de manzana al lado."], "url": "www_bbc_co_uk_food_recipes_perfect_roast_pork_belly_18860", "title": "Perfecto vientre de cerdo asado con repollo y tocino", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/perfect_roast_pork_belly_18860_16x9.jpg", "isVegetarian": false, "recommendations": 0}]