[{"ingredients": ["1-1.5kg de cangrejo entero cocido", "2 cucharadas de crema de coco", "200ml / 7fl oz de leche de coco", "2 hojas de lima kaffir, en finas julianas", "pequeño manojo de albahaca tailandesa, escogido", "jugo de lima, al gusto", "azúcar de palma, al gusto", "salsa de pescado, al gusto", "300ml / 10fl oz de aceite vegetal", "Nota: Esta receta originalmente usa medidas australianas. Las medidas equivalentes son lo más precisas posible.", "Este plato sirve 1 devorador de cangrejo devoto o 4 personas como parte de una comida compartida con arroz jazmín al vapor."], "method": ["Retire la capa superior del cangrejo, deseche los pulmones cafés y lave.", "Quita las garras, corta el cuerpo por la mitad, y rompe la cáscara dura en las garras con la parte posterior de una cuchilla.", "Precaliente el aceite vegetal a 180 ° C / 350 ° F en un wok grande y agregue la carne de cangrejo.", "Sofreir la carne de cangrejo durante 1-2 minutos, luego retirar del aceite y escurrir bien sobre papel de cocina.", "Para un wok grande, agregue 2 cucharadas de aceite vegetal y la crema de coco. Cocine a fuego alto hasta que las grasas de la crema de coco se separen y se vuelva fragante, aproximadamente 3 minutos.", "Agregue la pasta de chile, la hoja de lima juliana y las mitades de chile, fríe hasta que estén fragantes. Esto debería tomar aproximadamente 2 minutos o un toque más largo para la pasta hecha en casa.", "Agregue el azúcar de palma y deje que se caramelice, luego la salsa de pescado. Los sabores de caliente, salado, agrio y dulce deben ser equilibrados.", "Agregue el coco, lleve a ebullición y cocine a fuego lento por un minuto. En este punto, agregue el cangrejo al wok y continúe revolviendo hasta que esté recién cocido, de 5 a 6 minutos.", "Agregue la albahaca tailandesa y el jugo de lima."], "url": "www_bbc_co_uk_food_recipes_panfriedwholecrabwit_10111", "title": "Cangrejo entero frito con pasta de ají", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["8 pechugas de pollo", "aceite de oliva", "sal y pimienta recién molida", "1 puñado de albahaca fresca", "600ml / 1 pinta de aceite de oliva", "Vinagre de vino de arroz 150ml / ¼ pinta", "1 chalote, finamente picado", "2 dientes de ajo aplastados", "sal y pimienta recién molida", "4 puñados de perejil rizado italiano, desvanecidos", "Salsa Worcestershire", "8 tomates picados al sol o ruborizados", "queso parmesano, astillas de"], "method": ["Primero prepara el aderezo de albahaca. Amasar la albahaca con aceite, vinagre, chalota, ajo y aderezo en una licuadora o procesador de alimentos. Mantener a un lado.", "Cepille la pechuga de pollo con aceite de oliva y cocine en una parrilla precalentada hasta que esté recién cocida. El pollo debe dorarse por ambos lados y cruzarse con las marcas de la bandeja de la parrilla. Temporada.", "Para la ensalada, mezcle el perejil en un poco del aderezo de albahaca y espolvoree con un poco de salsa Worcestershire. Ponga una porción de ensalada de perejil en cada plato, espolvoree con unos trozos de tomate secado al sol y rodajas de queso parmesano.", "Sirva con papas asadas rústicas o chips de búfalo."], "url": "www_bbc_co_uk_food_recipes_pangrilledchickenbre_73924", "title": "Pechugas de pollo a la parrilla con ensalada de perejil y tomates secados al sol", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite vegetal", "250g / 9oz tocino rayado", "6 papas, finamente cortadas en rodajas", "2 cebollas, peladas, en rodajas", "5 zanahorias, peladas, en rodajas", "500ml / 17½fl oz de caldo de pollo", "sal y pimienta negra recién molida, al gusto", "Queso cheddar 150 g / 5 oz, rallado", "pan crujiente, para servir"], "method": ["Caliente el aceite vegetal en una sartén honda a prueba de horno. Freír el tocino durante 3-4 minutos, o hasta que esté dorado y ligeramente crujiente. Retire de la sartén y déjela a un lado para escurrir sobre papel de cocina.", "En la misma sartén que se usa para cocinar el tocino, coloca una capa de papas en rodajas en el fondo de la sartén. Cubra las papas con una capa de cebollas en rodajas, luego una capa de zanahorias en rodajas. Cubra una porción del tocino crujiente, luego sazone con sal y pimienta negra recién molida.", "Repita el proceso con las papas restantes, cebollas, zanahorias y tocino, terminando con una capa de patatas en la parte superior. Sazonar con sal y pimienta negra recién molida.", "Vierta el caldo de pollo para que todos los ingredientes estén cubiertos y luego llévelo a ebullición. Cubra la olla con una tapa y reduzca el fuego a fuego lento. Cocine a fuego lento durante 15-25 minutos, o hasta que las papas y las zanahorias estén tiernas.", "Precalentar la parrilla a alto.", "Destape la sartén y espolvoree sobre el queso rallado. Grill durante 5-6 minutos, o hasta que el queso esté burbujeante y dorado.", "Para servir, vierta la panhaggerty en tazones y sirva con un poco de pan crujiente para limpiar los jugos."], "url": "www_bbc_co_uk_food_recipes_panhaggerty_93163", "title": "Panhaggerty", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cebolla, pelada, muy finamente cortada", "200g / 7oz de Maris Piper, o papas cerosas similares, muy finamente cortadas", "50g / 2oz de mantequilla", "sal y pimienta recién molida", "100 g / 3½ oz de salmón ahumado, en rodajas", "75g / 2½oz de queso cheddar maduro", "100 ml / 3½ fl oz yogur", "1 limón, cáscara y jugo solamente", "1 cucharada de eneldo fresco picado", "sal y pimienta negra recién molida", "Rodajas de salmón ahumado de 100g / 3½oz"], "method": ["Precalentar el horno a 180 ° C / 360 ° F / Gas 4.", "Derretir la mitad de la mantequilla en una sartén honda a prueba de horno a fuego medio. Agregue la cebolla en rodajas y fría hasta que se ablande, luego retírela del molde con una cuchara ranurada.", "Coloque una capa de las rodajas de papa en la misma sartén y fría por unos minutos hasta que estén doradas.", "Agregue una capa de cebolla frita, luego agregue otra capa de las rodajas de papa.", "Continúa colocando la cebolla, la patata y la cebolla hasta que estés listo para agregar la última capa de papa.", "Agregue una capa de salmón ahumado y termine con una capa de papa.", "Derretir la mantequilla restante en una sartén por separado. Vierta la mantequilla derretida sobre las capas de patatas, salmón y cebolla.", "Coloque la sartén en el horno y hornee durante 40-45 minutos, o hasta que esté bien cocida. Hacia el final de la cocción, precaliente la parrilla a su nivel más alto.", "Antes de servir, ralle el queso por la parte superior y termine debajo de la parrilla hasta que el queso se derrita y se dore.", "Para el aderezo, mezcle el yogur, la ralladura de limón y el jugo y el eneldo en un tazón. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, corte las cuñas de la sartén de la sartén y colóquelas en los platos. Cubra con rodajas rizadas de salmón ahumado y rocíe con el aderezo."], "url": "www_bbc_co_uk_food_recipes_panhaggertywithsmoke_90142", "title": "Pan haggerty con salmón ahumado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 cucharadas de azúcar de palma", "4 dientes de ajo, aplastados", "2 cucharadas de jengibre fresco de raíz finamente rallado", "3 chiles rojos, finamente cortados en cubitos", "6 cucharadas de salsa de pescado", "½ manojo de cilantro fresco", "½ manojo de menta fresca", "3 limas, cáscara y jugo solamente", "4 calamar", "Harina común 110g / 4oz", "2 huevos medianos de granja, golpeados", "Pan rallado panko japonés de 110g / 4oz", "aceite vegetal, para freír en grasa", "2 cucharadas de berro de coriandro", "50g / 1¾oz mitzuna leaves", "25ml / fl oz de aceite de colza", "2 limas, cortadas en cuñas", "4 cebollas de primavera", "1 chile rojo, cortado en rondas"], "method": ["Para el azúcar de palma y el pesto de cilantro, coloque todos los ingredientes en un mortero y machaque hasta obtener una pasta.", "Para el calamar, limpia, puntúa y prepara el calamar. Separe los tentáculos del cuerpo del calamar y retire la pluma. Enjuague dentro del cuerpo del calamar con agua fría. Tire de las orejas (aletas similares a alas) del cuerpo. Tire de la piel purpura de las orejas y el cuerpo para dejar solo la carne blanca.", "Cortar los tentáculos lejos de las tripas cortando justo debajo de los ojos. Compruebe el centro de los tentáculos para el pico duro, que puede ser descartado. (Deseche las tripas del calamar o, si lo desea, conserve el saco de tinta para usar en pasta de marisco o risotto).", "Corta el cuerpo del calamar en anillos, o corta un lado del mismo, ábrelo, raspa cualquier rastro de tripas que quede dentro del cuerpo, luego marca el interior ligeramente en un patrón de rayitas cruzadas.", "Seque el calamar con el rollo de cocina antes de cocinar.", "Prepare un plato de harina, un cuenco del huevo y un plato de pan rallado.", "Precaliente el aceite en una freidora a 180 ° C / 350 ° F (PRECAUCIÓN: el aceite caliente puede ser peligroso; no lo deje desatendido).", "Sumerja el calamar preparado en la harina, luego el pan y el panko pan rallado y coloque en la freidora. Cocine por un par de minutos hasta que estén dorados y crujientes. Incline sobre un plato forrado con un rollo de cocina para escurrir.", "Para servir, coloque cada calamar en un plato de servir y rocíe el pesto. Adorne con berro de coriandro y mitzuna aderezada con aceite de colza, aderezada con rodajas de lima, cebolletas y guindilla."], "url": "www_bbc_co_uk_food_recipes_panko-coated_squid_with_94929", "title": "Calamar recubierto de panko con azúcar de palma y pesto de cilantro", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["300 ml / 10 fl oz doble crema", "1 vaina de vainilla, dividida por la mitad a lo largo y semillas raspadas", "100ml / 3½fl oz de leche condensada", "2 hojas de gelatina, empapadas en agua durante al menos cinco minutos", "350ml / 12fl oz de suero de leche", "Vodka de 25ml / 1fl oz", "250g / 9oz de harina blanca fuerte", "pizca de sal", "50 g / 1 oz de azúcar en polvo", "30 g / 1 oz de mantequilla, ablandada", "1 cucharadita de levadura de acción rápida", "aceite vegetal, para freír", "Frambuesas 250 g / 9 oz", "25 g / 1 oz de azúcar en polvo"], "method": ["Para la panna cotta, enfríe una jarra en el congelador.", "Caliente la crema doble, la vaina de vainilla y las semillas y la leche condensada en una cacerola hasta que hierva. Retire la sartén del fuego, agregue la gelatina remojada y el suero de leche. Batir hasta que esté bien combinado.", "Pase la mezcla a través de un colador fino en la jarra fría, agregue el vodka.", "Coloque la jarra en el refrigerador para enfriar, batiendo cada cinco minutos hasta que la mezcla comience a fraguar. Vierta la mezcla en moldes dariole o moldes y enfríe en la nevera durante al menos dos horas.", "Para las mini donas, combine la harina, la sal y el azúcar en polvo en un tazón grande.", "Mezcle la mantequilla, 150ml / 5fl oz de agua y la levadura hasta que la mezcla se una para formar una masa homogénea. Cubra con una película adhesiva y déjela en un lugar cálido durante aproximadamente una hora, o hasta que duplique su tamaño.", "Divida la masa en 12 porciones iguales y enrolle cada una en una bola.", "Alinee una bandeja para hornear con pergamino para hornear y coloque las bolas de masa sobre ella, dejando espacio suficiente entre cada bola. Cubra con un paño de cocina y reserve en un lugar cálido para probar durante 20 minutos más.", "Cuando la masa haya demostrado, caliente el aceite en una freidora a 150 ° C / 320 ° F. Alternativamente, caliente el aceite en una cacerola profunda de base pesada hasta que la miga de pan chisporrotee y se ponga marrón cuando se la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Con cuidado, baje las rosquillas en el aceite caliente en lotes y fría durante 3-4 minutos, o hasta que estén doradas. Retire de la sartén con una espumadera y déjela a un lado para escurrir sobre papel de cocina.", "Cuando el exceso de aceite haya drenado las rosquillas, colóquelas en un plato y espolvoree con el azúcar impalpable restante hasta que esté completamente cubierto.", "Para servir, coloque las frambuesas, el azúcar y 50 ml / 2 fl oz en una sartén y cocine durante 3-4 minutos. Licúe hasta que quede suave y pase a través de un colador fino.", "Retire la panna cotta de los moldes y colóquela en el centro de las placas para servir (sumerja brevemente la base de cada molde en un recipiente con agua caliente y deslice suavemente un cuchillo por el borde de cada panna cotta para aflojarlos). Sirve con los donuts y la salsa de frambuesa."], "url": "www_bbc_co_uk_food_recipes_panna_cotta_with_mini_79814", "title": "Panna cotta con mini donas y frambuesas frescas", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["aceite de girasol, para engrasar", "6 hojas de gelatina de hoja fina (11 g)", "600 ml / 20 fl oz de crema individual", "300 ml / 10 fl oz doble crema", "75 g / 2½ oz de azúcar en polvo", "1 cucharada de extracto de vainilla", "1 piña madura pequeña, finamente picada (tamaño de una grosella)", "4 bulbos de tallo de jengibre, finamente picado (tamaño de una grosella)", "6 cucharadas de jarabe de jengibre, del tarro"], "method": ["Engrase el interior de seis cuencos individuales de 150-175 ml / 5-6 fl oz de metal con leche (moldes Timbal) con aceite de girasol y déjelos boca abajo para escurrirlos sobre papel de cocina para eliminar cualquier exceso.", "Para hacer la panna cotta, remoje las hojas de gelatina en un recipiente de agua fría durante aproximadamente 5 minutos o hasta que estén suaves.", "Vierte las cremas y el azúcar en una cacerola y calienta suavemente, revolviendo hasta que esté a punto de hervir. Retire de la placa antes de que hierva.", "Retire la gelatina del agua y exprima para eliminar el exceso de agua. Agregue la gelatina a la crema caliente y revuelva hasta que se haya disuelto por completo. Agregue la vainilla.", "Decantar en una jarra y verter en los moldes y luego cubrir con película adhesiva. Dejar en la nevera durante un mínimo de 6 horas, o idealmente durante la noche, hasta que esté firme al tacto.", "Para hacer la salsa, mezcle los ingredientes en un tazón. Con cuidado, saque la panna cotta e inviértala en el centro de un plato pequeño. Coloque la salsa en la parte superior y alrededor de los bordes."], "url": "www_bbc_co_uk_food_recipes_panna_cotta_with_86218", "title": "Panna cotta con salsa de piña y jengibre", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 10}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/panna_cotta_with_86218_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["300ml / 10½ fl oz crema doble", "1 vaina de vainilla, dividida por la mitad a lo largo y semillas raspadas", "100 g / 3½ oz de azúcar en polvo", "2-3 hojas de gelatina, remojadas en agua durante unos minutos", "350ml / 12fl oz de suero de leche", "Vodka de 25ml / 1fl oz", "aceite, para engrasar", "140g / 5oz azúcar morena suave", "Goteo de carne de res clarificada de 85 g / 3 oz", "225 g / 8oz de fruta seca mixta y cáscara confitada", "Harina integral 225g / 8oz", "1 cucharadita de polvo de hornear", "1 pizca de canela molida", "1 nuez moscada recién rallada", "1 pizca de pimienta molida", "½ cucharadita de bicarbonato de soda", "Ruibarbo de 500g / 18 fl oz, cortado en bastones", "2 cucharadas de azúcar morena suave y ligera", "4 cucharadas de jugo de manzana"], "method": ["Para la panna cotta, enfríe una jarra o tazón grande en el congelador.", "Caliente la crema doble, la vaina de vainilla y las semillas y el azúcar en una cacerola hasta que hierva. Retire la sartén del fuego, agregue la gelatina remojada y el suero de leche y bata hasta que estén bien combinados", "Pase la mezcla a través de un tamiz fino en la jarra fría, y luego agregue el vodka.", "Regrese la jarra al refrigerador y bata la mezcla cada cinco minutos hasta que comience a fraguar.", "Vierta la mezcla en moldes dariole y enfríe en la nevera durante al menos dos horas, o hasta que esté completamente fraguado.", "Para la torta que gotea, precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase y forme una lata de pastel de 18 cm / 7 pulgadas.", "Ponga el azúcar, el goteo, la fruta seca y la cáscara confitada en una cacerola. Agregue 225ml / 8fl oz de agua y llévelo a ebullición. Cocine a fuego lento durante 10 minutos, luego deje enfriar en la sartén.", "Tamiza los ingredientes secos juntos en un tazón grande. Haga un pozo en el medio y agregue la mezcla fría de fruta seca. Mezcle con una cuchara de madera, dibujando gradualmente en la harina desde alrededor del borde del pozo, hasta que tenga una mezcla suave.", "Coloque la masa en la lata preparada y hornee durante aproximadamente 40 minutos, o hasta que una brocheta insertada en el centro salga limpia.", "Deja en la lata durante cinco minutos antes de encender una rejilla para que se enfríe por completo.", "Para el ruibarbo asado, precaliente el horno a 200C / 400F / Gas 6.", "Coloque el ruibarbo en una bandeja para hornear, espolvoree el azúcar y luego rocíe sobre el jugo de manzana. Asar en el horno durante 8-12 minutos o hasta que estén tiernos.", "Mezcle 125 g / 4½ oz del ruibarbo tostado con un puré en un procesador de alimentos. Reserve el ruibarbo tostado restante.", "Para servir, retire la panna cotta de sus moldes, sumergiendo brevemente la base de cada molde en un recipiente con agua hervida. Con cuidado, desliza un cuchillo por el borde de cada panna cotta y colócalo en el centro de un plato para servir. Sirva con el puré de ruibarbo, una rebanada de pastel goteante y ruibarbo asado."], "url": "www_bbc_co_uk_food_recipes_panna_cotta_with_roasted_37276", "title": "Panna cotta con ruibarbo asado y pastel de goteo", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["225ml / 8fl oz de agua", "100 g / 3½ oz de azúcar en polvo", "puñado de flores de lavanda", "600ml / 1 pinta 1½ fl oz doble crema", "50 g / 1¾oz de azúcar de vainilla", "1 naranja, solo ralladura", "2 cucharaditas de gelatina"], "method": ["Para las flores de lavanda, caliente el agua y el azúcar impalpable en una sartén.", "Revuelva hasta que el azúcar se derrita y luego hierva constantemente, de modo que el líquido se pueda reducir un poco.", "Saque la olla del fuego y déjela enfriar.", "Cuando el azúcar se haya enfriado, agregue las flores de lavanda a la sartén.", "Para panna cotta, alinee seis moldes con film transparente y colóquelos en una bandeja. Caliente tres cuartas partes de la crema con el azúcar de vainilla y la ralladura de naranja en una sartén, teniendo cuidado de no hervir la crema.", "Cuele la mezcla a través de un colador en un tazón.", "Espolvorea la gelatina sobre dos cucharadas de agua hasta que se vuelva esponjosa. Caliente muy suavemente en una sartén limpia a fuego lento hasta que se disuelva.", "Agregue la mezcla de crema a la gelatina y quite el fuego. Deja enfriar.", "Suavemente bate la crema restante y agrega la crema a la mezcla.", "Vierta la mezcla en los moldes revestidos y transfiera a la nevera para enfriar.", "Enfríe durante al menos dos horas hasta que se fragüe.", "Coloque la panna cotta en platos individuales y vierta el jarabe de lavanda sobre ellos. Decora con las flores de lavanda azucaradas."], "url": "www_bbc_co_uk_food_recipes_pannacottawithlavend_85680", "title": "Panna cotta con lavanda", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["300 ml / 10 fl oz crema individual", "200g / 7oz de jamón, cortado en cubos", "100g / 4oz de mantequilla salada", "pizca de nuez moscada rallada", "2 puñados de champiñones, en rodajas", "puñado de parmesano rallado", "sal", "pimienta negra recién molida", "Tagliatelle fresco de 400 g / 14 oz, cocinado según las instrucciones del paquete", "parmesano rallado al gusto"], "method": ["En una sartén, fría los champiñones y el jamón en la mantequilla hasta que estén dorados. Agregue la crema, sazone con sal y pimienta y una pizca de nuez moscada y deje cocer durante aproximadamente un minuto.", "Agregue la pasta cocida a la salsa y espese, pero no demasiado.", "Sirva inmediatamente con una pizca de queso parmesano rallado o raspado."], "url": "www_bbc_co_uk_food_recipes_pannaeprosciuttohamm_71533", "title": "Panna e prosciutto (jamón, champiñones y salsa de crema)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 limón, ralladura solamente", "2 dientes de ajo, aplastados", "2 ramitas de tomillo fresco", "75ml / 2½fl oz de vino blanco", "2 cucharadas de aceite de colza", "4 patas de pollo, huesos eliminados, piel en", "2 pechugas de pollo, el hueso del ala, la piel puesta", "Harina normal de 250g / 9oz", "½ cucharadita de semillas de apio", "½ cucharadita de sal", "pizca de pimienta negra recién molida", "7 huevos grandes de gallinas camperas", "3 cucharaditas de aceite de colza", "1 cucharada de aceite de oliva", "2 chalotes, finamente picados", "100ml / 3½fl oz de vino blanco", "350ml / 12oz de crema fresca", "1 limón, solo jugo", "1 diente de ajo, aplastado", "sal y pimienta negra recién molida", "150ml / 5fl oz de aceite de colza", "½ col de hispi, finamente rebanada", "manojo de eneldo fresco, más o menos picado"], "method": ["Para el pollo, coloque la ralladura de limón, el ajo, el tomillo y el vino en un tazón y mezcle bien.", "Unte la mezcla de adobo sobre la carne del pollo para cubrirla, luego coloque el lado con la carne hacia abajo en un plato y colóquelo en el refrigerador para marinar durante al menos una hora, preferiblemente durante la noche.", "Precalentar el horno a 230C / 445F / Gas 8.", "Coloque una sartén grande, a prueba de horno a fuego medio. Cuando esté caliente, agregue el aceite de colza y las piezas de pollo con la piel hacia abajo. Freír durante 3-4 minutos, hasta que estén dorados, luego voltee el pollo y transfiéralo al horno para asar durante 8-10 minutos, hasta que esté cocido y tierno.", "Para hacer el spätzle, coloque la harina, las semillas de apio, la sal, la pimienta y los huevos en un procesador de alimentos y mezcle hasta que se combinen en una masa suave y espesa.", "Llevar a ebullición una cacerola grande de agua salada. Agregue una cucharadita de aceite al agua.", "Con una cuchara, mezcle la mezcla en una manga pastelera fina y rocíe la masa sobre el agua hirviendo. Hervir durante 2-3 minutos, hasta que esté cocido.", "Coloque una sartén a fuego medio. Cuando esté caliente agregue las otras dos cucharaditas de aceite de colza.", "Escurrir el spätzle y colocar directamente en la sartén caliente. Freír los spätzle durante 1-2 minutos, hasta que estén coloreados, luego retírelos y déjelos a un lado en un tazón.", "Para hacer la salsa, caliente una sartén pequeña a fuego lento. Cuando esté caliente, agregue el aceite de oliva y los chalotes y fríalos durante 4-5 minutos, hasta que se ablanden.", "Agregue el vino, lleve a ebullición y reduzca el volumen del líquido en un tercio.", "Agregue la crème fraîche, reduzca el fuego y caliente la salsa.", "Vierta la mitad de la salsa sobre el spätzle y revuelva para combinar.", "Para el repollo, mezcle el limón y el ajo en un tazón y sazone con sal y pimienta negra recién molida. Agregue el aceite y bata de nuevo.", "Vierta el aderezo sobre el repollo, agregue el eneldo y revuelva.", "Para servir, esculpe el pollo en varias partes, colóquelo en platos calientes con una cucharada de spätzle y repollo. Rocíe sobre la salsa restante al gusto."], "url": "www_bbc_co_uk_food_recipes_panroastchickenwithc_83701", "title": "Pollo asado con crema spaetzle", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de mantequilla", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "4 pechugas de pollo, con la piel puesta", "1 cucharada de aceite de oliva", "4 chalotes, finamente picados", "1 diente de ajo, finamente picado", "2 cucharadas de vinagre balsámico", "75ml / 3fl oz de aceite de oliva virgen extra", "10g / ½ oz de cebollín fresco, más o menos picados", "10g / ½ oz de perejil fresco de flatleaf, toscamente picado", "10g / ½ oz de eneldo fresco, aproximadamente picado", "8 remolachas, cocinadas hasta que estén tiernas, peladas y cortadas en segmentos", "sal y pimienta negra recién molida", "1 coliflor grande, cortada en florecillas", "4 cucharadas de crema de rábano picante de un tarro", "1 limón, jugo", "150ml / 5fl oz de crema doble, ligeramente azotada", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 180C / 355F / Gas 4.", "Para el pollo, caliente una sartén grande a prueba de horno y agregue la mantequilla y el aceite de oliva.", "Sazone todo el pollo con sal y pimienta negra recién molida y, una vez que la mantequilla esté en forma de espuma, coloque en la sartén, con la piel hacia abajo. Freír durante 3-4 minutos, hasta que estén dorados.", "Dé la vuelta a las pechugas de pollo y transfiéralas al horno para asar durante 12-15 minutos, o hasta que estén totalmente cocidas.", "Mientras tanto, para la remolacha, caliente una olla pequeña con aceite de oliva. Agregue el ajo y los chalotes y fría a fuego lento durante 2-3 minutos, hasta que estén tiernos pero no dorados.", "Agregue el vinagre balsámico, el aceite de oliva virgen extra y las hierbas y mezcle bien. Coloque la remolacha en un recipiente para servir y vierta la mezcla de chalote. Revuelva para cubrir y sazone, al gusto, con sal y pimienta negra recién molida.", "Mientras tanto, para la coliflor, hierva una olla de agua y agregue la coliflor. Hervir durante 4-5 minutos, hasta que estén tiernos, luego escurrir y refrescar en agua helada. Escurrir la coliflor y dejar de lado.", "Coloque el rábano picante y el jugo de limón en un tazón grande y mezcle. Agregue la crema batida y sazone, al gusto, con sal y pimienta negra recién molida.", "Agregue la coliflor a la mezcla de rábano picante y mezcle bien.", "Para servir, coloque una cucharada de cada mezcla de remolacha y coliflor una al lado de la otra en cuatro platos y coloque una pechuga de pollo en cada uno."], "url": "www_bbc_co_uk_food_recipes_panroastedchickenwit_84338", "title": "Pollo asado con remolacha y coliflor con crema de rábano picante", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ pechuga de pato", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "6 cerezas, piedras quitadas", "1 cucharadita de azúcar en polvo", "100ml / 3½fl oz de vino blanco", "1 cucharadita de harina de maíz, mezclada en una pasta con un poco de agua", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para hacer el pato, frote el pato en ambos lados con el aceite de oliva y sazone con sal y pimienta negra recién molida.", "Caliente una sartén y cocine el pato durante cinco minutos con la piel hacia abajo. Vierta el exceso de grasa y voltee la pechuga de pato. Coloque en el horno y cocine durante ocho minutos. Retire y descanse por un minuto.", "Para hacer la salsa, caliente las cerezas en una sartén y mezcle el azúcar en polvo.", "Agregue el vino y la pasta de harina de maíz y cocine para reducir a la mitad.", "Sirve el pecho en el medio del plato y coloca la salsa de cereza alrededor."], "url": "www_bbc_co_uk_food_recipes_panroastedduckwithch_83341", "title": "Pato asado con salsa de cereza", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ pecho de ganso", "sal y pimienta negra recién molida", "½ nabo picado en trozos grandes", "50g / 1¾oz de mantequilla", "1 cucharada de aceite de oliva", "1 castañas enteras cocinadas con estaño", "25g / 1oz de mantequilla", "1 cucharada de aceite de oliva", "1 puerro, lavado y toscamente picado", "1 gran puñado de arándano", "2 cucharadas de vinagre balsámico", "4 cucharadas de azúcar morena suave"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Sazone la pechuga de ganso con sal y pimienta negra recién molida y coloque, con la piel hacia abajo, en una sartén caliente a prueba de horno. Cocine por cinco minutos hasta que esté dorado. Gire y cocine por otro minuto.", "Escurra la grasa de la bandeja de ganso y transfiérala al horno precalentado durante diez minutos o hasta que esté bien cocida. Sacar una vez cocinado y dejar reposar.", "Mientras tanto, coloque el colinabo en una olla de agua hirviendo y cocine durante ocho minutos. Escurrir y apartar.", "En una sartén separada a prueba de horno, derrita la mantequilla con el aceite. Agregue las castañas y el colinabo cocido y transfiéralos al horno precalentado para asar durante cinco minutos o hasta que estén dorados.", "Para la salsa de puerros y arándanos, caliente el aceite y derrita la mantequilla en una cacerola. Agregue los puerros y cocine durante cinco minutos hasta que estén suaves.", "Agregue los arándanos, el vinagre balsámico y el azúcar moreno y cocine por otros cinco minutos.", "Para servir, coloque la pechuga de ganso en un plato caliente con el colinabo y castañas asadas. Cuchara sobre la salsa de puerro y arándano."], "url": "www_bbc_co_uk_food_recipes_panroastedgoosewithr_78831", "title": "Pechuga de ganso asada al pan con colinabo y castañas, y salsa de puerros y arándanos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharadita de Romero fresco picado", "1 cucharadita de perejil fresco picado", "1 cucharada de aceite de oliva", "Filete de rape 150 g / 7 oz", "sal y pimienta negra recién molida", "2 rebanadas de jamón de Parma", "Zanahoria baby 50g / 2oz, blanqueada", "50g / 2oz guisantes, blanqueados", "50g / 2oz de papa pelada y picada, cocida", "25g / 1oz de mantequilla", "sal y pimienta negra recién molida", "50g / 2oz de mantequilla sin sal", "50g / 2oz anacardos, finamente picados", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para el rape, mezcle las hierbas con el aceite en un recipiente y agregue el rape. Mezcle bien para cubrir y deje macerar durante 2-3 minutos.", "Sazonar el pescado con sal y pimienta negra recién molida y envolver con el jamón de Parma.", "Caliente una sartén a prueba de horno y agregue el filete. Cocine por un minuto en cada lado, hasta que el jamón empiece a tomar color, luego transfiéralo al horno y tápelo por 6-8 minutos, o hasta que esté completamente cocido.", "Para el popurrí de verduras, coloque las verduras en un bol con la mantequilla, mezcle y sazone con sal y pimienta negra recién molida.", "Para hacer la salsa de mantequilla de anacardo, derrita la mantequilla en una sartén a fuego medio. Agregue los anacardos y fría hasta que estén dorados y sazone, al gusto, con sal y pimienta negra recién molida.", "Para servir, coloque el popurrí de verduras en un plato, coloque el pescado encima y una cucharada de salsa de mantequilla de anacardo."], "url": "www_bbc_co_uk_food_recipes_panroastedmonkfishve_84265", "title": "Rape al horno, mezcla de verduras y salsa de mantequilla de anacardo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50 g / 1¾oz de mantequilla sin sal", "1 diente de ajo, finamente picado", "½ cebolla blanca, finamente rebanada", "50g / 1¾oz de guisantes frescos", "Crema doble 50ml / 2fl oz", "sal y pimienta negra recién molida", "100g / 3½ oz de eglefino", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "500ml / 18fl oz de aceite vegetal", "100g / 3½ oz de harina de auto crianza", "30 ml / 1 fl oz de agua con gas", "1 cebolla, cortada en anillos gruesos", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para hacer la salsa blanca, derrita la mantequilla en una sartén. Agregue el ajo y la cebolla y fría por 2-3 minutos, hasta que estén suaves.", "Agregue los guisantes y cocine por cinco minutos.", "Agregue la crema doble y cocine a fuego lento durante 3-4 minutos, hasta que espese, luego sazone con sal y pimienta negra recién molida.", "Para hacer el eglefino, frote el eglefino con el aceite y sazone bien a ambos lados con sal y pimienta negra recién molida.", "Caliente una sartén a prueba de horno y cuando esté muy caliente, agregue el eglefino, con la piel hacia abajo, para freír durante un minuto, hasta que esté dorado. Gire el eglefino y transfiéralo al horno para asar durante 6-8 minutos, o hasta que esté completamente cocido.", "Para hacer los aros de cebolla, caliente el aceite en una cacerola profunda hasta que el pan rallado chispee y se dore cuando se le caiga. (PRECAUCIÓN: el aceite caliente puede ser peligroso. ¡No lo deje sin supervisión!)", "Coloque la harina en un tazón grande, agregue el agua con gas y bata vigorosamente para formar una masa.", "Sumerja los aros de cebolla en la mezcla y coloque con cuidado en el aceite para freír hasta que estén crujientes y dorados. Retire con cuidado con una cuchara ranurada y drene las toallas de cocina.", "Para servir, coloca la salsa en el centro de un plato caliente. Coloque el eglefino sobre la salsa y cubra con los aros de cebolla."], "url": "www_bbc_co_uk_food_recipes_panroastedhaddockwit_83324", "title": "Eglefino a la sartén con salsa de cebolla blanca y aros de cebolla frita", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ mango, picado", "1 tomate, picado", "pizca de copos de chile seco", "puñado de menta fresca, picada", "4 cebollas de primavera", "1 cucharada de aceite de oliva", "½ batata, rallada", "2 cucharadas de yogur al estilo griego", "1 yema de huevo de gallinas camperas", "1 cucharada de aceite de oliva", "½ filete de salmón"], "method": ["Para la salsa, licúe la mitad del mango picado y agregue la carne de mango restante. Agregue el tomate, las hojuelas de chile y la menta.", "Caliente el horno a 220C / 425F / Gas 7. Coloque las cebolletas en una bandeja para hornear vestida con aceite. Hornea por diez minutos.", "Para hacer el rösti, mezcle la papa, el yogur y la yema de huevo.", "Calentar el aceite en una sartén y aplanar la mezcla de papa en un molde anular en la sartén. Freír durante 4-5 minutos. Retire el anillo y fríalos del otro lado hasta que estén dorados.", "Mientras tanto, en otra sartén caliente un chorrito de aceite de oliva. Fría el salmón colocado con la piel hacia abajo durante 2-3 minutos por cada lado.", "Sirva la salsa en la parte superior del rösti, coronada con cebolletas y filete de salmón."], "url": "www_bbc_co_uk_food_recipes_panroastedsalmonwith_75891", "title": "Salmón asado con salsa de mango y tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["250g / 9oz llano '00' harina", "50 g / 2 oz de sémola fina, más extra para quitar el polvo", "2 huevos grandes de gallinas camperas (preferiblemente orgánicos)", "3 yemas de huevo grandes de granja (preferiblemente orgánicas)", "200g / 7oz de ricotta (preferiblemente ricota de leche de oveja)", "2 cucharadas de tapas de hinojo plumosas y picadas", "sal marina y pimienta negra recién molida", "½ diente de ajo", "Nueces 110g / 4oz", "jugo de ½ limón", "75g / 3oz de queso parmesano, rallado (u otro queso duro vegetariano)", "2 cucharadas de leche entera", "4 cucharadas de aceite de oliva", "1 cucharada de perejil picado", "50g / 2oz de mantequilla sin sal"], "method": ["Para la pasta, coloque la harina y los huevos y las yemas de huevo en un procesador de alimentos y procese durante un minuto hasta que la masa se una.", "Cubre la película adherida y colócala en el refrigerador para que descanse durante 30 minutos. Cuando esté frío, divida la masa por la mitad y conserve una porción para otra comida.", "Enrolle la mitad restante de la masa a través de una máquina de pasta, reduciendo gradualmente el grosor, hasta que la pasta se lamine lo más fina posible. Polvo con la sémola y reservar en la nevera hasta que sea necesario.", "Para el relleno de pansotti, bata la ricota y el hinojo en un tazón y sazone al gusto con sal y pimienta negra recién molida.", "Saque la pasta del refrigerador y extiéndala en la superficie de trabajo. Trabajando 2 cm / 1 pulgada desde el borde del lado más largo, coloque cucharadas colmadas del relleno a intervalos a lo largo de la pasta con un espacio de 3 cm / 1¼ en cada una.", "Cepille entre cada porción del relleno con un cepillo de pastelería mojado en agua, luego doble la mitad sin cubrir de la hoja de pasta para cubrirla.", "Usando sus dos pequeños dedos, empuje la pasta hacia abajo alrededor de cada porción del relleno para sellar. Asegúrese de que no haya aire atrapado en el interior o la pasta explotará durante la cocción.", "Usando un cortador de pasteles redondo, corte alrededor del relleno para crear formas de media luna. Recógelos individualmente para asegurarte de que estén herméticos. Guardarán en una nevera en una bandeja enharinada durante hasta dos días, o puedes cocinarlos inmediatamente.", "Para la salsa de nuez, triture el ajo con una pizca de sal marina en un almirez y mortero, luego agregue las nueces. Batir hasta que quede suave, luego mezclar el jugo de limón, parmesano, leche, aceite de oliva y perejil.", "Batir hasta que la salsa se emulsione, luego condimentar, al gusto, con sal y pimienta negra recién molida.", "Cocine el pansotti en una olla grande de agua hirviendo con sal durante 3-4 minutos. El agua debe estar en un ebullición rápido y rodante.", "Mientras tanto, derrita la mantequilla en una sartén grande. Escurrir la pasta, agregar a la sartén y mezclar para cubrir la mantequilla.", "Agregue una cucharada generosa de la salsa de nueces y revuelva la pasta para cubrir. Agregue una buena molienda de pimienta negra y sirva, con salsa extra de nueces si lo desea."], "url": "www_bbc_co_uk_food_recipes_pansotti_with_ricotta_75156", "title": "Pansotti con ricotta y salsa de hinojo y nuez", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 70}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["puñado de albahaca fresca", "4 cucharadas de aceite de oliva virgen extra, más extra para lloviznar", "1 cucharada de alcaparras saladas, enjuagadas", "300g / 10½oz de masa fermentada rancia, desmenuzada en trozos", "500g / 1lb 2 oz tomates maduros (preferiblemente reliquia, en variedad de colores, formas y tamaños), lavados y en rodajas, reservando las semillas y el jugo", "Kalamata 55g / 2oz u otras aceitunas oscuras, piedras removidas, rebanadas", "½ cebolla roja, finamente rebanada", "1 cucharada de vinagre de vino tinto", "sal marina y pimienta negra recién molida"], "method": ["Mezcle la mayor parte de la albahaca (reservar algunas hojas para decorar) en un procesador de alimentos con aceite y alcaparras. (Alternativamente, pique finamente la albahaca y las alcaparras juntas con la mano y mezcle con el aceite).", "Transfiera la mitad del aceite de alcaparra Herby a un recipiente, agregue la masa madre y mezcle bien.", "Coloque los tomates, exprimiendo algunos de ellos para liberar su jugo, en una ensaladera grande junto con las semillas y el jugo reservados. Mezcle con la mayoría de las aceitunas y la cebolla roja, y un poco más de aceite de oliva. Agregue la masa madre, la mezcla de aceite de hierbas y el vinagre, y combine para asegurarse de que el pan esté cubierto con todos los jugos.", "Transfiera la ensalada a un plato de servir, colocando en capas las rodajas de tomate, las aceitunas, la cebolla y la masa madre. Rocíe el aceite de hierbas restante y adornar con hojas de albahaca y el resto de cebolla roja y aceitunas. Sazonar de nuevo con sal y pimienta y servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_panzanella_23604", "title": "panzanella", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/panzanella_23604_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 pimientos rojos", "2 pimientos amarillos", "225ml / 8fl oz de aceite de oliva virgen extra", "800g / 1lb 12 oz de tomates de ciruela maduros", "1 cucharada de aceitunas verdes grandes", "1 cucharada de alcaparras, escurridas y enjuagadas", "1 pan de ciabatta", "3 cucharadas de vinagre de vino tinto", "2 dientes de ajo, aplastados", "sal y pimienta negra recién molida", "gran puñado de hojas de albahaca fresca"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Coloque los pimientos en una bandeja para hornear, rocíe un poco del aceite de oliva y tápelos durante unos 15-20 minutos, o hasta que los pimientos estén suaves pero no carbonizados. Colóquelos en un tazón grande y cubra con una película adhesiva durante aproximadamente 20 minutos. (Cuando se hayan enfriado, la piel se despegará fácilmente).", "Cortar el tallo de los tomates y blanquearlos sumergiéndolos en una jarra de agua hirviendo durante 45 segundos, o hasta que las pieles empiecen a desprenderse. Con una cuchara ranurada, saca los tomates y sumérgete en un recipiente con agua fría. Una vez que se hayan enfriado, las pieles deben desprenderse fácilmente.", "Cortar los tomates pelados en cuartos. Retire las semillas y colóquelas en un colador sobre un recipiente. Coloque los cuartos de tomate en un tazón grande.", "Empuja las semillas en el tamiz para liberar el jugo.", "Pele los pimientos asados ​​y quite y deseche las semillas. Cortar la carne en tiras grandes y poner en el bol con los tomates.", "Mezcle las aceitunas y las alcaparras con los tomates y los pimientos.", "Arranca la chapata en trozos grandes y ponla a un lado.", "Mezcle el vinagre, el ajo y el aceite restante con el jugo de tomate. Agregue sal y pimienta y revuelva para combinar. Agregue las piezas de ciabatta al bol y déjelas durante al menos una hora para que el pan absorba todo el jugo.", "Después de una hora, mezcle la chapata con los tomates y los pimientos. Rasgue las hojas de albahaca y con sus manos combine suavemente todos los ingredientes.", "Servir en un tazón grande en el centro de la mesa."], "url": "www_bbc_co_uk_food_recipes_panzanella_72070", "title": "panzanella", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/panzanella_72070_16x9.jpg", "isVegetarian": true, "recommendations": 0}]