[{"isVegetarian": false, "title": "Tomato consommé", "url": "www_bbc_co_uk_food_recipes_tomato_consomm_86259", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2kg/4lb 6oz ripe red tomatoes, chopped", "2 shallots, roughly chopped", "½ tsp Tabasco sauce", "1 tbsp Worcestershire sauce", "small handful fresh basil leaves, plus extra smaller leaves, to serve", "sea salt flakes", "dash extra virgin olive oil", "12 mixed heritage tomatoes, cut into halves or quarters"], "serves": "Serves 4-6", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Blend the chopped red tomatoes, shallots, Tabasco sauce, Worcestershire sauce and basil leaves in a food processor for 8-10 seconds until just broken up but not puréed – it should resemble gazpacho. Season, to taste, with salt flakes, then pulse again.", "Line a colander with a large piece of muslin cloth, then suspend it over a large bowl. Strain the tomato mixture into the muslin and seal with pegs or string, then place the whole bowl into the fridge to drip away for at least 4 hours or overnight, without pressing or squeezing it at all.", "Remove the bowl from the fridge and lift the colander and muslin bag from it. Add a little olive oil to the strained liquid, then simmer in a saucepan for 12-15 minutes. Season, to taste, with salt, extra Worcestershire sauce and extra Tabasco sauce, then cover and set aside until cold. Chill in the fridge until ready to serve. ", "To serve, ladle the tomato consommé into bowls and garnish with a few pieces of the heritage tomatoes and small basil leaves. "]}, {"isVegetarian": false, "title": "Tomato eggy bread", "url": "www_bbc_co_uk_food_recipes_tomato_eggy_bread_36998", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tomato_eggy_bread_36998_16x9.jpg", "ingredients": ["2 large free-range eggs ", "1 tbsp finely chopped flat leaf parsley or chives (optional)", "2 x 70g/2½oz slices wholewheat bread ", "1 tsp tomato purée", "½ tsp Worcestershire sauce", "1 tsp olive oil ", "2 tomatoes, each cut into four thick slices", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Crack the eggs into a wide, shallow bowl, season and add the herbs, if using. Whisk with a fork.", "Spread one side of each slice of bread with the tomato purée and sprinkle over the Worcestershire sauce. ", "Place the bread slices into the egg mixture and soak for 5 minutes, turning three times.", "Heat the oil in a frying pan over a medium heat. Fry the tomatoes and egg-soaked bread for 3–4 minutes, turning halfway through, or until lightly browned on both sides. Serve immediately."]}, {"isVegetarian": true, "title": "Tomato rubbed toast", "url": "www_bbc_co_uk_food_recipes_tomato_rubbed_toast_65992", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tomato_rubbed_toast_65992_16x9.jpg", "ingredients": ["1 ripe tomato", "1 tbsp olive oil", "salt and freshly cracked black pepper", "1 slice sourdough, toasted"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Cut the tomato in half and rub the flesh side into the toast. Season with salt and pepper and drizzle with olive oil. "]}, {"isVegetarian": true, "title": "Tomato soup", "url": "www_bbc_co_uk_food_recipes_tomato_soup_56817", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2kg/4lb 4oz mixed ripe tomatoes, roughly chopped", "3 garlic cloves, roughly chopped", "1 handful fresh basil leaves, plus extra to serve", "1 tbsp tomato purée", "4 tbsp olive oil, plus extra to serve", "1 litre/1¾ pints hot vegetable stock", "salt and freshly ground black pepper", "2-3 tbsp caster sugar, to taste", "150ml/5fl oz double cream, plus extra to serve", "1 ciabatta loaf, thickly sliced, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a large, heavy-based saucepan over a medium to high heat. When the pan is hot, add the tomatoes and fry for 4-5 minutes, or until they have started to break down.", "Add the garlic, basil, tomato purée and two tablespoons of olive oil. Continue to cook for a further 1-2 minutes.", "Pour in the vegetable stock, bring the mixture to the boil, then reduce the heat until the mixture is simmering. Simmer for 3-4 minutes.", "Transfer the soup mixture to a food processor and blend to a purée.", "Return the blended soup to the pan and season, to taste, with salt, freshly ground black pepper and sugar.", "Pour in the cream and return the mixture to a simmer. Continue to simmer for a further 1-2 minutes.", "Meanwhile, brush the ciabatta slices with the remaining two tablespoons of olive oil.", "Heat a griddle pan until hot, add the ciabatta slices, in batches if necessary, and cook for 1-2 minutes on each side, or until golden brown griddle marks appear on both sides of the ciabatta.", "To serve, ladle the soup into four serving bowls. Drizzle a swirl of double cream into each bowl, then a swirl of olive oil, to garnish. Sprinkle over a few basil leaves."]}, {"isVegetarian": true, "title": "Tomato spirals", "url": "www_bbc_co_uk_food_recipes_tomato_spirals_39679", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125g/4½oz ready-made puff pastry", "4 tsp tomato puree", "30g/1oz cheddar, grated", "4 fresh basil leaves, shredded"], "serves": "Makes 12", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. Line a baking tray with greaseproof paper. ", "Roll the dough out on a floured worked surface to a 3mm/⅛in thickness.", "Spread the tomato puree all ove the pastry. Sprinkle over the cheddar and basil.", "Roll the pastry up tightly, then cut it into 12 slices. Place the slices, cut-side up onto the baking tray and bake for 12-15 minutes or until golden-brown."]}, {"isVegetarian": true, "title": "Tomato salsa", "url": "www_bbc_co_uk_food_recipes_tomato_salsa_58260", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tomatoes (300g/10½oz), roughly chopped", "1 tsp olive oil", "½ onion (50g/1¾oz peeled weight), finely chopped", "pinch chilli flakes or finely chopped fresh red chilli", "pinch salt and freshly ground black pepper", "15g/½oz fresh coriander, chopped (optional)"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Mix all the ingredients together. Serve or store for up to three days."]}, {"isVegetarian": false, "title": "Tomato tart with herb oil, tapenade and watercress and tarragon salad", "url": "www_bbc_co_uk_food_recipes_tomato_tart_with_herb_32067", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp olive oil", "2 banana shallots, chopped", "1 large garlic clove, crushed", "1 tsp black pepper", "1 tsp salt", "2 heaped tsp ground cumin", "1 tbsp white wine vinegar", "5 really ripe tomatoes, halved", "2 sheets ready-rolled puff pastry", "8 plum tomatoes, thickly sliced", "1 free-range egg, beaten with a pinch of salt", "2 garlic cloves, crushed", "100ml/3½fl oz olive oil", "small bunch fresh basil, leaves picked, stalks reserved ", "small bunch fresh tarragon, leaves picked, stalks reserved", "2 handfuls fresh watercress, leaves picked", "salt and black pepper", "200g/7oz pitted Kalamata olives", "3 tbsp capers, rinsed", "15g/½oz anchovies in oil (drained weight)", "2 tbsp finely chopped flatleaf parsley", "25ml/1oz brandy", "salt and black pepper", "drizzle of olive oil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "For the relish, heat the olive oil in a saucepan and gently fry the shallot and garlic. Season with black pepper, salt and ground cumin. Add the white wine vinegar and simmer until the volume of liquid has reduced a little. Add the tomatoes, cover with a lid and simmer for 45-50 minutes, or until you have a thick relish consistency.", "For the tart, line a flat baking sheet with baking parchment.", "Cut out four 16cm/6¼in rounds from the puff pastry sheets (use a 1 litre/1¾ pint pudding bowl as a guide). Mark a 15mm/¾in border in the pastry circles (use a 500ml/18fl oz bowl as a guide).  Place the pastry on the prepared baking sheet and prick the centres with a fork.", "Spoon some of the cooked relish into the centre of the pastry circles. Arrange the slices of plum tomato on top and brush the border with beaten egg - making sure you don’t brush the cut edge as this will prevent the pastry rising. Bake in the oven for 20 minutes, until the pastry is risen and golden-brown.", "Meanwhile make the herb oil. In a pan, gently heat the garlic in the olive oil with the basil stalks and tarragon stalks. Remove from the heat after 10 minutes and season with salt and pepper.", "Place a small handful of the basil leaves, tarragon leaves and watercress leaves in a small food processor (reserve the rest for the salad). Pour over some boiling water to wilt the leaves. Drain the water from the food processor and blend the leaves to a paste. Pour in the herb-infused oil and blend again until smooth.", "Make a salad with the remaining watercress, basil and tarragon leaves. Season with salt.", "To make the tapenade, blend the olives, capers, anchovies, parsley, brandy and black pepper together in a small food processor. Loosen with a little olive oil and blend to make a paste.", "Serve the cooked tarts topped with a small quenelle of tapenade and some herb salad. Drizzle with the herb oil."]}, {"isVegetarian": false, "title": "Tomato and anchovy pizza", "url": "www_bbc_co_uk_food_recipes_tomatoandanchovypizz_91866", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250ml/9fl oz tepid water", "1 tsp caster sugar", "1 x 7g/¼oz sachet easy blend dried yeast", "300g/10½oz strong white bread flour, plus extra for dusting", "1 heaped tsp salt", "1-2 tbsp olive oil, for greasing", "425g/15oz ripe tomatoes, stalks cut out, cross cut into the bottom of each", "3 tbsp olive oil", "1 hot red chilli, seeds removed, finely chopped", "4 garlic cloves, peeled, finely chopped", "½ tsp flaked sea salt", "½ tsp caster sugar", "10-12 anchovy fillets, in oil, drained", "2 large pinches dried oregano", "extra virgin olive oil, for drizzling"], "serves": "Serves 2", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the pizza dough, pour the water into a large bowl and gently stir in the sugar and yeast. Set aside for 10 minutes, or until the water has a thick beige foam floating on top.", "Add half of the flour and stir gently with a wooden spoon until incorporated into the water. ", "Gradually add half the remaining flour, stirring continuously, until it has been incorporated into the water. ", "Add the remaining flour and the salt and, using clean hands, mix together until the mixture comes together as a soft, spongey dough. ", "Immediately turn the dough out onto a lightly floured work surface and knead for 10 minutes, or until smooth and elastic.", "Grease a large bowl with oil and place the dough into the bowl. Brush a sheet of cling film lightly with oil and cover the dough with it. Set aside in a warm place for 45-60 minutes, or until the dough has doubled in size (proved).", "Preheat the oven to 240C/475F/Gas 9.", "When the dough has proved, turn it out onto a lightly floured work surface and knock back for 1-2 minutes.", "Divide the dough into two pieces and roll out until they are both 25cm/10in in diameter. ", "Place each pizza base onto a lightly oiled baking tray. Brush the pizza bases with a little more oil and cover loosely with another piece of lightly oiled cling film. Set aside in a warm place for 20 minutes, or until it has doubled in size again.", "Transfer the pizza bases to the oven and bake for 12-15 minutes or until risen and golden-brown. ", "Meanwhile, for the pizza topping, place the tomatoes into a bowl and cover with boiling water. Set aside for 30 seconds, then drain the tomatoes and peel away the skins. ", "Cut the peeled tomatoes into quarters, setting the seeds aside in a separate bowl. Chop the tomato flesh roughly.", "Heat the oil in a pan over a medium heat. Add the chilli and fry until it has softened.", "Add the garlic and continue to fry for no more than 30 seconds.", "Add the tomato flesh, salt and sugar and stir well to combine. ", "Transfer the reserved tomato seeds to a sieve and, using a wooden spoon, push the juice from the seeds through the sieve into the pan. Reduce the heat until the mixture is simmering. ", "Continue to simmer the sauce for 15-20 minutes, or until the tomatoes have broken down and the sauce has thickened. Remove from the heat and set aside to cool slightly. ", "When the sauce has cooled, spread a thin layer over the pizza bases (the remaining sauce can be frozen and cooked with pasta). Arrange the anchovy fillets in a clock formation on top of the pizza. Sprinkle over the dried oregano and drizzle over the olive oil. Serve immediately."]}, {"isVegetarian": true, "title": "Tomato and asparagus salad with caper vinaigrette", "url": "www_bbc_co_uk_food_recipes_tomatoandasparagussa_84479", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ bunch asparagus, ends trimmed off", "1 tbsp balsamic vinegar", "2 tbsp olive oil", "salt and freshly ground black pepper", "1 tbsp chopped capers", "150g/5½oz tomatoes, halved", "2 tbsp chopped parsley", "2 tbsp chopped basil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Bring a saucepan of water to the boil. Lower the asparagus into the boiling water to boil for 2-3 minutes, then immerse in a bowl of cold water for one minute.  Drain.", "Place the balsamic vinegar and olive oil in a bowl and whish together. Season with salt and freshly ground black pepper, then add the capers.", "To serve, place the asparagus and tomatoes together into a serving bowl, pour over the vinaigrette and sprinkle over herbs."]}, {"isVegetarian": true, "title": "Tomato and apple chutney", "url": "www_bbc_co_uk_food_recipes_tomatoandapplechutne_83979", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["570ml/1 pint malt vinegar", "450g/1lb soft brown sugar", "300g/11oz sultanas", "2kg/4lb 4oz ripe red tomatoes, cut into 6 or 8 pieces", "500g/1lb 2oz green apples, peeled and chopped", "400g/14oz shallots, peeled and roughly chopped", "4 red chillies, chopped", "1 tbsp root ginger, finely chopped", "sea salt and freshly ground black pepper"], "serves": "Makes 3-4 jam jars full", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Place the vinegar and sugar in a large saucepan and bring to the boil. Cook for three to four minutes until the sugar has melted.", "Add the sultanas and cook until just reduced.", "Add all the other ingredients, bring to the boil and cook for about 20 to 30 minutes, stirring frequently.", "Leave the chutney with a chunky texture and not too cooked as that will cause it to be a purée. ", "Cool the chutney, place into sterilised jars and store for two to three weeks in the fridge."]}, {"isVegetarian": true, "title": "Tomato and basil croquettes with oozing mozzarella and rocket pesto vinaigrette", "url": "www_bbc_co_uk_food_recipes_tomatoandbasilcroque_90977", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["10 sun-blushed tomato pieces, roughly chopped", "50g/2oz rocket leaves, plus extra to garnish", "1 tbsp pine nuts", "½ garlic clove ", "3 piquillo peppers, roughly chopped (available from Spanish delicatessens and some supermarkets)", "1 tbsp grated parmesan", "5-6 tbsp olive oil", "4 tbsp Cabernet Sauvignon vinegar", "vegetable oil, for deep fat frying", "500g/1lb 2oz potatoes, peeled and cut into large dice", "110g/4oz parmesan cheese, freshly grated", "1 tbsp red pesto (from recipe above)", "10 sun-blushed tomato pieces, roughly chopped", "10 basil leaves, roughly chopped", "salt and freshly ground black pepper", "50g/2oz plain flour plus up to 2 tbsp extra (if too dry)", "1 small ball fresh mozzarella cheese, cut into small pieces", "110g/4oz breadcrumbs", "2 free-range eggs, beaten"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the pesto, place all the pesto ingredients, except the Cabernet Sauvignon vinegar, into a food processor and blend to a fine purée. Set aside.", "For the croquettes, preheat the oven to 160C/320F/Gas 2.", "Preheat the oil in a deep fat fryer to 160C. (CAUTION: Hot oil can be dangerous. Do not leave unattended.)", "Place the potatoes into a saucepan of salted water and bring to the boil. Cook for 12-18 minutes, or until tender, then drain and return to the pan.", "Place the pan of potatoes back over the heat until all the moisture has evaporated. Mash with a potato masher or ricer until smooth.", "Add the parmesan cheese, one tablespoon of the red pesto, and all the sun-blushed tomatoes and basil to the mash and mix well. Add salt and freshly ground black pepper, to taste. (Add a little flour if the mixture is too wet to form into shapes with your hands.)", "Divide the mixture into 12 equal-sized pieces and shape into cylinder croquettes, using your hands. Push a small piece of mozzarella into the centre of each croquette, closing up the potato to completely cover the mozzarella.", "Place the remaining flour and the breadcrumbs onto two separate plates. Place the eggs in a bowl. Dredge the croquettes in the flour, then dip them into the beaten eggs and finally roll them in the breadcrumbs, to cover, retaining the shape.", "Carefully lower a few croquettes at a time into the preheated deep fat fryer and cook for 3-4 minutes, or until golden-brown and crisp. Remove with a slotted spoon and drain on kitchen paper. Transfer the croquettes to a roasting tray and place in the preheated oven to keep warm.", "To serve, add the Cabernet Sauvignon vinegar to the remaining pesto and place a spoonful onto each of four plates. Place three croquettes on top of each dollop of pesto and garnish with rocket."]}, {"isVegetarian": false, "title": "Tomato and basil poached fish", "url": "www_bbc_co_uk_food_recipes_tomatoandbasilpoache_83682", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil ", "2 onions, sliced", "2 garlic cloves, finely chopped", "2 x 400g/14oz cans of chopped tomatoes", "125ml/4fl oz vegetable or fish stock ", "salt and freshly ground black pepper", "4 x 200g/7oz firm white fish fillets", "2 handfuls baby spinach leaves", "1 tbsp chopped fresh basil", "12 new potatoes, diced and boiled"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Heat a deep frying pan over a medium heat.", "Add the oil, onions and garlic and cook for eight minutes, until the onion is soft.", "Add the tomatoes, stock and seasoning, and stir to combine.", "Cook uncovered until the mixture has reduced and thickened slightly, which should be about ten minutes.", "Place the fish in a baking dish, top with the tomato mixture and cook in the preheated oven for 12 minutes.", "To serve, remove the fish from the sauce, and keep warm.", "Stir the spinach and basil into the sauce, and cook until the spinach has wilted.", "Spoon the sauce over the fish and serve immediately with the boiled new potatoes."]}, {"isVegetarian": false, "title": "Tomato and basil salad with prosciutto", "url": "www_bbc_co_uk_food_recipes_tomatoandbasilsaladw_84313", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "2 slices prosciutto ", "2 tbsp olive oil", "frac12; onion", "1 clove garlic", "4 cherry tomatoes, chopped", "1 tbsp fresh chives, chopped", "salt and freshly ground black pepper ", "handful fresh basil leaves", "4 cherry tomatoes, cut in half", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the prosciutto, heat the oil in a pan over a high heat. Add the prosciutto and fry for one minute on each side, or until crisp and golden. Drain on kitchen paper.", "For the dressing, heat the oil in a frying pan over a medium heat. Add the onion and garlic and fry until soft.", "Add the tomatoes and fry for 3-4 minutes, or until soft.", "Add the chives and season, to taste, with salt and freshly ground black pepper.", "For the salad, arrange the basil leaves onto a serving plate in a circle. Place half a cherry tomato cut-side up onto each basil leaf. Spoon a little of the dressing over each cherry tomato. ", "To serve, arrange the proscuitto in the middle of the plate and season with salt and freshly ground black pepper."]}, {"isVegetarian": true, "title": "Tomato and basil tart", "url": "www_bbc_co_uk_food_recipes_tomatoandbasiltart_72416", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["110g/4oz puff pastry", "plain flour, to dust", "1 beef tomato, cut into slices", "handful of fresh basil leaves", "55-85g/2-3 oz gruyère cheese, grated", "freshly ground black pepper, to season", "1 egg, beaten"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "Roll the pastry out thinly on a floured surface. Cut a large circle out and place on a non-stick baking tray. Crumple the edges of the pastry roughly using your fingers.", "Place the tomato slices in the middle of the pastry circle and then top with the basil. Sprinkle the cheese over and season with black pepper.", "Brush the edges of the tart using the egg wash and then bake in the oven for 8-10 minutes, or until crisp and golden. ", "Serve."]}, {"isVegetarian": true, "title": "Tomato and bean stew", "url": "www_bbc_co_uk_food_recipes_tomatoandbeanstew_84184", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["knob of butter", "bunch spring onions, tips only, chopped", "½ 400g/14 oz can flageolet beans, rinsed and drained", "400g/14oz can of plum tomatoes and juice", "1 garlic clove, finely chopped", "½ 326g/11½ oz can sweetcorn, drained and rinsed", "salt and freshly ground black pepper", "1 tbsp chopped fresh parsley"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the butter in a saucepan over a medium heat. Add the spring onions, and saué for one minute. ", "Add the beans, tomatoes, garlic and sweetcorn, bring to the boil, and reduce then simmer for 5-6 minutes to reduce. Season, to taste, with salt and freshly ground black pepper.", "To serve, add the parsley to the stew and pour into a warmed bowl."]}, {"isVegetarian": false, "title": "Tomato and chilli jam", "url": "www_bbc_co_uk_food_recipes_tomatoandchillijam_89081", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 400g/14oz can plum tomatoes", "4 red chillies, chopped", "4 garlic cloves, peeled", "7cm/3in piece fresh ginger, peeled, chopped", "3 tbsp fish sauce (nam pla)", "120ml/4fl oz red wine vinegar", "375g/13oz soft light brown sugar", "1 tsp cardamom pods, lightly crushed", "70g/2½oz raisins", "400g/14oz fresh tomatoes, chopped"], "serves": "1-2 jars", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Place the canned tomatoes, chilli, garlic, ginger and fish sauce into a food processor and blend until smooth.", "Place the tomato sauce into a non-reactive pan over a medium heat and add the vinegar, sugar, cardamom pods and raisins. Bring to the boil then add the chopped fresh tomatoes. Reduce the heat and simmer for 45-55 minutes, or until the sauce has thickened to a chutney or jam-like consistency.", "Transfer to sterilised jars and seal until ready to use. The jam should keep for 2-3 weeks in the fridge."]}, {"isVegetarian": true, "title": "Tomato and chilli penne", "url": "www_bbc_co_uk_food_recipes_tomatoandchillipenne_92089", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["350g/12oz cherry tomatoes", "3 cloves garlic, peeled, sliced", "1 tsp chilli flakes", "150ml/5½fl oz extra virgin olive oil", "125g/4½oz fresh breadcrumbs", "100g/3½oz finely grated pecorino cheese", "1 tsp chopped fresh thyme", "salt and freshly ground black pepper", "450g/1lb freshly-cooked penne pasta", "1 tbsp torn fresh basil leaves", "garlic bread, to serve"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/360F/Gas 4.", "Place the tomatoes, garlic and chilli flakes into a baking dish and drizzle over the olive oil. Roast in the oven for 25 minutes, or until the tomatoes are softened.", "Meanwhile in a bowl, mix together the breadcrumbs, pecorino cheese and thyme and season with salt and freshly ground black pepper. Spoon the mixture over the tomatoes and place back into the oven for 4-5 minutes, or until the top is golden-brown and crisp. ", "Spoon the tomato mixture over the penne pasta in a bowl and mix well. Spoon the penne into serving bowls, then garnish with the torn basil and serve with garlic bread."]}, {"isVegetarian": true, "title": "Tomato and goats' cheese tarte tatin with basil oil", "url": "www_bbc_co_uk_food_recipes_tomatoandgoatscheese_86055", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "5 cherry tomatoes, halved", "pinch caster sugar", "85g/3oz ready-rolled puff pastry", "30g/1oz goats' cheese, halved", "50g/2oz spinach", "water, to cover", "4 tbsp olive oil", "handful fresh basil leaves", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the tarte tatin, heat the olive oil in a small ovenproof frying pan, add the tomatoes cut-side down and sprinkle over the sugar. Fry gently for 3-4 minutes until slightly softened.", "Cut a circle of puff pastry large enough to fit over the top of the frying pan and place the pastry over the tomatoes. Push the pastry down around the edges to seal in the tomatoes.", "Transfer to the oven and bake for 8-10 minutes, or until the pastry is golden-brown. Remove from the oven and allow to cool slightly, then place a plate over the top of the frying pan and carefully turn the tarte tatin out onto the plate.", "Heat another small frying pan and fry the goats' cheese on both sides until lightly browned. Place the goats' cheese on top of the tarte tatin.", "For the basil oil, place the spinach into a bowl and cover with boiling water to wilt the spinach. Drain the spinach and squeeze out any excess liquid.", "Place the spinach, oil and basil into a small food processor. Season, to taste, with salt and freshly ground black pepper and blend until smooth.", "To serve, drizzle the basil oil over the tarte tatin."]}, {"isVegetarian": false, "title": "Tomato and Parma ham spaghetti", "url": "www_bbc_co_uk_food_recipes_tomatoandparmahamspa_83243", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz fresh spaghetti", "2 tomatoes, blanched, peeled and chopped", "3 slices Parma ham, roughly chopped", "2 tbsp olive oil", "black pepper, to taste", "1 tbsp chopped fresh basil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the spaghetti in salted boiling water according to packet instructions.", "Drain the spaghetti and stir in the chopped tomatoes, Parma ham, olive oil and black pepper.", "To serve, spoon into a bowl and sprinkle with fresh basil."]}, {"isVegetarian": true, "title": "Tomato and red pepper soup", "url": "www_bbc_co_uk_food_recipes_tomatoandredpepperso_10654", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ onion, chopped", "2 cloves garlic, chopped", "2 tins tomatoes", "1 jar red peppers", "250ml/9fl oz chicken or vegetable stock", "sea salt and black pepper", "handful fresh parsley, chopped ", "double cream (optional)"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Firstly, sauté the onion and garlic and then add the tinned tomatoes and red peppers. ", "Bring to a simmer and add the stock. Bring to the boil and then gently simmer for four to five minutes, before placing in the blender. ", "Blend to a smooth soup. Season with salt and pepper. Return to the pan to warm through and serve immediately scattered with the parsley and a swirl of double cream, if using."]}, {"isVegetarian": true, "title": "Tomato and spinach soup", "url": "www_bbc_co_uk_food_recipes_tomatoandspinachsoup_88274", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["dash olive oil", "¼ onion, finely chopped", "75ml/2½fl oz tomato passata (sieved tomatoes)", "300ml/½ pint hot vegetable stock", "125g/4½oz fresh spinach leaves", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a saucepan, add the onion and fry until softened.", "Add the passata, stock, spinach, salt and freshly ground black pepper and simmer for 3-4 minutes. Blend with a hand blender until smooth.", "To serve, pour into a serving bowl."]}, {"isVegetarian": true, "title": "Tomato and squash pizza", "url": "www_bbc_co_uk_food_recipes_tomatoandsquashpizza_85259", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz plain flour, plus extra for dusting", "pinch salt", "1 tbsp olive oil", "warm water", "100g/3½oz tinned tomatoes, drained and chopped", "1 tbsp olive oil", "pinch dried chilli flakes", "pinch sugar", "handful fresh parsley, chopped", "handful fresh basil, chopped", "salt and freshly ground black pepper ", "1 tbsp olive oil", "100g/3½oz butternut squash, peeled, cut into 1cm/½in cubes", "1 garlic clove, crushed", "2 sprigs fresh thyme, leaves only", "salt and freshly ground black pepper"], "serves": "Serves 1-2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 230C/450F/Gas 8.", "For the pizza dough, place the flour, salt and olive oil into a large bowl and mix well. Add enough warm water to make a soft but not sticky dough.", "Turn the dough out onto a lightly floured surface and knead briefly. Roll the dough out to make a circle 0.5cm/¼in thick and place onto a non-stick baking sheet.", "For the tomato sauce, place all the sauce ingredients into a bowl, season with salt and freshly ground black pepper and mix well. Spread the sauce evenly over the dough circle, leaving a thin border around the edge.", "For the topping, heat the olive oil in a frying pan and cook the butternut squash pieces, garlic and thyme for 5-6 minutes, or until just tender.  Season with salt and freshly ground black pepper, then sprinkle the topping over the pizza base.", "Transfer the pizza to the oven and bake for 10-12 minutes, or until the base is crisp and cooked through.", "To serve, place the pizza onto a serving plate."]}, {"isVegetarian": true, "title": "Tomato and sweetcorn soup", "url": "www_bbc_co_uk_food_recipes_tomatoandsweetcornso_7921", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 cloves garlic, crushed ", "1 large onion, finely chopped ", "olive oil ", "1 tsp powdered cumin ", "2 tins(400g/14oz) chopped tomatoes ", "340g/12oz sweetcorn kernels, tinned or frozen ", "1L/1 ¾pt vegetable or chicken stock ", "2 tbsp tomato purée ", "fresh basil or coriander leaves ", "salt and black pepper"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Sweat the garlic and onion in olive oil until soft and translucent. Add the cumin and cook for a minute or so before adding the tomatoes, sweetcorn, stock and tomato purée. Bring to the boil, then turn down the heat and allow to simmer for 15-20 minutes.", "The soup is good just as it is, rustic and chunky. If you prefer a smoother soup, just blend half of the mixture. Scatter with fresh herbs and serve with a drizzle of olive oil. Season well."]}, {"isVegetarian": true, "title": "Tomato and walnut stew", "url": "www_bbc_co_uk_food_recipes_tomatoandwalnutstew_76876", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "½ tsp chilli flakes", "½ tsp ground coriander", "1 x 400g/14oz tin cherry tomatoes", "2 tbsp brown sugar", "25g/1oz walnuts, chopped", "3 tbsp fresh coriander, chopped", "2 tbsp butter"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a saucepan over a medium heat.", "Add the chilli flakes and ground coriander and cook for one minute. Add the cherry tomatoes and brown sugar and cook for a further 8-10 minutes.", "Stir in the chopped walnuts and coriander.", "Stir in the butter and serve."]}, {"isVegetarian": true, "title": "Tomato, apple and soft duck egg salad", "url": "www_bbc_co_uk_food_recipes_tomatoappleandsoftdu_88789", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tomato, sliced", "1 spring onion, sliced", "1 apple, sliced", "1 tbsp balsamic vinegar", "3 tbsp olive oil", "salt and freshly ground black pepper ", "large handful fresh coriander", "1 duck egg, poached, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Mix the tomato, spring onion, apple, balsamic vinegar, and olive oil together in a large bowl and season to taste with salt and freshly ground black pepper.", "Spoon into a serving bowl and top with the poached duck egg."]}, {"isVegetarian": true, "title": "Tomato, avocado and mango salad", "url": "www_bbc_co_uk_food_recipes_tomatoavocadomangosa_76910", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ mango sliced into thin strips", "½ avocado diced", "4 cherry tomatoes, sliced", "1 lime, juice only", "3 tbsp parsley, chopped", "3 tbsp coriander, chopped", "3 tbsp red onion, diced", "4 tbsp olive oil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Mix the mango with the avocado and cherry tomatoes.", "Add the lime juice, chopped herbs,  red onion and olive oil and mix together.", "Serve."]}, {"isVegetarian": false, "title": "Tomato, basil and chickpea bread", "url": "www_bbc_co_uk_food_recipes_tomatobasilandchickp_92406", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb plain flour, plus extra for dusting", "1 tsp baking powder", "small handful fresh basil leaves", "40g/1½oz butter", "1 free-range egg", "2-3 tbsp milk, to bind", "5 cherry tomatoes", "85g/3oz tinned chickpeas, drained", "3 tbsp olive oil", "salt and freshly ground black pepper"], "serves": "Makes 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Blend the flour, baking powder, basil and butter in a food processor bowl until the mixture resembles breadcrumbs. ", "Crack the egg into the food processor bowl and pour in two tablespoons of the milk. Pulse, adding another tablespoon of milk if necessary to form a dough. ", "Turn the mixture out onto a lightly floured surface and knead until smooth and elastic. Roll the dough out into a thick round using a floured rolling pin. ", "Press the tomatoes and chickpeas into the surface of the dough and place onto a baking sheet. ", "Drizzle the olive oil over the tomatoes and chorizo and season well with salt and freshly ground black pepper.", "Bake the dough in the oven for 10-12 minutes, or until golden-brown and slightly risen."]}, {"isVegetarian": false, "title": "Tomato, bean and chorizo stew", "url": "www_bbc_co_uk_food_recipes_tomatobeanandchorizo_79833", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "100g/3½oz chorizo, peeled and sliced 1cm thick", "3 tbsp celery, finely chopped", "3 garlic cloves, crushed", "½ tsp freshly ground black pepper ", "4 tomatoes, deseeded (seeds reserved)", "½ tsp dried oregano", "1 tin cannellini beans, rinsed and drained", "handful black olives, pitted"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a saucepan over a medium heat. Add the chorizo, celery, garlic and pepper, and cook over a medium heat for two minutes, until the chorizo is browned.", "Place the tomato seeds and the flesh of two of the tomatoes into a food processor and blend. Add to the pan.", "Add the remaining ingredients and simmer for five minutes.", "Serve hot with crusty bread."]}, {"isVegetarian": false, "title": "Chicken and pepper stew", "url": "www_bbc_co_uk_food_recipes_tomatochickenandpepp_85655", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "75g/2½oz chicken fillets", "½ jar roasted red peppers, chopped", "75ml/2½fl oz white wine", "1 tbsp double cream", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a small saucepan. ", "Add the chicken fillets and cook until golden on all sides. ", "Add the red peppers and fry for two minutes. ", "Add the wine, turn up the heat and bubble for one minute. ", "Stir in the double cream and season. Cook for one minute, or until the chicken is cooked through. ", "Pour into a serving bowl and serve."]}, {"isVegetarian": true, "title": "Tomato chutney", "url": "www_bbc_co_uk_food_recipes_tomatochutney_75669", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tomatochutney_75669_16x9.jpg", "ingredients": ["1 tbsp olive oil", "½ shallot, chopped", "1 ½ tomatoes, chopped", "1 clove garlic, crushed", "1 tbsp balsamic vinegar", "1 tsp brown sugar"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a small pan. ", "Add the shallots, tomatoes and garlic and cook out for 5-8 minutes or until softened. ", "Add the vinegar and sugar and cook out for a further 3-5 minutes or until the chutney has caramelised slightly. Serve immediately."]}, {"isVegetarian": true, "title": "Tomato couscous with goats' cheese roll", "url": "www_bbc_co_uk_food_recipes_tomatocouscouswithgo_86058", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150ml/¼ pint hot vegetable stock", "2 tsp tomato purée", "2 tsp tomato ketchup", "200g/7oz couscous", "60g/2½oz cherry tomatoes, halved", "handful fresh parsley, chopped", "handful fresh basil, chopped ", "salt and freshly ground black pepper", "175g/6oz ready-rolled puff pastry", "8 basil leaves, rubbed with olive oil", "85g/3oz goats' cheese log", "1 free-range egg, beaten", "sea salt, for sprinkling"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the tomato couscous, place the vegetable stock, tomato purée and tomato ketchup into a small saucepan and bring to the boil.", "Place the couscous into a large bowl and pour over the stock mixture to cover the couscous. Cover with cling film and leave to stand for five minutes.", "Remove the cling film and separate the couscous grains with a fork. Add the cherry tomatoes and herbs, season, to taste, with salt and freshly ground black pepper and stir well.", "Preheat the oven to 200C/400F/Gas 6.", "For the goats' cheese roll, place the puff pastry onto a board. Place the basil leaves along the middle of the pastry and top with the goats' cheese log.", "Brush the edges of the pastry with beaten egg, then roll up to seal the goats' cheese inside the pastry. Brush the top of the pastry with more beaten egg and sprinkle with sea salt.", "Place the pastry roll onto a non-stick baking sheet, transfer to the oven and bake for 12-14 minutes, or until the pastry is puffed up and golden-brown on top. Slice in half.", "To serve, place equal amounts of the couscous onto two serving plates and place half of the goats' cheese roll on top of each."]}, {"isVegetarian": true, "title": "Tomatoes on toast with green olive tapenade", "url": "www_bbc_co_uk_food_recipes_tomatoesontoastwithg_89568", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb cherry tomatoes", "sea salt and freshly ground black pepper", "4 garlic cloves, sliced", "12 sprigs fresh thyme", "250ml/9fl oz extra virgin olive oil", "2 tbsp sherry vinegar", "250g/9oz green olives, stones removed", "1 tbsp capers, rinsed and drained", "1 lemon, juice only", "1 garlic clove, chopped ", "1 focaccia loaf, cut into 15cm/6in long strips", "olive oil", "handful fresh parmesan shavings"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 120C/250F/Gas ¼.", "Place the tomatoes into a non-reactive baking dish and season well with salt and freshly ground black pepper.", "Sprinkle over the garlic and thyme.", "Drizzle over the oil and transfer to the oven to roast for one hour.", "Remove from the oven, drizzle the tomatoes with the vinegar, then set aside.", "For the tapenade, place the green olives, capers, lemon juice and garlic into a small blender and pulse to a rough paste.", "For the toast, brush the focaccia strips with olive oil, then place onto a very hot griddle pan. Cook for 2-3 minutes on each side, until griddle lines appear on both sides. ", "To serve, place a strip of toast onto a plate and spread with a teaspoonful of tapenade. Repeat with the remaining toast strips until all of the tapenade is used up.", "Top each toast strip with a spoonful of tomatoes and finish with parmesan shavings."]}, {"isVegetarian": false, "title": "Tomatoes stuffed with salmon", "url": "www_bbc_co_uk_food_recipes_tomatoes_stuffed_with_16590", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 garlic cloves, peeled, left whole ", "small bunch fresh parsley, leaves only", "85g/3oz chopped walnuts", "500ml/18fl oz rapeseed oil", "pinch salt", "350g/12oz cooked leftover salmon fillet, flaked", "2 tbsp shredded smoked salmon", "1 tbsp ready-made mayonnaise", "1 garlic clove, crushed", "1 tbsp tomato ketchup", "splash balsamic vinegar", "4 large firm tomatoes, cut in half from top to bottom, seeds removed and reserved", "salt and freshly ground black pepper", "150g/5oz French beans, trimmed", "3 tbsp olive oil", "1 tbsp white wine vinegar", "1 tsp Dijon mustard", "2 small shallots, sliced"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the parsley oil, blend the garlic, parsley and walnuts as finely as possible in a food processor, then gradually add the oil in a thin stream, blending continuously, until smooth and well combined. Season, to taste, with salt. Set aside until needed.", "For the stuffed tomatoes, in a large bowl, mix together the flaked salmon, smoked salmon, mayonnaise, garlic, ketchup and balsamic vinegar until well combined. Season, to taste, with salt and freshly ground black pepper.", "Stuff the tomato halves with the filling mixture. Set aside.", "For the green bean and shallot salad, blanch the beans in a large pan of salted, boiling water for 1-2 minutes. Drain well and run under a cold tap to refresh.", "In a bowl, whisk together the oil, vinegar and mustard until well combined. Add the blanched beans and the shallot rings and stir to coat them in the dressing. Season, to taste, with salt and freshly ground black pepper.", "To serve, place two stuffed tomato halves, cut sides facing downwards, onto each of four serving plates. Drizzle over the parsley oil. Spoon the salad alongside."]}, {"isVegetarian": false, "title": "Tomato essence", "url": "www_bbc_co_uk_food_recipes_tomatoessence_92958", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2kg /4lb 6½oz cherry tomatoes", "1 baby fennel, sliced", "1 garlic clove, finely sliced", "½ celery stick, chopped", "½ banana shallot, finely sliced", "1 sprig fresh basil", "1 sprig fresh thyme", "1 sprig fresh garlic flowers or chive flowers", "4-6 drops Tabasco sauce", "1 tbsp Worcestershire sauce", "2-3 dashes angostura bitters"], "serves": "Makes 800ml/1 pint 9fl oz", "time": {"preparation": "overnight", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 0, "preparationMins": 0}, "recommendations": 0, "method": ["Place all of the ingredients into a bowl and mix together.", "Place the mixture, in batches, into a food processor and pulse five times for 1-2 seconds each time. Transfer the purée into a large bowl and repeat until all of the vegetables have been puréed.", "Cover the bowl with cling film and chill in the fridge for six hours.", "Line a clean bowl with a large piece of muslin and spoon in the tomato mixture. Draw the corners of the muslin cloth together and tie up tightly. String the muslin 'bag' up above the bowl to catch the strained juices. Leave to strain overnight. (Do not be tempted to squeeze the muslin.)", "Once strained, cover and refrigerate until needed."]}, {"isVegetarian": false, "title": "Tomato, figs and soft cheese rolled in parma ham (rotolo di proscuitto)", "url": "www_bbc_co_uk_food_recipes_tomatofigsandsoftche_70264", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["12 slices of parma ham", "6 large Italian plum tomatoes", "300g/11oz soft cheese", "100g/4oz basil leaves", "6 large figs, peeled", "Italian extra virgin olive oil", "salt and freshly ground pepper to taste", "grissini sticks"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cut the tomatoes in half, place them on a baking tray. Drizzle extra virgin olive oil on top and season with salt and pepper. Grill for approximately 5 minutes and then allow to cool.", "Finely slice the basil leaves and mix into the soft cheese with a pinch of salt and pepper.  ", "Slice the figs approximately ½cm/¼in thick.", "Put a slice of parma ham on a chopping board. Place 1 half tomato in the middle and then put 1 slice of fig on top. Place 1 teaspoon of soft cheese on top of the fig and tomato and then gently roll the parma ham over the filling ensuring that the ham is rolled tightly in order to keep the filling enclosed.", "Place three Rotolo di Prosciutto on a plate, drizzle with extra virgin olive oil and serve with Italian grissini sticks and a glass of cold white wine."]}, {"isVegetarian": false, "title": "Tomato filled with salmon and pine nuts, with a pistou dressing", "url": "www_bbc_co_uk_food_recipes_tomatofilledwithsalm_92461", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz butter", "½ small onion, peeled, chopped", "1 garlic clove, peeled, crushed", "2 tbsp pine nuts", "pinch chilli powder", "pinch ground ginger", "pinch cayenne pepper", "1 tbsp tomato purée", "55g/2oz salmon fillet, skin removed, chopped", "1 ripe beef tomato, top sliced off, hollowed out with a spoon, seeds discarded", "1 handful fresh basil leaves", "2 tbsp pine nuts, toasted", "4 tbsp extra virgin olive oil", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Melt the butter in a pan over a medium heat and gently fry the onion and garlic for 3-4 minutes, until softened. Add the pine nuts, chilli powder, ground ginger, cayenne, tomato purée and salmon and stir well. Cook for a further 2-3 minutes. ", "Fill the hollowed-out tomato with the stuffing mixture and place onto a baking tray.", "Bake the stuffed tomato in the preheated oven for 5-7 minutes, or until softened.", "Meanwhile, for the pistou dressing, place all the pistou dressing ingredients into a food processor and blend until smooth.", "To serve, place the cooked tomato into the centre of a serving plate. Drizzle the pistou dressing around the edge of the plate."]}, {"isVegetarian": true, "title": "Tomato, mozzarella and basil pizza", "url": "www_bbc_co_uk_food_recipes_tomatomozzarellaandb_87868", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tomatomozzarellaandb_87868_16x9.jpg", "ingredients": ["500g/1lb 2oz strong plain flour, plus extra for dusting ", "10g/½oz fresh yeast", "2 tsp salt", "400g/14oz can chopped tomatoes, well drained ", "salt and freshly ground black pepper", "small handful fresh basil leaves ", "small handful thyme leaves, optional", "200g/7oz buffalo mozzarella cheese, torn up", "small handful pitted black olives, optional", "extra virgin olive oil, for drizzling"], "serves": "Serves 2", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the base, sift the flour into a large bowl. In another bowl, mix the yeast with a little warm water until it begins to foam. Slowly add to the flour and mix to form a dough. If it's too sticky, add more flour. Cover the bowl with a clean cloth and leave to rest for five minutes.", "Add the salt to the dough, then turn out onto a lightly floured surface and knead for about ten minutes until smooth. Cover with a damp cloth and let it prove for 30 minutes. ", "Preheat the oven to its highest setting. Cut the dough in half and knead for a minute or so, making sure you really knock it back. ", "Press the dough out very thinly to make two circles about 40cm/16in across, leaving the edges slightly thicker, like the edge of a plate. Place the dough circles onto floured baking sheets. ", "For the topping, season the tomatoes with salt and freshly ground black pepper and spread over each dough base (you probably won't need the whole tin). Sprinkle over the basil leaves, thyme leaves, if using, and mozzarella, season with salt and freshly ground black pepper and drizzle over some oil. Scatter over the olives, if using.", "Place the pizzas into the oven and bake for 8-10 minutes, or until the base is crisp and the cheese is bubbling."]}, {"isVegetarian": true, "title": "Tomato mozzarella salad", "url": "www_bbc_co_uk_food_recipes_tomatomozzarellasala_84154", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 cherry tomatoes, halved", "1 thick slice mozzarella cheese", "2 tbsp olive oil", "2 tbsp chopped fresh basil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the cherry tomatoes onto a plate. ", "Heat the oil in frying pan and when hot, add the mozzarella and fry for one minute on each side, until golden.", "To serve, place the mozzarella on top of the tomatoes and sprinkle with basil."]}, {"isVegetarian": true, "title": "Tomato and yellow pepper crostini", "url": "www_bbc_co_uk_food_recipes_tomatopepperandauber_77216", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 thick slices of bread", "1 tbsp olive oil", "1 clove garlic, crushed", "½ yellow pepper, de-seeded and sliced ", "4 mini mozzarella balls", "handful fresh basil", "4 cherry tomatoes, sliced in half", "sea salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to its highest setting.", "Brush the bread with the oil and rub in the garlic.", "Layer the remaining ingredients onto the bread, season and place under the grill for 2-3 minutes, until cheese is bubbly. Serve."]}, {"isVegetarian": true, "title": "Tomato relish", "url": "www_bbc_co_uk_food_recipes_tomatorelish_81521", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["oil for frying", "1 onion, sliced ", "1 garlic clove, crushed ", "1 red chilli, finely chopped ", "800g/1lb 12oz chopped tomatoes", "200ml/7fl oz red wine vinegar", "200g/7oz sugar", "salt and freshly ground black pepper", "30g/1½oz capers in vinegar, rinsed", "30g/1½oz baby gherkins, chopped", "handful fresh coriander"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a frying pan and fry the onion, garlic and chilli until soft.", "Add the tomatoes and mix well.", "Add the vinegar and sugar and bring to the boil. Simmer for 30 minutes and season with the salt and freshly ground black pepper. The relish should be the consistency of jam.", "Stir in the capers and gherkins and the chopped coriander. Add more seasoning if required."]}, {"isVegetarian": false, "title": "Tomato risotto", "url": "www_bbc_co_uk_food_recipes_tomatorisotto_92965", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tomatorisotto_92965_16x9.jpg", "ingredients": ["2 tbsp olive oil, plus extra for drizzling", "½ onion, finely chopped", "¼ garlic clove, crushed", "200g/7oz risotto rice, such as carnaroli", "Salt and freshly ground black pepper", "150g/5oz butternut squash, peeled and cut into 1cm/½in cubes", "300ml/10½fl oz water", "300ml/10½fl oz tomato essence or passata", "10 cherry tomatoes, halved", "2 baby courgettes, halved lengthways and sliced into 1cm/½in thick pieces", "1 baby fennel, sliced", "½ tsp coriander seeds, lightly crushed", "80g/3oz peas", "2 tbsp mascarpone cheese", "4 tsp freshly grated parmesan, plus extra for sprinkling", "4 tbsp baby salad leaves"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6.", "Heat a pan over a medium heat, add the olive oil and gently fry the onion for 3–4 minutes, or until tender. Add the garlic and fry for a further minute. ", "Add the rice, stirring well to coat in the olive oil. Fry for 1–2 minutes, or until the rice is translucent. Season with salt and freshly ground black pepper. ", "Add the butternut squash to the pan and mix well. Add the water and half of the tomato essence, then bring to a gentle simmer. Cover with a lid and cook for 15 minutes.", "Place the remaining tomato essence into a saucepan and warm through.", "Meanwhile, place the halved cherry tomatoes onto a baking tray, drizzle with a little olive oil and season with salt and freshly ground black pepper. Roast in the oven for 5–6 minutes, or until the tomatoes are just tender and collapsed slightly. ", "By now, the rice should have absorbed all of the liquid. Remove the lid and stir well. Add the courgettes, baby fennel and coriander seeds and cook for a couple of minutes. Add the peas, mascarpone and parmesan and stir well, adding a little extra tomato essence if the risotto is too dry. ", "To serve, spoon the risotto into a small serving bowl. Top with a few roasted tomatoes, a little sprinkling of parmesan and some micro leaves. Spoon over the warmed tomato essence."]}, {"isVegetarian": true, "title": "Tomato salad Maman Blanc", "url": "www_bbc_co_uk_food_recipes_tomatosaladmamanblan_92961", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 large Coeur de Boeuf or beefsteak tomatoes, thickly sliced", "1 red onion, finely sliced", "1 shallot, finely chopped", "1 garlic clove, crushed", "1 tbsp Dijon mustard", "3 tbsp rapeseed oil", "splash white wine vinegar", "1-2 tbsp warm water", "2 tbsp roughly chopped fresh flatleaf parsley", "1 small handful fresh basil leaves"], "serves": "4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 60, "preparationMins": 60}, "recommendations": 0, "method": ["Arrange the tomato slices in a circle on a serving platter. ", "Scatter the red onion over the top.", "Place the shallot, garlic, mustard and white wine vinegar into a bowl and whisk well to combine. Whisk in the rapeseed oil, then add the water (whisking continuously) to emulsify the dressing. Season to taste with salt and freshly ground black pepper.", "Spoon the dressing over the tomatoes then set aside for at least one hour to marinate.", "When ready to serve, scatter over the parsley and basil leaves."]}, {"isVegetarian": true, "title": "Tomato salad with guacamole", "url": "www_bbc_co_uk_food_recipes_tomatosaladwithguaca_84132", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 garlic clove ", "½ avocado, peeled, stone removed", "1 tsp chopped fresh coriander", "½ lemon juice only", "2 tbsp olive oil", "salt and freshly ground black pepper", "1 tbsp olive oil", "1 tsp balsamic vinegar ", "1 tomato, deseeded, finely chopped", "½ avocado, peeled, stone removed, finely chopped", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["To make the guacamole, place all of the guacamole ingredients into a food processor and blend until smooth.", "To make the salad, whisk together the oil and vinegar in a bowl.", "Add the tomato and avocado, season, to taste, with salt and freshly ground black pepper and mix together well.", "To serve, place the salad onto a plate and spoon the guacamole around."]}, {"isVegetarian": true, "title": "Tomato salad with buffalo mozzarella", "url": "www_bbc_co_uk_food_recipes_tomatosaladwithbuffa_92966", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["20 black Kalamata olives, stones removed", "400g/14¼oz heritage tomatoes, cores removed, roughly chopped", "1 garlic clove, finely sliced", "2-3 fresh basil leaves, finely sliced", "2 tbsp extra virgin olive oil", "1 tsp white wine vinegar", "2 pinches sea salt", "1 small pinch freshly ground black pepper", "1 large bunch fresh basil ", "15g/½oz pine nuts, toasted", "30g/1oz parmesan cheese", "1 garlic clove", "100-125ml olive oil", "50g/2oz black olive tapenade", "320g/11oz buffalo mozzarella, roughly chopped", "2 tbsp aged balsamic vinegar", "8 small croutons", "1 red onion, halved and finely sliced", "4 tbsp fresh micro herbs"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["For the dried olives, preheat the oven to 100C/210F or to its lowest possible setting. Place the olives on a baking tray and leave in the oven for 1-1½ hours, or until the olives are completely dried. Allow to cool, then finely chop and set aside.", "For the tomatoes, mix together all of the tomato ingredients in a bowl and set aside for one hour. ", "For the pesto, bring a medium pan of water to the boil, add the basil and blanch for 30 seconds. Drain and plunge the basil into iced water to stop the cooking process. ", "Drain the basil well, squeezing out any excess water, and place in a food blender with the remaining pesto ingredients. Blend to a fine purée, then taste and adjust the seasoning if necessary. ", "To serve, brush the black olive tapenade across the centre of a rectangular plate. Arrange the tomatoes across the tapenade strip, alternating with pieces of mozzarella and dried olives. Dot the plate with pesto and aged balsamic vinegar, then scatter over the croutons, slices of red onion and the micro herbs."]}, {"isVegetarian": false, "title": "Tomato sauce", "url": "www_bbc_co_uk_food_recipes_tomatosauce_3755", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5oz salted breast of pork, rather fat", "175g/6oz carrots, cut into cubes", "175g/6oz onions, cut into cubes", "1 bay leaf and 1 small sprig thyme", "150g/5oz flour", "55g/2oz butter", "15g/½oz salt", "25g/1oz sugar", "pinch of pepper", "4.5kg/10lb raw tomatoes or 4.5L/8pt/4quarts of same, mashed", "2.26L/4pt/2quarts white stock"], "serves": "Makes approx 10 pints", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Fry the pork with the butter in a tall, thick-bottomed saucepan. When the pork is nearly melted, add the carrots, onions and aromatics. ", "Cook and stir the vegetables, then add the flour, which should be allowed to cook until it begins to brown. ", "Now put in the tomatoes and white stock, mix the whole mixture well, and set to boil on an open fire. ", "At this point add the seasoning and a crushed clove of garlic, cover the saucepan, and place in a moderate oven, where it may cook for 1½ hours. ", "At the end of this time the sauce should be passed through a sieve or tammy, and it should boil while being stirred.", "Finally, pour it into a tureen, and butter its surface to avoid the formation of a skin."]}, {"isVegetarian": true, "title": "Tomato soup", "url": "www_bbc_co_uk_food_recipes_tomatosoup_13560", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tomatosoup_13560_16x9.jpg", "ingredients": ["2 onions, peeled and chopped", "1 carrot, peeled and diced finely ", "1 clove garlic, peeled and crushed", "1 stick celery,  finely chopped ", "2 tbsp olive oil", "450g/1lb fresh ripe tomatoes, halved", "1 litre/1¾ pints vegetable stock", "1 tsp sugar", "salt and freshly ground black pepper", "handful fresh basil, shredded (optional)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a large saucepan and add the onions, carrot and celery and garlic. Cover and cook gently for 10 minutes until soft.", "Add the sugar, salt, pepper and tomatoes. Stir and cook for another 5 minutes.", "Add the stock, bring to the boil and simmer for 10 minutes. Liquidise until smooth. If using the basil, stir in at the end."]}, {"isVegetarian": false, "title": "Tomato, spinach and fish curry", "url": "www_bbc_co_uk_food_recipes_tomatospinachandfish_88153", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "½ onion, finely sliced", "1 garlic clove, chopped", "1 tsp Thai red curry paste", "1 fresh tomato, chopped", "splash hot water", "150g/5½oz whiting, skinned, chopped", "small handful fresh baby spinach leaves", "1 tbsp chopped fresh coriander"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a saucepan, add the onion and fry gently for 3-4 minutes or until softened. ", "Add the garlic and Thai red curry paste and fry for one minute. Add the tomato and a splash of hot water and simmer for three minutes. ", "Add the fish and cook for 1-2 minutes or until cooked through. ", "Stir in the spinach leaves and chopped coriander. Spoon onto a plate and serve."]}, {"isVegetarian": true, "title": "Tomato, spinach and mozzarella roulade with spicy tomato sauce", "url": "www_bbc_co_uk_food_recipes_tomatospinachandmozz_88467", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 free-range eggs, separated", "1 tsp lemon juice", "1 tsp cornflour", "200ml/7fl oz whole milk", "1 tsp wholegrain mustard", "salt and freshly ground black pepper", "1 tbsp olive oil", "150g/5½oz spinach", "½ beef tomato, seeds removed, chopped", "100g/3½oz mozzarella cheese, sliced", "1 tbsp olive oil", "¼ onion, finely chopped", "½ beef tomato, seeds removed, chopped", "½ tsp dried chilli flakes", "200ml/7fl oz red wine", "1 tbsp caster sugar", "35g/1¼oz butter", "2 tbsp chopped fresh mint", "small handful spinach leaves, to serve"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the roulade, whisk the egg whites and lemon juice in a large clean bowl until stiff peaks form when the whisk is removed.", "In a separate bowl, mix together the cornflour, milk, mustard, salt and freshly ground black pepper and egg yolks until well combined. Fold this mixture carefully into the whisked egg whites.", "Line a baking tray with silicone paper and pour the mixture onto the tray, spreading it into the corners. Transfer to the oven to cook until set and golden-brown, about 5-8 minutes.", "Heat the olive oil in a pan and cook the spinach for a minute or two, stirring until wilted. Stir in the chopped tomato and the mozzarella.", "Remove the roulade from the oven and spread over the wilted spinach, tomato and mozzarella. Using the silicone paper to help, roll up the roulade into a log.", "For the spicy tomato sauce, heat the oil in a saucepan and fry the onion until translucent, about 4-5 minutes.", "Add the tomato, chilli flakes, red wine and sugar and simmer the sauce for five minutes until slightly reduced. Stir in the butter and the chopped fresh mint.", "To serve, slice the roulade and arrange on two serving plates. Garnish with the spinach leaves and pour over the spicy tomato sauce."]}, {"isVegetarian": true, "title": "Tomato soup with basil oil", "url": "www_bbc_co_uk_food_recipes_tomatosoup_75886", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 garlic clove, crushed", "½ onion, chopped", "200g/7oz tinned cherry tomatoes, chopped", "1 courgette, diced", "¼ pint vegetable stock", "large handful basil", "4-6 tbsp olive oil", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a pan and gently sauté the garlic and onion for 2-3 minutes or until soft. ", "Add the tomatoes and courgette and simmer for 8-10 minutes.", "To make the basil oil, place the basil, oil and seasoning in a blender and blend until smooth.", "Serve the soup in a bowl topped with a drizzle of basil oil."]}, {"isVegetarian": true, "title": "Tomato, watermelon and feta salad", "url": "www_bbc_co_uk_food_recipes_tomatowatermelonandf_72272", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 1oz watermelon", "500g/1lb 1oz ripe tomatoes", "2 tbsp extra virgin olive oil", "2 tbsp fresh mint leaves", "2 tbsp fresh basil leaves", "200g/7¼oz feta cheese, crumbled", "1 tsp dried oregano"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Peel the watermelon and cut into bite-sized cubes.", "Cut the tomatoes into quarters (size to match the watermelon) and toss in the olive oil with the fresh mint and basil leaves.", "Loosely arrange the watermelon and tomatoes on a large white platter and scatter the feta cheese and oregano over the top to serve."]}]