[{"isVegetarian": true, "title": "Pastel de remolacha", "url": "www_bbc_co_uk_food_recipes_beetroot_pie_89195", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beetroot_pie_89195_16x9.jpg", "ingredients": ["Harina normal de 200g / 7oz", "2 cucharadas de azúcar glas", "100 g / 3½ oz de mantequilla sin sal, refrigerada, cortada en cubos de aproximadamente 1 cm / ½ en cubitos", "1 huevo de gallinas camperas, ligeramente golpeado", "1 cucharadita de jugo de limón", "350g / 12oz de remolacha cocida y pelada (al vacío está bien, pero no remolacha en escabeche)", "125ml / 4fl oz de crema doble", "2 huevos grandes de gallinas camperas", "175g / 6oz de azúcar moreno oscuro", "1 cucharadita de canela molida", "½ cucharadita de jengibre molido", "1 limón, ralladura finamente rallada solamente"], "serves": "Sirve 6-8", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para la masa, mezcle la harina y el azúcar glas juntos en un tazón. Agregue la mantequilla y frótela ligeramente con las puntas de los dedos hasta que la mezcla se asemeje a migas de pan finas. Alternativamente, haga esto en un procesador de alimentos o en un mezclador y luego transfiéralo a un tazón.", "En un tazón pequeño o jarra, mezcle el huevo con el jugo de limón y dos cucharadas de agua. Haga un pozo en el centro de la mezcla de harina y vierta la mezcla de huevo. Usando un cuchillo de mesa, coloque el líquido en la harina para unir la masa. Si parece demasiado seco, agrega un poco más de agua. Cuando la masa comience a pegarse, use sus manos para amasar suavemente en forma de bola. Envuelva la película adhesiva y descanse en la nevera durante al menos 15 minutos.", "Extienda la masa sobre una superficie de trabajo ligeramente enharinada hasta un grosor aproximado de 3 mm / ⅛. Cubra una tarta de tarta de 23cm / 9in con la masa, dejando cualquier exceso de pastel colgando sobre el borde. Reserve un poco de masa sin cocer en caso de que necesite parchear cualquier grieta más adelante.", "Alinee la caja de repostería con papel pergamino o papel de aluminio, y luego rellene con alubias, arroz o lentejas sin cocer. Hornee la persiana por 15 minutos, luego quite el pergamino y los frijoles para hornear y vuelva al horno por unos ocho minutos o hasta que la masa parezca seca y levemente coloreada. Con un cuchillo pequeño y afilado, corte el exceso de masa del borde. Use un poquito de la masa cruda reservada para parchear las grietas o agujeros si es necesario.", "Baje el horno a 180C / 350F / Gas 4.", "Para el llenado, si está usando remolacha preenvasado, drene cualquier exceso de líquido. Corta aproximadamente la remolacha y ponla en un procesador de alimentos con la crema. Mezcle hasta obtener un puré espeso.", "En un tazón, mezcle bien los huevos y el azúcar. Agregue el puré de remolacha, las especias y la ralladura de limón y mezcle bien.", "Vierta la mezcla en la caja de repostería y hornee durante 30-40 minutos, o hasta que el relleno se establece con un ligero bamboleo en el medio. Deje que se enfríe completamente."]}, {"isVegetarian": true, "title": "Ensalada de remolacha, lentejas y queso de cabra", "url": "www_bbc_co_uk_food_recipes_beetroot_lentil_and_03289", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beetroot_lentil_and_03289_16x9.jpg", "ingredients": ["½ x 400 g de estaño lentejas verdes pequeñas, escurridas y enjuagadas", "2 cucharaditas de aceite de oliva", "1 cucharadita de mostaza integral", "½ bolsa de hojas de ensalada mixtas (alrededor de 60 g)", "Remolacha cocida al vacío 100 g / 3½ oz empacada al vacío", "50g / 1¾oz de queso de cabra suave, rebanado", "sal y pimienta negra recién molida"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Calentar las lentejas en una cacerola con una cucharadita de aceite de oliva hasta que se caliente. Agregue un poco de agua si comienzan a pegarse. Retire del fuego y revuelva a través de la mostaza integral.", "Ponga las hojas mezcladas en un tazón para servir y cubra con las lentejas calientes, la remolacha cuarteada y el queso de cabra en rodajas. Rocíe el aceite de oliva restante en la parte superior y sazone con sal y pimienta negra recién molida. Sirve con pan tostado."]}, {"isVegetarian": true, "title": "Pastel de chocolate de remolacha", "url": "www_bbc_co_uk_food_recipes_beetroot_chocolate_cake_82388", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beetroot_chocolate_cake_82388_16x9.jpg", "ingredients": ["200g / 7oz de mantequilla, más extra para engrasar", "250g / 9oz de remolacha cocida y pelada", "200 g / 7 oz de chocolate negro (70% de sólidos de cacao)", "4 cucharadas de espresso caliente", "Harina normal de 135g / 5oz", "1 cucharada colmada de polvo de hornear", "3 cucharadas de cacao en polvo", "5 huevos de gallinas camperas, separados", "190 g / 6½ oz de azúcar en polvo de oro", "crème fraîche o crema doble, para servir"], "serves": "Para 6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase un molde para pastel de 20 cm / 8 in con un poco de mantequilla y forme el fondo de la lata con un disco de pergamino para hornear.", "Mezcle la remolacha en un procesador de alimentos con un puré áspero.", "Derrita el chocolate en un recipiente suspendido sobre una fuente de agua caliente (no permita que el fondo del recipiente toque el agua), luego vierta el café caliente.", "Agregue la mantequilla en trozos pequeños y deje que se ablande. Retirar del fuego y dejar enfriar ligeramente.", "Mientras tanto, tamice la harina, el polvo de hornear y el cacao en un bol y déjelos a un lado.", "Separa los huevos. Batir las yemas en un bol hasta que estén espumosas. Revuelva los huevos en la mezcla de chocolate y mantequilla, luego doble la remolacha.", "Batir las claras de huevo hasta que los picos aún se forman cuando se quita la batidora. Incorpore el azúcar.", "Dobla el azúcar y las claras de huevo en la mezcla de chocolate, luego dobla la mezcla de harina y cacao.", "Vierta la mezcla en la lata preparada y hornee durante 40 minutos, o hasta que un pincho insertado en la torta salga limpio.", "Deje que se enfríe en la lata, luego sirva con crème fraîche o crema doble."]}, {"isVegetarian": true, "title": "Ensalada de remolacha", "url": "www_bbc_co_uk_food_recipes_beetroot_salad_06735", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beetroot_salad_06735_16x9.jpg", "ingredients": ["2 remolachas medianas", "echar aceite de oliva, para lloviznar", "20g / 1oz de almendras blanqueadas", "½ cucharadita de semillas de comino", "1 manzana roja para comer, cortada en cubos de 2 cm / 1 in", "1 manzana verde para comer, cortada en cubos de 2 cm / 1 in", "½ cebolla roja pequeña, en rodajas", "puñado de hierbas frescas", "sal y pimienta negra recién molida", "150 g / 5½ oz de yogur natural", "1 lima, ralladura y jugo", "2 cucharaditas de miel"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precaliente el horno a 200C / 180C Fan / Gas 6.", "Cubra una bandeja para hornear con papel de cocina y coloque las remolachas en el medio. Sazonar con sal y pimienta y rociar con aceite. Envuelva el papel aluminio alrededor de las remolachas, selle y hornee durante 1 hora.", "Coloque una sartén pequeña a fuego lento y tueste las nueces y las semillas de comino durante 2 minutos. Retirar del fuego y dejar enfriar en la sartén.", "Pele y corte la remolacha en cubos de 2cm / 1 in y colóquela en un tazón de vidrio grande. Agregue la manzana, nueces, semillas y hierbas.", "Para hacer el aderezo, mezcle los ingredientes en un tazón. Justo antes de servir, prepare la ensalada y mezcle bien."]}, {"isVegetarian": true, "title": "Ensalada de remolacha con queso búfalo cuajada", "url": "www_bbc_co_uk_food_recipes_beetroot_salad_with_60687", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["5 remolachas crudas enteras, tops y hojas dejadas en", "2 litros / 3½ pintas de leche de búfala (disponible en delicatessen y proveedores especializados)", "50ml / 2fl oz de jugo de limón", "6 cucharadas de aceite de oliva virgen extra", "½ baguette, cortado en cubos pequeños", "2 ramitas de romero fresco, solo hojas", "2 ramitas de tomillo fresco, solo hojas", "2 cucharadas de vinagre de jerez", "1 cucharadita de semillas de comino", "1 cucharada de hojas frescas de estragón", "1 cucharada de hojas frescas de orégano, más ramitas enteras para decorar", "1 cucharada de hojas frescas de mejorana", "1 cucharada de hojas de perejil de flatleaf", "sal y pimienta negra recién molida", "4 ramitas de colza (opcional)", "4 ramitas de eneldo fresco, solo hojas"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Cortar las hojas de la parte superior de la remolacha y dejar de lado.", "Llene a la mitad una olla con agua, luego agregue toda la remolacha y deje que el agua hierva. Reduzca el fuego hasta que el agua esté hirviendo a fuego lento, luego cocine a fuego lento durante 30-45 minutos, o hasta que la remolacha esté tierna al atravesarla con la punta de un cuchillo. Escurrir bien y reservar para enfriar.", "Mientras tanto, llevar la leche de búfala a ebullición en una olla aparte, sin remover. Cuando la leche esté a punto de hervir, mezcle el zumo de limón; verá inmediatamente una reacción a medida que la leche se solidifica y se separa en cuajada y suero.", "Con cuidado, cuele la leche de búfala y el suero a través de un tamiz suspendido sobre un tazón grande. Déjelo a un lado para drenar durante 5 minutos: cuanto más tiempo lo deje colar, más sólido será el queso. Una vez colado, enfríe el queso de requesón en la nevera hasta que lo necesites (descarta el suero líquido).", "Calienta la mitad del aceite de oliva en una sartén a fuego medio. Cuando el aceite esté caliente, agregue los cubos de pan, el romero y las hojas de tomillo y fría, revolviendo bien, hasta que el pan esté dorado y crujiente. Transfiera el contenido de la sartén a un recipiente, luego rocíe sobre el aceite de oliva restante y todo el vinagre de jerez.", "Agregue las semillas de comino y las hojas de remolacha reservadas a la sartén que se usa para cocinar el pan y saltee hasta que las hojas de remolacha se hayan marchitado. Agregue el contenido de la sartén al tazón con los cubos de pan.", "Cuando la remolacha esté lo suficientemente fría como para manipularla, córtela en trozos y agréguelos al recipiente que contiene los cubos de pan. Mezcle las hierbas restantes y sazone, al gusto, con sal y pimienta negra recién molida.", "Para servir, divida la ensalada entre cuatro platos para servir. Cubra con cucharadas de queso de búfalo filtrado. Rocíe un poco de aceite de oliva, luego decore con las ramitas de orégano, la colza, si se usa, y las ramitas de eneldo."]}, {"isVegetarian": true, "title": "Pastel de semillas de remolacha", "url": "www_bbc_co_uk_food_recipes_beetroot_seed_cake_50355", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beetroot_seed_cake_50355_16x9.jpg", "ingredients": ["mantequilla o aceite, para engrasar", "Harina de levante 225g / 8oz", "media cucharadita de bicarbonato de soda", "una cucharadita de levadura en polvo", "media cucharadita de canela molida", "180ml / 6¼fl oz de aceite de girasol", "225g / 8oz de azúcar mascabado ligero", "3 huevos de gallinas camperas, separados", "150g / 5oz de remolacha cruda, pelada", "jugo de medio limón", "75g / 3oz sultanas o pasas", "75g / 3oz de semillas mezcladas (como girasol, calabaza y linaza)", "8 cucharadas de azúcar glas", "un poco de jugo de limón o agua de azahar", "semillas de amapola, para adornar"], "serves": "Sirve aproximadamente 8", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase ligeramente una lata de pan rectangular (20 cm x 9 cm x 7 cm / 8 pulg x 4 pulg x 3 pulg), luego forre la base con papel para hornear.", "Tamizar la harina, el bicarbonato de soda, el polvo de hornear y la canela.", "Batir el aceite y el azúcar en un mezclador de alimentos hasta que estén bien combinados, luego introducir las yemas de huevo una por una, mezclando después de agregar cada yema de huevo. Rallar la remolacha en forma gruesa y doblarla en la mezcla de huevo, luego agregar el jugo de limón, las pasas (sultanas) y las semillas variadas. Pulso hasta combinado.", "Doble la harina y los agentes de crianza en la mezcla de huevo mientras la máquina está en un ajuste lento.", "Batir las claras de huevo hasta que estén claras y casi rígidas. Doble con cuidado pero a fondo en la mezcla de la torta, usando una cuchara grande de metal (una de madera eliminará el aire). Vierta la mezcla en la lata de la torta y hornee durante 50-55 minutos, cubriendo la parte superior con un trozo de papel de aluminio después de treinta minutos. Prueba con un pincho para cocinar. La torta debe estar húmeda por dentro pero no pegajosa. Deje la tarta reposar durante unos buenos veinte minutos antes de salir de la lata sobre una rejilla para enfriar cables.", "Para hacer la formación de hielo, tamice el azúcar glas en un tazón y mezcle suficiente jugo de limón o agua de azahar para lograr una consistencia donde la formación de hielo pasará por la parte superior del pastel y rocíe lentamente por los lados (alrededor de tres cucharaditas), revolviendo para eliminar cualquier bulto. Rocíe sobre la torta y se dispersa con las semillas de amapola. Deje que se seque antes de comer."]}, {"isVegetarian": false, "title": "Soufflé de remolacha con salsa de anchoas", "url": "www_bbc_co_uk_food_recipes_beetroot_souffl_with_45218", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["20 g / oz de mantequilla, para engrasar", "20g / ¾oz de migajas de pan finas secas, para quitar el polvo", "Remolacha cocida a 400g / 14oz, pelada y cortada en cubitos", "150ml / 5fl oz de zumo de pomelo rosado", "1 cucharadita de rábano picante", "sal marina y pimienta negra recién molida", "3 cucharadas de harina común", "4 huevos de gallinas camperas, separados", "125g / 4½oz de mantequilla sin sal", "1 diente de ajo grande, cortado en 3", "10 filetes de anchoa en aceite, escurridos", "100ml / 3½ fl oz crema doble"], "serves": "Para 6", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Engrase seis moldes individuales con la mantequilla y espolvoree el interior con las migas de pan. Precalentar el horno a 220C / 425F / Gas 7.", "Coloque la remolacha, la mitad del jugo de pomelo, rábano picante, sal marina y pimienta negra recién molida en una licuadora y pulse hasta que quede suave.", "Caliente el jugo de pomelo restante en una olla pequeña, mezcle la harina para hacer una pasta y agréguela a la licuadora. Agregue las yemas de huevo a la mezcla de a una por vez y mezcle hasta que todo esté suave. Vierta la mezcla de la licuadora en un tazón grande.", "Batir las claras de huevo hasta que estén tieso en un recipiente limpio y luego doblar cuidadosamente en la mezcla de remolacha.", "Coloque los moldes preparados en una bandeja para hornear, vierta la mezcla de soufflé y hornee en el horno durante 20 - 25 minutos.", "Para la salsa de anchoa, poner la mantequilla y el ajo en una sartén, freír durante un minuto y luego desechar el ajo. Baje el fuego y agregue los filetes de anchoa. Cuando se hayan disuelto por completo, agregue la crema y retire la sartén del fuego.", "Cuando los suflés estén cocidos, haga un pequeño orificio en el medio de cada uno, vierta dos cucharadas de salsa y sirva inmediatamente."]}, {"isVegetarian": true, "title": "Tarta de remolacha con cuajada de cabras de caramelo de sal y vinagre", "url": "www_bbc_co_uk_food_recipes_beetroot_tart_with_salt_75327", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 remolachas grandes", "1 bulbo de ajo", "2 ramitas de tomillo fresco", "150 g / 5 oz de azúcar en polvo", "Hojaldre comprado en la tienda de 300g / 11oz", "50g / 2oz de mantequilla", "1 cebolla roja, finamente rebanada", "Puerto de 50 m / 2 fl oz", "25ml / 1fl oz de vinagre de vino tinto", "25ml / 1fl oz de vinagre de jerez", "gran pizca de sal", "50g / 2oz de piñones, tostados en una sartén seca", "150g / 5oz de cuajada de cabras frescas", "25ml / 1fl oz de vinagre de jerez", "110ml / 4fl oz de aceite de oliva", "1 manojo de estragón fresco, solo hojas", "1 manojo de albahaca fresca, solo hojas", "1 manojo de cilantro fresco, solo hojas"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Coloque la remolacha en una bandeja con el ajo, el tomillo y 50 g / 2 oz del azúcar y tueste en el horno durante 1-1 ½ horas, o hasta que estén tiernos. Una vez cocinado, deje que la remolacha se enfríe antes de pelarla.", "Cortar en rodajas muy finas en una mandolina o usar un cuchillo muy filoso.", "Ruede los pasteles en un rectángulo del grosor de la moneda de la libra y pinche con un tenedor. Coloque sobre una bandeja para hornear plana y cubra con una segunda bandeja para evitar que se levante la masa.", "Hornee en el horno por 15-20 minutos o hasta que la masa esté dorada.", "Caliente la mantequilla en una olla pequeña y fría las cebollas durante 3-4 minutos, o hasta que se ablanden.", "Agregue el puerto y el vinagre de vino tinto y cocine hasta que se reduzca a la mitad en volumen. Mezcle la mezcla en un procesador de alimentos hasta que quede suave.", "Mientras tanto, caliente el azúcar restante en una olla pequeña con dos cucharadas de agua. Una vez que el azúcar se haya disuelto, aumente la temperatura para que la mezcla se dore y se conserve. Una vez que la mezcla tenga un color marrón oscuro, retire la cacerola del fuego y agregue 20 ml / l de agua para evitar que el caramelo se endurezca.", "Deje que el caramelo se enfríe un poco, luego agregue la sal y el vinagre de jerez.", "Extienda el puré de cebolla roja sobre la masa cocida, luego coloque la remolacha en la parte superior en un patrón de escala de pescado.", "Rocíe con el caramelo y colóquelo en el horno durante 2-3 minutos o hasta que esté caliente.", "Mientras tanto, para la ensalada, mezcle el vinagre de jerez y el aceite de oliva hasta que estén bien combinados y cubra las hierbas con el aderezo.", "Retire la masa del horno, recorte los extremos y corte en forma de triángulo.", "Para servir, coloca una cucharada de cuajada de cabra encima de la tarta. Espolvoree los piñones y rocíe generosamente con el caramelo. Sirva junto a la ensalada de hierbas."]}, {"isVegetarian": true, "title": "Remolacha tzatziki", "url": "www_bbc_co_uk_food_recipes_beetroot_tzatziki_01974", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 remolacha cocida (no en escabeche), pelada", "500g / 1lb 2oz de yogur de estilo griego", "1 limón, solo jugo", "puñado de eneldo fresco", "2 cucharadas de hojas de menta fresca picada", "2 cucharadas de pepino finamente picado", "sal y pimienta negra recién molida", "chips de verduras, para sumergir"], "serves": "Para 6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 0, "cooking": "no se requiere cocinar", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Coloque la remolacha en un mini procesador de alimentos y mezcle hasta que esté finamente picado. Transfiera a un recipiente y mezcle todos los ingredientes restantes, excepto las patatas fritas. Sazone con sal y pimienta negro.", "Sirva con chips vegetales para mojar."]}, {"isVegetarian": false, "title": "Tartar de remolacha con rábano picante y ternera", "url": "www_bbc_co_uk_food_recipes_beetroot_tartare_with_10362", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Remolacha cruda de 500 g / 1 libra y 2 onzas, fregada y dejada la piel", "2 cucharadas de vinagre de cereza", "1 cebolla roja, finamente picada", "1 manzana Bramley, pelada y finamente rallada", "1½ cucharada de mostaza integral", "1 cucharada de aceite de oliva", "2 cucharadas de rábano picante, recién rallado", "1 cucharada de miel", "puñado de hojas forrajeadas (como aster de mar, remolacha de mar o pamplina), picadas", "aceite de colza, al gusto", "Filete de rape de mejor calidad de 250 g / 9 oz, cortado y cortado en cubitos finos", "copos de sal marina y pimienta negra recién molida", "150g / 5½oz de queso blando ahumado", "75-100ml / 2½-3½ oz de crema individual", "50-100 g / 1¾-3½ oz de crema", "75g / 2½oz de mantequilla sin sal", "Pan rallado de 150 g / 5½ oz marrones", "hojas forrajeadas (como arriba)"], "serves": "Sirve 4 como entrante, o 2 como plato principal", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Para el tartar de remolacha, pela 100 g / 3½ oz de la remolacha y córtala en cubos muy pequeños. Pon los cubos de remolacha en un bol con el vinagre. Sazonar con sal y pimienta y reservar para marinar.", "Cocine las remolachas restantes en una olla con agua hirviendo durante 40-45 minutos, hasta que estén suaves. Escurra, sumérgete en agua fría y quítate la piel: puedes ponerte guantes de plástico si no quieres que tus manos se tiñen de rojo.", "Cortar las remolachas cocidas en cubos muy pequeños y mezcle con cebolla roja, manzana, mostaza y aceite de oliva en un tazón. Agregue la remolacha marinada cruda, al gusto, junto con el rábano picante, la miel y las hojas forrajeadas. Sazone al gusto con sal y pimienta. Rocíe con aceite de colza, al gusto.", "Para el queso ahumado, coloque el queso en un tazón y mezcle la crema y la crema fresca. Sazonar con pimienta negra.", "Para servir, derrita la mantequilla en una sartén, agregue las migas de pan y freír hasta que estén doradas.", "Coloque la carne alrededor de los platos de servir y coloque una cucharada pequeña de la mezcla de queso ahumado en la parte superior. Coloca la mezcla de remolacha alrededor de los platos y decora con las hojas forrajeadas y las migas de pan tostado."]}, {"isVegetarian": true, "title": "Risotto de remolacha y mascarpone con queso Wensleydale desmenuzado", "url": "www_bbc_co_uk_food_recipes_beetrootandmascarpon_85258", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 remolachas crudas, peladas, más o menos picadas", "750ml / 1¼ pintas de caldo de verduras", "30g / 1oz de mantequilla", "2 chalotes, pelados, finamente picados", "2 dientes de ajo, pelados, finamente picados", "2 ramitas de tomillo fresco, solo hojas", "Arroz arborio 250 g / 9 oz", "100ml / 3½fl oz de vino blanco", "3 cucharadas de mascarpone", "Parmesano 110 g / 4 oz, rallado", "pequeño puñado de perejil fresco, picado", "sal y pimienta negra recién molida", "2 cucharadas de aceite de oliva", "1 cucharadita de mantequilla", "1 remolacha, finamente rebanada", "Queso Wensleydale 200 g / 7 oz, desmenuzado"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Para el risotto, mezcle la remolacha con la mitad del caldo en un procesador de alimentos hasta que quede suave. Transfiera a una olla, hierva y reduzca el fuego para que el líquido hierva a fuego lento.", "Calentar la mantequilla en una cacerola grande a fuego medio. Agregue los chalotes picados, el ajo y las hojas de tomillo. Cocine suavemente durante 1-2 minutos hasta que se ablanden.", "Agregue el arroz a la sartén y revuelva para cubrir todos los granos en la mezcla mantecosa. Cocine, revolviendo, por otros 1-2 minutos hasta que los granos comiencen a verse translúcidos.", "Agregue el vino a la sartén y permita que burbujee y reduzca ligeramente.", "Agregue un cucharón de caldo de remolacha hirviendo a fuego lento y revuelva hasta que todo el líquido haya sido absorbido. Continúe agregando el caldo, un cucharón a la vez, a medida que se absorbe el líquido, revolviendo entre cada adición.", "Cuando hayas usado todo el caldo de remolacha, calienta el resto del caldo de verduras y comienza a agregarlo al risotto de la misma manera (puede que no lo necesites todo). Cocine el arroz hasta que los granos estén tiernos pero retenga algo de mordida. Esto llevará al menos 20 minutos.", "Cuando el arroz esté cocido, retirar del fuego y agregar el mascarpone, el parmesano, el perejil picado y sazonar con sal y pimienta negra recién molida.", "Para servir, caliente el aceite de oliva y la mantequilla en una sartén. Agregue las rodajas de remolacha y saltee durante 3-4 minutos, hasta que estén tiernas.", "Sirve el risotto cubierto con las rodajas de remolacha y el queso Wensleydale desmenuzado."]}, {"isVegetarian": false, "title": "Rosti de remolacha y patata con salmón ahumado", "url": "www_bbc_co_uk_food_recipes_beetrootandpotatoros_84607", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 papas grandes Maris Piper, fregadas, sin pelar", "2 remolachas, peladas, ralladas gruesas", "2 dientes de ajo, aplastados", "sal y pimienta negra recién molida", "5 cucharadas de aceite de oliva", "100 g / 3½ oz de rábano picante fresco", "200g / 7oz de crema fresca", "1 limón, solo jugo", "sal y pimienta negra recién molida", "250g / 10½oz de salmón ahumado", "8 ramitas de eneldo fresco, para servir", "4 rodajas de limón, para servir"], "serves": "Para 6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Coloque las papas en una olla de agua hirviendo con sal y deje hervir durante siete minutos, luego escurra y deje enfriar.", "Cuando las papas estén lo suficientemente frías para manipularlas, pélelas y ralladlas en un bol.", "Agregue la remolacha rallada y el ajo, condimente al gusto, con sal y pimienta negra recién molida, y mezcle bien.", "Divida y dé forma a la mezcla de patata en seis hamburguesas planas, colóquela en una bandeja para hornear y transfiérala al refrigerador para que se enfríe durante una hora.", "Caliente el aceite en una sartén grande a fuego medio-alto. Agregue los röstis de papa y fría por 4-6 minutos en cada lado, o hasta que estén dorados por completo, luego escurra sobre papel de cocina.", "Para la salsa de rábano picante, mezcle el rábano picante, la crema fresca y el jugo de limón en un tazón limpio y sazone, al gusto, con sal y pimienta negra recién molida.", "Para servir, coloque cada rösti en un plato. Cubra con una cucharada de salsa de rábano picante y un trozo de salmón, luego termine cada plato con algunas ramitas de eneldo y una rodaja de limón."]}, {"isVegetarian": true, "title": "Ensalada de remolacha, zanahoria y queso azul", "url": "www_bbc_co_uk_food_recipes_beetrootcarrotandblu_12159", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 zanahorias medianas, peladas", "2 remolachas enteras", "azúcar glas", "sal marina y pimienta recién molida", "1 manojo de perejil de hoja plana, recogido", "aceite de oliva virgen extra", "vinagre de vino tinto", "100g / 3½oz de queso azul", "1 cucharada de jengibre rallado"], "serves": "Sirve 2 o 4 como plato compartido", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Pon a hervir una olla de agua salada hirviendo y cocina a fuego lento las zanahorias hasta que estén cocidas.", "Ase las remolachas con la piel puesta en un horno mediano o simplemente hiérvalas con el vinagre, el azúcar y la sal hasta que estén suaves, aproximadamente 40 minutos.", "Permita que se enfríe, luego pele y corte en rodajas.", "En un recipiente, coloca el perejil, la remolacha y las zanahorias.", "Viste las verduras con aceite de oliva virgen extra y aproximadamente 1/3 de la cantidad de vinagre de vino tinto (3 partes de aceite por 1 de vinagre). Sazone con sal y pimienta, luego agregue el queso azul y el jengibre rallado. Mezcle suavemente para asegurar que el vinagre y el aceite cubran todos los ingredientes.", "Sirva en un tazón como una ensalada compartida o en platos individuales como una entrada."]}, {"isVegetarian": false, "title": "Ensalada de queso de remolacha, tocino y cabra", "url": "www_bbc_co_uk_food_recipes_beetrootbaconandgoat_92212", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 remolachas grandes, cocidas, peladas y en rodajas finas", "6 lonchas de tocino rayado ahumado, cortado en lardons", "2 cucharaditas de aceite de oliva", "1 cucharadita de mostaza inglesa", "1 cucharada de vinagre de vino blanco", "3 cucharadas de aceite de colza", "sal y pimienta negra recién molida", "azúcar en polvo, al gusto", "75g / 3oz de berro, recortado", "2 lechugas Little Gem, hojas separadas", "4 x 1cm / ½ en rebanadas gruesas de queso de cabra, corteza en"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Coloque las rodajas de remolacha alrededor del borde con cuatro platos para servir, superponiendo las rebanadas para formar un círculo.", "Pon a hervir una olla de agua, agrega los lardons de tocino y blanquea durante 1 minuto. Escurra y seque con papel de cocina.", "Caliente una sartén hasta que esté caliente, agregue los lardons de tocino y fría por 3-4 minutos, hasta que estén dorados y crujientes. Escurrir sobre papel de cocina.", "Batir la mostaza inglesa, el vinagre de vino blanco y el aceite de colza en un bol para el aderezo. Sazonar, al gusto, con sal, pimienta negra recién molida y azúcar impalpable.", "Coloque el berro y las hojas de Little Gem en un recipiente y mezcle. Agregue los tocino lardons.", "Precalentar la parrilla a alto.", "Coloque las rondas de queso de las cabras en la bandeja de la parrilla y cocine por debajo de la parrilla durante 1-2 minutos, o hasta que estén doradas y burbujeantes.", "Para servir, rocíe el aderezo sobre las hojas de ensalada y mezcle bien para cubrir. Acumula la ensalada en el medio de los platos de servir. Balancee las rondas de queso de las cabras en la ensalada y rocíe un poco más de aderezo alrededor de los bordes del plato."]}, {"isVegetarian": true, "title": "Pasteles de remolacha, queso y arándano con papas de wasabi", "url": "www_bbc_co_uk_food_recipes_beetrootcheeseandcra_87572", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Remolacha 500 g / 1lb 1 oz, fregado", "aceite, para lloviznar", "sal y pimienta negra recién molida", "350 g / 12¼ oz de queso Wensleydale, desmenuzado", "1 cebolla, en rodajas", "1 chile rojo, sin semilla y picado", "100g / 3½oz de arándanos secos", "Espinaca bebé 200 g / 7 oz, lavado", "6 x 15 cm / 6 pulgadas cuadrados de hojaldre listo para usar", "1 huevo de gallinas camperas, golpeado", "semillas de amapola, para rociar", "100ml / 3½fl oz de aceite de oliva", "450g / 1lb de papas nuevas, reducidas a la mitad si son grandes, hervidas por par", "sal y pimienta negra recién molida", "200g / 7oz de mantequilla, suavizada", "75g / 2¾oz de pasta de wasabi", "1 cucharada de cilantro fresco picado", "coles de Bruselas cocidas, para servir"], "serves": "Para 6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 190C / 375F / Gas 5.", "Coloque la remolacha en una lata para asar, rocíe con aceite y sazone con sal y pimienta negra recién molida.", "Transfiera al horno y tueste durante 45 minutos, o hasta que se ablanden. Dejar enfriar, luego cortar en trozos y colocar en un tazón grande.", "Aumente la temperatura del horno a 200C / 400F / Gas 6.", "Agregue el queso, la cebolla, el chile, los arándanos y las espinacas al tazón con la remolacha. Sazonar bien con sal y pimienta negra recién molida y remover bien.", "Coloque los cuadrados de repostería en una bandeja para hornear antiadherente y divida la mezcla de remolacha por igual entre los cuadrados.", "Dibuje la masa alrededor de los bordes para encerrar por completo el relleno en una bola apretada.", "Cepille la masa con huevo batido y espolvoree sobre las semillas de amapola.", "Transfiera al horno y hornee durante 15 minutos o hasta que estén crujientes y doradas.", "Mientras tanto, para las papas, caliente un plato a prueba de horno hasta que esté muy caliente. Agregue el aceite y las papas hervidas, sazone bien con sal y pimienta negra recién molida y revuelva.", "Coloque en el horno y tueste durante 25 minutos, o hasta que estén crujientes y doradas.", "En un recipiente, mezcle la mantequilla y el wasabi hasta que estén bien combinados (puede que no necesite toda la manteca de wasabi, guarde el resto para usar en otro plato).", "Cuando las papas estén cocidas y esté listo para servir, agregue la mantequilla de wasabi al plato con las papas y mezcle bien para cubrir. Espolvorea sobre el cilantro.", "Para servir, coloque un pastel en cada plato con algunas papas de wasabi y coles de Bruselas."]}, {"isVegetarian": true, "title": "Ensalada de remolacha, queso de cabra y nueces", "url": "www_bbc_co_uk_food_recipes_beetrootgoatscheesea_85188", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 remolachas listas para cocinar, picadas", "50g / 1¾oz de queso de cabra, desmenuzado", "50 g / 1¾oz de judías verdes, cocidas, escurridas", "1 cucharada de nueces picadas", "puñado de perejil fresco", "1 cucharadita de mostaza Dijon", "1 cucharadita de vinagre de vino blanco", "3 cucharaditas de aceite de oliva", "1 cucharadita de yogur de cabra", "50g / 1¾oz de queso de cabra, desmenuzado"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 0, "cooking": "no se requiere cocinar", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Para la ensalada, coloque la remolacha, el queso de cabra, las judías verdes y las nueces en un tazón grande y mezcle bien.", "Coloque el perejil en un plato para servir y cubra con la mezcla de remolacha.", "Para el aderezo, coloque todos los ingredientes del aderezo en un tazón y mezcle bien.", "Para servir, vierta el aderezo sobre la ensalada."]}, {"isVegetarian": false, "title": "Ñoquis de remolacha con salsa de mantequilla, salvia y naranja", "url": "www_bbc_co_uk_food_recipes_beetrootgnocchiwithb_91340", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 kg / 2lb 4 oz de papas harinosas, como King Edward, peladas y picadas", "Remolacha cocida a 400g / 14oz, pelada y picada", "Harina normal de 300g / 11oz", "1 huevo de gallinas camperas, ligeramente golpeado", "pizca de sal", "110g / 4oz de mantequilla", "6 hojas de salvia", "1 naranja, solo jugo, más cáscara de 2 naranjas, para servir", "sal al gusto", "4 cucharadas de queso parmesano recién rallado"], "serves": "Sirve 4-6", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Para los gnocchi, coloque las papas en una sartén con agua con sal y deje que hiervan. Cocine a fuego lento durante 15-18 minutos, o hasta que esté tierno.", "Escurra las papas y regréselas al fuego para eliminar el exceso de humedad. Permita que se enfríen por un minuto y luego machaque bien con un machacador de papas o ricer.", "Mezcle la remolacha en un procesador de alimentos con un puré. Pase el puré por un colador fino.", "Incline la harina sobre una superficie de trabajo limpia y haga un pozo en el centro. Agregue el huevo batido, el puré de papa, el puré de remolacha y la sal al pozo.", "Usando sus manos, mezcle bien hasta que la masa alcance una consistencia suave. Divida la masa en 4-6 pedazos iguales y enrolle cada pieza en una forma de salchicha larga.", "Con un cuchillo afilado, corte las salchichas de gnocchi en trozos de 2cm / 1in y reserve.", "Llevar a ebullición una cacerola grande de agua ligeramente salada. Agregue los gnocchi y cocine a fuego lento hasta que vuelvan a flotar hacia arriba. Cuando salgan a la superficie, sácalos con una cuchara ranurada. Tan pronto como deje caer el gnocchi en el agua hirviendo, comience a preparar la salsa; necesita trabajar rápidamente porque los gnocchi llegarán a la cima después de solo un minuto más o menos.", "Para la salsa, derrita la mantequilla en una sartén grande y agregue las hojas de salvia. Permita que el sabio infunda durante unos 30 segundos y luego agregue el jugo de naranja y la sal, al gusto.", "Saque los ñoquis cocidos con una cuchara ranurada, dejándolos escurrir un poco, y luego agréguelos a la salsa, mezclándolos bien. Cocine por un minuto más o menos hasta que la salsa comience a espesar un poco.", "Retire la sartén del fuego, agregue el parmesano y sirva inmediatamente, espolvoreado con cáscara de naranja."]}, {"isVegetarian": true, "title": "Mayonesa de remolacha", "url": "www_bbc_co_uk_food_recipes_beetrootmayonnaise_81741", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 cucharadas de vinagre de vino blanco", "1 cucharada de tallos de perejil, toscamente picados", "1 cucharada de perifollo, picado", "2 yemas de huevo de gallinas camperas", "1 cucharadita de mostaza inglesa en polvo", "150ml / 5fl oz de aceite de oliva ligero", "150ml / 5fl oz de aceite vegetal", "sal y pimienta negra recién molida", "exprimir jugo de limón", "250g / 9oz de remolacha cocida, descuartizada", "1 cucharada de cebollín, finamente picado", "Cohete 50g / 1¾oz", "2 cucharaditas de aceite de oliva"], "serves": "Porciones 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Coloque el vinagre, los tallos de perejil y el perifollo en una olla pequeña y deje que hierva. Cocine a fuego lento hasta que el volumen se reduzca a una cucharada de líquido.", "Cuele el líquido a través de un tamiz y deseche el perejil y el perifollo.", "Coloque las yemas de huevo, la mostaza en polvo y el vinagre infundido en un procesador de alimentos y mezcle.", "Con la licuadora aún en funcionamiento, agregue gradualmente los aceites. Continúe mezclando la mezcla hasta que todo el aceite se haya incorporado y la mezcla se haya espesado.", "Sazonar con sal y pimienta negra recién molida y agregar un chorrito de jugo de limón.", "Para servir, mezcle la remolacha cocida con la mayonesa, agregue el cebollín y sirva en un plato con rocío fresco rociado con aceite de oliva."]}, {"isVegetarian": true, "title": "Salsa de remolacha", "url": "www_bbc_co_uk_food_recipes_beetrootrelish_86997", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 remolachas cocidas en vinagre, escurridas y picadas", "pequeño perifollo fresco picado", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida"], "serves": "Sirve 1-2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 0, "cooking": "no se requiere cocinar", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Coloque todos los ingredientes en un recipiente y mezcle bien."]}, {"isVegetarian": true, "title": "Sopa de remolacha", "url": "www_bbc_co_uk_food_recipes_beetrootsoup_82121", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 cucharada de aceite de oliva", "¼ de cebolla roja picada", "2 remolachas, peladas y en rodajas", "100 ml / 3½ fl oz de caldo de pollo (los vegetarianos pueden sustituir el caldo de verduras)", "1 cucharada de perejil fresco, picado", "1 cucharada de frijoles Borlotti enlatados, enjuagados y escurridos", "sal y pimienta negra recién molida", "1 cucharada de yogur griego, para servir"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Caliente el aceite de oliva en una sartén a fuego medio. Agregue las cebollas y saltee durante 3-4 minutos, hasta que se ablanden.", "Agregue la remolacha, el caldo, el perejil fresco y los frijoles borlotti y deje que hierva. Reduzca el fuego a fuego lento durante 10 minutos, o hasta que la remolacha se haya ablandado y esté cocida. Sazonar, al gusto, con sal y pimienta negra recién molida, luego mezclar con una batidora de mano hasta que quede suave.", "Para servir, vierta en un recipiente y adornar con una cucharada de yogur griego."]}]