[{"isVegetarian": false, "title": "Creamy cauliflower cheese with walnuts", "url": "www_bbc_co_uk_food_recipes_creamythreecheesecau_72958", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/creamythreecheesecau_72958_16x9.jpg", "ingredients": ["1 cauliflower, trimmed and cut into 1cm/0.5in pieces", "10oz/300g cream cheese", "1 tsp Dijon mustard", "4oz/125g blue cheese, crumbled", "1oz/25g walnuts, roughly chopped", "2oz/50g cheddar cheese, grated", "salt", "freshly ground black pepper", "watercress salad"], "serves": "4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Bring 5cm/2in depth of water to the boil in a saucepan, add the cauliflower and cook for about 8 minutes, or until tender. Drain, and return the cauliflower to the pan.", "Mix the cream cheese and mustard with the cauliflower, then stir in the blue cheese. Season with a little salt if necessary and plenty of pepper.", "Pour the mixture into a shallow gratin dish. Scatter the walnuts on top, then cover with the cheddar (this helps to prevent the walnuts from burning). Place under a preheated hot grill for 10-15 minutes, or until the top is golden brown and the inside hot and bubbling. ", "Serve at once with a watercress salad."]}, {"isVegetarian": true, "title": "Creamy tomato soup", "url": "www_bbc_co_uk_food_recipes_creamytomatosoup_67508", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/creamytomatosoup_67508_16x9.jpg", "ingredients": ["3 tbsp olive oil", "1 large onion, chopped", "2 garlic cloves, crushed", "2 celery sticks, chopped", "200g/7oz carrots, chopped", "1 bay leaf", "1 large sprig fresh thyme", "750g/1½lb ripe plum or vine-ripened tomatoes, roughly chopped", "½ tsp sugar", "salt and freshly ground black pepper", "200ml/7fl oz passata", "500ml/17fl oz vegetable stock", "100ml/3½fl oz single cream or low-fat crème fraîche", "splash dry sherry ", "crusty bread and butter, to serve"], "serves": "", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a large saucepan and cook the onion for 5-6 minutes over a gentle heat until almost softened but not browned. Add the garlic, celery, carrots, bay leaf and thyme and cook for a further 6-7 minutes, stirring occasionally, making sure the vegetables don't stick to the base of the pan.", "Add the chopped tomatoes and sugar and season well with salt and pepper. Cook for a few minutes, then stir in the passata and vegetable stock. Bring to a simmer, cover with a lid and cook for 35-40 minutes, until all the vegetables are tender.", "Remove the bay leaf and thyme, then blend the soup in a liquidizer or food processor. This will probably have to be done in two batches. Pour the soup into a clean saucepan, passing it through a sieve if you want it really smooth. Stir in the cream, a splash of sherry and extra seasoning if required.", "Pour into large mugs or bowls and serve with fresh crusty buttered bread."]}, {"isVegetarian": true, "title": "How to make crème brûlée", "url": "www_bbc_co_uk_food_recipes_cremebrulee_90204", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cremebrulee_90204_16x9.jpg", "ingredients": ["450ml/16fl oz double cream", "50ml/2 fl oz whole milk", "2 vanilla pods, split, seeds scraped out (or a few drops vanilla extract)", "5 free-range eggs", "75g/2½ oz caster sugar, plus 40g/1½ oz more, for the topping"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 150C/300F/Gas 2. Pour the cream and the milk into a heavy-bottomed pan over a medium heat and bring to a simmer.", "Split the vanilla pods down the middle with a sharp knife. Scrape out the seeds with the knife and add the seeds and the pods (or the vanilla extract) to the cream and milk mixture. Stir well to combine.", "Separate the egg yolks and egg whites. Only the yolks are used in this recipe, so you can use the egg whites for another dish or freeze them for future use.", "Pour the caster sugar into the bowl with the yolks. Whisk together the egg yolks and the caster sugar until well combined.", "When the cream and milk mixture is coming up to a simmer, pour it (including the vanilla pods, if using) into the bowl with the egg yolk mixture. Stir thoroughly for a minute or two to dissolve the sugar. At this stage, you can chill the mixture in the fridge and make the brulees the following day, or carry on with the recipe.", "Ladle the brûlée mixture into the serving dish (or dishes). Discard the vanilla pods.", "Place the crème brûlée dishes into a deep baking tray and pour hot water into the tray, until the water reaches halfway up the sides of the dishes (this is called a bain-marie).", "Place the bain-marie into the preheated oven and cook the creme brulees for about 30-35 minutes, until set firm but still with a slight wobble. Allow to cool. You can place the brûlées in the fridge at this stage if you're not serving them immediately.", "For the topping, sprinkle half of the remaining caster sugar on top of the brûlées. Heat the surface with a mini-blowtorch until it forms a thin layer of caramel.", "Sprinkle over the rest of the sugar in a final layer and caramelise with the mini-blowtorch once again, to form a thick crunchy layer. The crème brûlées are ready to serve immediately or in 2-3 hours."]}, {"isVegetarian": true, "title": "Crème brûlée", "url": "www_bbc_co_uk_food_recipes_cremebrulee_91228", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450ml/16fl oz double cream", "50ml/2fl oz full-fat milk", "2 vanilla pods, split, seeds scraped out with a knife", "115g/4oz caster sugar", "5 free-range egg yolks"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 150C/300F/Gas 2.", "Bring the cream and milk to a simmer in a heavy-based pan over a medium heat.", "Add the vanilla seeds and pods and stir well to combine.", "Whisk together 75g/2½oz of the caster sugar and all of the egg yolks in a large mixing bowl until pale, fluffy and well combined. ", "Remove the vanilla pods from the milk and cream mixture. Pour the warm milk and cream mixture over the whisked egg and sugar mixture, stirring continuously until the sugar has dissolved. ", "Pour the crème brulée mixture into four ramekins. Place the ramekins into a deep-sided roasting tin. Carefully add enough boiling water to the roasting tin to reach halfway up the sides of the ramekins. (This is called a bain-marie.)", "Transfer the bain-marie to the oven and cook for 30-35 minutes, or until the custard has set firm but still has a slight wobble. Remove the crème brulées from the bain-marie and set aside to cool. ", "Once cool, chill the crème brulées in the fridge until needed. ", "When the crème brulées are ready to serve, sprinkle 20g/¾oz of the remaining caster sugar onto the surface of the crème brulées. Using a chefs' blowtorch, heat the sugar until it melts and caramelises, then set aside to cool. ", "Repeat the process with the remaining sugar, until the sugar has caramelised and hardened. Serve immediately."]}, {"isVegetarian": true, "title": "Crème brûlée with almond snap biscuits", "url": "www_bbc_co_uk_food_recipes_cremebruleewithalmon_86596", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75ml/2½fl whole milk", "250ml/9fl oz double cream ", "1 vanilla pod, split and seeds removed", "4 free-range egg yolks", "50g/2oz caster sugar, plus extra for topping ", "25g/1oz butter", "25g/1oz sugar", "2 tbsp liquid glucose or golden syrup", "65g/2½oz almonds, skins removed, chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 120C/250F/Gas ¼.", "Place the milk, double cream, vanilla seeds and pod into a pan. Bring to the boil.", "In a large bowl whisk the egg yolks and sugar together until thoroughly combined, then stir in the milk. ", "Strain the mixture through a sieve and divide among four ovenproof ramekins. Place the ramekins into a roasting tray and fill the tray with water until it comes halfway up the sides of the ramekins. Place the tray into the oven and cook for 30-40 minutes, or until the mixture is just firm to the touch. Once cooked, remove from the oven and allow to cool. Place into the fridge to chill. ", "For the biscuits, preheat the oven to 160C/325F/Gas 2. Melt the butter in a pan then add the sugar and liquid glucose or golden syrup and bring to the boil. Remove the pan from the heat and stir in the almonds. Pour the mixture onto a tray covered with baking paper and place into the fridge to cool for 2-3 minutes, until the dough is firm and pliable.  ", "Remove the tray from the fridge and mould the almond mixture into approximately 25 marble size shapes. Place onto a clean baking sheet. Leave plenty of space between them for the biscuits to spread. Place the tray into the oven and cook for 4-5 minutes. Leave to cool.", "To serve, sprinkle each creme brulee with a sugar to cover and caramelise the top with a mini blowtorch. Alternatively, you can place the ramekins under a hot grill until browned and caramelised. Serve with an almond snap."]}, {"isVegetarian": true, "title": "Crème brûlée with marinated autumn fruits and mint broth", "url": "www_bbc_co_uk_food_recipes_cremebruleewithmarin_84170", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/2oz caster sugar", "5 free-range egg yolks", "75ml/3fl oz milk ", "3 vanilla pods, split, seeds scraped out", "500ml/18fl oz whipping cream      ", "100g/3½oz Demerara sugar", "100g/3½oz strawberries ", "100g/3½oz raspberries  ", "100g/3½oz redcurrants ", "100g/3½oz blackcurrants ", "100g/3½oz blackberries ", "100g/3½oz caster sugar ", "small bunch fresh mint ", "300ml/11fl oz milk ", "2 tbsp crème de menthe"], "serves": "Serves 8", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Place the caster sugar and egg yolks into a bowl and beat together until pale and light.", "Place the milk into a saucepan with the vanilla pods and bring to the boil, then remove from the heat.", "Slowly add the milk to the beaten eggs and sugar, whisking constantly, then add the cream in and whisk gently to combine. Place into the fridge and leave for 12 hours to infuse.", "Preheat the oven to 140C/285F/Gas 1.", "Line the bases of eight small chefs' rings with two layers of cling film, then place onto a flat baking tray. Divide the mixture between the chefs' rings and place into the oven to cook for 45 minutes, or until the mixture has set like an egg custard. Remove from the oven and leave to cool.", "Sprinkle the top of the crème brûlées with Demerara sugar. Place each ring onto a plate and then carefully remove the ring and cling film.", "Heat the top of the sugar with a mini-blowtorch, until the sugar melts and turns golden-brown.", "For the marinated fruits, remove any stems from the fruits and cut the strawberries into quarters. ", "Take a quarter of each fruit and place into a large bowl. Add the caster sugar and, using a fork, mash the fruits together. ", "Add the rest of the fruit, mix well and add the mint. Leave to stand for five minutes.", "Taste the fruit mixture and add a little sugar if the fruit is too sharp.", "For the mint broth, place the milk and creme de mênthe into a saucepan and heat until hot, but do not boil.", "Using a hand blender, froth the milk to produce a 'cappuccino' effect.", "To serve, spoon the fruit onto each plate around the crème brûlées, then spoon the mint broth over the fruit and around the plates."]}, {"isVegetarian": true, "title": "Crème brûlée with marinated summer fruits and a mint broth", "url": "www_bbc_co_uk_food_recipes_cremebruleewithmarin_86528", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["5 free-range egg yolks", "50g/2oz caster sugar", "85ml/3fl oz milk ", "3 vanilla pods, split and seeds scraped out", "500ml/17fl oz cold whipping cream    ", "demerara sugar, for sprinkling  ", "100g/3½oz strawberries, hulled and quartered", "100g/3½oz raspberries  ", "100g/3½oz redcurrants ", "100g/3½oz blackcurrants ", "100g/3½oz blackberries ", "caster sugar, to taste ", "small handful fresh mint, chopped "], "serves": "Serves 8", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the crème brûlées, place the egg yolks into a bowl with the sugar and mix together until well combined.", "Place the milk into a pan and bring to the boil with the vanilla pods and seeds. ", "Pour the milk into the bowl with the egg mixture and mix well. Add the cold cream, cover, then leave to infuse for 12 hours.", "Preheat the oven to 100C/200F/Gas ½.", "Remove the vanilla pods and divide the mixture among eight ramekins, filling each one to just below the rim. Place the ramekins onto a baking sheet, transfer to the oven and bake for approximately an hour, or until set. Remove from the oven and leave to cool.", "For the marinated summer fruits, wash the fruits and leave to drain in a colander. Place a large handful of the fruit into a bowl with caster sugar, to taste, and mash with a fork. Gently stir in the remaining fruit and the chopped mint and leave to stand for five minutes. Taste and add a little more sugar if the fruit is too sharp. ", "Sprinkle the top of the crème brûlées with demerara sugar, then heat with a mini-blowtorch until caramelised. (Alternatively, place them under a very hot grill for 30 seconds, or until sugar has carmelised.) ", "To serve, place the crème brûlées onto serving plates with a spoonful of marinated fruits. "]}, {"isVegetarian": false, "title": "Crème fraîche and watercress roast chicken with all the trimmings", "url": "www_bbc_co_uk_food_recipes_cremefraicheandwater_87457", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["110g/4oz crème fraîche", "75g/3oz watercress, roughly chopped", "salt and freshly ground black pepper", "1 large chicken, weighing about 2-3kg/4lb 4oz-6lb 8oz, preferably organic ", "40g/1½oz butter, softened", "2 tbsp extra virgin olive oil", "18 slices streaky bacon", "3 tbsp plain flour", "150ml/5fl oz white wine", "300ml/10fl oz chicken stock", "12 chipolata sausages", "10 King Edward potatoes, peeled and cut into large chunks", "50g/2oz lard, dripping or vegetable oil", "6 carrots, peeled and cut into large chunks", "1 broccoli head, cut into large florets", "1 cauliflower head, cut into large florets", "150g/6oz French beans, trimmed", "2 bunches asparagus, trimmed", "110g/4oz butter", "1 large onion, peeled", "6 cloves", "1 bay leaf", "6 black peppercorns", "450ml/1 pint whole milk", "110g/4oz fresh white breadcrumbs", "40g/1½oz butter", "salt and freshly ground black pepper", "vegetable oil, for deep-frying", "1 large baking potato, sliced very thinly on a mandoline", "salt and freshly ground black pepper"], "serves": "Serves 4-6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the roast chicken, mix the crème fraîche and watercress together in a bowl and season with salt and freshly ground black pepper. Spoon the mixture into a piping bag.", "Place the chicken into a roasting tin. Slide your hand up under the skin of the chicken and place the nozzle of the piping bag under the skin. Squeeze the filling mixture in, smoothing down over the breast and leg.", "Rub the butter and olive oil over the bird and season with salt and freshly ground black pepper. Lay six slices of bacon over the breast of the chicken.", "Transfer the chicken to the oven and roast for 20 minutes per 450g/1lb, basting frequently. To check whether the chicken is cooked, push a skewer into the thigh at the thickest point. If the juices run clear the bird is done. If not, return to the oven for a further five minutes at a time. Remove from the oven, place onto a serving plate and set aside in a warm place for 15 minutes.", "To make the gravy, place the roasting tin onto the hob and heat gently, stirring with a wooden spoon and scraping up all the bits from the bottom of the pan.", "Add the plain flour and cook, stirring, for 1-2 minutes.", "Add the wine and simmer until reduced by half. Add the stock and simmer for five minutes. Season, to taste, with salt and freshly ground black pepper, then pass the gravy through a sieve into a jug and keep warm until ready to serve.", "Wrap the remaining bacon slices around the chipolata sausages. Place onto a baking sheet and bake in the oven for the last 15 minutes, while the bird is resting.", "Meanwhile, for the vegetables, place the potatoes into a large saucepan. Cover with water, add a pinch of salt and bring to the boil. Reduce the heat and simmer for 3-4 minutes. Drain into a colander and shake around a little to rough up the edges.", "Place a deep roasting tin onto the heat and pour in the fat. Add the potatoes and fry on each side until they start to brown. Sprinkle with salt, then transfer to the oven and roast for 50 minutes-an hour, turning halfway through the cooking time, until golden-brown and crisp.", "Cook all the remaining vegetables in boiling salted water until just tender, then drain and refresh in iced water. When all the vegetables are cooked and have been cooled, place them on a large plate in the fridge, covered.", "For the bread sauce, stud the onion all over with the cloves, then place into a saucepan along with the bay leaf, peppercorns and milk. Bring to the boil, then remove from the heat and allow to cool and infuse.", "Remove the onion, bay leaf and peppercorns and discard. Add the breadcrumbs to the pan and stir. Return the pan to the heat and heat very gently for 5-10 minutes, stirring occasionally until the breadcrumbs have absorbed all the liquid. Stir in the butter and season, to taste, with salt and freshly ground black pepper.", "When you're almost ready to serve the roast, make the game chips. Place the vegetable oil into a deep, heavy-bottomed saucepan and heat until a small cube of bread sizzles and turns golden when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Carefully place the potato slices into the hot oil and deep fry for 1-2 minutes until golden-brown. Remove from the oil with a slotted spoon, drain on kitchen paper and season with salt and freshly ground black pepper. Pile the game chips onto the chicken platter.", "Bring a large pan of water to the boil. Take the vegetables out of the fridge and drain, then place into the saucepan of boiling water and cook for 30-45 seconds until warmed through.", "Drain the vegetables and return to the pan. Add the butter, season with salt and freshly ground black pepper and stir well to coat.", "To serve, place the vegetables and roast potatoes into serving dishes. Pour the bread sauce into a serving jug. Carve the chicken, place onto serving plates and pour over the gravy."]}, {"isVegetarian": true, "title": "Crème caramels with poached cherries and cherry cream", "url": "www_bbc_co_uk_food_recipes_cremecaramelwithpoac_86696", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["175g/6oz caster sugar", "3 tbsp water", "425ml/15fl oz double cream", "1 vanilla pod, split", "50g/2oz caster sugar", "4 free-range eggs", "250g/9oz cherries, stones removed", "250ml/9fl oz red wine", "1 tbsp Kirsch", "75g/3oz caster sugar", "½ lemon, juice only", "150ml/5fl oz double cream", "2 tbsp cherry syrup (see below)"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the crème caramels, place the sugar and water into a pan and bring to the boil. Cook for 4-5 minutes, or until the sugar has dissolved and turned a caramel colour.", "Pour a little of the caramel into the bottom of each of four large ramekins or cups, carefully swirling the caramel up the sides of the cup.", "Place the cream and split vanilla pod into the pan that the caramel was made in and bring to a simmer.", "Place the eggs and sugar into a bowl and whisk together until smooth, then pour the hot cream over the egg mixture, whisking all the time. Strain into the caramel-lined ramekins.", "Place the ramekins into a deep roasting tin and fill the roasting tin with hot water two thirds of the way up the sides of the ramekins.", "Place in the oven for 15-20 minutes, depending on the size of the ramekins, or until just set.", "Remove from the oven, take out of the roasting tin and allow to cool completely before placing in the fridge to chill for 1-2 hours.", "For the poached cherries, place the cherries, red wine, Kirsch, sugar and lemon juice into a pan and bring to the boil. Simmer for 2-3 minutes until the cherries are tender. Using a slotted spoon, remove the cherries from the liquid and set aside.", "Turn the heat up under the pan and bring the liquid back to the boil. Cook for 4-5 minutes, or until just syrupy.", "Pour the syrup over the cherries, reserving two tablespoons, and set aside to cool.", "For the cherry cream, place the cream into a bowl and whisk until soft peaks form when the whisk is removed. Add the reserved cherry syrup and whisk gently to combine.", "To serve, turn the crème caramels out onto four serving plates. Spoon some cherries onto the side, drizzle over the syrup and serve with a dollop of cherry cream."]}, {"isVegetarian": true, "title": "Creole aubergines", "url": "www_bbc_co_uk_food_recipes_creoleaubergines_92669", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/creoleaubergines_92669_16x9.jpg", "ingredients": ["6 tbsp olive oil", "2 onions, peeled, finely chopped", "4 cloves garlic, peeled, chopped", "1 green pepper, seeds removed, chopped", "1 red pepper, seeds removed, chopped", "3 large aubergines, cut into cubes", "¼ tbsp hot paprika", "¼ tbsp sweet paprika", "2 tsp ground cumin", "800g/1lb 12¼oz canned cherry tomatoes", "½ tsp soft light brown sugar", "salt and freshly ground black pepper", "2 tbsp chopped fresh parsley leaves", "8 lime wedges"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat two tablespoons of the oil in a frying pan over a medium heat. Add the chopped onions, garlic and peppers and fry in the oil, stirring well, until softened, about 3-4 minutes. ", "Meanwhile, heat the remaining oil in a sauté pan or casserole and fry the aubergine cubes, in batches, for 4-6 minutes, or until golden-brown all over. Remove from the pan using a slotted spoon and set aside on a warmed plate. Repeat the process with the remaining batches of aubergine cubes.", "Stir the hot paprika, sweet paprika and cumin into the onion mixture and cook for one minute, or until the spices are fragrant. Add the canned tomatoes, sugar and cooked aubergines, and season, to taste, with salt and freshly ground black pepper.", "Pour 350ml/12½fl oz water into the pan, stir well and bring to the boil, then reduce the heat until the mixture is simmering. Simmer for 15-20 minutes, or until the mixture has thickened and is cooked through.", "Serve the Creole aubergines sprinkled with chopped parsley and garnished with wedges of lime."]}, {"isVegetarian": true, "title": "Crêpes with orange butter sauce", "url": "www_bbc_co_uk_food_recipes_crepes_with_orange_97791", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crepes_with_orange_97791_16x9.jpg", "ingredients": ["125g/4½oz plain flour", "15g/½oz caster sugar", "pinch salt", "2 medium free-range eggs", "325ml/11½fl oz milk", "50ml/1¾fl oz double cream", "few drops orange flower water", "20g/¾oz clarified butter", "10 oranges, 6 juiced, 4 segmented", "100g/3½oz icing sugar", "125g/4½oz butter, diced, softened", "4 sprigs fresh mint"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the crêpes, whisk the flour, sugar, salt, eggs and a third of the milk in a bowl to a smooth batter.", "Gradually stir in the rest of the the milk and all of the cream. Leave the batter to rest in a warm place for about an hour.", "Just before cooking, stir in the orange flower water.", "Brush a small 18cm-20cm/7in-8in frying pan with a little of the clarified butter and place over a medium heat. Add a ladleful of the batter and tilt the pan to cover the base thinly; cook the crêpe for a minute each side.", "Transfer the crêpe to a plate and repeat, stacking the crêpes between sheets of greaseproof paper, until all of the batter has been used up. ", "For the orange butter sauce, strain the orange juice through a sieve into a saucepan and add the icing sugar.", "Gradually bring the mixture to the boil and cook until the volume of liquid has reduced by half.", "Turn off the heat and whisk in the butter, a little at a time.", "To serve, scatter the orange segments over each crêpe and roll up. Spoon over  the orange sauce and garnish with a  sprig of mint."]}, {"isVegetarian": true, "title": "Crêpes with raspberries and cream", "url": "www_bbc_co_uk_food_recipes_crepeswithraspberrie_88005", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["110g/4oz plain flour", "pinch salt", "1 free-range egg", "1 free-range egg yolk", "300ml/½ pint milk", "1 tbsp vegetable oil", "55g/2oz raspberries", "150ml/¼ pint double cream, whipped"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Sift the flour and salt into a large bowl. Make a well in the middle of the flour.", "Add the egg, egg yolk and milk to the well in the flour and whisk until the batter is smooth. Leave to rest for a few minutes.", "Heat a flat griddle or frying pan and rub with vegetable oil. Pour a ladleful of batter into the pan and swirl to coat the base. Cook for 1-2 minutes, then flip and cook on the other side for one minute.", "Place the pancake on a plate and repeat with the rest of the batter.", "To serve, fold each pancake into four. Place onto serving plates and serve with raspberries and whipped cream."]}, {"isVegetarian": true, "title": "Crêpes with strawberries and cream", "url": "www_bbc_co_uk_food_recipes_crepeswithstrawberri_87013", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["110g/4oz plain flour", "pinch salt", "2 free-range eggs, beaten", "200ml/7floz milk", "75ml/3floz water", "2 tbsp butter, melted", "1 tbsp vegetable oil, for frying", "1 tbsp strawberry jam", "2 tbsp double cream, whipped", "icing sugar, for dusting"], "serves": "Serves 1-2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Sift the flour and salt into a large bowl and make a well in the middle of the flour. Pour the eggs into the well and whisk gently. ", "Gradually add the milk and water until you have a smooth batter. ", "Stir in the melted butter and leave to rest for a few minutes, or half an hour if time permits.", "Add the vegetable oil to a skillet or non-stick frying pan, wipe out the excess with kitchen paper and add a ladle of batter to the pan.", "Swirl the batter around the pan until there is an even layer covering the base of the pan. Fry for two minutes, turn over and fry for a further two minutes on the other side. ", "Remove the crêpe from the pan and repeat with the rest of batter. ", "Lay the crêpes on a plate, spread with jam, top with the whipped cream and fold into triangles. ", "Serve immediately, dusted with icing sugar."]}, {"isVegetarian": true, "title": "Cricket cake with strawberries and lemon curd", "url": "www_bbc_co_uk_food_recipes_cricket_cake_with_30136", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cricket_cake_with_30136_16x9.jpg", "ingredients": ["4 large free-range eggs", "225g/8oz self-raising flour", "225g/8oz caster sugar", "225g/8oz butter or baking spread, softened and chopped, plus extra for greasing", "1 unwaxed lemon, finely grated zest only", "1 level tsp baking powder", "500g/1lb 2oz strawberries, hulled (leaving 3 whole)", "450ml/16fl oz double cream, whipped", "6 tbsp lemon curd"], "serves": "Serves 10", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. Line two 20cm/8in sandwich tins with discs of non-stick baking paper and grease well.", "Put the eggs, flour, sugar, butter, lemon zest and baking powder in a bowl and beat until smooth and combined. Divide between the tins and level the top.", "Bake for about 25 minutes, or until the cake is well-risen, golden and shrinking away from the sides of the tins. Set aside to cool for 15 minutes in the tins. Remove from the tin onto a wire cooling rack and allow to cool completely.", "Cut the three or four whole strawberries in half through the stalk and set aside to decorate. Slice the remaining strawberries.", "Slice each cake in half horizontally and sit one slice on a cake stand. Spread with a quarter of the whipped cream, then 2 tablespoons of lemon curd, then a third of the sliced strawberries.  ", "Continue layering the cake. Finish with a large dollop of cream in the centre of the top slice, then decorate with the reserved green-topped strawberries. Cut into wedges to serve."]}, {"isVegetarian": false, "title": "Crisp bacon rosti with fried eggs", "url": "www_bbc_co_uk_food_recipes_crisp_bacon_rosti_with_84695", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crisp_bacon_rosti_with_84695_16x9.jpg", "ingredients": ["sunflower oil, for frying", "2 rashers smoked back bacon, cut into small pieces", "1 small onion, thinly sliced", "500g/1lb 2oz floury potatoes, coarsely grated ", "2 free-range eggs", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat 1 tablespoon oil in a 20cm/8in lidded frying pan, add the bacon and fry over a high heat until crisp. Remove the bacon and set aside. Add the onion to the pan and fry for 1 minute. Cover, lower the heat and cook for 15 minutes, until soft and tender.", "Put the potatoes inside a clean tea towel and wring out as much water as possible by squeezing the towel – this prevents the rosti from being soggy. Put the potato in a bowl, add the onion and bacon. Season with salt and pepper and mix well.", "Return the pan to the heat and add 1 tablespoon oil. When the oil is hot add the potato mixture. Using the back of a spoon press the mixture into the pan so there is an even layer covering the whole pan.  ", "Cook over a low heat for 5–10 minutes, then carefully turn over. The easiest way is to turn it upside down onto a plate and then slide it back into the pan (you may need to add a little more oil into the pan first). Cook the other side for 5–10 minutes, until golden and crisp.", "Heat oil in a frying pan and fry the eggs until cooked to your liking. ", "Cut the rosti into wedges and divide between plates, top with the eggs and serve. "]}, {"isVegetarian": false, "title": "Crisp breadcrumbed squid with creamy ponzu dressing and Chinese leaf salad", "url": "www_bbc_co_uk_food_recipes_crisp_breadcrumbed_squid_24534", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 medium squid, cleaned and sliced into 5mm/¼ in thick rings", "75g/3oz plain flour", "salt and freshly ground black pepper", "2 eggs, beaten", "75g/3oz panko or Japanese breadcrumbs", "1 lime, segmented", "3 tbsp coriander cress", "2 tbsp red amaranth cress", "2 eggs, yolks only", "½ tsp sea salt", "1 pinch white pepper", "2 tsp rice wine vinegar", "4 tsp chilli garlic sauce", "2 tsp yuzu juice", "200ml/7fl oz vegetable oil", "200g/7oz Chinese leaf, finely shredded", "½ red onion, very finely sliced", "2 tbsp very finely shredded mint ", "2 tbsp rice wine vinegar", "1 tbsp toasted sesame oil", "2 tbsp vegetable oil", "1 lime, juice only", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the squid, heat a deep fat fryer to 190C/375F. Alternatively heat vegetable oil in a deep-sided, heavy based pan, until a breadcrumb sizzles and turns golden-brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Season the flour with salt and black pepper.", "Dredge the squid rings with the seasoned flour, coating thoroughly.", "Dip the floured squid rings into the beaten eggs then straight into the breadcrumbs to coat.", "Lower a few squid rings at a time into the fat fryer, or hot oil, and cook for two minutes until golden-brown and crisp.", "Remove the squid rings from the hot oil with a slotted spoon and drain onto kitchen paper.", "For the creamy ponzu dressing, place all the ingredients, except the vegetable oil, into a small food processor and blend to a purée.", "Gradually add in the vegetable oil until a thin mayonnaise forms.", "Check the seasoning and add more yuzu juice if desired.", "For the Chinese leaf salad, mix together the Chinese leaf, red onion and mint in a bowl.", "Whisk the rice wine vinegar, sesame and vegetable oils together with the lime juice then season to taste.", "Pour the dressing over the leaves and mix well.", "To serve, pile the squid onto a plate and drizzle over the creamy ponzu dressing then pile the salad alongside."]}, {"isVegetarian": false, "title": "Crisp chilli chicken", "url": "www_bbc_co_uk_food_recipes_crisp_chilli_chicken_67804", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½ oz fine breadcrumbs, dried", "80g/2¾oz za’atar", "20g/¾oz sumac", "1 tbsp sesame seeds, lightly toasted", "chicken skin, from 1 chicken", "flaky sea salt, to taste", "50g/1¾oz fine salt", "1 tsp sweet smoked paprika", "1 medium chicken, jointed", "1-2 tbsp extra-virgin olive oil", "330g/11½  oz palm sugar (jaggery)", "15 garlic cloves, finely chopped", "3 red chillies, finely chopped", "50g/1¾oz hot pepper paste, available in specialist and Middle Eastern shops (optional)", "165ml/5½fl oz  cider vinegar", "2 large free-range egg yolks", "½ tsp Dijon mustard", "25ml/¾fl oz cider vinegar", "300ml/10fl oz sunflower oil", "squeeze lime juice", "1 heaped tbsp lime pickle", "1 lime, cut into wedges"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Take all the skin off the chicken pieces except for the wings. Put on a baking tray and cook for approximately 40-50 minutes or until golden and crisp. Tip the fat out of the tray a few times whilst cooking. Once the skin has cooled finely chop into little pieces. Turn the oven up to 200C/180C Fan/Gas 6.", "To make the brine bring 200ml/7fl oz of water to the boil with the paprika and salt. Tip into a bowl and add 800ml/1¼ cold water. Once the brine is at room temperature tip onto the chicken pieces and put in the fridge for 3 hours. After 3 hours rinse the chicken under cold water and pat dry", "For the glaze, put the chillies and garlic into a food processor and blend to a coarse purée. Put the sugar in pan over a medium heat until it starts to caramelise (CAUTION: boiling sugar is extremely hot). Add in the purée and hot chilli paste and cook for 10-20 minutes. Then add in the cider vinegar - be careful it will spit a bit. Cook for 10-20 minutes or until the glaze is at a syrup consistency.", "Meanwhile, make the mayonnaise. Blend the egg yolks in a small processor along with the mustard and vinegar. Whilst the motor is running very slowly drizzle in the oil to form a mayonnaise. Finally, blend in the lime pickle and juice and adjust the seasoning if necessary.", "Place the chicken pieces onto a large baking tray well spaced apart and drizzle with a little olive oil.  Cook in the oven for about 30 minutes, we are looking to cook the chicken two-thirds of the way through.", "Remove the chicken from the oven and generously ladle the glaze over all the pieces, use about half the glaze. Place back into the oven for 5 mins. Take out and repeat the process.", "Meanwhile make the crumb, combine all of the ingredients and place on a tray. ", " Once the chicken is cooked through and glazed well take out of the oven. Coat the chicken in the crumb. Serve with the lime mayo on the side and wedges of lime."]}, {"isVegetarian": false, "title": "Crisp coated rabbit with sweetcorn salsa and a mustard slaw", "url": "www_bbc_co_uk_food_recipes_crisp_coated_rabbit_with_61935", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["vegetable oil, for deep frying", "500g/1lb 2oz rabbit meat, cut into 2cm/¾in cubes", "500ml/18fl oz buttermilk", "200g/7oz plain flour", "100g/3½oz rice flour", "pinch dried thyme", "pinch dried oregano", "4 tbsp cornflour", "1 tsp cayenne pepper", "½ tsp garlic powder", "½ tsp onion powder", "1 tbsp sea salt", "1 tsp paprika\t", "1 tsp baking powder", "2 red chillies, roughly chopped", "8 lime leaves", "2 lemongrass stalks, tough outer leaves removed, finely chopped", "25g/1oz fresh root ginger, roughly chopped", "2 garlic cloves, peeled, left whole", "2 small shallots, roughly chopped", "4 tbsp Thai fish sauce", "3 tbsp sesame oil", "50ml/2fl oz soy sauce", "2 limes, juice and zest only", "150g/5½oz caster sugar", "150g/5½oz tinned sweetcorn, drained weight", "2 egg yolks", "2 tsp white wine vinegar", "1½ tbsp Dijon mustard", "salt and freshly ground black pepper", "300ml/10fl oz vegetable oil ", "¼ red cabbage, thinly sliced", "1 small carrot, grated", "1 small onion, finely sliced", "2 tbsp fresh parsley, chopped"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["For the crisp coated rabbit, in a plastic container or bowl, cover the rabbit pieces with the buttermilk. Chill in the fridge for 24 hours.", "The next day, put all the dry ingredients in a large plastic food bag and mix. Remove the rabbit from the buttermilk, put it in the bag with the seasoned flour and shake to coat.", "Heat a deep-fat fryer or a large, deep, heavy-bottomed pan two-thirds full with vegetable oil. Heat the oil to 165C, or until a piece of bread turns golden-brown when dropped in the oil. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Deep-fry the rabbit until golden-brown and cooked through. Remove with a slotted spoon and place on kitchen paper to drain.", "For the sweetcorn salsa, blend all the ingredients, except the caster sugar and sweetcorn, to a smooth purée in a food processor.", "Heat the sugar in a heavy-based saucepan over a low-medium heat until it melts and forms a golden-brown caramel. Do not stir and keep an eye on it so that it doesn’t burn.", "Once the sugar has caramelised, pour in the puréed mixture and stir well. Bring the mixture to the boil and add the sweetcorn. Reduce the heat and simmer for 4-5 minutes, or until sticky and jam-like. Remove from the heat and set aside to cool slightly.", "For the mustard slaw, first make a mayonnaise. Put the egg yolks, white wine vinegar and a teaspoon of mustard into a food processor and blend until pale and creamy. ", "With the motor running, add the oil, in a thin steady stream, until the mayonnaise is thick (you may not need all the oil). Add the remaining mustard and stir.", "Put the cabbage, carrot and onion in a large bowl and stir in the mayonnaise. Just before serving add the parsley and mix.", "To serve, place the deep-fried rabbit on serving plates alongside the slaw. Serve the sweetcorn salsa in a little pot alongside."]}, {"isVegetarian": false, "title": "Crisp noodle cake with basil cream", "url": "www_bbc_co_uk_food_recipes_crisp_noodle_cake_with_73371", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["600ml/20fl oz double cream", "40g/1½oz dried ancho chillies (mild Mexican chilli pepper, available from larger supermarkets), left whole", "1 lemon, whole peeled zest only", "½ onion, skin on", "4 cloves", "150g/5oz linguine", "200g/7oz parmesan, grated", "4 smoked garlic cloves (available from larger supermarkets), finely chopped ", "2 tsp cracked black peppercorns", "6 tbsp olive oil ", "25g/1oz fresh basil leaves"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the double cream in a lidded saucepan over a gentle heat. Add the ancho chillies and whole lemon peel. Stud the onion half with the cloves and add it to the pan.", "Bring the mixture gently to a simmer. Just as it starts to bubble, turn off the heat, cover the pan with the lid and leave it on the hob to infuse for 30 minutes.", "Meanwhile, cook the linguine in a pan of boiling, salted water as per the packet instructions. Drain well into a colander and set aside for 10 minutes, until the cooked pasta is dry and sticky.", "In a large mixing bowl, mix together the grated parmesan, smoked garlic and cracked black pepper until well combined. Stir in the linguine, mixing well.", "Heat half of the oil in a small, non-stick frying pan over a medium heat. Gather up the pasta and cheese mixture into a ball using your hands, then press it down into the frying pan and fry for 3-4 minutes on each side, or until crisp and golden-brown on both sides but soft in the middle. ", "When the sauce has infused, blend it in a food processor with the remaining oil until smooth. Strain through a fine sieve, then stir the basil into the strained sauce.", "To serve, slice the noodle cake into 8 portions. Serve in bowls with the sauce alongside."]}, {"isVegetarian": false, "title": "Crisp octopus, roasted fennel and apple with a liquorice dressing", "url": "www_bbc_co_uk_food_recipes_crisp_octopus_roasted_87261", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 carrot, roughly chopped", "1 white onion, roughly chopped", "1 bay leaf", "4 peppercorns", "1 tbsp rock salt", "1 octopus (about 2kg/4lb 8oz), innards and beak removed, cleaned", "½ celeriac, cut into large chunks", "1 fennel bulb (or 4 baby fennel bulbs), cut into large chunks, fronds reserved in water for the garnish", "1 garlic clove, crushed", "2 tbsp olive oil, plus extra for frying", "1 sprig thyme", "1 apple, peeled, halved and cored", "6–8 octopus tentacles ", "2 tbsp olive oil", "1 tbsp cooking juices, reserved from the garnish (above)", "1 tbsp balsamic vinegar", "2 tbsp olive oil", "2 tsp fine liquorice powder, plus a pinch to serve", "fresh tarragon leaves, to garnish", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the octopus, put all the ingredients except the octopus in a large saucepan. Cover with water and bring to the boil before adding the octopus. Simmer for about 1½ hours until the octopus is tender. Do check regularly using the tip of a knife; once you can easily cut through the flesh strain the octopus, and leave overnight in the fridge. Discard the head and the liquid.", "For the fruit and vegetable garnish, preheat the oven to 180C/160C Fan/Gas 4.", "Place the celeriac and fennel on a sheet of kitchen foil and season with salt and pepper. Add the garlic clove, olive oil and thyme. Wrap in the foil and seal tightly. Bake for 20–30 minutes (depending on the size of the chunks), or until tender.", "In the meantime, slice each half of apple into three even wedges. Heat a drizzle of oil in a frying pan and fry the apple wedges on each side until golden, but not cooked through. Set aside until ready to serve.", "When the vegetables are cooked, remove them from the foil and reserve any cooking juices (to use in the dressing).  ", "For the octopus tentacles, slice the tentacles into chunks. Heat the olive oil in a large frying pan over a high heat. Once the pan is hot, fry the tentacles until crisp. Season with salt and pepper.", "For the liquorice dressing, put all the ingredients in a mixing bowl and whisk together to create a split vinaigrette. Dress with tarragon leaves and an extra pinch of liquorice powder.", "To serve, divide the roasted vegetables between serving plates, top with the octopus and finish with the dressing and fennel fronds."]}, {"isVegetarian": false, "title": "Crisp pork belly with Chinese greens", "url": "www_bbc_co_uk_food_recipes_crisp_pork_belly_with_95763", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1.5 kg/3lb 5oz boneless pork belly, with rind", "4 tbsp coarse sea salt", "2 tbsp ground roasted Sichuan peppercorns", "2 tsp freshly ground white pepper", "2 tbsp Chinese five-spice powder", "1 tbsp caster sugar", "2 tbsp vegetable oil", "4 spring onions, finely sliced", "150g/5½oz mangetout, finely sliced", "4 heads bok choi, roots removed, leaves separated", "1 red chilli, deseeded and julienned", "2 tbsp soy sauce", "1 tbsp sesame oil"], "serves": "Serves 4-6", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the crisp pork belly, pierce the rind side of pork with a sharp fork or knife until the skin is covered with fine holes. Insert a meat hook into the meat to secure it. ", "Bring a large pan of water to a boil and, using a large ladle, pour the hot water over the rind side of the pork several times. This is best done suspending the pork above the sink. Set the pork belly aside.", "Heat a wok until it is hot, then add the salt, both peppers, five-spice powder and sugar and stir fry the mixture for three minutes. Allow the mixture to cool slightly. ", "When the mixture is cool enough to handle, rub it into the flesh side of the pork. Hang the meat to dry for eight hours or overnight in a cool place or in front of a fan. Alternatively, place the meat on a wire rack set above a roasting tin. ", "Preheat the oven to 200C/400F/Gas 6. Place the pork on a wire rack, rind-side up, over a deep roasting pan filled about one third with water and roast for 20 minutes. ", "Reduce the heat to 180C/350F/Gas 4 and continue to roast for two hours. Turn the oven back up to 230C/450F/Gas 8 and cook for 15 minutes. Remove the meat from the oven and allow the pork to cool. ", "For the Chinese greens, heat a wok and add the oil. Once hot, add the spring onions cook for 1-2 minutes. Add the mangetout, bok choi, chilli and three tablespoons of water and cook for a further 2-3 minutes.", "Add the soy sauce and sesame oil and mix to coat the vegetables.", "To serve, carve the pork into bite-sized pieces, arrange on a platter and serve with the Chinese greens."]}, {"isVegetarian": true, "title": "Crisp winter slaw", "url": "www_bbc_co_uk_food_recipes_crisp_winter_slaw_58247", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crisp_winter_slaw_58247_16x9.jpg", "ingredients": ["½ red cabbage", "1 bulb fennel", "1 stick celery", "1 (sharp) apple", "1 lemon, juiced ", "8 walnuts", "1 tbsp red wine vinegar", "pinch salt", "1 tbsp Dijon mustard", "1 tbsp groundnut oil", "1 tbsp walnut oil", "100g/3½oz  Stilton "], "serves": "Serves 2-3", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Finely slice the red cabbage, fennel and celery and combine in a large salad bowl. Slice the apple into discs, lay onto a plate and squeeze a lemon over in order to stop it discolouring.", "Toast the walnuts in a dry frying pan for two minutes and set aside.", "For the dressing, take a separate bowl and to it add the red wine vinegar, a little salt, some Dijon mustard and both walnut and groundnut oil. Whisk them together.", "Now toss all the components together in a salad bowl. Crumble over large chunks of Stilton, trickle the dressing and serve with some of the green fronds from the fennel bulb."]}, {"isVegetarian": false, "title": "Crisp battered sea bass on finely chopped new potatoes", "url": "www_bbc_co_uk_food_recipes_crispbatteredseabass_88163", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300ml/½ pint vegetable oil, for deep-frying ", "3 tbsp self-raising flour", "1 tsp baking powder", "50ml/2fl oz cold sparkling water", "3 ice cubes", "1 sea bass fillet", "150g/5½oz new potatoes, halved", "4 garlic cloves, unpeeled", "1 lemon, juice only", "2 tbsp chopped fresh flatleaf parsley", "salt and freshly ground black pepper ", "lemon wedges, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the bass, heat the oil in a large saucepan until a small cube of bread turns golden in 30 seconds. (CAUTION: hot oil is dangerous. Do not leave unattended.) ", "Combine the flour and baking powder in a bowl and mix in enough water to create a batter the thickness of double cream. Add the ice cubes and stir. Dip the sea bass fillet in the batter and, when the oil is hot enough, carefully lower the fish into the oil and fry for about 3-4 minutes or until golden-brown. Remove with a slotted spoon and drain on kitchen paper.", "For the new potatoes, bring the potatoes and garlic cloves to the boil in a large saucepan of salted water. Cook for about 10-12 minutes, or until the potatoes are tender. Drain, remove the garlic, peel and chop the cloves roughly. ", "In the pan, gently crush the potatoes using a fork and return the chopped garlic to the pan along with the lemon juice, chopped parsley, salt and freshly ground black pepper. Stir to combine.", "To serve, place a spoonful of the potatoes on a serving plate and arrange the fish on top. Garnish with lemon wedges."]}, {"isVegetarian": false, "title": "Crisp fried plaice", "url": "www_bbc_co_uk_food_recipes_crispfriedplaice_90189", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crispfriedplaice_90189_16x9.jpg", "ingredients": ["1 plaice", "vegetable oil, for deep frying", "lemon wedges, to serve", "4 tbsp plain flour", "4 tbsp cornflour", "salt and freshly ground black pepper", "1 small bottle (330ml/11½ fl oz) sparkling mineral water, cold"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Trim, halve and bone the plaice (or ask your fishmonger to prepare it for you).", "For the batter, mix the flour and cornflour together in a large mixing bowl. Season, to taste, with salt and freshly ground black pepper. Gradually whisk in enough of the water to give you a batter with the consistency of double cream (you may not need to use all the water).", "Heat the oil in a deep, heavy-based frying pan until the surface of the oil begins to shimmer. To test if it's hot enough, dribble some of the batter into the hot oil. It should sizzle and brown. (NB: hot oil can be very dangerous. Don't leave unattended.)", "When the oil is hot, give the batter a final stir. Dip the plaice into the mixture, then drop the fish into the pan of hot oil. The fish will take 3-4 minutes to crisp up, depending on size.", "When the fish is crisp and golden, carefully remove the fish with a slotted spoon and drain on kitchen paper.", "Serve hot, with wedges of lemon."]}, {"isVegetarian": false, "title": "Crisp fried prawns in kadaifi pastry with harissa and preserved lemon salsa", "url": "www_bbc_co_uk_food_recipes_crispfriedprawnsinka_91391", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ bunch coriander, finely chopped", "3 tbsp olive oil", "16 cooked prawns, peeled but tails left on", "200g/7oz ready-made kadaifi pastry (also spelled 'kataifi'; available at some continental delicatessens and online specialists) ", "vegetable oil, for deep frying", "1 small red onion, finely chopped", "2 tomatoes, peeled, seeds removed, finely chopped ", "2 preserved lemons, skin only, drained and finely chopped ", "1 tbsp harissa paste", "½ lemon, juice only", "½ bunch fresh coriander, finely chopped", "Rocket to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the prawns, pound the coriander and olive oil together in a pestle and mortar until the mixture is the consistency of pesto. Dip the prawns in the coriander to coat.", "Unravel the pastry onto a flat, clean work surface. Cut the pastry into 12 equal pieces about 10cm/4in (keep the pastry pieces covered after you've cut them out to prevent them from drying out). Wrap the pastry pieces around the prawns.", "Heat a deep fat fryer to 170C/325F/Gas 3, or until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Deep fry the prawns in batches until golden-brown. Remove with a slotted spoon, drain on kitchen paper and keep in a warm place until ready to serve.", "For the salsa, combine all of the salsa ingredients. Leave to stand for about 15 minutes to let the flavours infuse before serving.", "Serve the prawns with the salsa on the side."]}]