[{"ingredients": ["1 cucharada de aceite de oliva", "½ cabeza de brócoli, cortada en florecillas", "100g / 3½oz de tomates enrojecidos por el sol", "75ml / 2½fl oz de vino blanco", "25g / 1oz de mantequilla", "1 cucharada de estragón fresco picado, para servir"], "method": ["Caliente el aceite en un wok y fríe con cuidado el brócoli y los tomates tomados por el sol durante 3-4 minutos.", "Agregue el vino y cocine a fuego lento hasta que el vino se reduzca y el brócoli esté tierno, aproximadamente cinco minutos. Agregue la mantequilla.", "Espolvorear con estragón fresco picado y servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_warmsunblushedtomato_88697", "title": "Ensalada cálida de tomate y brócoli", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de vinagre balsámico", "3 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "100g / 3½oz de berro", "1 cucharada de aceite de oliva", "¼ cebolla roja, finamente rebanada", "1 cucharadita de azúcar morena suave", "2 cucharaditas de vinagre balsámico", "2 higos, cortados a la mitad", "1 cucharada de miel clara", "30g / 1oz Stilton, desmenuzado", "2 cucharadas de nueces sin cáscara"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para la ensalada de berros, coloca el vinagre balsámico, el aceite de oliva, la sal y la pimienta negra recién molida en un tazón grande y bate para combinar. Agregue el berro y revuelva para cubrir.", "Para la cebolla asada, caliente el aceite de oliva en una sartén, agregue la cebolla roja y fríela a fuego lento durante cinco minutos hasta que se ablande.", "Agregue el azúcar y cocine por un minuto. Agregue el vinagre balsámico y cocine durante tres minutos. Déjelo enfriar un poco, luego agregue al recipiente con el berro.", "Para los higos tostados, coloque los higos con el lado cortado hacia arriba en una bandeja para hornear y rocíe con miel. Coloque en el horno durante cinco minutos, o hasta que estén blandos y de un color más oscuro.", "Para servir, coloca la ensalada de berros en un plato de servir. Coloca los higos tostados encima y espolvorea con Stilton desmenuzado y nueces."], "url": "www_bbc_co_uk_food_recipes_warmwatercresssaladw_88007", "title": "Ensalada de berros tibia con higos asados ​​con miel, Stilton y nueces", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["¼ calabaza butternut, pelada y picada", "2 cucharadas de aceite", "¼ repollo rojo, rallado", "1 cucharada de azúcar moreno", "jugo de ½ naranja", "cucharadita de sal", "2 cucharaditas de semillas de sésamo"], "method": ["Precalentar el horno a 225C / 450F / Gas 7.", "Poner a hervir una olla con agua y agregar la calabaza y cocinar por cinco minutos, o hasta que esté suave. Escurrir y colocar en una bandeja para hornear.", "Mientras tanto, caliente 1 cucharada de aceite en una sartén grande y saltee la col durante 5-8 minutos, hasta que esté suave. Transfiera la col a la bandeja para hornear con la calabaza.", "Rocíe el repollo y la calabaza con la cucharada restante de aceite de oliva. Espolvorear con el jugo de naranja, azúcar moreno y una cucharadita de sal. Coloque en el horno y tueste durante diez minutos.", "Para servir, coloque en un tazón y espolvoree con semillas de sésamo."], "url": "www_bbc_co_uk_food_recipes_warmwintersaladwiths_78705", "title": "Ensalada templada de invierno con aderezo picante", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100g / 3½ oz de perejil de flatleaf", "400g / 14oz de berros frescos", "50g / 2oz de mantequilla", "1 chalote, pelado, picado", "2-3 dientes de ajo, pelados, picados", "Guisantes congelados de 400g / 14oz (peso sin cáscara)", "1 litro / 1¾ pintas de caldo de verduras calientes", "100ml / 3½ fl oz crema doble", "sal y pimienta negra recién molida", "puñado de brotes frescos de guisantes", "puñado de berros de bebé", "2 puñados croûtons (opcional)", "2 lonchas de tocino rayado cocinado, desmenuzado (opcional)", "rociar aceite de oliva"], "method": ["Caliente la mitad de la mantequilla en una sartén a fuego medio. Agregue la chalota, ajo y freír suavemente hasta que estén blandos - alrededor de 3-4 minutos. Agregue el berro, los guisantes, el perejil y el caldo o agua caliente, ponga la mezcla a ebullición, luego reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento y continúe cocinando a fuego lento por tres minutos o hasta que los guisantes estén verdes y tiernos.", "Vierta la crema, luego mezcle completamente con una licuadora de mano. Sazonar, al gusto, con sal y pimienta negra recién molida, luego incorporar la mantequilla restante hasta que se derrita.", "Divida la sopa por igual entre cuatro tazones para servir y adorne con los brotes de guisantes, berros de bebé, croûtons y trozos de tocino crujiente. Termine con un chorrito de aceite de oliva. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_watercress_and_pea_soup_72980", "title": "Berro y sopa de guisantes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/watercress_and_pea_soup_72980_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de azúcar en polvo", "50g / 1¾oz de vinagre de vino blanco", "5 granos de pimienta blanca", "½ cucharadita de semillas de hinojo", "½ cucharadita de semillas de cilantro", "6 huevos de codorniz", "Berro blanqueado de 500 g / 1 lb 2 oz (aproximadamente 300-400 g / 10½ -14 oz de peso sin cocer)", "sal al gusto", "Cebollas de 200g / 7oz, aproximadamente picadas", "Patata de 250g / 9oz, pelada y picada", "1 manzana Granny Smith, finamente picada", "dash oil", "Cebolla 300 g / 10½ oz, picada", "200g / 7oz de apio, más o menos picados", "4 dientes de ajo, en rodajas", "2 ramitas de romero, hojas recogidas y picadas", "½ barra de pan integral", "50g / 1¾oz de mantequilla", "1 diente de ajo, rallado", "80g / 2¾oz escogieron berro", "150ml / 5fl oz de aceite no perfumado, como aceite vegetal o de girasol"], "method": ["Para los huevos de codorniz encurtidos, prepare el licor de encurtido llevando a ebullición el azúcar, el vinagre, las especias y 50 ml / 1¾fl de agua en una olla no reactiva. Deja enfriar. Pase este líquido a través de un tamiz en un recipiente limpio con una tapa.", "Cocine los huevos de codorniz en una olla con agua hirviendo durante dos minutos y revuelva en un recipiente con agua helada. Una vez frío, pelar y colocar en el licor de pickle. Déjelos al menos durante la noche para encurtirlos, pero puede dejarlos durante hasta cinco días.", "Para la sopa de berros, separe las hojas y los tallos del berro. Blanquee las hojas de berro en una sartén de agua hirviendo con sal hasta que estén suaves y transfieralas a un recipiente con agua helada. Exprime el agua y separa 500 g / 1lb 2oz.", "Para el nage, en una sartén por separado, caliente una pizca de aceite y fría las cebollas, el apio, el ajo y el romero hasta que estén suaves, pero no coloreados. Una vez ablandado, agregue 500ml / 18fl oz de agua, lleve a ebullición y luego agregue los tallos de berro. Retire del fuego y cubra con película adhesiva durante 10 minutos para infundir el sabor. Pase el líquido a través de un tamiz fino. Dejar de lado.", "Para la sopa, calentar otra pizca de aceite en una sartén y freír las cebollas en aceite. Agregue las papas en rodajas. Agregue un poco del nage para cocinar las papas. Agregue más nage y deje hervir y luego retírelo del fuego.", "Agregue un poco de berros blanqueados a una licuadora o procesador de alimentos con las papas y la nata y mezcle, se pondrá verde brillante. Cuele a través de un colador fino en un recipiente limpio y agregue sal. Reserve y mantenga caliente hasta que esté listo para servir.", "Para los croûtons, retire las costras del pan y colóquelas en el congelador en una bandeja para hornear mientras prepara el aceite de berros, esto ayudará a mantener las formas agradables y nítidas.", "Precalentar el horno a 200C / 400F / Gas 6 para hornear los croutons más tarde.", "Para el aceite de berros, ponga el berro escogido en una licuadora. Caliente el aceite a 150 ° C / 300 ° F en una sartén (use un termómetro de cocción para verificar la temperatura) y vierta el aceite sobre el berro. Mezcle y pase a través de una tela de muselina limpia en un recipiente. Dejar enfriar en la nevera.", "Para los croûtons, en una sartén a prueba de horno, caliente un poco de mantequilla hasta que la nuez se dore. Agregue el pan cortado en cubitos y cúbralo con la mantequilla. Agregue el ajo rallado y mezcle.", "Hornee en el horno precalentado durante ocho minutos o hasta que estén dorados, retire y escurra en un plato forrado con papel de cocina.", "Para servir la sopa, ponga un huevo de codorniz en el fondo de cada tazón y luego agregue una pequeña manzana cortada Granny Smith. Vierta la sopa y cubra con los croûtons y el aceite de berros."], "url": "www_bbc_co_uk_food_recipes_watercress_soup_with_81330", "title": "Sopa de berros con croûtons de ajo y huevos de codorniz en escabeche", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "¼ de cebolla, finamente picada", "1 diente de ajo, picado", "½ papa grande, pelada y finamente picada", "150ml / 5fl oz de caldo de pollo (los vegetarianos pueden sustituir el caldo de verduras)", "½ manojo de berros, picados", "Crema doble 50ml / 2fl oz", "sal y pimienta negra recién molida"], "method": ["Caliente el aceite de oliva en una olla mediana. Agregue la cebolla y el ajo y saltee suavemente hasta que se ablanden.", "Agregue los ingredientes restantes y cocine suavemente durante 8 minutos.", "Licuar con una batidora de mano hasta que quede suave y verter en un bol para servir."], "url": "www_bbc_co_uk_food_recipes_watercressandpotatos_81611", "title": "Berro y sopa de papa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 cucharadas de aceite de oliva", "½ cebolla, picada", "3 cucharadas de azúcar moreno", "2 cucharadas de vino tinto", "100g / 3½oz de tomates cherry", "1 cucharadita de hojas frescas de tomillo", "2 puñados de berro", "25g / 1oz de queso azul"], "method": ["Caliente el aceite de oliva en una cacerola a fuego medio. Una vez caliente, agregue la cebolla, el azúcar morena, el vino tinto, los tomates y el tomillo y cocínelos durante siete minutos, revolviendo suavemente, hasta que los tomates se hayan dorado y estén comenzando a ablandarse.", "Agregue el berro y mezcle suavemente para no romper los tomates.", "Para servir, coloque en un plato y espolvoree con el queso azul."], "url": "www_bbc_co_uk_food_recipes_watercresssaladwiths_80849", "title": "Ensalada de berros con tomates dulces", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["300ml / 10fl oz de caldo de verduras", "1 puñado de berros, sin tallos", "1 huevo de gallinas camperas", "2 cucharadas de vinagre de vino blanco", "1 cucharada de queso cheddar rallado"], "method": ["Deje que el caldo hierva a fuego lento en una sartén, luego agregue el berro y cocine a fuego lento durante 1-2 minutos, o hasta que el berro se marchite. Licúe hasta que quede suave con una batidora y manténgalo caliente.", "Poner a hervir una olla de agua, luego reducir a fuego lento y agregar el vinagre. Rompe el huevo en un tazón. Agite el agua con una cuchara de madera para formar una bañera de hidromasaje, luego vierta el huevo en el centro del remolino. Cueza durante 2 o 3 minutos, o hasta que los blancos se hayan terminado, luego retírelos con una espumadera y escurra sobre papel de cocina.", "Para servir, ponga la sopa en un tazón y coloque el huevo escalfado encima. Adorne con una pizca de queso cheddar rallado."], "url": "www_bbc_co_uk_food_recipes_watercresssoupwithap_90700", "title": "Sopa de berros con huevo escalfado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["20g / 1oz de mantequilla sin sal", "100 g / 3½ oz de cebolla blanca, finamente picada", "1 diente de ajo, finamente picado", "300g / 10½oz de berro, tallos resistentes eliminados", "sal marina y pimienta negra recién molida", "100 g / 3½ oz de hojas de espinaca", "500ml / 17½fl oz de agua hirviendo", "Cubitos de hielo de 500 g / 17½", "100 ml / 3½ fl oz crema fresca"], "method": ["En una cacerola grande a fuego medio, derrita la mantequilla y cocine suavemente la cebolla picada y el ajo durante 2-3 minutos, o hasta que estén suaves y translúcidos, pero no coloreados. Este edulcorante suave de la cebolla y el ajo transformará los almidones naturales presentes en azúcar, dando ese delicioso sabor de cebolla endulzada, en contraposición al sabor de cebolla cruda y dura.", "Aumente el fuego a alto, agregue el berro y una pizca de sal, cubra con una tapa y cocine durante 30 segundos. Agregue la espinaca y cocine durante 1-2 minutos, o hasta que se marchite. La espinaca redondeará las fuertes cualidades a pimienta del berro.", "Vierta el agua hirviendo y cocine a fuego lento durante 2-3 minutos, luego retire del fuego y agregue el hielo. Esta cocción rápida de las verduras y el enfriamiento con hielo no solo conservará el color y el sabor, sino que también maximizará las vitaminas y los minerales.", "Vierta la mitad de la sopa en un procesador de alimentos, y mezcle hasta que quede suave. Transfiera la sopa a una sartén limpia, luego repita con la sopa restante.", "Cuando esté listo para servir, vuelva a calentar la sopa y sazónese, al gusto, con sal y pimienta negra recién molida si es necesario. Sirve la sopa en una sopera grande con la crème fraîche arremolinándola."], "url": "www_bbc_co_uk_food_recipes_watercresssoup_93505", "title": "sopa de berro", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "25g / 1oz de mantequilla", "½ cebolla, finamente picada", "1 diente de ajo, finamente picado", "300ml / 10fl oz de caldo de verduras", "Crema doble 50ml / 2fl oz", "75g / 2¾oz de berros", "1 loncha de tocino ahumado, picado", "1 cucharada de yogur al estilo griego"], "method": ["Caliente el aceite y la mantequilla en una sartén y fríe con cuidado la cebolla y el ajo hasta que estén blandos, alrededor de 3-4 minutos.", "Vierta el caldo de verduras y cocine a fuego lento. Agregue la crema y el berro, mezcle bien y cocine a fuego lento. Deje que se enfríe un poco, luego mezcle con una batidora manual hasta que quede suave.", "Para servir, coloca el tocino picado en una sartén y freír hasta que estén crujientes.", "Vierta la sopa en un recipiente para servir poco profundo. Adorne con una cucharada de yogur y espolvoree sobre el tocino."], "url": "www_bbc_co_uk_food_recipes_watercresssoupwithcr_88658", "title": "Sopa de berros con tocino crujiente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50g / 2oz de mantequilla", "2 chalotes de plátano grandes, toscamente picados", "125 g / 4 ½ oz papas Royal Jersey, lavadas, lavadas y cortadas en rodajas finas", "450ml / 16fl oz de caldo de pollo (los vegetarianos pueden sustituir el caldo de verduras)", "225g / 8oz de berros, más o menos picados", "150ml / 5fl oz de crema doble", "sal y pimienta negra recién molida", "pizca de nuez moscada recién rallada", "Papas Royal Jersey de 400g / 14oz, lavadas", "75g / 3oz de mantequilla", "4 cucharadas de cebollín, finamente picado", "Crema doble 110ml / 4fl oz", "½ limón, solo jugo", "sal y pimienta negra recién molida", "berro, para adornar"], "method": ["Para la sopa, caliente una sartén hasta que esté caliente, luego agregue la mantequilla y los chalotes y fría durante 2-3 minutos a fuego lento hasta que se ablanden, pero no se doren.", "Agregue las papas y el caldo y lleve a ebullición, luego reduzca el fuego a fuego lento durante 8-9 minutos, hasta que las papas estén tiernas.", "Agregue el berro y continúe cocinando a fuego lento por dos minutos, luego retírelo del fuego y déjelo enfriar por 2-3 minutos.", "Vierta la sopa en un procesador de alimentos y mezcle hasta que quede suave.", "Regrese la sopa a la sartén y agregue la crema. Sazonar, al gusto, con sal y pimienta negra recién molida y rallar en una pizca de nuez moscada.", "Para los Jersey Royals, coloque las papas en una sartén a fuego medio y cúbralas con agua. Llevar a ebullición, luego cocinar durante 8-10 minutos, o hasta que estén tiernos. Escurra las papas, luego regrese a la sartén.", "Agregue la mantequilla y el cebollino y aplaste las papas con la parte posterior de un tenedor.", "Mientras tanto, vierta la crema en un tazón y agregue el jugo de limón, la sal y la pimienta negra recién molida. Batir la crema hasta que se formen picos suaves cuando se quite la batidora.", "Para servir, coloque una cucharada grande de papas trituradas en el centro de cada uno de los cuatro cuencos de sopa poco profundos. Sirva la sopa alrededor de las papas molidas, dejando visibles las islas de papa. Cubra cada montón de patatas trituradas con una cucharada de crema agria y unas ramitas de berros."], "url": "www_bbc_co_uk_food_recipes_watercresssoupwithcr_88999", "title": "Sopa de berros con patatas machacadas Jersey Royal y cebolletas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "4 cebolletas, finamente picadas", "puñado de perejil fresco, picado", "150ml / ¼ pinta de caldo de verduras calientes", "manojo de berros, picado (una cucharada reservada para decorar)", "Crema doble de 150 ml / 1/4 de pinta", "sal y pimienta negra recién molida", "2 cucharadas de aceite de oliva", "3 rebanadas de pan de ciabatta", "75g / 2½oz de queso Taleggio, en rodajas", "pimienta negra recién molida"], "method": ["Para hacer la sopa, caliente el aceite de oliva en una cacerola pequeña a fuego medio, agregue las cebolletas y el sudor durante 2 minutos o hasta que se ablanden.", "Agregue el perejil fresco, el caldo y el berro y cocine a fuego lento durante cinco minutos.", "Agregue la crema, condimente, al gusto, con sal y pimienta negra recién molida y cocine a fuego lento durante un minuto más.", "Licuar con una batidora de mano hasta que quede suave y verter en un bol.", "Para preparar el crostini, precaliente la parrilla en alto. Frote el aceite de oliva sobre el pan ciabatta y cubra con las rebanadas Tallegio. Sazonar, al gusto, con pimienta negra y colocar debajo de la parrilla durante 2-3 minutos, hasta que se derrita y se ponga dorado.", "Para servir, coloque el tazón de sopa de berros en un plato grande con el crostini colocado al lado."], "url": "www_bbc_co_uk_food_recipes_watercresssoupwithta_82132", "title": "Sopa de berros con Taleggio crostini", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva, más 1 cucharadita extra, para servir", "½ cebolla, finamente rebanada", "1 manojo de berros", "1 diente de ajo, picado", "150ml / ¼ pinta de caldo de verduras", "1 huevo de gallinas camperas"], "method": ["Caliente la cucharada de aceite de oliva en una cacerola y agregue la cebolla. Cocine la cebolla hasta que esté suave pero no coloreada.", "Corta los tallos del berro, reserva las hojas y agrégalas a la sartén con el ajo. Saltee el berro y el ajo por un minuto más.", "Agregue el caldo a la sartén, lleve a ebullición y cocine a fuego lento durante cinco minutos.", "Retire la sartén del fuego, deje enfriar un poco y agregue las hojas de berros. Vierta en una licuadora. Mezcle hasta que quede suave y cuele a través de un colador. Vierta en un recipiente para servir y reserve para mantener el calor.", "Para el huevo escalfado, ponga a hervir un sartén con agua con sal y agite suavemente el agua alrededor de la sartén para hacer un remolino. Agriete el huevo en el medio de la bañera de hidromasaje y reduzca a fuego lento durante cuatro minutos.", "Levante con cuidado el huevo escalfado fuera del agua con una cuchara ranurada y flote en el centro de la sopa.", "Para servir, rocíe la sopa con la cucharada extra de aceite de oliva y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_watercresssoupwithpo_87043", "title": "Sopa de berros con huevo escalfado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["550g / 1lb 4oz de sandía, pelada, picada", "¼ limón, solo jugo", "hojas de menta fresca"], "method": ["Mash la sandía en un recipiente, luego agregue el jugo de limón.", "Tamiza la sandía en una jarra y presiona suavemente sobre la pulpa para extraer todo el jugo.", "Vierta el jugo en vasos llenos de hielo y adornar con la menta."], "url": "www_bbc_co_uk_food_recipes_watermelon_cooler_57906", "title": "Enfriador de sandía", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 pepino", "250 g / 9 oz de queso feta, cortado en cubos", "24 aceitunas calamata", "puñado de cohetes hojas", "½ sandía, cortada en cuñas", "100ml / 3½fl oz de vinagre de sidra", "Jengibre fresco de 2.5cm / 1in, rallado", "2 cucharadas de menta fresca picada", "1 lima, solo jugo", "300ml / 10fl oz de aceite de oliva virgen extra", "sal y pimienta negra recién molida", "pan pitta caliente, para servir"], "method": ["Para la ensalada, corte el pepino por la mitad a lo largo y saque las semillas con una cucharadita, luego córtelas en 2,5 cm / 1 en medias lunas. Coloque en un tazón grande con los ingredientes restantes de la ensalada, excepto la sandía.", "Para el aderezo, coloque el vinagre, el jengibre, la menta, el jugo de lima y el aceite de oliva en un bol, sazone con sal y pimienta negra recién molida y mezcle bien.", "Para servir, vierta el aderezo sobre la ensalada y mezcle bien. Coloque las rodajas de sandía alrededor de la ensalada y sírvalas con pan de pita caliente."], "url": "www_bbc_co_uk_food_recipes_watermelonandfetasal_86516", "title": "Sandía y ensalada de feta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["125g / 4oz de azúcar en polvo", "125ml / 4oz de agua", "1 vaina de vainilla, solo semillas", "Jugo de sandía de 600 ml / 1 pinta (hecho de la carne de 1 sandía, sin semillas, mezclado y tamizado)", "4 limas, solo jugo"], "method": ["Coloque las semillas de azúcar, agua y vainilla en una sartén a fuego medio. Caliente hasta que el azúcar se disuelva, luego retírelo del fuego y déjelo enfriar.", "Transferir a la nevera y enfriar hasta que esté muy frío.", "Agregue el jugo de sandía y el jugo de lima y mezcle bien.", "Vierta la mezcla de fruta en ocho moldes de polo de hielo y coloque en el congelador toda la noche hasta que se congele."], "url": "www_bbc_co_uk_food_recipes_watermelonicelollies_89302", "title": "Paletas de hielo de sandía", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Rinde 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/watermelonicelollies_89302_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Carne de sandía de 1.2kg / 2lb10oz", "200 g / 7 oz de azúcar en polvo", "2 limones, solo jugo", "200 g / 7 oz de fresas, descuartizado", "225 g / 8 oz de leche en polvo", "Harina normal de 50g / 2oz", "1/4 cucharadita de polvo de hornear", "½ pb de bicarbonato de soda", "Crema doble 175ml / 6fl oz", "25g / 1oz de mantequilla derretida", "75ml / 3fl oz de agua", "200 g / 7 oz de azúcar en polvo", "1 cucharadita de agua de rosas", "4 ramitas de menta, para servir"], "method": ["Para el sorbete, corte aproximadamente un kilogramo (2 libras 2 oz) de la sandía y coloque en un procesador de alimentos con el azúcar y el jugo de limón. Mezclar hasta que esté suave.", "Colar a través de un colador en una máquina de helados y batir hasta que se congele.", "Corte la sandía restante en finas cuñas y déjela a un lado.", "Para el gulab jamun, precaliente una freidora a 170C / 350F.", "Coloque la leche en polvo, la harina, el polvo de hornear y el bicarbonato de soda en un bol y mezcle para combinar. Agregue la mitad de la crema y mezcle bien.", "Agregue la mantequilla y la cantidad restante de crema según sea necesario para formar una masa suave y ligeramente pegajosa.", "Forme la masa en bolitas y colóquela en la freidora. Freír por 2-3 minutos hasta que estén dorados y cocidos.", "Retire con una espumadera y escurra sobre papel de cocina.", "Mientras tanto, haz el jarabe. Coloque el agua, el azúcar y el agua de rosas en una sartén y deje hervir. Reduzca el fuego y cocine a fuego lento durante 1-2 minutos.", "Divida el jarabe entre dos tazones. Coloque el jamun frito en uno de los cuencos y mezcle para cubrir con el jarabe. Deje que absorba el jarabe por 10 minutos.", "Vierta el resto del almíbar sobre las rodajas de sandía reservadas y las rodajas de fresa y déjelas durante 10 minutos.", "Para servir, coloque varias rodajas de sandía en el centro de un plato para servir, luego esparza con algunas de las fresas. Cubra con algunos gulab jamun y una cucharada de sorbete de sandía. Adorne con una ramita de menta fresca."], "url": "www_bbc_co_uk_food_recipes_watermelonsorbetwith_86357", "title": "Sorbete de sandía con Gulab Jamun de agua de rosas y cuñas de sandía marinada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Pierna de cordero de 2.7kg / 6lb", "3 tallos de romero", "3-4 dientes de ajo, cortados en astillas", "6 patatas grandes, peladas y en rodajas finas", "4 cebollas, en rodajas finas", "sal marina y pimienta negra recién molida", "25g / 1oz de mantequilla, más un poco más para la salsa", "500ml / 18fl oz de caldo de pollo", "1 botella (750ml / 26fl oz) buen vino tinto", "1 litro / 1¾ pintas de caldo de carne", "75ml / 3fl de oz de vinagre de malta", "1 pizca de azúcar en polvo", "1 gran manojo de hojas de menta, finamente picado", "sal"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Con un pequeño cuchillo afilado y puntiagudo, haga una serie de pequeñas hendiduras profundas a unos 4cm / 1½ pulgadas de distancia en toda la pierna de cordero. En cada corte inserte una tira de ajo y una pequeña ramita de romero, presionándolos dentro.", "Rocíe con aceite de oliva y una buena cantidad de sal, luego reserve mientras prepara el plato de patatas.", "Coloque las papas y las cebollas en una bandeja grande a prueba de horno, condimente cada capa con sal y pimienta negra y termine con una capa de papas.", "Salpique con mantequilla, luego vierta sobre el caldo y presione ligeramente hacia abajo.", "Coloque el plato para asar en el fondo del horno y coloque el cordero sobre una rejilla pequeña en la rejilla del horno directamente encima de las papas (para que los jugos del cordero puedan \"llorar\" en las papas de abajo).", "Déjelos asar durante una hora y media, o hasta que las papas estén cocidas, presionando las papas hacia abajo en el líquido de cocción cada 30 minutos mientras se cocinan.", "Vierte el caldo de vino tinto y de res en una sartén o una sartén grande y ponlo a fuego medio, lleva a ebullición y cocina durante 30-45 minutos, o hasta que se reduzca a un cuarto del volumen original y espese para hacer un salsa brillante.", "Agregue un poco de mantequilla y revise el condimento.", "Retire el cordero del horno cuando esté cocinado a su gusto y déjelo reposar durante 15 minutos antes de tallar.", "Mientras tanto caliente el vinagre de malta, el azúcar y una pizca de sal en una cacerola limpia hasta que hierva a fuego lento, luego agregue la menta y revuelva hasta que se marchite.", "Para servir, esculpe el cordero y sirva con las papas, la salsa y la salsa de menta."], "url": "www_bbc_co_uk_food_recipes_weeping_lamb_with_79676", "title": "Cordero llorón con patatas boulangère y salsa de menta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Pierna de cordero de 2.7kg / 6lb", "50g / 2oz de mantequilla, ablandada", "3 tallos de romero", "3-4 dientes de ajo, cortados en astillas", "50ml / 1¾fl oz de aceite de oliva", "6 papas, peladas y en rodajas finas", "4 cebollas, en rodajas finas", "sal y pimienta negra", "450ml / 16fl oz de caldo de pollo o cordero", "Hojas de ensalada mixta de 300g / 11oz", "1 limón, jugo"], "method": ["Precalentar el horno a 230C / 450F / Gas 8.", "Frote la carne con mantequilla ablandada y colóquela en una lata para asar.", "Usando un cuchillo pequeño, afilado y puntiagudo, haga una serie de pequeñas hendiduras profundas a unos 4cm (1½ pulgadas) de distancia en toda la pierna de cordero, insertando una tira de ajo y una pequeña ramita de romero en cada hendidura.", "Vierta una cucharada más o menos del aceite de oliva sobre la carne y cocínelo durante aproximadamente 30 minutos.", "Mientras la carne se cocina, coloque las papas y las cebollas en un tazón, mezcle y sazone.", "Después de 30 minutos, saca la carne del horno y sácala de la lata.", "Coloque las papas y las cebollas en la grasa del estaño y vierta sobre el caldo.", "Regrese la lata de asar al estante bajo y coloque el cordero directamente en el estante justo arriba, para que los jugos 'lloren' en las papas.", "Asar durante aproximadamente una hora más dependiendo de qué tan bien te guste tu carne cocinada.", "Vierta las hojas de la ensalada con el limón y el aceite de oliva restante, luego sazone con sal y pimienta.", "Tallar el cordero y servir con las papas y la ensalada."], "url": "www_bbc_co_uk_food_recipes_weepinglambwithboula_83920", "title": "Cordero llorón con patatas boulangere", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Pierna de cordero de 2.7kg / 6lb", "aceite de oliva", "55g / 2oz de mantequilla suavizada", "3-4 dientes de ajo, cortados en astillas", "6 papas", "4 cebollas", "455ml / 16 fl oz de caldo de pollo o cordero", "ramitas de romero", "sal y pimienta negra"], "method": ["Precalentar el horno a 230C / 450F / Gas 8.", "Con un pequeño cuchillo afilado y puntiagudo, haga una serie de pequeñas hendiduras profundas de aproximadamente 1 ½ pulgadas de distancia en toda la pierna de cordero e inserte una astilla de ajo y una pequeña ramita de romero.", "Frote la carne con mantequilla ablandada y colóquela en una lata para asar. Vierte un poco de aceite de oliva y cocina por unos 30 minutos.", "Mientras la carne se cocina, pele y corte finamente las papas y las cebollas. Mézclalos en un tazón y sazónalos.", "Después de la primera media hora, saca la carne del horno y sácala de la lata.", "Coloque las papas y las cebollas en la grasa y vierta sobre el caldo. Regrese la lata de asar al estante bajo y coloque el cordero en el estante justo arriba, para que los jugos 'lloren' en las papas.", "Asar durante aproximadamente una hora más dependiendo de qué tan bien te guste tu carne cocinada. Sirva con una ensalada verde aderezada."], "url": "www_bbc_co_uk_food_recipes_weepinglamb_67701", "title": "Cordero llorón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]