[{"ingredients": ["70 g / 2½ oz de mantequilla sin sal, ablandada", "Azúcar glas de 70g / 2½oz", "2 claras de huevo de gallinas camperas", "Harina normal de 80g / 3oz, tamizada", "1 cucharadita de esencia de regaliz", "½-1 cucharadita de pasta colorante para alimentos negros", "3 huevos grandes de gallinas camperas, a temperatura ambiente", "75 g / 2½ oz de azúcar en polvo, más extra para rociar", "Harina de auto crianza de 75g / 2½ oz", "75g / 2½oz de mantequilla, suavizada", "225g / 8oz de azúcar glasé", "1 cucharada de leche", "½ cucharadita de esencia de regaliz", "200 g / 7 oz de grosella negra"], "method": ["Precalienta el horno a 200 ° C (ventilador de 180 ° C) / 400 ° F / Gas 6. Engrasa y coloca una lata de rodillo suizo con pergamino para hornear.", "Para la pasta de esponja decorativa, unte la mantequilla y el azúcar glas juntos hasta que estén suaves y esponjosos y luego agregue gradualmente las claras de huevo, batiendo continuamente. Dobla la harina y agrega la esencia de regaliz y la pasta de colorante para alimentos y bate hasta que la mezcla esté negra. Ponga una cuchara en una manga pastelera equipada con una boquilla de tubería plana y pise seis líneas diagonales a través de la lata. Refrigera la lata mientras preparas la masa para pasteles.", "Para la esponja, coloque los huevos y el azúcar impalpable en un tazón grande y bata con una batidora eléctrica de mano hasta que la mezcla esté liviana y espumosa y deje un rastro cuando se quite la batidora. Tamice la harina sobre la mezcla y dóblela cuidadosamente con una cuchara grande de metal o una espátula de goma.", "Vierta suavemente la mezcla en la lata, dando a la lata un poco de batido para que la mezcla encuentre su propio nivel; empuje suavemente la mezcla en las esquinas si es necesario. Hornee durante 10-12 minutos, o hasta que la esponja se dore y comience a encogerse a los lados de la lata.", "Coloque dos hojas de papel pergamino (cortado un poco más grande que el tamaño de la lata) en una superficie de trabajo y espolvoree una con azúcar impalpable. Tan pronto como la esponja esté cocida, apáguela sobre la hoja de papel azucarado y retire con cuidado el papel de revestimiento. Coloque la otra hoja de papel sobre la parte superior con rayas y dé la vuelta, de modo que las líneas negras queden debajo. Dejar de lado para enfriar.", "Para el relleno, bata la mantequilla, el azúcar glas, la leche y la esencia de regaliz en un tazón hasta que quede suave.", "Una vez que se haya enfriado, deseche el papel azucarado, recorte los bordes de la esponja con un cuchillo afilado y marque una línea a través de la esponja de 2 cm por cada uno de los bordes cortos. Extienda una capa uniforme de crema de mantequilla sobre la esponja.", "Extender una capa uniforme de mermelada sobre la crema de mantequilla. Enrolle firmemente el rollo suizo comenzando en el extremo marcado y usando el papel para ayudarlo."], "url": "www_bbc_co_uk_food_recipes_blackcurrant_and_96079", "title": "Grosella negra y regaliz Rollo suizo", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Sirve 8-10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/blackcurrant_and_96079_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500 g / 1 libra 2 oz de grosellas frescas, tallos eliminados, más extra para servir", "100 g / 3½ oz de azúcar en polvo", "3 cucharadas de agua", "3 cucharadas de crème de cassis", "6 hojas de gelatina", "Crema doble 350ml / 12fl oz, más extra para servir", "350ml / 12fl oz de leche entera"], "method": ["Coloque las grosellas negras, el azúcar y el agua en una sartén a fuego medio y cocine suavemente durante diez minutos, revolviendo regularmente, o hasta que las bayas comiencen a descomponerse.", "Cuele el contenido de la sartén a través de un colador en una sartén limpia, exprimiendo las bayas a través del tamiz con el dorso de una cuchara de madera para formar un puré. Esto debería producir aproximadamente 300ml / 10½fl oz de jugo.", "Agregue la crème de cassis, mezcle bien y reserve.", "Mientras tanto, en un tazón, cubra las hojas de gelatina con agua fría. Dejar de lado durante cinco minutos para suavizar.", "Mientras tanto, caliente la crema y la leche en una sartén hasta que esté a punto de hervir, luego retírela del fuego. Exprima el exceso de agua de las hojas de gelatina empapadas, luego agréguelos a la mezcla de crema caliente, revolviendo hasta que se disuelvan.", "Revuelva la mezcla de crema en la mezcla de grosella negra hasta que esté suave y bien combinada (gusto, luego agregue un poco de azúcar extra si es necesario).", "Enjuague un molde de gelatina de 1 litro / 1¾ pinta con agua fría. Vierta la mezcla de crema de grosella negra en el molde preparado y cubra con una película adhesiva. Enfríe en la nevera durante 7-8 horas, o hasta que esté listo.", "Retire la película adhesiva y sumerja el molde en un recipiente grande con agua recién hervida hasta que el agua llegue casi hasta los costados. Suspenda el recipiente en el agua caliente durante cinco segundos (ya no), luego, con la punta de los dedos, presione alrededor del borde de la crema de grosella negra para romper el sello. Invierta el molde de budín o el molde de gelatina en un plato de servir y toque la parte superior del molde. (NB: la crema de grosella negra debe ser liberada en la placa; de lo contrario, repita el proceso).", "Para servir, corte la crema de grosella negra en rodajas. Adorne con los restos de grosellas negras y rocíe sobre la crema."], "url": "www_bbc_co_uk_food_recipes_blackcurrantcream_91972", "title": "Crema de grosella negra", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Rinde 1 x 1 litro / 1.75 pintas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["150 g / 5½ oz de grosellas frescas", "Azúcar en polvo de 55 g / 2 oz", "2 cucharadas de licor de cassis", "½ cucharadita de jengibre fresco rallado", "4 claras de huevo de gallinas camperas", "225 g / 8 oz de azúcar en polvo", "1 vaina de vainilla, solo semillas"], "method": ["Coloque las grosellas negras, el azúcar, el licor de cassis y el jengibre rallado en una olla pequeña y cocine a fuego lento a fuego moderado hasta que estén espesos y almibarados. Coloque la mezcla de grosella negra en un plato gratinado.", "En un recipiente limpio y sin grasa, bata las claras de huevo hasta que se formen picos rígidos cuando se quite el batidor.", "Poco a poco agregue el azúcar en polvo a las claras de huevo, una cucharada a la vez, batiendo continuamente hasta que la mezcla esté espesa y brillante.", "Dobla las semillas de vainilla en las claras de huevo y mezcla bien para combinar.", "Coloque la mezcla de clara de huevo sobre las grosellas negras para cubrir completamente.", "Dorar el merengue con un mini soplete hasta que se dore por completo. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_blackcurrantmeringue_87044", "title": "Merengue de grosella negra", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Lentejas negras 150g / 5oz (urad dal)", "Lentejas verdes 50g / 2oz (moong dal)", "480ml / 17fl oz de agua", "3 cucharadas de aceite de oliva", "1 cebolla grande, finamente picada", "4 dientes de ajo, finamente picados", "2 chiles verdes, finamente picados", "¼ cucharadita de cúrcuma molida", "½ cucharadita de comino molido", "½ ramita de canela, rota en pedazos", "4 dientes", "sal y pimienta negra recién molida", "1 tomate grande, picado", "1 cucharadita de azúcar en polvo", "exprimir jugo de limón", "pequeño puñado de cilantro picado fresco"], "method": ["Coloque las lentejas negras y verdes en una olla mediana, agregue el agua y deje que hierva. Reduzca el fuego y cocine a fuego lento durante 20 minutos, o hasta que esté tierno. Escurrir, luego machacar las lentejas y dejar de lado.", "Calentar el aceite de oliva en una sartén, agregar la cebolla y freír hasta que comience a colorear. Agregue el ajo y fría por unos segundos.", "Agregue los chiles finamente picados, la cúrcuma, el comino, la canela, el clavo de olor, la sal y la pimienta negra recién molida y cocínelos durante un minuto, revolviendo constantemente.", "Agregue el tomate picado, el azúcar y un chorrito de jugo de limón y cocine por 2-3 minutos.", "Agregue las lentejas machacadas y deje que hierva.", "Agregue un puñado grande de cilantro picado y sirva."], "url": "www_bbc_co_uk_food_recipes_blackdal_89042", "title": "Black dal", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 2-3", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/blackdal_89042_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 cucharadas de miel", "pizca de sal", "1 corona de pato (aproximadamente 2 kg / 4 lb 8 oz)", "2 papas King Edward grandes, peladas y en cubos, luego escurridas, esparcidas en una bandeja y congeladas", "150 g / 5½ oz de guisantes de petit pois frescos", "1 ramita de menta", "manojo pequeño zanahorias y nabos primaverales jóvenes", "botón de mantequilla", "1 cantidad de reserva de pato, reducida a consistencia de salsa y luego terminada con una pizca de hidromiel, al gusto"], "method": ["Para el pato, precalentar el horno a 200C / 180C Fan / Gas 6.", "Ponga la miel y una buena pizca de sal en una cacerola con 4 cucharadas de agua. Lleve a ebullición y luego apague el fuego (no reduzca el líquido, de lo contrario, el glaseado se volverá demasiado almibarado y podría arder). Cepille el glaseado sobre las coronas de pato.", "Coloque las coronas de pato con la pechuga hacia arriba sobre una rejilla, colocada en una lata de asar. Asar durante 10 minutos, luego bajar la temperatura a 180 ° C / 160 ° C Fan / Gas 4 y asar durante 20 minutos más, o hasta que la piel esté crujiente y profundamente dorada. Retire del horno y deje en un lugar cálido para descansar durante 10 minutos.", "Para las verduras, precaliente una freidora a 180 ° C o, alternativamente, llene una olla profunda con aceite y caliente hasta que la miga de pan chisporrotee y se ponga dorada cuando la deje caer (Precaución: el aceite caliente puede ser peligroso. No lo deje sin supervisión. )", "Quite los senos del hueso, colóquelos en una bandeja y termine debajo de una parrilla mediana alta.", "Mientras tanto, fría las patatas durante 3-4 minutos hasta que estén doradas y crujientes. Retire con una espumadera y escurra sobre papel de cocina.", "Cocine los guisantes en agua hirviendo con una ramita de menta durante 1-2 minutos. Cocine las zanahorias y los nabos para bebés en agua hirviendo con sal durante 3 minutos, luego transfiera a una sartén con un poco de mantequilla y freír suavemente hasta que estén tiernos.", "Sirve el pato y las papas con zanahorias, guisantes y nabos. Termine con el stock reducido de pato."], "url": "www_bbc_co_uk_food_recipes_blackened_norfolk_05776", "title": "Corona de anguila ennegrecida ennegrecida", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["60ml / 2¼fl oz de sake", "60ml / 2¼fl oz", "4 cucharadas de pasta de miso blanco", "3 cucharadas de azúcar en polvo", "4 x 150 g / 5¼ oz de filetes de salmón", "1 berenjena", "8 bebé berenjena", "Jengibre de raíz de 2 cm / 1 in, pelado, cortado en rodajas finas", "4 cucharadas de pasta de miso", "2 cucharadas de azúcar en polvo", "2 cucharadas de mirin", "1 cucharada de salsa de soja", "coriander cress", "berro de amaranto rojo"], "method": ["Para el salmón ennegrecido, mezcle el sake, el mirin, la pasta blanca de miso y el azúcar impalpable en un plato poco profundo. Agregue el salmón a la mezcla, cubra y adobe en la nevera durante 24 horas.", "Caliente una sartén mediana a la plancha, limpie cualquier exceso de adobo del salmón y colóquelo en la plancha. Cocine por tres minutos en cada lado, o hasta que esté cocido a su gusto.", "Para el miso berenjena, precalentar el horno a 200C / 400F / Gas 6.", "Hornee la berenjena por 20 minutos o hasta que esté suave. Retire las berenjenas y reserve. Corte las berenjenas a la mitad y colóquelas en una bandeja para hornear. Con un cuchillo afilado, marque un patrón entrecruzado en las berenjenas para bebés, colóquelas en la bandeja para hornear y cocine durante 10 minutos.", "Mientras tanto, caliente la pasta de miso, el azúcar, el mirin, la salsa de soja y el jengibre en una sartén pequeña a fuego lento.", "Saca la carne de berenjena y colócala en un pequeño procesador de alimentos con dos cucharadas de la mezcla de miso. Mezcle hasta obtener un puré y reserve.", "Precalentar la parrilla a caliente. Vierta la mezcla de miso sobrante sobre las berenjenas para bebés y colóquela debajo de la parrilla durante dos minutos.", "Sirva el puré de berenjena con el salmón a la plancha y las berenjenas a los lados. Adorne con el berro de cilantro y el amaranto rojo."], "url": "www_bbc_co_uk_food_recipes_blackened_salmon_with_04412", "title": "Salmón ennegrecido con puré de miso berenjena", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 cucharadas de condimento cajún", "1 cucharadita de orégano seco", "4 filetes de salmón, aproximadamente 75 g / 3 oz cada uno", "aceite de girasol, cepillar", "cuñas de lima, para adornar", "400 g de frijoles de hoja negra, enjuagados y escurridos", "2 cucharadas de aceite de oliva", "1 aguacate, pelado, apedreado y picado", "2 tomates de ciruela, finamente picados", "1 pimiento amarillo, sin semillas y finamente picado", "2 cucharadas de jugo de lima", "sal y pimienta negra recién molida"], "method": ["Mezcle el condimento de Cajun y el orégano en un recipiente poco profundo.", "Cepille el salmón en ambos lados con un poco de aceite y cubra con la mezcla de especias, asegurándose de que el pescado esté completamente cubierto. Dejar de lado.", "Mientras tanto, para la salsa mezcle todos los ingredientes en un tazón. Sazone al gusto y reserve.", "Calentar una sartén a fuego medio, freír el salmón en seco por 4 minutos a cada lado.", "Cortar el salmón y echar la salsa, adornar con rodajas de lima y servir."], "url": "www_bbc_co_uk_food_recipes_blackened_salmon_with_67385", "title": "Salmón ennegrecido con salsa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/blackened_salmon_with_67385_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 cebolla picada", "1 diente de ajo, picado", "½ pimiento amarillo, picado", "1-2 chiles chipotle ahumados, o al gusto (disponible en algunos supermercados y proveedores en línea)", "100g / 3½oz de frijoles negros en lata, enjuagados y escurridos", "2 cucharadas de ketchup de tomate", "1 cebolla roja, cortada en 8 cuñas", "1 cucharada de aceite de oliva", "1 cucharada de vinagre balsámico", "1 cucharada de azúcar en polvo", "1 lima, solo jugo", "100ml / 3½ fl oz crema agria", "½ aguacate, pelado, removido de piedra, picado", "pequeño cilantro fresco puñado, picado", "sal y pimienta negra recién molida", "4 rebanadas de chapata, tostadas, para servir"], "method": ["Para el estofado, caliente el aceite en una sartén y saltee la cebolla y el ajo hasta que se ablanden.", "Agregue los ingredientes restantes del guiso y cocine a fuego lento durante 6-8 minutos, o hasta que los vegetales estén tiernos y el estofado se haya espesado.", "Para la cebolla roja a la parrilla, coloque las rodajas de cebolla en un bol con el aceite, el vinagre y el azúcar y mezcle bien.", "Caliente una sartén hasta que esté humeante, luego coloque las rodajas de cebolla roja durante 1-2 minutos por cada lado, o hasta que estén ligeramente carbonizadas y suavizadas.", "Para la salsa de crema agria, coloque todos los ingredientes de crema agria en un tazón y mezcle bien hasta que se combinen.", "Para servir, coloque el estofado en dos cuencos y cubra con las rodajas de cebolla y una cucharada de salsa de crema agria. Sirve con la chapata tostada."], "url": "www_bbc_co_uk_food_recipes_blackeyebeanstewwith_85933", "title": "Guiso de frijoles de ojos negros con crema agria", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharaditas de semillas de sésamo, tostadas", "¼ de cebolla roja, finamente picada", "1 diente de ajo, finamente picado", "½ estaño, frijoles de ojos negros, enjuagados y escurridos", "½ lima, solo jugo", "1 cucharada de aceite de oliva", "1 cucharada de cilantro fresco picado", "Yogur natural de 100 g / 3½ oz", "2 rebanadas de pan", "1 diente de ajo, finamente picado", "3 cucharadas de perejil picado", "35 g / 1½ oz de mantequilla"], "method": ["Para el chapuzón, coloca las semillas de sésamo en una licuadora hasta que estén finamente molidas. Mezcle con los ingredientes de inmersión restantes y reserve.", "Para los tostados de ajo, tueste el pan en una sartén con el ajo, la mantequilla y el perejil durante 2 minutos hasta que se dore. Sirve con la salsa."], "url": "www_bbc_co_uk_food_recipes_blackeyedbeandipwith_80911", "title": "Dip de frijol negro con tostadas de ajo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Pasta de tagliatelle de huevo fresco de 320 g / 11½ oz", "6 higos negros maduros", "2-3 cucharadas de aceite de oliva virgen extra", "1 diente de ajo, finamente cortado", "pizca de chile seco", "Crema doble 125ml / 4½fl oz", "sal marina y negro recién molida", "½ limón, solo jugo", "½ manojo de albahaca morada", "½ manojo de albahaca verde", "4 chiles rojos largos a la parrilla, pelados y sin semilla", "200 g / 7 oz de queso parmesano, afeitado con un pelador de verduras", "hojas extra de albahaca"], "method": ["Ponga a hervir una olla grande de agua con sal y vierta la pasta. Cocine por dos o tres minutos.", "Mientras tanto, quite los tallos de los higos y corte en cuartos y luego en octavos.", "Suavemente caliente el aceite en una sartén de fondo grueso, luego agregue el ajo y fría hasta que esté pegajoso y dorado.", "Agregue una pizca de chile seco y los higos picados. Freír suavemente durante aproximadamente uno o dos minutos.", "Agregue la crema y baje el fuego, llevando la salsa a fuego lento.", "Sazonar con sal, pimienta y un poco de limón.", "Agregue algunas de las diferentes hojas de albahaca y revuelva para combinar.", "Escurra la pasta y agregue a la salsa, revolviendo para combinar y cubrir la pasta.", "Corrija el condimento, si es necesario, y divídalo entre cuatro tazones para servir.", "Adorne con tiras de chile a la parrilla, unas cuantas hojas de albahaca y virutas de queso parmesano."], "url": "www_bbc_co_uk_food_recipes_blackfigandchillitag_83976", "title": "Tagliatelle negro de higos y chiles", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["mantequilla, para engrasar", "9 huevos de gallinas camperas", "255 g / 9 oz de azúcar en polvo", "200g / 7½ oz de harina de auto crianza, tamizada", "40 g / 1½ oz de cacao en polvo", "1 x 340g / 12oz (peso escurrido) jarras cerezas, escurrido, jugo reservado", "buena racha de Kirsch", "2 cucharadas de arrurruz", "Crema doble de 750 ml / 1¼ pinta, batida", "300 g / 10½ oz de chocolate negro", "½ cucharadita de esencia de menta", "Azúcar demerara 110 g / 4 oz", "50 g / 2 oz de almendras copos tostadas, para servir"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase y forme una lata honda de 26 cm / 10½ pulgadas en forma de resorte.", "Para la esponja, agriete los huevos en un tazón para mezclar, agregue el azúcar y bata bien hasta que esté suave y esponjoso, y se forma un rastro similar a una cinta cuando se quita el batidor. Doble suavemente la harina tamizada y el polvo de cacao. Vierta la mezcla en la lata preparada, transfiérala al horno y hornee durante aproximadamente 55 minutos, o hasta que se haya levantado y cocinado completamente. Déle vuelta a una rejilla y déjelo enfriar.", "Para el relleno, coloque las cerezas en un recipiente con el Kirsch. Coloque el jugo de cereza del tarro en una sartén y deje que hierva. Mientras el jugo se calienta, mezcle el arrurruz con un poco de agua en un tazón pequeño para hacer una pasta. Cuando el jugo de cereza esté hirviendo, mezcle la pasta de arrurruz en él, luego cuele a través de un colador en el tazón con las cerezas y deje enfriar.", "Corta la esponja enfriada en tres capas con un cuchillo de pan afilado. Coloque las tres capas juntas usando la crema batida (reserve un poco para unir los trozos de chocolate) y la mitad de las cerezas en el almíbar.", "Para los fragmentos de chocolate, coloque el chocolate en un tazón resistente al calor colocado sobre una olla de agua hirviendo a fuego lento y el calor, revolviendo ocasionalmente, hasta que se derrita y suavice. Agregue la esencia de menta y el azúcar, luego distribuya la mezcla en una bandeja llena de película adhesiva y déjela enfriar. Coloque en la nevera para establecer.", "Cuando el chocolate esté listo, divídalo en fragmentos grandes y adhiéralo al borde de la torta, usando una pequeña crema batida en la parte posterior para mantener los fragmentos en su lugar.", "Para servir, cubra con las cerezas restantes y las almendras."], "url": "www_bbc_co_uk_food_recipes_blackforestgateau_86364", "title": "Black Forest gâteau con trozos de menta chocolate", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Sirve 8-10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["225 g / 8oz de mantequilla sin sal, más extra para engrasar", "225 g / 8 oz de azúcar en polvo", "Harina normal 225g / 8oz", "1½ cucharadita de polvo de hornear", "3 cucharadas de cacao en polvo", "4 huevos grandes", "2 cucharaditas de arrurruz", "450 g / 1 libra de cerezas conservadas de morello", "275ml / 10fl oz de crema doble", "1 cucharada de azúcar en polvo", "2-3 cucharadas de ron", "50 g / 2 oz de chocolate negro"], "method": ["Precalentar el horno a 190C / 380F / Gas 5.", "Unte con mantequilla dos moldes para hornear redondos de 20cm / 8in y luego forre con un pergamino horneado con mantequilla.", "Batir la mantequilla y el azúcar juntos hasta que estén ligeros y esponjosos.", "Tamiza la harina, el polvo de hornear y el cacao en un tazón limpio.", "Batir los huevos en la mezcla de mantequilla y azúcar, uno a la vez.", "Doble suavemente la harina tamizada con una cuchara de metal.", "Divida la mezcla entre las dos latas de torta preparadas y colóquela en el horno para hornear durante 20-25 minutos, o hasta que las partes superiores de la torta vuelvan hacia atrás cuando se presione ligeramente con el dedo.", "Retire del horno y deje que los pasteles se enfríen en sus latas durante cinco minutos, luego colóquelos en una rejilla de alambre, retire el pergamino para hornear y deje hasta que estén completamente fríos.", "Mientras tanto, para el relleno, drene las cerezas, reservando seis cucharadas de jarabe. Coloque el jarabe reservado en una sartén pequeña y caliente suavemente.", "Mezcle el arrurruz con dos cucharadas de agua y agregue al almíbar caliente, revolviendo constantemente hasta que la salsa se espese.", "Agregue una cucharada de ron, luego retírelo del fuego y déjelo enfriar.", "Cortar los bizcochos por la mitad y espolvorear cada mitad con el ron restante.", "Corte las guindas drenadas por la mitad (quitando las piedras si es necesario). Deje 10-12 cerezas enteras para la decoración.", "Batir la crema y el azúcar juntos en un bol hasta que se formen picos suaves cuando se quite el batidor.", "Reserve la mitad de la mezcla de crema para cubrir la parte superior de la torta. Revuelva las cerezas a la mitad y el jarabe calentado.hasta la mitad restante de la crema.", "Extienda un tercio de la mezcla de crema y cereza en un lado de una capa del pastel. Agregue una segunda capa y extiéndala con más crema de cereza. Agregue una tercera capa de pastel y extienda la crema de cereza restante sobre la parte superior.", "Cubra con la última porción de pastel y cubra con la crema batida reservada.", "Rallar el chocolate negro sobre la parte superior y decorar con las cerezas enteras reservadas."], "url": "www_bbc_co_uk_food_recipes_blackforestgateau_89161", "title": "Selva de la Selva Negra con ron", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["340g / 12oz de azúcar en polvo de oro", "Mantequilla sin sal 340g / 12oz", "6 huevos", "Harina de auto crianza de 240g / 8½oz, tamizada", "100g / 3½oz de cacao", "2 latas de cerezas negras en almíbar", "2 cucharadas de kirsch", "Crema doble de 600 ml / 21 fl oz", "200 g / 7 oz de chocolate negro de buena calidad, roto en trozos pequeños", "50 g / 2 oz de chocolate negro, para afeitarse"], "method": ["Precalentar el horno a 170 C / 325 F / Gas 3.", "En un tazón de 20 cm (8 pulgadas) de lata de fondo suelto, lave ligeramente con un poco de harina y sacuda el exceso. Cubra la lata con papel resistente a la grasa.", "Para el pastel, coloca la mantequilla y el azúcar en un tazón y bate hasta que esté suave y esponjoso. Batir los huevos uno a la vez y luego doblar la harina y el cacao en polvo.", "Vierta la mezcla en la lata de torta preparada, alise la superficie con un cuchillo y hornéela en el horno precalentado durante 1 hora -1 hora y 45 minutos hasta que esté firme y elástica. Para comprobar si el pastel está hecho, inserte un pincho limpio en el centro del pastel; si sale limpio, el pastel estará listo.", "Retirar del horno y dejar enfriar en la lata durante cinco minutos antes de girar sobre una rejilla de alambre.", "Escurra las cerezas, reservando 200 ml (7 fl oz) de jarabe de cereza. Agregue el kirsch al jarabe reservado.", "Use un cuchillo de sierra grande para cortar la torta horizontalmente en tres rondas de igual tamaño.", "Coloque cada ronda en una tabla de cortar y espolvoree el jarabe de cereza sobre cada disco y déjelo en remojo.", "Para la formación de hielo, caliente 200 ml (7 fl oz) de la crema doble al punto de escaldadura y luego agregue las piezas de chocolate. Retire del fuego y revuelva suavemente hasta que el chocolate se derrita y se suavice. Vierta en un recipiente y deje enfriar en el refrigerador, para espesar un poco.", "Batir la crema doble restante hasta que espese. Extienda uno de los discos de pastel con la mitad de la crema y cubra con la mitad de las cerezas, presionándolas ligeramente. Cubra con el segundo disco de esponja y repita este proceso, terminando con el tercer disco dejado en la parte superior. Presione suavemente todo el pastel junto con las palmas de sus manos.", "Retire el glaseado de chocolate de la nevera y revuelva rápidamente. Use una espátula para extender la parte superior y los lados de la torta con la guinda, empezando por la parte superior. De esta forma, si el chocolate rezuma por los lados del pastel, no importará. (Si lo prefiere, puede dejar los lados del pastel sin hielo para mostrar las capas).", "Deje la torta para colocar en un lugar fresco y luego cortar en rodajas grandes y servir."], "url": "www_bbc_co_uk_food_recipes_blackforestgateaux_74843", "title": "Gâteau clásico de la Selva Negra", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "Jengibre de 2.5cm / 1in, pelado, finamente picado", "1 chile rojo pequeño, sin semillas, picado", "1 lima, cáscara y jugo solamente", "1 diente de ajo, aplastado", "pellizcar canela molida", "pellizcar semillas de cilantro molidas", "225g / 7½oz de azúcar moreno claro y suave", "225ml / 7½fl oz de vinagre de sidra", "3 mangos, pelados, cortados en cubos", "3 cucharadas de Cayena", "2 cucharaditas de mostaza en polvo", "2 cucharaditas de orégano seco", "4 cucharaditas de ajo en polvo", "3 cucharaditas de cebolla en polvo", "1 cucharadita de sal de apio", "pizca de tomillo seco", "2 cucharaditas de pimienta blanca", "Filetes de halibut 4 x 150 g / 5oz", "sal y pimienta negra recién molida", "4 cuñas de lima", "puñado de cilantro fresco", "arroz basmati, cocinado según las instrucciones del paquete"], "method": ["Para la salsa picante, caliente el aceite de oliva en una sartén grande a fuego lento y fríe con cuidado el jengibre, el chile, la ralladura de lima, el jugo de lima y el ajo hasta que estén suaves, pero no coloreados.", "Agregue la canela, el cilantro, el azúcar, el vinagre y el mango. Aumenta el calor y lleva a ebullición.", "Reduzca el fuego y cocine a fuego lento durante al menos 40 minutos, hasta que se reduzca a una consistencia pegajosa.", "Mientras tanto, para la mezcla ennegrecida, coloque todos los ingredientes que ennegrecen en un tazón y mezcle bien.", "Para el halibut, condimente los filetes de pescado con sal y pimienta negra recién molida.", "Presione cada lado del pescado en la mezcla de ennegrecimiento y sacuda el exceso.", "Seque los filetes recubiertos en una sartén caliente durante 2-3 minutos en cada lado, o hasta que estén recién cocidos.", "Para servir, coloque los filetes de halibut cocidos en los platos y decore con las rodajas de lima, cilantro fresco y sirva con arroz."], "url": "www_bbc_co_uk_food_recipes_blackenedhalibutwith_86253", "title": "Fletán negro con salsa picante de mango", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de salsa de soja ligera", "2 cucharadas de jerez seco", "2 dientes de ajo, pelados, finamente picados", "1 cucharada de pimienta negra recién molida", "1 cucharada de harina de maíz", "Filete de res 500 g / 1lb 2 oz, finamente cortado", "2 cucharadas de aceite vegetal", "2 pimientos rojos, sin semillas, finamente rebanados", "2 cucharadas de salsa de ostras", "1 cucharada de salsa de soja oscura", "1 cucharada de aceite de sésamo", "50-75ml / 2-3fl oz de agua", "2 cucharadas de aceite de cacahuete", "Arroz basmati de 200g / 7oz, cocido según las instrucciones del paquete, escurrido y enfriado por completo", "2 huevos grandes de gallinas camperas, ligeramente golpeados", "2 cucharaditas de aceite de sésamo", "4 cebolletas, finamente cortadas", "3 cucharadas de hojas de cilantro fresco finamente picado"], "method": ["Para la carne de pimiento negro, mezcle la salsa ligera de soja, el jerez seco, el ajo, la pimienta negra y la harina de maíz en un bol. Agregue las rodajas de carne y revuelva bien para cubrir la carne en el adobo. Cubra y reserve en el refrigerador para marinar durante al menos 30 minutos.", "Al final del tiempo de marinado, retire la carne del adobo (deseche el adobo). Caliente un wok hasta casi fumar, luego agregue el aceite vegetal y la carne. Revuelva freír durante 1-2 minutos, o hasta que se dore por todas partes. Retire la carne del wok y reserve.", "Agregue los pimientos al wok y saltee durante 1-2 minutos, luego agregue la salsa de ostras, la salsa de soya oscura, el aceite de sésamo y el agua. Cocine por un minuto, luego devuelva la carne al wok y saltee por un minuto más. Mantener caliente", "Para el arroz frito con huevo, caliente un wok limpio hasta que esté caliente y agregue el aceite. Agregue el arroz cocido y enfriado y saltee durante 2-3 minutos para que se caliente.", "Mezcle ligeramente los huevos batidos y el aceite de sésamo, luego vierta sobre el arroz. Continúe revolviendo por 2-3 minutos, rompiendo cualquier gran trozo de huevo y arroz con una cuchara de madera, hasta que el huevo esté listo. Sazonar, al gusto, con sal y pimienta negra recién molida, luego incorporar la cebolleta y el cilantro.", "Para servir, espolvorea la carne de pimiento negro en los platos y apila el arroz frito con huevo al lado."], "url": "www_bbc_co_uk_food_recipes_blackpepperbeefstirf_92254", "title": "Salteado de ternera a la pimienta negra con arroz frito con huevo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["750ml / 1 pinta 7fl oz de agua hirviendo", "pizca de sal", "200g / 7oz de polenta fina de cocción rápida", "100g / 3½oz de aceitunas negras, finamente picadas", "sal y pimienta negra recién molida", "1-2 cucharadas de aceite de oliva", "150g / 5½oz de mantequilla sin sal", "1 diente de ajo, aplastado hasta formar una pasta con el filo de un cuchillo", "450 g / 1 libra de champiñones silvestres y de campo, cepillados, enjuagados, bien picados", "½ limón, ralladura y jugo", "1 cucharada de hojas de tomillo fresco picado", "virutas de parmesano, para servir"], "method": ["Ponga a hervir el agua y agregue una pizca de sal. Vierta la polenta, revolviendo bien. Reduzca el fuego hasta que el agua apenas burbujee y continúe cocinando, revolviendo bien, durante 4-5 minutos, o hasta que la polenta haya absorbido toda el agua y esté suave y espesa.", "Agregue las aceitunas picadas y sazone, al gusto, con sal y pimienta negra recién molida.", "Cubra una bandeja para hornear con una hoja de papel para hornear y esparza la mezcla de polenta sobre ella en una capa uniforme. Dejar de lado hasta que la polenta se haya solidificado y esté completamente fría.", "Cuando la polenta se haya enfriado y fraguado, córtela en cuadrados de 10cm / 4 pulgadas. Cepille cada cuadrado en ambos lados con un poco del aceite de oliva.", "Caliente una sartén a fuego medio. Cuando la sartén esté caliente, agregue los cuadrados de polenta, en tandas si es necesario, y cocínelos durante 2-3 minutos en cada lado, o hasta que aparezcan marcas doradas de la plancha en ambos lados y la polenta se caliente. Retire los cuadrados de polenta a la parrilla de la sartén y manténgalos calientes. Repita el proceso con los cuadrados restantes de la polenta.", "Mientras tanto, caliente el aceite restante y la mantequilla en una sartén a fuego medio. Agregue el ajo y las setas mezcladas y fría por 3-4 minutos, o hasta que estén doradas.", "Agregue el jugo de limón, la ralladura de limón y el tomillo y revuelva bien para combinar.", "Para servir, coloque un cuadrado de polenta a la parrilla en el centro de cada una de las seis placas para servir. Con una cuchara, coloque los champiñones y los jugos sobre la polenta. Adorne cada porción con unas pocas virutas de queso parmesano."], "url": "www_bbc_co_uk_food_recipes_blackolivepolentawit_92626", "title": "Polenta de aceituna negra con setas de campo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 cucharadas de aceite vegetal", "1 cucharadita de jengibre de raíz pelado y finamente rallado", "2 dientes de ajo, aplastados", "¼ cucharadita de sal", "1 cucharadita de pimienta negra molida", "1 cucharadita de pimienta blanca molida", "6 pechugas de pollo, deshuesadas y sin piel, cortadas en trozos del tamaño de un bocado", "1 cebolla mediana, finamente picada", "2 chiles verdes frescos, hendidura longitudinal", "1 cucharadita de jugo de limón", "Hojas de cilantro de 30g / 1oz, picadas", "2 cucharadas de aceite de verdura o maní", "1 cebolla grande española, finamente picada", "2 chiles verdes con los dedos, finamente picados", "2 dientes de ajo, finamente picados", "Papas blancas de 300g / 10½oz, peladas y cortadas en cubos de 2cm (¾in)", "Florecillas de coliflor de 200g / 7oz, cortadas en trozos de 4cm (1¾in)", "1 cucharadita de cúrcuma", "¼ cucharadita de comino molido", "¼ cucharadita de cilantro molido", "½ cucharadita de sal", "¼ cucharadita de sal masala", "1 cucharada de mantequilla o ghee", "1 cucharadita de jengibre de raíz pelado y finamente rallado"], "method": ["Para hacer el pollo, mezcle una cucharada de aceite, el jengibre, el ajo, la sal y los pimientos en blanco y negro, y frote la mezcla en las piezas de pollo.", "Cubra y refrigere por 30 minutos.", "Calentar el aceite restante en un wok y freír la cebolla durante dos minutos.", "Agregue las piezas de pollo marinado y saltee suavemente por 10 minutos.", "Agregue los chiles y 200 ml (7 fl oz) de agua hirviendo, tapar y cocine a fuego lento durante 10 minutos, hasta que el pollo esté cocido.", "Agregue el jugo de limón y espolvoree sobre las hojas de cilantro.", "Para hacer la papa y la coliflor, caliente el aceite en una sartén y agregue las cebollas, los chiles, el ajo y las papas. Freír durante siete minutos o hasta que la cebolla esté amarilla y translúcida.", "Agregue la coliflor y fría por otros tres minutos hasta que se doren.", "Agregue la cúrcuma, el comino, el cilantro y la sal y el garam masala. Revuelva y fríe durante cinco minutos.", "Agregue la mantequilla y mezcle, luego agregue cinco cucharadas de agua fría, cubra y cocine a fuego lento durante cinco minutos. Agregue el jengibre.", "Sirve con el pollo."], "url": "www_bbc_co_uk_food_recipes_blackpepperchickenmu_74040", "title": "Pollo al pimiento negro (Murgh kali mirch) con papas sazonadas y coliflor (Aloo gobhi)", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Papas de 500 g / 1 lb 2 oz, peladas y picadas", "1 manzana cocida como Bramley o Granny Smith, pelada, descuartizada y sin corazón", "1 cucharada de mantequilla", "sal y pimienta negra recién molida", "500g / 1lb 2 oz de morcilla, sin piel", "1 cucharada de queso cheddar rallado", "4 cucharadas de verduras pequeñas en ensalada, arrojadas en aceite de oliva", "Crema doble 80ml / 3fl oz", "2 cucharadas de mostaza de grano", "sal y pimienta negra recién molida"], "method": ["Cocine las papas y la manzana en agua hirviendo con sal durante 20 minutos. Escurrir bien y machacar con la mantequilla, sal y pimienta negra recién molida.", "Precalentar el horno a 200C / 400F / Gas 6.", "Mash la morcilla con un tenedor y fríe con cuidado en una sartén caliente durante dos minutos, dándoles vuelta, hasta que estén crujientes.", "Coloque un molde de anillo aceitado de 8cm / 3¼ de ancho por 6cm de alto en una bandeja para hornear forrada con papel resistente a la grasa, y coloque una capa de morcilla en la base, presionando suavemente.", "Cubra con una capa de puré, luego repita, terminando con una capa de papa.", "Retire suavemente el molde y repita hasta que tenga cuatro pasteles.", "Esparce con queso y hornea por 15 minutos para que se caliente. Termine bajo una parrilla caliente si no es dorado.", "Para la salsa, caliente suavemente la crema, la mostaza, la sal y la pimienta negra recién molida, revolviendo con frecuencia.", "Transfiera los pasteles a los platos calientes, cubra con los vegetales para ensalada y sirva con la salsa de mostaza."], "url": "www_bbc_co_uk_food_recipes_blackpuddingandmashc_83005", "title": "Black pudding y puré de pasteles", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 naranjas, solo jugo", "recortes de músculo de 3 vieiras (ver abajo)", "15 g / ½ oz de azúcar en polvo", "3 cucharadas de gambas", "sal y pimienta negra recién molida", "25g / 1oz de mantequilla", "¼ cucharadita de maceta de tierra", "¼ cucharadita de pimentón molido", "2 cucharadas de harina normal", "sal y pimienta negra recién molida", "3 rebanadas gruesas de pudin negro hecho", "1 cucharada de aceite de oliva", "3 vieiras, coral y músculo eliminado", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "15g / ½ oz de mantequilla", "½ naranja, solo jugo", "½ limón, solo jugo", "2 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "1 pequeño puñado de brotes frescos de guisantes", "1 pequeño puñado de brotes de rábano morado fresco", "3 cebolletas frescas, para servir"], "method": ["Para la mantequilla de camarón, coloque el jugo de naranja y los músculos de la vieira en una olla pequeña y deje que hierva. Retire la espuma y agregue el azúcar.", "Mezcle dos cucharadas de gambas en un procesador de alimentos para formar una pasta, luego agregue esto a la sartén con el jugo de naranja y continúe calentando durante 2-3 minutos más. Pase la salsa por un colador para quitar los músculos de vieira, devuelva el líquido a la sartén y sazone al gusto con sal y pimienta negra recién molida.", "Agregue la mantequilla y la cucharada restante de gambas y continúe cocinando durante 1-2 minutos hasta que la mantequilla se derrita y los camarones se hayan calentado.", "Para la morcilla, combine la maza, el pimentón, la harina y el condimento en un tazón y presione las rebanadas de pudin negro en esta mezcla para cubrir, sacudiendo cualquier exceso. Calentar el aceite en una sartén a fuego medio y freír la morcilla revestida durante 2-3 minutos por cada lado.", "Para las vieiras, sazone las vieiras con sal y pimienta negra recién molida. Caliente el aceite y la mantequilla en una sartén separada a fuego alto. Cuando la mantequilla esté espumosa, agregue las vieiras y cocine durante 1-2 minutos en cada lado, o hasta que estén doradas y crujientes.", "Para la ensalada de arvejas y rábanos, mezcle el jugo de naranja y de limón, el aceite de oliva y el condimento en un tazón hasta que estén bien combinados. Agregue los brotes de guisantes y brotes de rábano y mezcle en la vinagreta para cubrir.", "Para servir, apile la ensalada de brotes en un plato de servir y alterne las vieiras y las rebanadas de pudín negro alrededor del borde del plato. Rocíe la mantequilla de camarón sobre las vieiras y el pudín negro, luego decore con cebolletas frescas."], "url": "www_bbc_co_uk_food_recipes_blackpuddingwithscal_89483", "title": "Black pudding con vieiras y mantequilla de camarón, con ensalada de arvejas y rábanos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 x 7 huesos de cordero, huesos extraídos, pero con una solapa de piel reservada (pídale a su carnicero que prepare el cordero)", "350 g / 12 oz de morcilla negra", "2 cucharadas de aceite de oliva", "150g / 5oz mini black pudding", "75g / 3oz de mantequilla", "400 g / 14 oz de habas (peso sin cáscara)", "Crema doble 175ml / 6fl oz", "4 ramitas de menta fresca, solo hojas", "sal y pimienta negra recién molida", "150ml / 5fl oz de vino tinto", "150ml / 5fl oz de caldo de carne", "25g / 1oz de mantequilla"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para el cordero, coloque el cordero en un tablero, con la piel hacia abajo. Coloque la morcilla a lo largo del filete de cordero, luego envuelva la piel sobre la parte superior, para formar un rollo. Asegure el cordero relleno a intervalos con hilo de cocina.", "Caliente una sartén a prueba de horno hasta que esté caliente, luego agregue la mitad del aceite de oliva y el cordero relleno. Freír por un minuto en todos los lados, hasta que se dore por todas partes.", "Voltee el cordero con la piel hacia arriba y tueste en el horno durante 18-20 minutos, o hasta que esté cocido a su gusto. Retire del horno y descanse durante 5-10 minutos.", "Mientras tanto, caliente una sartén hasta que esté caliente. Agregue el aceite de oliva restante y los mini budines negros y fría por 2-3 minutos, o hasta que se dore por completo y completamente cocido. Retire de la sartén y reserve.", "Para las habas, caliente una sartén por separado hasta que esté caliente, luego agregue la mantequilla y las habas y fría por dos minutos, revolviendo regularmente.", "Agregue la crema y la menta y deje que hierva, luego reduzca el fuego a fuego lento durante 2-3 minutos. Sazonar, al gusto, con sal y pimienta negra recién molida y machacar ligeramente con un tenedor.", "Para la salsa, coloque el vino tinto en una sartén por separado a fuego medio y deje que hierva. Reduzca el fuego y cocine a fuego lento hasta que el líquido se reduzca a la mitad.", "Agregue el caldo y continúe cocinando a fuego lento hasta que el líquido se reduzca a la mitad.", "Agregue la mantequilla y sazone, al gusto, con sal y pimienta negra recién molida.", "Para servir, corte el cordero relleno en 12 rebanadas de igual grosor. Con una cuchara, coloque la mezcla de habas anchas en el centro de cada plato y cubra cada porción con tres rebanadas del cordero relleno.", "Desmenuce los mini budines negros, luego espolvoree alrededor del borde de cada plato. Vierta la salsa de vino tinto sobre el cordero relleno y alrededor del plato."], "url": "www_bbc_co_uk_food_recipes_blackpuddingstuffedl_89938", "title": "Black-pudding-cordero relleno con habas acuñadas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]