[{"ingredients": ["500 g / 1 libra de guisantes congelados", "½ patata picada", "200ml / 7fl oz de caldo de verduras calientes", "150g / 5½oz Stilton, desmenuzado", "pimienta negra", "1 cucharada de cebolletas frescas picadas", "aceite de oliva, a llovizna"], "method": ["Coloque los guisantes, las papas y el caldo en una cacerola pequeña a fuego medio y deje que hierva. Reduzca el fuego y cocine a fuego lento durante 6-8 minutos, o hasta que la papa esté suave.", "Agregue el Stilton y revuelva hasta que se derrita, luego sazone con pimienta negra recién molida (no se debe requerir sal, ya que el Stilton lo hará lo suficientemente salado).", "Licuar con una batidora de mano hasta que quede suave, verter en un bol y decorar con cebollino picado y un chorrito de aceite de oliva."], "url": "www_bbc_co_uk_food_recipes_creamofpeaandstilton_84662", "title": "Sopa de crema de guisantes y Stilton", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "50 g / 1¾oz de mantequilla sin sal", "1 diente de ajo, finamente picado", "1 cebolla, finamente rebanada", "Patata de 150g / 5½oz cortada en cubos pequeños", "200g / 7oz de maíz dulce", "600ml / 20fl oz de caldo de verduras calientes", "Crema doble 50ml / 2fl oz", "sal y pimienta negra recién molida", "1 cucharadita de cebollín fresco, finamente picado"], "method": ["Calentar el aceite de oliva con la mantequilla en una sartén a fuego medio. Una vez que la mantequilla se haya derretido, agregue el ajo, la cebolla y la papa y saltee durante cinco minutos, hasta que se ablanden.", "Agregue el maíz dulce y continúe cocinando por dos minutos más.", "Agregue el caldo, lleve a ebullición, luego reduzca el fuego a fuego lento durante cinco minutos, hasta que la papa se haya cocinado.", "Agregue la crema y condimente, al gusto, con sal y pimienta negra recién molida, luego vierta en un procesador de alimentos y mezcle hasta que quede suave.", "Para servir, vierta en un recipiente caliente y adornar con una pizca de cebollín."], "url": "www_bbc_co_uk_food_recipes_creamofsweetcornsoup_81627", "title": "Sopa cremosa de maíz dulce", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/creamofsweetcornsoup_81627_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 colinabo, pelado y cortado en cubos", "3 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "1 cebolla, finamente picada", "2 zanahorias, finamente cortadas", "2 tallos de apio, en rodajas finas", "1 diente de ajo, aplastado", "6 tallos de tomillo fresco, solo hojas", "1,25 litros / 2 pintas de caldo de verduras", "142ml / 5fl oz carton single cream", "hojas frescas de tomillo para adornar"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Coloque los cubos de colinabo en una bandeja de asar. Rocíe más de dos cucharadas de aceite de oliva y sazone.", "Asar en el horno durante 25-30 minutos hasta que estén dorados y tiernos, revolviendo ocasionalmente.", "Mientras tanto, caliente la cucharada sobrante de aceite en una cacerola grande de base pesada, mezcle la cebolla, las zanahorias, el apio, el ajo y las hojas de tomillo y fríe durante 4-5 minutos hasta que se ablanden pero no se doren.", "Agregue el colinabo asado a la sartén y vierta sobre el caldo.", "Llevar a ebullición suavemente, cubrir y hervir a fuego lento durante 25-30 minutos, revolviendo ocasionalmente.", "Puré la sopa en un procesador de alimentos o licuadora hasta que esté completamente suave. Pase a través de un tamiz para una textura extra fina, si lo prefiere.", "Transfiera la sopa a una cacerola limpia. Agregue la mayor parte de la crema y reserve algo para decorar. Calienta suavemente y ajusta el condimento si es necesario.", "Servir en cuencos calientes o en una sopera y adornar con un remolino de crema, algunas hojas frescas de tomillo y pimienta negra recién molida."], "url": "www_bbc_co_uk_food_recipes_creamroastedswedesou_79761", "title": "Sopa cremosa de colinabo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/creamroastedswedesou_79761_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100g / 3½oz de tallarines secos o espaguetis", "50g / 1¾oz de guisantes congelados", "2 cucharaditas de aceite de oliva virgen extra o girasol", "½ cebolla, finamente picada", "2 lonchas de tocino ahumado, cortadas en tiras de 15 mm / ⅝ de ancho", "100 g / 3½ oz pequeños champiñones cerrados, en rodajas", "1 calabacín, cortado en rodajas de 1 cm / ½ in", "3 cucharadas de crema individual", "15g / ½ oz de queso parmesano, finamente rallado", "sal marina y pimienta negra recién molida"], "method": ["Llene a la mitad una cacerola grande y antiadherente con agua y llévela a ebullición. Agregue la pasta a la sartén y cocine por 10 minutos, o de acuerdo con las instrucciones del paquete, hasta que esté tierna. Agregue los guisantes y cocine durante 2 minutos más.", "Mientras tanto, caliente el aceite en una sartén antiadherente grande o wok. Agregue la cebolla, el tocino, los champiñones y el calabacín a la sartén y sazone con sal y pimienta. Freír a fuego medio-alto durante 5 minutos, revolviendo con frecuencia.", "Escurra la pasta y los guisantes y vuelva a la cacerola. Agregue la crema y la mezcla de tocino a la cacerola y coloque a fuego lento. Mezcle la mezcla con un par de tenedores durante unos segundos hasta que la crema esté caliente y todo esté bien mezclado. Espolvorear con el queso parmesano y servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_creamy_carbonara_74567", "title": "Carbonara más ligero", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/creamy_carbonara_74567_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "Cebolla picada", "1 diente de ajo, picado", "5 alcachofas de Jerusalén, peladas, picadas", "50ml / 2fl oz de vino blanco", "150ml / 5fl oz de caldo de pollo caliente (los vegetarianos pueden sustituir el caldo de verduras)", "Crema doble 50ml / 2fl oz", "sal y pimienta negra recién molida", "cebollín fresco, para adornar"], "method": ["Calentar el aceite en una olla mediana. Agregue la cebolla y cocine suavemente durante tres minutos hasta que se hayan ablandado.", "Agregue el ajo a la cacerola, revuelva y cocine por un minuto.", "Agregue las alcachofas, el vino blanco y el caldo y cocine durante ocho minutos o hasta que la alcachofa se haya suavizado. Coloque la mezcla en el tazón de un procesador de alimentos. Agregue la crema y mezcle la mezcla hasta que quede suave. Sazone al gusto con sal y pimienta negra recién molida.", "Para servir, espolvorear en un bol y decorar con cebolletas frescas."], "url": "www_bbc_co_uk_food_recipes_creamofjerusalemarti_84614", "title": "Sopa de crema de alcachofa de Jerusalén", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["450ml / 16fl oz de caldo de pollo", "3 pechugas de pollo, desolladas", "75g / 3oz de mantequilla", "2 puerros, cortados y cortados en rodajas de 1cm / ½", "2 dientes de ajo, aplastados", "Harina normal de 50g / 2oz", "200ml / 7fl de leche en oz", "2-3 cucharadas de vino blanco (opcional)", "150ml / 3fl oz de crema doble", "Pedazo de 150g / 5oz pedazo de jamón grueso tallado, cortado en trozos de 2cm", "copos de sal marina", "pimienta negra recién molida", "Harina normal de 350g / 12oz", "200g / 7oz de mantequilla", "1 huevo de corral batido con 1 cucharada de agua fría, más 1 huevo de corral, batido, para esmaltar"], "method": ["Caliente el caldo de pollo en una olla con tapa. Agregue la pechuga de pollo y baje a fuego lento. Cubra con una tapa y cocine por 10 minutos. Retire las pechugas de pollo del agua con pinzas y colóquelas en un plato. Vierta el licor de cocina en una jarra grande.", "Derrita 25 g / 1 oz de la mantequilla en una cacerola grande a fuego lento. Agregue los puerros y fríelos suavemente durante dos minutos, revolviendo ocasionalmente hasta que se suavicen. Agregue el ajo y cocine por un minuto más. Agregue la mantequilla restante y mezcle la harina tan pronto como la mantequilla se haya derretido. Cocine por 30 segundos, revolviendo constantemente.", "Vierta lentamente la leche en la sartén, poco a poco, revolviendo bien entre cada adición. Poco a poco agregue 250ml / 10fl oz de la reserva reservada y el vino, si lo usa, revuelva hasta que la salsa esté suave y espesada ligeramente. Llevar a fuego lento a fuego lento y cocinar por 3 minutos.", "Sazone la mezcla, al gusto, con sal y pimienta negra recién molida. Retire del fuego y agregue la crema. Vierta en un tazón grande y cubra la superficie de la salsa con papel film para evitar que se forme la piel. Dejar de lado para enfriar.", "Precaliente el horno a 200C / 400F / Gas 6. Coloque una bandeja para hornear en el horno para calentar.", "Para la masa, coloque la harina y la mantequilla en un procesador de alimentos y mezcle el ajuste del pulso hasta que la mezcla se asemeje a migas de pan finas. Con el motor en marcha, agregue el huevo batido y el agua y mezcle hasta que la mezcla forme una bola. Parte de 250 g / 10 oz de hojaldre para la tapa.", "Enrolle los pasteles restantes sobre una superficie ligeramente enharinada, volteando los pasteles con frecuencia hasta alrededor de 5 mm / ¼ de grosor y 4 cm / 1½ pulgadas más grandes que el plato de tarta. Levante la masa sobre el rodillo y colóquela suavemente en el plato para pastel. Presione la masa firmemente por los lados, asegurándose de que no haya burbujas de aire. Deje el exceso de hojaldre colgando sobre los lados.", "Corta las pechugas de pollo en trozos de 3cm / 1¼ en pedazos. Revuelva el pollo, el jamón y los puerros en la salsa fría. Vierta el relleno de pollo en el plato de tarta. Cepille el borde del plato con huevo batido. Despliegue la masa reservada para la tapa.", "Cubra el pastel con la tapa de pastelería y presione los bordes juntos para sellar. Recorte cualquier exceso de pastelería.", "Haz un pequeño agujero en el centro del pastel con la punta de un cuchillo. Esmaltar la parte superior del pastel con huevo batido. Hornee en la bandeja precalentada en el centro del horno durante 35-40 minutos o hasta que el pastel esté dorado por completo y el relleno esté bien caliente."], "url": "www_bbc_co_uk_food_recipes_creamy_chicken_ham_and_03877", "title": "Pastel cremoso de pollo, jamón y puerro", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/creamy_chicken_ham_and_03877_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva suave", "1 cebolla mediana, finamente cortada", "4 lonchas de tocino ahumado ahumado, cortadas en tiras de 2cm / ¾ de ancho", "2 dientes de ajo, en rodajas finas", "Espagueti seco 300-350g / 10½-12oz", "1 cucharadita de hojuelas de chile seco", "1 x 400 g de tomate picado", "2 cucharadas de puré de tomate", "1 cucharadita de orégano seco", "100ml / 3½ fl oz crema doble", "sal y pimienta negra recién molida"], "method": ["Llene a la mitad una olla grande con agua y deje que hierva.", "Caliente el aceite en una sartén grande y antiadherente a fuego medio. Agregue la cebolla y el tocino y fría por 5-6 minutos, o hasta que estén suaves y ligeramente dorados. Agregue el ajo y fría por un minuto más (no deje que el ajo se queme o será amargo).", "Cuando el agua esté hirviendo, agregue los espaguetis en cuatro lotes, permitiendo que cada lote se ablande en el agua antes de agregar el siguiente. Revuelva bien, luego cocine los espaguetis de acuerdo con las instrucciones del paquete, revolviendo ocasionalmente.", "Mientras los espaguetis se cocinan, mezcle los copos de chile en la mezcla de cebolla y tocino, luego agregue los tomates en lata, puré de tomate, orégano y 250 ml de agua. Sazonar, al gusto, con sal y pimienta negra recién molida. Llevar la mezcla a fuego lento y cocinar durante 10 minutos, revolviendo regularmente, hasta que espese. Agregue la crema y regrese la mezcla a fuego lento.", "Escurrir la pasta en un colador y volver a la sartén. Vierta sobre la cremosa salsa de tomate, luego mezcle la salsa en los espaguetis hasta que esté bien cubierta.", "Para servir, divida los espaguetis por igual entre cuatro tazones de servir y sirva."], "url": "www_bbc_co_uk_food_recipes_creamy_chilli_bacon_and_60433", "title": "Espagueti cremoso de chile, tocino y tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/creamy_chilli_bacon_and_60433_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1kg / 2lb 4oz berberechos vivos frescos (o berberechos sin concha 400g / 14oz)", "½ limón, solo jugo", "25g / 1oz de mantequilla", "1 cebolla, finamente picada", "2 palitos de apio, cortados y rebanados", "3 lonchas de tocino ahumado sin corteza, cortadas en rodajas de 1cm / ½ en rodajas", "1 hoja de laurel", "tomillo de ramita espeso", "Papas 300g / 10½oz, preferiblemente Maris Piper", "2 cucharadas de harina normal", "300ml / 10fl oz de leche entera", "300ml / 10fl oz de caldo de pollo, hecho con ½ cubo de reserva", "1 puerro mediano, cortado, lavado y finamente cortado", "100ml / 3½ fl oz crema doble", "100ml / 3½fl oz de vino blanco", "6 rollos de pan de soda grandes", "perejil picado, para adornar (opcional)", "apio joven, desde el centro de la cabeza"], "method": ["Lave bien los berberechos y deseche los que tengan conchas rotas o dañadas. Todos deben permanecer firmemente cerrados, por lo tanto, retire cualquier obstáculo que esté abriendo o no lo cierre cuando lo golpee en el costado del fregadero. Poner en un tazón grande y cubrir con agua fría, agitar con la mano y escurrir. Repita el proceso tres veces más y luego drene en un colador.", "Coloque una cacerola a fuego alto y agregue los berberechos en sus conchas, con 150 ml / 5 fl oz de agua y el jugo de limón. Cubra rápidamente con una tapa y cocine al vapor los berberechos durante 4-5 minutos, o hasta que los caparazones se hayan abierto todos. Sostenga la tapa firmemente y déle a la sartén un buen batido de vez en cuando para redistribuir el calor. Una vez que los berberechos estén cocidos, hágalos en un colador y déjelos escurrir.", "Derrita la mantequilla en una cacerola grande y fríe con cuidado la cebolla, el apio y el tocino con la hoja de laurel y la ramita de tomillo durante cinco minutos, o hasta que se ablanden y estén ligeramente coloreados, revolviendo regularmente. Pele las papas y córtelas en cubos de aproximadamente 1.5cm / ¾in.", "Revuelva la harina y luego las papas en la cacerola con las verduras. Agregue lentamente la leche y el caldo y cocine a fuego lento. Cocine sin tapar durante 15 minutos, o hasta que las papas estén muy tiernas y la sopa se haya espesado, revolviendo ocasionalmente. Elija y deseche la hoja de tomillo y la hoja de laurel.", "Mientras la sopa hierve a fuego lento, saca los berberechos de sus conchas y colócalos en un cuenco. Deseche cualquier que no se haya abierto. Agregue el puerro, la nata y el vino a la sopa. Regrese a fuego lento y cocine por tres minutos. Sazone al gusto con sal y pimienta. Agregue los berberechos y cocine por un minuto más, o hasta que estén calientes.", "Coloque los panecillos en un tablero y corte las partes superiores con un cuchillo de sierra. Saca el pan suave del interior de cada rollo. Coloque los rollos en seis platos y vierta la sopa cuidadosamente dentro. Esparce el perejil en la parte superior y agrega un apio joven en cada tazón de pan. Cubra con las tapas de pan reservadas si lo desea. Servir inmediatamente. Coma la sopa y el pan empapado de sopa, abriéndose camino desde la parte superior del rollo."], "url": "www_bbc_co_uk_food_recipes_creamy_cockle_chowder_71147", "title": "Sopa cremosa de berberecho", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500g / 1lb 2oz de harina fuerte", "pizca de sal", "45 g / 1½ oz de azúcar en polvo", "300ml / 10½fl oz de leche caliente", "10g / ⅓oz de levadura fresca", "Carne picada 300 g / 10½ oz", "50g / 1¾oz de coco desecado, tostado", "50 g / 1¾oz de mantequilla sin sal, más extra para el relleno", "50g / 1¾oz demerara de azúcar, más extra para el relleno", "600ml / 1lb 5oz de leche de coco"], "method": ["Coloque la harina y la sal en un tazón grande.", "En una sartén, caliente el azúcar y la leche para calentar. Revuelva la levadura en la leche tibia.", "Vierta la leche en la harina y mezcle para formar una masa.", "Amasar hasta que quede suave, luego regrese a la taza y deje en un lugar tibio para probar durante una hora, o hasta que se duplique su tamaño.", "Rechace la masa y luego extiéndala en un cuadrado grande, de aproximadamente 1 cm / ½ pulgada de grosor.", "Cortar la masa por la mitad y extender la carne picada sobre ambas mitades y espolvorear el coco tostado.", "Enrolle la masa como un rollo suizo y corte en rodajas de aproximadamente 4 cm / 1½ pulgadas de ancho.", "Usando una bandeja para hornear, aproximadamente 25x30cm / 10x12 in, presione la mantequilla a lo largo de la base. Espolvorea sobre el azúcar demerara, luego vierte más de 400 ml / 14 fl oz de la leche de coco (reserva el resto).", "Coloque los bollos cortados en la leche de coco dejando 1 cm / ½ en espacios entre cada uno. Deje que se demuestre que está en algún lugar cálido hasta que esté bien levantado y las lagunas se hayan llenado con la masa probada, unos 40 minutos.", "Precalentar el horno a 180C / 350F / Gas 4.", "Coloque una pequeña perilla de la mantequilla extra en la parte superior de cada panecillo y espolvoree con azúcar demerara extra. Hornee por 25-30 minutos, o hasta que estén doradas.", "Retire del horno y separe suavemente los panecillos con una cuchara, luego vierta sobre la leche de coco reservada."], "url": "www_bbc_co_uk_food_recipes_creamy_coconut_and_fruit_77195", "title": "Bollos de carne de coco y fruta cremosos", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Hace 10-12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["25g / 1oz de pan blanco fresco", "15 g / ½ oz Gruyère, finamente rallado", "½ cucharadita de perejil seco", "300ml / 10fl oz de leche entera", "1 cebolla pequeña, pelada, cortada en 6 cuñas a lo largo", "1 hoja de laurel", "2 tiras de cáscara de limón", "450 g / 1 libra de filete de eglefino fresco (o cualquier otro pescado blanco decente con piel)", "40 g / 1½ oz de mantequilla", "Harina normal de 25g / 1oz", "2 cucharadas de vino blanco o vermut (opcional)", "50g / 1¾oz Gruyère, finamente rallado", "½ cucharadita de mostaza inglesa preparada", "3 cucharadas de crema doble", "sal y pimienta negra recién molida"], "method": ["Coloque de 4 a 6 platos pequeños, incombustibles e ignífugos en una bandeja para hornear.", "Para el relleno gratinado, mezcle las migas de pan, el gruyere y el perejil y déjelas de lado mientras prepara el relleno.", "Para el relleno, vierta la leche en una sartén grande y profunda y agregue la cebolla, la hoja de laurel y la cáscara de limón. Coloque el pescado con la piel hacia abajo en la sartén y cocine a fuego lento a fuego medio. Hilvane el pescado de vez en cuando con la leche y cocine por 5-6 minutos. Cuando estén cocidos, los peces serán opacos y comenzarán a desmenuzarse en pedazos. Deje reposar durante 5 minutos.", "Escurrir el pescado en un colador sobre una jarra grande, reservar la leche.", "Derrita la mantequilla en una cacerola grande antiadherente y mezcle la harina con una cuchara de madera hasta que esté bien combinada. Retire del fuego y agregue lentamente la leche caliente reservada, revolviendo constantemente. Regrese al fuego, lleve la salsa a fuego lento y continúe revolviendo hasta que esté suave y espesa. Agregue el vino o vermout, Gruyère, mostaza y crema. Cocine a fuego lento durante 2-3 minutos más, mientras revuelve. Sazonar con sal y pimienta negra recién molida al gusto.", "Agita el pescado en trozos gruesos y descarta la piel, la cebolla, la hoja de laurel y la cáscara de limón. Agregue el pescado a la sartén con la salsa y caliente muy suavemente durante 2 minutos para calentarlo.", "Mientras el pescado se calienta, precaliente la parrilla hasta que esté caliente y coloque la bandeja para hornear con los platos poco profundos bajo el calor para calentar durante unos segundos. Con cuidado quítelos del fuego y divida la mezcla de pescado caliente entre los platos calientes. Espolvoree con el relleno gratinado y vuelva a la parrilla durante 3-5 minutos o hasta que se dore bien y se llene de burbujas por debajo."], "url": "www_bbc_co_uk_food_recipes_creamy_haddock_gratins_86114", "title": "Gratinados de abadejo cremoso", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200g / 7oz de lentejas verdes", "botón de mantequilla", "2 cebollas, finamente picadas", "curry en polvo, al gusto", "100ml / 3½ fl oz crema doble", "100g / 3½oz de hojas de espinaca baby", "Aceite para freír", "1 x 350-400 g / 12-14 oz de filete de eglefino ahumado, cortado en 4 porciones", "jugo de limón, al gusto", "sal y pimienta negra recién molida"], "method": ["Coloque las lentejas en una olla grande y cubra con 5cm / 2in de agua. Cocine a fuego medio, no quiere hervir las lentejas, durante unos 20 minutos. Para probar si las lentejas están cocidas aplastar una entre los dedos, se debe sentir cremoso y no almidón. Sazone las lentejas con sal y pimienta.", "Caliente una sartén grande de fondo grueso, derrita la mantequilla, agregue las cebollas y cocine a fuego medio. Cuando las cebollas se hayan dorado y estén comenzando a ablandar, agregue el polvo de curry. Luego agregue la crema y cocine por unos minutos.", "Agregue las lentejas cocidas a las cebollas y revuelva. Luego agregue las espinacas y cocine hasta que la espinaca se haya marchitado.", "Mientras tanto, caliente una sartén grande y agregue el aceite. Freír el eglefino ahumado durante 2-3 minutos en cada lado, o hasta que esté comenzando a copos y esté bien cocido.", "Para servir, divida las lentejas entre 4 platos. Cubra cada plato con una porción de eglefino y un generoso chorrito de jugo de limón."], "url": "www_bbc_co_uk_food_recipes_creamy_lentils_with_14386", "title": "Lentejas cremosas con abadejo ahumado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/creamy_lentils_with_14386_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharadita de aceite de colza", "80g / 3 oz champiñones, más o menos picados", "Medallón de tocino ahumado reducido en grasa 32g / 1oz, aproximadamente picado,", "2 cebollas de primavera, en rodajas finas", "1 diente de ajo, finamente picado", "½ limón pequeño, solo jugo", "1 cucharada sopera de grasa cruda fraiche", "30g / 1oz rebanada de pan integral o de granero", "sal y pimienta negra recién molida, al gusto", "1 cucharada de cebolletas frescas picadas (opcional)"], "method": ["Caliente el aceite en una sartén pequeña a fuego medio. Agregue los champiñones, el tocino, las cebollas tiernas y el ajo y cocínelos durante 1-2 minutos. Agregue el jugo de limón, cubra con una tapa y cocine a fuego lento durante 5 minutos o hasta que los champiñones estén cocidos.", "Retire del fuego, agregue la crema fresca y cebollino, si se usa, y sazone.", "Tueste el pan en ambos lados, colóquelo en un plato calentado y cubra con los champiñones."], "url": "www_bbc_co_uk_food_recipes_creamy_mushrooms_on_35264", "title": "Champiñones cremosos más claros sobre una tostada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/creamy_mushrooms_on_35264_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Pappardelle 400g / 14oz", "100-200g / 3½-7oz tocino en cubos", "Setas de castaña de 175g / 6oz, finamente rebanadas", "Crema doble 225ml / 8fl oz", "Queso parmesano 75 g / 3 oz, rallado", "pimienta negra recién molida"], "method": ["Cocine el pappardelle de acuerdo con las instrucciones del paquete.", "Mientras tanto, freír la panceta en una sartén a fuego medio-alto durante unos cinco minutos. Cuando empiece a dorarse, agregue los champiñones y cocine por 2-3 minutos, luego agregue la crema doble. Una vez que la crema esté caliente, agregue el parmesano y mezcle bien.", "Una vez que la pasta esté lista, drene y devuelva a la sartén. Agregue la mezcla de panceta y mezcle bien. Sazonar con un poco de pimienta (me parece que no suele necesitar sal debido al parmesano salado y la panceta)."], "url": "www_bbc_co_uk_food_recipes_creamy_pancetta_pasta_60702", "title": "Pasta cremosa de panceta con champiñones y queso parmesano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite vegetal", "Tocino rayado ahumado de 150g / 5½oz", "2 pechugas de pollo", "1 cebolla grande", "2 dientes de ajo", "Setas de 200g / 7oz, alrededor de 10-15 hongos", "perilla de mantequilla sin sal", "pellizcar hierbas mezcladas secas", "250ml / 9fl oz de vino blanco", "250ml / 9fl oz de crema individual", "200g / 7oz de patatas nuevas", "150g / 5½oz de judías verdes"], "method": ["Coloque una olla grande a fuego alto y agregue el aceite. Cortar el tocino, agregar a la sartén y freír durante 3-4 minutos hasta que estén crujientes. Retire de la sartén y reserve.", "Mientras el tocino se fríe, corte el pollo en tiras del tamaño de un bocado. Coloque el pollo en la olla, sazone con un poco de pimienta y dore por todos lados hasta que se dore. Retire y reserve en el plato con el tocino.", "Mientras el pollo se está friendo, pele y pique la cebolla y el ajo, y corte los champiñones. Reduzca el fuego ligeramente y agregue la mantequilla. Cuando empiece a formar espuma, agregue las cebollas, sazone con sal y pimienta y fría por 3-4 minutos hasta que se ablanden. Agregue el ajo, cocine durante 1 minuto y luego agregue los champiñones. Freír durante 3-4 minutos hasta que se ablanden y luego incorporar las hierbas.", "Verter sobre el vino y llevar a ebullición. Regrese el pollo y el tocino a la sartén, más los jugos de reposo y cocine a fuego medio durante 3-4 minutos. Agregue la crema, lleve a ebullición y cocine a fuego lento durante 10 minutos.", "Mientras tanto, traiga una olla grande de agua con sal al hervor y agregue las papas. Cocine por 10 minutos, luego agregue los frijoles a la sartén y cocine por 3 minutos más. Escurrir y servir con el pollo cremoso."], "url": "www_bbc_co_uk_food_recipes_creamy_white_wine_58519", "title": "Pollo cremoso de vino blanco", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/creamy_white_wine_58519_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["25g / 1oz de mantequilla", "1 cucharada de aceite de girasol", "2 cebollas medianas, picadas", "Pastillas de chiles de 600 g / 1 lb 5 oz, cortadas en piezas de 2 cm / 1 in", "2 dientes de ajo, aplastados", "600g / 1lb 5oz manzanas Bramley, peladas, descuartizadas y cortadas en trozos", "1 litro / 1¾ pintas de vegetales o caldo de pollo", "150ml / 5fl de leche en oz", "sal marina escamada y pimienta negra recién molida"], "method": ["Derrita la mantequilla y el aceite en una olla grande. Fríe con cuidado las cebollas y las chirivías durante 15 minutos o hasta que las cebollas estén blandas. Agregue el ajo y las manzanas y cocine por otros dos minutos, revolviendo regularmente.", "Verter sobre el caldo y llevar a ebullición. Reduzca el fuego a fuego lento y cocine durante unos 20 minutos, o hasta que la pastinaca esté muy suave. Retirar del fuego y sazonar con sal y pimienta negra recién molida. Mezcle la mezcla en un procesador de alimentos hasta que quede suave.", "Agregue la leche y agregue un poco más si es necesario. Sazone al gusto con sal y pimienta negra recién molida."], "url": "www_bbc_co_uk_food_recipes_creamy_parsnip_and_apple_35005", "title": "Sopa cremosa de chirivía y manzana", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/creamy_parsnip_and_apple_35005_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Habas de 500g / 1lb 2oz, podded", "hierbas, picado, por ejemplo, cebolletas, perifollo y ajedrea", "150ml / 5fl oz de crema doble", "1 huevo, solo yema", "5 cdas. De existencias", "azúcar en polvo, al gusto", "sal y pimienta negra recién molida"], "method": ["Hervir las habas durante 2 minutos, escurrirlas y sacarlas de sus pieles.", "Poner en una cacerola con cebollino picado, perifollo y ajedrea, humedecer con caldo y agregarle un toque de azúcar en polvo, sal y pimienta negra. Hierva hasta que el licor casi haya desaparecido.", "Batir una yema de huevo con crema doble, agregar a los frijoles y calentar hasta que la crema se haya espesado un poco. No vuelva a hervir"], "url": "www_bbc_co_uk_food_recipes_creamybroadbeans_68045", "title": "Habas cremosas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 cucharada de mantequilla", "1 diente de ajo, picado", "½ cebolla grande, picada", "Brócoli 170g / 6oz, floretes y tallo, picados", "150ml / ¼ pinta de caldo de pollo caliente (los vegetarianos pueden sustituir el caldo de verduras)", "sal y pimienta negra recién molida", "1 yema de huevo de gallinas camperas", "3 cucharadas de crema doble", "55g / 2oz Stilton"], "method": ["Caliente el aceite y la mantequilla en una olla.", "Agregue el ajo y la cebolla y saltee durante 2-3 minutos, o hasta que estén suaves.", "Agregue el brócoli y cocínelo durante 1-2 minutos.", "Agregue el caldo de pollo caliente. Llevar a ebullición a fuego lento durante 4-5 minutos, o hasta que el brócoli esté tierno.", "Vierta la sopa en una licuadora o procesador de alimentos y mezcle hasta que quede suave. Sazonar con sal y pimienta negra recién molida.", "Coloque la yema de huevo y la crema en un tazón.", "Agregue la sopa caliente y revuelva hasta que la sopa espese un poco.", "Desmenuce el Stilton y sirva caliente."], "url": "www_bbc_co_uk_food_recipes_creamybroccoliandsti_86013", "title": "Brócoli cremoso y sopa de Stilton", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1-2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["300g / 10½ oz de calabaza, pelada y picada", "aceite de oliva, para lloviznar", "sal y pimienta negra recién molida", "2 dientes de ajo sin pelar", "½ cebolla, picada", "300ml / ½ pinta de pollo caliente o caldo de verduras", "100ml / 3½ fl oz crema doble", "perejil fresco picado, para adornar"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Coloque la calabaza en una bandeja para hornear. Rocíe con aceite de oliva, sazone con sal y pimienta negra recién molida y esparza sobre los dientes de ajo. Coloque en el horno y tueste durante 10-15 minutos, o hasta que estén tiernos y dorados. Dejar de lado.", "Mientras tanto, caliente una pizca de aceite de oliva en una cacerola, agregue la cebolla y fría por cinco minutos con un poco de calor, o hasta que se ablande.", "Agregue la calabaza a las cebollas (reservando algunos cubos para decorar). Exprime el ajo tostado de su piel y agrégalo a la sartén. Agregue el caldo de pollo y cocine a fuego lento durante tres minutos.", "Agregue la crema y sazone bien con sal y pimienta negra recién molida.", "Mezcle con una batidora de mano hasta que quede suave. Vierta en un tazón y adorne con los cubos de calabaza tostados reservados y el perejil picado. Servir."], "url": "www_bbc_co_uk_food_recipes_creamybutternutsquas_88084", "title": "Sopa cremosa de calabaza", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["mantequilla, para engrasar", "3 claras de huevo de gallinas camperas", "1 yema de huevo de gallinas camperas", "1 cucharada de harina de maíz", "Queso de 55 g / 2 oz, rallado", "Guisantes congelados de 55 g / 2 oz, descongelados", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Engrase el interior de una sartén a prueba de horno de 10 cm / 4 in, o dos platos de ramekin de 7,5 cm / 3 in con mantequilla.", "Batir las claras de huevo en un recipiente limpio y seco hasta que se formen picos rígidos cuando se quite el batidor.", "En un recipiente aparte, mezcle la yema de huevo, la harina de maíz, el queso y los guisantes juntos y sazone con sal y pimienta negra recién molida.", "Dobla las claras de huevo en la mezcla de yema de huevo y con cuidado coloca una cuchara en la sartén o moldes.", "Coloque en una bandeja para hornear y hornee en el horno durante 7-8 minutos, o hasta que esté bien levantado y dorado.", "Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_creamycheeseandpeaso_86862", "title": "Soplos de queso cremoso y guisantes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Hace 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 cucharadas de aceite de oliva", "3 muslos de pollo deshuesados ​​grandes, sin piel, cortados en tiras", "5 lonchas de tocino, picadas", "1-2 dientes de ajo, aplastados", "sal y pimienta negra recién molida", "300 ml / 10 fl oz doble crema", "450g / 1lb mariposas", "puñado de albahaca fresca, desgarrada, más extra para decorar", "200 g / 7 oz de queso cheddar o parmesano, rallado, más extra para decorar"], "method": ["Cocine la pasta de acuerdo con las instrucciones del paquete en una sartén de agua hirviendo con sal, luego escurra.", "Caliente el aceite de oliva en una sartén, agregue las tiras de pollo y el tocino y cocínelas durante 3-4 minutos, o hasta que el pollo esté dorado y cocido.", "Agregue el ajo y cocine por un minuto. Sazonar, al gusto, con sal y pimienta negra recién molida, agregar la crema y calentar.", "Agregue la salsa cremosa a la pasta cocida y escurrida y mezcle bien.", "Para servir, agregue la albahaca y la cuchara de queso cheddar en los platos para servir. Adorne con queso extra rallado y hojas de albahaca."], "url": "www_bbc_co_uk_food_recipes_creamychickenbaconan_87166", "title": "Pasta cremosa de pollo, tocino y albahaca", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/creamychickenbaconan_87166_16x9.jpg", "isVegetarian": false, "recommendations": 0}]