[{"ingredients": ["2 langostas, cocinadas y sin carne, conchas reservadas para servir (opcional)", "3 cebollas pequeñas, finamente picadas", "20g / ¾oz de jengibre fresco, rallado", "12 hojas de curry", "3 cucharadas de coco fresco rallado", "5 cucharadas de semillas de cilantro", "2 cucharadas de semillas de comino", "1 cucharadita de pimienta negra", "8 cucharadas de pulpa de tamarindo", "1 litro de caldo de verduras", "3 fechas, piedras removidas, picadas", "1 cucharada de sal masala", "1 cucharada de chile en polvo", "1 cucharada de curry en polvo", "200ml / 7fl oz de leche de coco", "3 cucharadas de aceite de colza", "1 cucharadita de semillas de comino", "2 cucharaditas de semillas de sésamo", "200 g / 7 oz de jengibre fresco, en rodajas finas", "1 guindilla verde, hendidura abierta", "1 cucharadita de chile rojo en polvo", "100g / 3½oz de pasta de tamarindo", "Azúcar de palma 100g / 3½oz", "pellizcar asafoetida", "1 chile rojo seco", "½ cucharadita de semillas de mostaza", "5-6 hojas de curry", "400g / 14oz de arroz pegajoso", "150ml / 5fl oz de leche de coco", "1 cucharadita de sal", "2 cucharadas de cilantro fresco, toscamente picado"], "method": ["Para el curry de langosta, coloque la cebolla, el jengibre, las hojas de curry, el coco, las semillas, los granos de pimienta y un poco de agua en una licuadora y mezcle hasta que se forme una pasta homogénea.", "Ponga la pulpa de tamarindo, caldo, dátiles, garam masala, polvo de chile y polvo de curry en una sartén grande y cocínelos durante 20-30 minutos para hacer caldo de tamarindo.", "Caliente un wok y agregue la pasta. Una vez caliente, agregue 200ml / 7fl oz de caldo de tamarindo y la leche de coco. Cocine por 4-6 minutos.", "Coloque las piezas de langosta cocidas en la mezcla de curry y cocine durante 1-2 minutos.", "Para el chutney de jengibre, caliente dos cucharadas de aceite en una sartén. Freír las semillas de comino durante 1-2 minutos y luego agregar las semillas de sésamo, el jengibre, el chile verde y el chile en polvo y sazonar con un poco de sal.", "Revuelva durante 2-3 minutos y luego cubra la mezcla con un círculo de papel resistente a la grasa y deje que se cocine lentamente durante 40-45 minutos hasta que el jengibre esté casi cocinado.", "Deje que la mezcla se enfríe, luego transfiérala a un procesador de alimentos y mezcle hasta formar una pasta fina con la pasta de tamarindo y el azúcar de palma.", "Caliente el aceite restante en una sartén por separado, agregue la asafétida, el chile rojo y las semillas de mostaza. A medida que estallen las semillas de mostaza, agregue las hojas de curry, revuelva por 30 segundos y luego viértalo en la mezcla de chutney de jengibre y mezcle bien. Dejar de lado.", "Para el arroz pegajoso de coco, lavar el arroz 3 veces y escurrir. Ponga el arroz en una cacerola, cubra con leche de coco y agua para que el líquido esté a 2 cm por encima del nivel del arroz. Agregue la sal y cubra con una tapa y deje que hierva.", "Hierva durante 5 minutos, luego, sin abrir la tapa, apague el fuego y déjelo hervir durante 20 minutos.", "Para servir, vierta o cuchara el curry y la langosta de nuevo en el caparazón (si se utiliza) y coloque en el plato de servir. Pon una cucharada de chutney de jengibre al lado. Sirva el arroz pegajoso de coco en un recipiente para servir por separado. Adorne con cilantro fresco picado."], "url": "www_bbc_co_uk_food_recipes_ginger_and_coconut_28196", "title": "Curry de langosta de jengibre y coco con chutney de jengibre y arroz pegajoso de coco", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Margarina 225g / 8oz, ablandada", "175g / 6oz de azúcar mascabado ligero", "200g / 7oz de melaza negra", "300g / 10 oz de harina de auto crianza", "2 cucharaditas de polvo de hornear", "1 cucharadita de especias mixtas molidas", "1 cucharadita de pimienta de Jamaica molida", "4 huevos de gallinas camperas", "4 cucharadas de leche", "3 piezas de tallo de jengibre de un frasco, finamente picado", "75g / 2½oz de azúcar glas, tamizado", "3 cucharadas de jarabe de jengibre de tallo del tarro", "3 piezas de tallo de jengibre de un tarro, picado grueso"], "method": ["Corte un rectángulo de pergamino antiadherente para hornear para que se ajuste a la base y los lados de una lata de bandeja de 30x23x4cm / 12x9x1½ pulgadas o una lata para asar. Engrase la lata y luego alinee con el papel, empujándolo cuidadosamente en las esquinas de la lata.", "Precalentar el horno a 160 ° C / 325 ° F / Gas 3.", "Mida todos los ingredientes para el traybake en un tazón grande y bata bien durante unos dos minutos hasta que estén bien mezclados. Un mezclador eléctrico de mano es mejor para esto, pero por supuesto también puede mezclarlo a mano con una cuchara de madera. (Treacle puede ser difícil de pesar con precisión, ya que tiende a pegarse a la bandeja de la balanza. Pesar la melaza encima del azúcar supera este problema).", "Convierta la mezcla en la lata preparada, raspando los lados del recipiente con una espátula de plástico para eliminar toda la mezcla. Nivele la parte superior suavemente con la parte posterior de la espátula.", "Hornee en el horno precalentado durante aproximadamente 35-40 minutos, o hasta que la bandeja se suelte hacia atrás cuando se presione ligeramente con un dedo en el centro y empiece a encogerse alejándose de los lados de la lata. Deje que la bandeja se enfríe un poco, luego retire la torta de la lata alejando el papel de los lados de la lata. Dé vuelta a una rejilla de enfriamiento, quite el papel de revestimiento y deje que se enfríe por completo.", "Para hacer el glaseado, mezcle el azúcar glas y el jarabe en un tazón pequeño hasta que quede suave y tenga una consistencia uniforme. Vierte el glaseado sobre el pastel, extiéndelo suavemente hasta los bordes con un pequeño cuchillo de cocina y espolvorea con el jengibre tallo picado para decorar.", "Permita que la formación de hielo se establezca antes de cortar el traybake para servir."], "url": "www_bbc_co_uk_food_recipes_ginger_and_treacle_60494", "title": "Jengibre y melaza con especias traybake", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 15-20 rebanadas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/ginger_and_treacle_60494_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 200g / 7oz", "1 cucharadita de polvo de hornear", "½ cucharadita de bicarbonato de soda", "2 cucharaditas de jengibre molido", "¼ cucharadita de sal marina fina", "175g / 6oz azúcar moreno claro y suave", "2 huevos grandes de gallinas camperas, a temperatura ambiente", "200ml / 7fl oz de aceite vegetal, más extra para engrasar", "200 g / 7 oz de zanahorias, peladas y ralladas", "Piezas de nogal de 100g / 3½oz, más o menos picadas, más extra para decorar", "Jengibre cristalizado de 75g / 2½oz, finamente picado, más extra para decorar", "100g / 3½oz de mantequilla sin sal, ablandada", "100g / 3½oz de azúcar glas, tamizado si tiene grumos", "1 cucharada de harina de maíz", "100g / 3½oz de queso crema", "1 cucharada de jengibre fresco rallado grueso"], "method": ["Precaliente el horno a 170C / 150C Fan / Gas 3½ y engrase los lados y forre la base de una lata de torta con forma de resorte de 20cm / 8in con papel de hornear.", "Mezcle la harina, el polvo de hornear, el bicarbonato de soda, el jengibre molido y la sal en un tazón.", "Batir el azúcar, los huevos y el aceite en otro tazón grande hasta que estén completamente mezclados, luego agregue gradualmente la mezcla de harina. En esta etapa, la mezcla puede parecer alarmantemente rígida, pero las zanahorias la relajarán. Batir las zanahorias y luego doblar las nueces y el jengibre cristalizado, hasta que todo esté uniformemente combinado.", "Cuchara en la lata preparada. No se preocupe si parece que no tiene suficiente rebozado, ya que la torta se levantará bien a medida que hornea. Suavice la parte superior y hornee por 45-55 minutos. Cuando esté listo, la torta se pondrá dorada en la parte superior, comenzando a encogerse alejándose de los bordes de la lata y un probador de torta saldrá con solo unas migas pegadas. Transfiera a una rejilla de alambre y deje enfriar en su lata.", "Mientras tanto, para hacer la guinda, batir la mantequilla y el azúcar glas juntos y cuando se combinan, batir en la harina de maíz, seguido de la mitad del queso crema. Una vez que está incorporado, bate en la mitad restante. Tenga cuidado de no sobrepasar o la formación de hielo se pondrá demasiado líquida. Exprime el jugo del jengibre rallado en el tazón y mezcla, descarta la carne de jengibre. Cubra con una película adhesiva y colóquela en el refrigerador.", "Cuando el pastel esté completamente frío, retire la formación de hielo de la nevera durante unos 20 minutos. Batir brevemente para asegurarse de que esté suave. Retire la torta de la lata y colóquela en un plato o en un soporte para pasteles. Extienda la guinda por encima, agite un poco, luego espolvoree nueces picadas y jengibre cristalizado encima."], "url": "www_bbc_co_uk_food_recipes_ginger_and_walnut_carrot_68622", "title": "Pastel de zanahoria de jengibre y nuez", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 8-12 rebanadas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/ginger_and_walnut_carrot_68622_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["70 g / 2½ oz de mantequilla", "80g / 2¾oz de azúcar mascabado ligero", "2 cucharadas de melaza o melaza negra", "8 vainas de cardamomo", "Harina normal de 250g / 9oz", "½ cucharadita de bicarbonato de soda", "2 cucharaditas de canela molida", "1 cucharadita de jengibre molido", "1 huevo de gallinas camperas, solo yema", "alrededor de 2 cucharadas de leche", "1 cucharada de azúcar glas", "1 limón, solo jugo"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Ligeramente unte la bandeja de horno.", "Bata la mantequilla y el azúcar juntos en un tazón con una batidora eléctrica hasta que estén suaves y esponjosos. Batir en la melaza o melaza negro.", "Rompe las vainas de cardamomo y aplasta las semillas finamente. Agrégalos a la mezcla con la harina, el bicarbonato de soda, la canela, el jengibre y la yema de huevo.", "Agregue un par de cucharadas de leche y luego agréguelo para formar una masa.", "Haga rodar la masa sobre una superficie enharinada hasta un grosor de moneda de 1 £. Corta en tus formas deseadas.", "Coloque los bizcochos en la bandeja de horno con mantequilla y hornee durante 12-14 minutos. Retire del horno y deje enfriar en la rejilla para enfriar. Repita con la masa restante.", "Combine el azúcar glas y el jugo de limón en un tazón hasta que quede suave. Hiele las galletas con un patrón de su elección."], "url": "www_bbc_co_uk_food_recipes_ginger_biscuits_87673", "title": "Galletas de jengibre", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 10-12 galletas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/ginger_biscuits_87673_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500g / 1lb 2oz de judías gigantes o judías verdes, remojadas durante la noche", "1 cebolla picada", "2 dientes de ajo picados", "6 cucharadas de aceite de oliva", "½ cucharadita de pimentón dulce", "1 cucharada de puré de tomate", "1 x 400 g de tomate picado", "1 cucharadita de sal", "pimienta negra recién molida, al gusto", "350 g / 12 oz de acelgas o espinacas, lavadas", "pequeño puñado de perejil fresco, picado", "pequeño puñado de menta fresca, picado"], "method": ["Escurrir los frijoles, cubrir con agua fresca y llevar a ebullición. Baje a fuego lento y cocine de 1½ a 2 horas hasta que los frijoles estén tiernos.", "Suavemente suavizar la cebolla y el ajo en 2 cucharadas de aceite de oliva durante 5 minutos. Cuando esté suave, mezcle el pimentón, puré de tomate, tomates picados, 100 ml / 3½ fl oz de agua, sal y pimienta.", "Llevar a ebullición, luego reducir a fuego lento y cocinar durante 30 minutos. Agregue la acelga y quite el fuego.", "Precalentar el horno a 160C / 140C Fan / Gas 3.", "Cuando los frijoles estén cocidos, escúrralos y mezcle con la salsa de tomate y acelga, agregue otras 2 cucharadas de aceite de oliva y las hierbas picadas.", "Transfiera los frijoles a una cacerola, rocíe con el aceite de oliva restante y hornee durante 35-40 minutos hasta que los frijoles estén tiernos y la salsa espesada y burbujeante. Sirva caliente, caliente o a temperatura ambiente."], "url": "www_bbc_co_uk_food_recipes_gigantes_with_tomatoes_47546", "title": "Gigantes con tomates y verduras", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Sirve 4-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gigantes_with_tomatoes_47546_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de mantequilla", "100g / 3½oz de avena jumbo", "100 g / 3½ oz de avena", "450 g / 1 libra de chocolate negro, 72 por ciento", "150ml / 5fl oz de crema doble", "150g / 5½oz de arándanos secos", "150g / 5½oz de cerezas secas", "Jengibre cristalizado 150g / 5½oz, picado"], "method": ["Derretir la mantequilla en una sartén. Agregue ambos tipos de avena y cocine durante tres minutos. Transfiera a un plato de horno que cabe en su refrigerador.", "Coloque un recipiente sobre una fuente de agua hirviendo. Agregue el chocolate y la crema al recipiente y déjelos derretir durante 15 minutos sin remover.", "Agregue los arándanos, las cerezas y el jengibre a la avena y revuelva.", "Cuando el chocolate se haya derretido por completo, revuelva un poco y luego vierta sobre la avena y la fruta. Dobla el chocolate y luego refrigéralo por 30 minutos.", "Cuando esté listo, romper en pedazos a mano y servir."], "url": "www_bbc_co_uk_food_recipes_ginger_chocolate_oat_bar_55755", "title": "Barra de avena de chocolate y jengibre", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 12-15", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/ginger_chocolate_oat_bar_55755_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3kg / 6lb 8oz junta gammon no ahumada, fuera del hueso", "600ml / 21fl oz de cerveza de jengibre", "4 piezas de tallo de jengibre, finamente picado", "4 cucharadas de jarabe de jengibre del tarro", "200g / 7oz de crema entera en grasa", "6 cucharadas de mayonesa entera", "2 cucharadas de mostaza Dijon", "2 cucharadas de mostaza integral", "pizca de azúcar en polvo", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 160C / 140C Fan / Gas 3.", "Para hacer el gammon, coloque la junta gammon en una olla que se ajuste cómodamente. Vierta la cerveza de jengibre y 1,2 litros / 2 pintas de agua o lo suficiente para cubrir el gammon. Cubra con una tapa, deje hervir y hierva durante unos minutos. Transfiera al horno por aproximadamente 2½ horas o hasta que esté cocido. Alternativamente, cocine a fuego lento a fuego lento durante aproximadamente 2 horas y media.", "Aumente la temperatura del horno a 220C / 200C Fan / Gas 7.", "Retire la junta gammon del líquido y, con un cuchillo afilado, corte la piel, simplemente dejando una capa muy delgada.", "Alinee una lata de asar con papel de cocina, coloque el jamón, coloque la grasa en la lata y envuélvala alrededor de la carne dejando la parte superior. Califique la grasa y la llovizna sobre el jarabe de jengibre. Dispersar sobre el jengibre picado y presionar ligeramente para cubrir la grasa superior.", "Hornee en el horno caliente durante unos 25 minutos o hasta que estén dorados y glaseados en la parte superior.", "Para hacer la salsa, mezcle todos los ingredientes y sazone con sal y pimienta.", "Cortar el jamón en rodajas finas y servir caliente o frío con la salsa."], "url": "www_bbc_co_uk_food_recipes_ginger_gammon_with_92608", "title": "Ginger jamón con salsa de mostaza", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 10-12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/ginger_gammon_with_92608_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200 g / 7 onzas de hielo", "Arándanos congelados de 400 g / 14 oz, más extra para la decoración", "2-4 perillas de jengibre conservado en tallo (dependiendo de qué tan gingery te guste)", "3 cucharadas de jarabe de la jarra de jengibre", "500ml / 18fl oz de sidra"], "method": ["Mezcle todos los ingredientes a excepción de la sidra en una licuadora.", "Vierta la sidra y mezcle de nuevo.", "Servir en una jarra con algunos arándanos congelados para decorar."], "url": "www_bbc_co_uk_food_recipes_ginger_fizz_01295", "title": "Ginger fizz", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Hace 1 jarra grande", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/ginger_fizz_01295_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Crema doble 500ml / 18fl oz", "7 cucharadas de jarabe de jengibre, de un tarro", "½ cucharadita de jengibre molido", "4 cucharadas de miel", "110g / 3¾oz de tallo de jengibre en un tarro, finamente picado", "150g / 5½oz de azúcar moreno claro y suave", "150 g / 5½ oz de mantequilla ablandada, más extra para engrasar", "Jarabe de oro de 250 g / 9 oz", "75g / 2¾oz de melaza negra", "125 g / 4½ oz de avena", "Harina de 175g / 6oz de auto crianza", "3 cucharadas de jengibre molido", "1 cucharadita de nuez moscada molida", "1 cucharadita de especias mixtas", "pizca de sal", "2 huevos de gallinas camperas, golpeados", "5 cucharaditas de leche", "1 huevo blanco de corral", "550g / 1lb 4 oz de avellanas enteras", "200 g / 7 oz de azúcar en polvo", "¼ cucharadita de sal marina", "150 g / 5½ oz de azúcar en polvo", "200 g / 7 oz de fresas frescas", "verbena de limón"], "method": ["Para el helado de jengibre, coloca la crema, el jarabe de jengibre, el jengibre molido y la miel en un tazón limpio. Batir hasta que se formen picos suaves en la crema cuando se quita la batidora. Agregue el jengibre tallo picado, luego transfiera a un recipiente a prueba de congelación y colóquelo en el congelador durante 2 horas o hasta que se solidifique. Retire del congelador 10 minutos antes de servir para ablandar levemente.", "Precaliente el horno a 140C / 120C Ventilador / Gas 1. Aplique mantequilla a una lata de pastel de 30x20cm / 12x8 pulgadas.", "Para el parkin, ponga el azúcar moreno, la mantequilla, el jarabe y la melaza en una cacerola pequeña y derrita a fuego lento.", "Coloque la avena, la harina, el jengibre, la nuez moscada, la mezcla de especias y la sal en un tazón grande y mezcle. Agregue los huevos y la leche. Vierta la mezcla derretida de la mantequilla y el azúcar en el tazón y mezcle con un batidor hasta que estén bien combinados. Verter en la lata preparada y hornear durante 1 ¼ horas, o hasta que esté firme en el centro. Retire del horno y deje en la lata para que se enfríe antes de girar y cortar en cuadrados.", "Para las avellanas azucaradas, reduzca la temperatura del horno a 130 ° C / 110 ° Ventilador / Gas 1.", "Batir ligeramente la clara de huevo con 1 cucharada de agua. Agregue las avellanas y revuelva hasta que estén bien cubiertas. Mezcle el azúcar y la sal y espolvoree sobre las nueces. Mezcle para cubrir, y se extendió uniformemente en una bandeja forrada. Cocine durante 1 hora en el horno, revolviendo ocasionalmente, hasta que estén doradas. Retirar y dejar enfriar.", "Para la decoración, caliente una sartén mediana y agregue el azúcar, deje en el fuego hasta que se convierta en caramelo (PRECAUCIÓN: el azúcar hirviendo es extremadamente caliente. Maneje con mucho cuidado.) Use un cepillo de pastelería para cepillar cuidadosamente el caramelo en platos para servir .", "Cortar el jengibre parkin en cuadrados y colocar en los platos junto con las avellanas azucaradas, fresas y hierba luisa. Cubra con una bola de helado de jengibre y sirva."], "url": "www_bbc_co_uk_food_recipes_ginger_parkin_with_93910", "title": "Ginger parkin con helado de jengibre y avellanas azucaradas", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de maní", "1½ cucharada de jengibre fresco finamente picado", "1 cucharada de ajo finamente picado", "2 cucharadas de cebolletas finamente picadas", "Vieiras de 450 g / 1 lb, incluidas las huevas", "1 cucharada de vino de arroz Shaoxing o jerez seco", "2 cucharaditas de salsa de soja ligera", "1 cucharadita de azúcar", "½ cucharadita de sal", "½ cucharadita de pimienta blanca recién molida", "1 cucharada de aceite de maní", "2 cucharadas de ajo, en rodajas finas", "Hojas verdes de 700g / 1½lb, como la col china o el bok choi, cortadas en trozos de 7,5 cm / 3 in", "2 cucharaditas de aceite de sésamo", "Fideos de e-fu secos 225g / 8oz o fideos de huevo secos", "2 cucharadas de aceite de sésamo", "4 cucharadas de pasta de sésamo o mantequilla de maní", "1 cucharada de salsa de soja oscura", "2 cucharadas de salsa de soja ligera", "2 cucharaditas de azúcar", "225ml / 8fl oz de caldo de pollo", "½ cucharadita de sal", "Pimienta blanca recién molida, al gusto"], "method": ["Para las vieiras de jengibre con verduras chinas, caliente un wok o una sartén grande a fuego alto hasta que esté caliente. Agregue el aceite, y cuando esté muy caliente y ligeramente humeante, agregue el jengibre, el ajo y las cebollas tiernas y saltee durante 10 segundos. Inmediatamente agregue las vieiras y saltee durante 1 minuto.", "Agregue el vino de arroz, la salsa de soya, el azúcar, la sal y la pimienta. Continúe revolviendo por 2 minutos, quite las vieiras del wok con cualquier salsa y déjelas a un lado.", "Para los fideos de chiu chow, en una olla grande de agua salada hirviendo, pula los fideos durante 2 minutos o hasta que estén apenas suaves. Escurra bien y mezcle inmediatamente con aceite de sésamo y acomódelo en un plato de servir.", "Mezcle todos los ingredientes de la salsa de sésamo en una olla pequeña y cocine a fuego lento. Deje que la salsa se enfríe un poco y mezcle con los fideos. Servir a la vez", "Para terminar las vieiras, limpie el wok clean, agregue el aceite de cacahuete y caliente a fuego alto. Cuando esté muy caliente y ligeramente humeante, agregue el ajo en rodajas y saltee durante 10 segundos. Agregue los verdes chinos y saltee por 3 minutos o hasta que los verdes se hayan marchitado un poco.", "Regrese las vieiras al wok y continúe revolviendo por 3 minutos. Ahora agregue el aceite de sésamo y saltee por otro minuto. Servir a la vez"], "url": "www_bbc_co_uk_food_recipes_ginger_scallops_with_31234", "title": "Escalopes de jengibre con verduras chinas chiu chow fideos en salsa de sésamo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina de auto crianza de 200g / 7oz", "200g / 7 oz de azúcar", "1 cucharadita de jengibre molido", "1 cucharadita de bicarbonato de soda", "Margarina de 55g / 2oz, más extra para engrasar", "1 huevo de gallinas camperas, golpeado", "2 cucharadas de jarabe de oro", "240ml / 9fl oz de agua caliente"], "method": ["Precaliente el horno a 180C / 350F Gas 4. Engrase y forre una bandeja para hornear de 28cm x 18cm / 11in x 7in con papel antigrasa.", "Mezcle la harina, el azúcar, el jengibre y el bicarbonato de soda en un tazón. Con los dedos, frote la margarina hasta que la mezcla se asemeje a pan rallado. Agregue el huevo batido, el almíbar y el agua caliente y mezcle bien con una cuchara de madera hasta que se combinen.", "Vierta la mezcla en la lata preparada y hornee en el medio del horno durante 35-40 minutos, o hasta que estén doradas y la parte superior esté elástica al tacto. Dejar enfriar en la lata. Una vez frío, corte en cuadrados."], "url": "www_bbc_co_uk_food_recipes_ginger_sponge_cake_51697", "title": "Bizcocho de jengibre", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 12 rebanadas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/ginger_sponge_cake_51697_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["130g / 4⅔oz de mantequilla sin sal", "80g / 2¾oz de melaza", "50g / 1¾oz de jarabe dorado", "50g / 1¾oz de tallo de jengibre en almíbar, finamente picado", "3 cucharadas de jarabe, del tallo de jengibre", "1 limón, ralladura solamente", "130g / 4⅔oz de azúcar morena clara", "500g / 1lb 2 oz de harina común", "2 cucharaditas de jengibre molido", "2 cucharaditas de canela molida", "1 cucharadita de nuez moscada recién rallada"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4. Coloque dos bandejas grandes para hornear con papel de hornear.", "En una cacerola, caliente la mantequilla, la melaza, el jarabe dorado, el jengibre y el jarabe, la ralladura de limón y el azúcar a fuego medio hasta que se derrita y se combine bien.", "Tamiza la harina, el jengibre molido, la canela y la nuez moscada en un tazón y revuelve. Poco a poco agregue la mezcla húmeda y caliente, mezclando todo el tiempo con una cuchara de madera hasta que se combinen. Amasar brevemente para unir la masa.", "Estirar la masa entre dos hojas de papel resistente a la grasa (es bastante pegajoso) hasta un grosor aproximado de 3-4 mm. Recorta formas con un cortador de galletas y transfiérelas a las bandejas preparadas (las galletas no se extienden demasiado para que puedas ponerlas muy juntas).", "Hornee por 15 minutos o hasta que esté firme y dorado. Coloque sobre una rejilla de alambre para que se enfríe por completo."], "url": "www_bbc_co_uk_food_recipes_ginger_thins_11044", "title": "El jengibre adelgaza", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace aproximadamente 35 galletas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/ginger_thins_11044_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1oz / 25g pasas", "Jugo de manzana 3½pts / 2L", "3½pts / 2L de cerveza de jengibre", "Jengibre de raíz de 1in / 2cm (rallado con piel y exprimido para el jugo - debe producir aproximadamente 1 cucharada / 15 ml)"], "method": ["Remoje las pasas en el jugo de manzana durante 1 hora.", "Agregue la cerveza de jengibre y el jugo de raíz de jengibre. Servir a la vez"], "url": "www_bbc_co_uk_food_recipes_gingerapplefizz_8853", "title": "Ginger apple fizz", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 60}, "serves": "Sirve 8-10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Crema doble 500ml / 18fl oz", "2 cucharadas de jengibre fresco finamente picado", "4 yemas de huevo de gallinas camperas", "125 g / 4½ oz de azúcar en polvo", "125 g / 4½ oz de calabaza cocida, en puré", "1 cucharadita de jugo de limón"], "method": ["Llena un tazón grande con hielo y un poco de agua.", "Coloque la crema y el jengibre en una cacerola y deje que hierva.", "Retire la cacerola del fuego y cubra, dejando la crema para infundir durante 30 minutos.", "Después de 30 minutos devuelva la sartén al fuego y vuelva a hervir.", "Coloque las yemas de huevo y el azúcar en un bol y mezcle.", "Vierta un poco de la mezcla de crema caliente en las yemas de huevo y batir continuamente para combinar.", "Vierta la mezcla de yema de huevo en la cacerola que contiene el resto de la crema y continúe cocinando suavemente durante 3-4 minutos, o hasta que la mezcla cubra la parte posterior de una cuchara.", "Agregue la calabaza a la mezcla de crema y revuelva bien.", "Coloque la cacerola en el baño de agua helada, revolviendo ocasionalmente, hasta que se enfríe.", "Agregue el jugo de limón a la crema y cuele a través de un tamiz de malla fina.", "Vierta la mezcla en una máquina de helados y batir hasta que quede suave. Mantener congelado hasta que esté listo para su uso."], "url": "www_bbc_co_uk_food_recipes_gingerandbutternutsq_84060", "title": "Jengibre y helado de calabaza", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cebolla, finamente picada", "4 dientes de ajo, picados", "25 g / 1 oz de perejil, finamente picado", "25g / 1oz de cebollín, finamente picado", "25g / 1oz de tomillo, finamente picado", "25 g / 1 oz de orégano, finamente picado", "Cebollas de primavera 25g / 1oz, finamente picadas", "50ml / 2fl oz de aceite de colza", "500g / 1lb 2oz de carne de salchicha de cerdo", "100 g / 3½ oz de albaricoques secos, finamente picados", "200 g / 7 oz de parkin (o pan de jengibre o bulla) se derrumbaron en el tamaño de pan rallado", "1 huevo de gallinas camperas, golpeado"], "method": ["Precalentar el horno a 150 ° C / 130 ° Ventilador / Gas 2.", "En un procesador de alimentos, pulse juntos la cebolla, el ajo, las hierbas, las cebolletas y el aceite de colza.", "En un tazón, mezcle los ingredientes mezclados con la carne de salchicha, albaricoques y parkin. Agregue el huevo y sazone con sal y pimienta.", "Rodar en bolitas y colocar en una bandeja para hornear forrado y hornear durante unos 25 minutos."], "url": "www_bbc_co_uk_food_recipes_gingerbread_apricot_12205", "title": "Relleno de albaricoque pan de jengibre", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50g / 1¾oz de azúcar mascabado ligero", "50g / 1¾oz de azúcar moreno oscuro", "50g / 1¾oz de jarabe dorado", "150 g / 5½ oz de mantequilla, picada", "1 huevo mediano de gallinas camperas (a temperatura ambiente)", "Harina normal 300g / 10½ oz", "1 cucharada de jengibre molido", "1 cucharada de especias mixtas molida", "50 g / 1¾oz de caramelos duros, como mentas glaciares, dulces de colores endurecidos, trozos de mantequilla o toffees duros", "20 cordones de fresa", "15 g / ½ oz de chocolate negro o con leche picado en trozos pequeños", "10 mini tazas de mantequilla de maní u otros mini chocolates"], "method": ["Coloque los dos tipos de azúcar, el sirope dorado y la mantequilla en una cacerola de base pesada. Ponlo a fuego medio y tibia, revolviendo ocasionalmente, hasta que la mantequilla se haya derretido y los azúcares se hayan disuelto.", "Transfiera la mezcla a un recipiente grande y deje enfriar durante aproximadamente 5 minutos antes de batir en el huevo. Tamice la harina y luego las especias, una a la vez, mezclando suavemente después de cada adición, para hacer una masa suave.", "Coloque la masa en una bolsa de comida o envuélvala en una película adhesiva. Enfríe durante varias horas, preferiblemente de la noche a la mañana, para reafirmarse: esto hace que la masa sea más fácil de extender.", "Retire la masa de la nevera 15-30 minutos antes de enrollarla para que se ablande levemente. Divida la masa por la mitad y extienda cada pieza entre dos hojas de pergamino para horno con el grosor de una moneda de 1 £. Si crees que la masa es muy pegajosa, espolvoréala ligeramente y el pergamino con un poco de harina.", "Despegue la hoja superior de pergamino. Usando los cortadores redondos, ya sea de un solo tamaño o de una variedad, recorta los discos. Para cada chuchería, debes cortar también una tira de masa de 1,5 x 2 cm (es más fácil cortarlos de una pieza larga de 2 cm de ancho. Pelar el exceso de masa y volver a enrollar los recortes entre pergamino fresco para cortar más discos Repita con la otra pieza de masa.", "Levanta el borde de un disco y desliza el extremo de una tira de masa debajo de él. Presione suavemente para que la tira se adhiera a la parte inferior del disco; aproximadamente 1 cm de la tira debe sobresalir del adorno (este será el accesorio para colgar).", "Use el extremo de un mango delgado de pincel, paja o barra de cóctel para hacer un orificio cerca de la parte superior de la tira que sobresale (puede enhebrar esto con una cuerda una vez que la galleta esté cocida).", "Repita con los discos y tiras restantes. Asegúrese de que haya un pequeño espacio entre las piedras, luego levántelas (en sus hojas de pergamino), colóquelas en las bandejas para hornear y refrigere durante 15 minutos.", "Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4 mientras las galletas se enfrían.", "Mientras tanto, aplasta los dulces hervidos en trozos pequeños. Retire las chucherías del refrigerador y use el cortador de estrellas para sellar una forma de estrella desde el centro de cada una. Retire con cuidado estas estrellas y colóquelas en una bandeja para hornear forrada con pergamino.", "Coloque con cuidado los dulces aplastados dentro de las formas de las estrellas recortadas (no mezcle los dulces). Hornee los bizcochos durante 8-12 minutos o hasta que los dulces se hayan derretido y los bizcochos estén dorados por los bordes. Hornee las estrellas recortadas por separado durante aproximadamente 5 minutos. Puedes comer estas estrellas tal como son o regalarlas con los adornos de galletas como regalo.", "Mientras aún esté tibio, verifique los orificios en las tiras; si se han cerrado durante la cocción, ábralas de nuevo. Deje que los bizcochos se endurezcan en sus bandejas hasta que los dulces derretidos se hayan fraguado antes de transferirlos, en el pergamino, a una rejilla para que se enfríen.", "Pase un encaje de fresa a través del orificio en cada chuchería, usando el extremo de un palillo de cóctel o una aguja para ayudar a pasarlo. Atar en lazos para colgar.", "Derrita el chocolate en un microondas o en un recipiente resistente al calor colocado sobre una fuente de agua, luego déjelo enfriar un poco. Corta con cuidado los mini chocolates por la mitad (solo necesitas 15 mitades, pero vale la pena tener algunas piezas de repuesto). Usa el pincel / barra de cóctel para aplicar chocolate derretido en la franja que sobresale en la parte superior de cada chuchería y presiona sobre la mitad de un mini chocolate, que debe simplemente ocultar el orificio y cubrir el hilo. Deja para establecer."], "url": "www_bbc_co_uk_food_recipes_gingerbread_baubles_08209", "title": "Gingerbread chucherías", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Hace 15 galletas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gingerbread_baubles_08209_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina de trigo sarraceno 230 g / 9 oz, más extra para espolvorear", "120g / 4¼ oz de harina de papa (también conocida como almidón de papa)", "½ cucharadita de bicarbonato de soda", "½ cucharadita de goma xantana", "pellizcar copos de sal marina", "3 jengibre molido cucharadita de jengibre", "110 g / 3¾oz de mantequilla fría sin sal, en cubos", "1 huevo grande de gallinas camperas", "170g / 5¾oz azúcar moreno claro", "2 cucharadas de jarabe de un frasco de jengibre conservado", "2 cucharadas de jarabe de miel o jarabe de arce"], "method": ["Precaliente el horno a 190C / 170C Ventilador / Gas 5. Coloque dos bandejas para hornear con papel para hornear.", "Tamiza las harinas en un tazón grande y agrega el bicarbonato de soda, goma de xanthum, sal y jengibre molido. Frote la mantequilla hasta que no haya grumos visibles (o mezcle en un procesador de alimentos). Agregue el azúcar moreno.", "Batir el huevo con los dos jarabes y verter en los ingredientes secos. Agregue el líquido con un cuchillo y luego amasarlo a mano hasta que la mezcla se una como una masa suave.", "Espolvoree una superficie de trabajo con harina de trigo sarraceno y extienda la masa hasta 4 mm de grosor. Usando cortadores de galletas o una plantilla, corte los bizcochos.", "Transfiera a la bandeja para hornear preparada y hornee por unos 10 minutos o hasta que se dore. Deje que los bizcochos se enfríen durante unos minutos antes de transferirlos a una rejilla para que se enfríen por completo."], "url": "www_bbc_co_uk_food_recipes_gingerbread_biscuits_37157", "title": "Galletas de jengibre sin gluten", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace alrededor de 50 galletas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gingerbread_biscuits_37157_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de jarabe de oro", "60g / 2¼ oz de azúcar en polvo", "50g / 1¾oz de mantequilla", "3 cucharadas de crema doble", "½ cucharadita de jengibre molido", "½ cucharadita de canela molida", "Harina normal de 175g / 6oz, más extra para espolvorear", "½ cucharadita de bicarbonato de soda"], "method": ["Caliente el jarabe dorado, el azúcar y la mantequilla en una cacerola mediana a fuego medio. Revuelva hasta que la mezcla se caliente y el azúcar se disuelva por completo. Retire del fuego y agregue la crema y las especias.", "Agregue la harina y el bicarbonato de soda, revolviendo mientras lo agrega hasta que tenga una mezcla suelta. Coloque una hoja de papel pergamino en una bandeja para hornear e incline la mezcla encima. Cubra con otro trozo de pergamino y aplaste la masa ligeramente. Deje enfriar en la nevera durante 2-3 horas. Después de esto deberías tener una masa espesa.", "Precalentar el horno a 180C / 350F / Gas 4.", "Retire la masa del refrigerador y ruede entre las hojas de papel con un rodillo hasta 1 cm / ½ pulgadas de espesor.", "Polvore una superficie de trabajo con harina y ruede la masa con un rodillo enharinado hasta 5 mm / ¼ de grosor (ya que desea que las galletas solo se eleven ligeramente al cocinarlas y que sean buenas y crujientes cuando estén cocidas).", "Con un cortador enharinado de su elección, recorte los bizcochos y colóquelos en una bandeja de horno revestida. Es posible que deba cocinarlos en lotes o usar dos bandejas si no caben todos en una bandeja. Cualquier trozo de masa se puede presionar, volver a enrollar y cortar.", "Coloque los bizcochos en el horno precalentado y hornee durante 8-10 minutos, o hasta que los bizcochos tengan un color marrón intenso a los lados y un poco más pálido en el centro.", "Retire del horno. Si tiene la intención de colgar las galletas (por ejemplo, de un árbol de Navidad), perfore un pequeño orificio en la parte superior de la galleta inmediatamente después de que salgan del horno y colóquelas en una rejilla para que se enfríen.", "Una vez frío, puedes enhebrar una cinta o una cuerda a través del orificio en la parte superior de la galleta para colgarla del árbol. Almacene en un recipiente hermético para que las galletas permanezcan crujientes."], "url": "www_bbc_co_uk_food_recipes_gingerbread_biscuits_38814", "title": "Galletas de jengibre", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Sirve 15-20", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gingerbread_biscuits_38814_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["225g / 8oz de mantequilla, ablandada", "225g / 8oz de azúcar mascabado ligero", "Jarabe dorado de 225g / 8oz", "225g / 8oz de melaza negra", "225g / 8oz de harina de auto crianza, tamizada", "Harina de auto crianza integral 225g / 8oz tamizada", "4 cucharaditas de jengibre molido", "2 cucharadas de tallo de jengibre (de un tarro), picado", "2 huevos de gallinas camperas, golpeados", "300ml / 10½ fl oz de leche", "150g / 5oz de azúcar glasé", "1 naranja, jugo y ralladura"], "method": ["Cubra una lata de torta cuadrada de 23 cm / 9 pulgadas de al menos 4 cm / 1½ pulgadas de profundidad con pergamino para hornear.", "Precalentar el horno a 160 ° C / 325 ° F / Gas 3.", "Coloque la mantequilla, el azúcar, el jarabe dorado y la melaza negra en una sartén y caliente suavemente hasta que la mezcla se haya derretido uniformemente. Dejar enfriar un poco.", "Tamiza las harinas, el jengibre molido y el jengibre en un tazón grande y mezcla suavemente. Vierta la mezcla de mantequilla enfriada en la harina. Agregue los huevos y la leche y bata con una cuchara de madera hasta que estén bien combinados.", "Vierta la masa de la torta en la lata y nivele la superficie con una espátula o con el dorso de una cuchara. Hornee durante 50 minutos, o hasta que la tarta se haya levantado y esté dorada, y un pincho insertado en el centro salga limpio. Déjelo enfriar un poco en la lata, luego transfiera la torta a una rejilla de alambre y déjela enfriar por completo.", "Mientras tanto, para el glaseado de naranja, tamice el azúcar glas en un tazón. Agregue aproximadamente dos cucharadas de jugo de naranja y mezcle hasta obtener una pasta homogénea. Agregue más jugo de naranja, según sea necesario, hasta que obtenga un glaseado uniforme de la consistencia que desea.", "Vierta la guinda sobre la torta enfriada y extiéndala ligeramente, dejando que rezume sobre los bordes. Espolvorea la ralladura de naranja picada y deja la torta a un lado hasta que se haya solidificado."], "url": "www_bbc_co_uk_food_recipes_gingerbread_cake_with_69829", "title": "Pastel de pan de jengibre con glaseado de naranja", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 10-12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gingerbread_cake_with_69829_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["140g / 5oz de mantequilla sin sal", "200 g / 7 oz de azúcar en polvo de oro", "60g / 2¼ oz de melaza negra", "60g / 2¼ oz de jarabe dorado", "2 huevos de gallinas camperas, más 2 yemas de huevo de gallinas camperas", "Harina normal 300g / 10½ oz", "1 cucharadita de jengibre molido", "1 cucharadita de nuez moscada molida", "2 cucharaditas de polvo de hornear", "1 cucharadita de sal", "240ml / 8½ fl oz de leche, calentada", "125 g / 4½ oz de azúcar en polvo blanco", "Crema doble 80ml / 2½fl oz", "½ cucharadita de sal (o al gusto)", "1 cucharadita de extracto de vainilla", "160g / 5¾oz de mantequilla salada, suavizada", "200g / 7oz de azúcar glasé"], "method": ["Precaliente el horno a 190 ° C / 375 ° F / Gas 5. Coloque dos bandejas para muffins de 12 hoyos con 15 cajas de papel.", "Batir la mantequilla y el azúcar juntos en un bol hasta que estén suaves y cremosos. Batir la melaza, el sirope, los huevos y las yemas de huevo hasta que estén bien combinados.", "Tamizar juntos la harina, el jengibre, la nuez moscada, el polvo de hornear y la sal. Agregue la mitad de la mezcla de harina a la mezcla de mantequilla, luego bata a la mitad de la leche tibia. Agregue la mezcla de harina restante y la leche restante y bata hasta que estén bien combinados.", "Coloca la mezcla en las cajas de muffins y hornea por 20-25 minutos, o hasta que esté bien subida y ligeramente firme al tacto. Retire los pasteles de la lata y déjelos a un lado para que se enfríen en una rejilla para enfriar.", "Para la crema de caramelo salada, caliente el azúcar y cuatro cucharadas de agua en una cacerola a fuego lento hasta que el azúcar se haya disuelto, luego aumente el fuego y cocine el caramelo por 2-3 minutos, o hasta que esté dorado y ligeramente espeso. Retire la sartén del fuego de inmediato y agregue la crema. (PRECAUCIÓN: el caramelo puede chisporrotear un poco cuando agrega la crema.) Agregue la sal y la vainilla y déjelas enfriar por completo.", "Bata la mantequilla y el azúcar glas por al menos 4-5 minutos, luego bate en el caramelo. Cuando se combina, esparcir el glaseado sobre los pasteles de la taza y espolvorear con un poco de sal marina extra.", "Decora los cupcakes con la crema de mantequilla."], "url": "www_bbc_co_uk_food_recipes_gingerbread_cupcakes_24180", "title": "Magdalenas de jengibre con glaseado de caramelo salado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 15 magdalenas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gingerbread_cupcakes_24180_16x9.jpg", "isVegetarian": true, "recommendations": 0}]