[{"isVegetarian": true, "title": "Beetroot, goats' cheese and walnut salad", "url": "www_bbc_co_uk_food_recipes_beetrootgoatscheesea_85188", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 ready-cooked beetroot, chopped", "50g/1¾oz goats' cheese, crumbled", "50g/1¾oz green beans, cooked, drained", "1 tbsp chopped walnuts ", "handful fresh parsley", "1 tsp Dijon mustard", "1 tsp white wine vinegar", "3 tsp olive oil", "1 tsp goats' yoghurt", "50g/1¾oz goats' cheese, crumbled"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["For the salad, place the beetroot, goats' cheese, green beans and walnuts into a large bowl and mix well. ", "Place the parsley onto a serving plate and top with the beetroot mixture.", "For the dressing, place all the dressing ingredients into a bowl and mix well.", "To serve, pour the dressing over the salad."]}, {"isVegetarian": false, "title": "Beetroot gnocchi with butter, sage and orange sauce", "url": "www_bbc_co_uk_food_recipes_beetrootgnocchiwithb_91340", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 kg/2lb 4oz floury potatoes, such as King Edward, peeled and roughly chopped", "400g/14oz cooked beetroot, peeled and roughly chopped", "300g/11oz plain flour", "1 free-range egg, lightly beaten", "pinch salt", "110g/4oz butter", "6 sage leaves", "1 orange, juice only, plus zest of 2 oranges, to serve", "salt, to taste", "4 tbsp freshly grated parmesan cheese"], "serves": "Serves 4-6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the gnocchi, place the potatoes into a pan of salted water and bring to the boil. Simmer for 15-18 minutes, or until tender.", "Drain the potatoes and return them to the heat to drive off any excess moisture. Allow them to cool for a minute and then mash well using a potato masher or ricer.", "Blend the beetroot in a food processor to a purée. Pass the purée through a fine sieve.", "Tip the flour onto a clean work surface and make a well in the centre. Add the beaten egg, mashed potato, beetroot purée and salt to the well. ", "Using your hands, mix well until the dough reaches a smooth consistency.  Split the dough into 4-6 equal pieces and roll each piece out into a long sausage shape.", "With a sharp knife, cut the gnocchi 'sausages' into 2cm/1in pieces and set aside. ", "Bring a large saucepan of lightly salted water to the boil. Add the gnocchi and simmer until they float back up to the top. As they come to the surface, lift them out with a slotted spoon. As soon as you drop the gnocchi into the boiling water, start making the sauce - you need to work quickly because the gnocchi will rise to the top after only a minute or so. ", "For the sauce, melt the butter in a large frying pan and add the sage leaves. Allow the sage to infuse for about 30 seconds and then add the orange juice and salt, to taste. ", "Scoop out the cooked gnocchi with a slotted spoon, allowing them to drain a little, and then add them to the sauce, mixing well. Cook for a minute or so until the sauce begins to thicken slightly. ", "Remove the pan from the heat, stir in the parmesan and serve immediately, sprinkled with orange zest."]}, {"isVegetarian": true, "title": "Beetroot mayonnaise", "url": "www_bbc_co_uk_food_recipes_beetrootmayonnaise_81741", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp white wine vinegar", "1 tbsp parsley stalks, roughly chopped", "1 tbsp chervil, chopped", "2 free-range egg yolks", "1 tsp English mustard powder", "150ml/5fl oz light olive oil", "150ml/5fl oz vegetable oil", "salt and freshly ground black pepper", "squeeze lemon juice", "250g/9oz cooked beetroot, quartered", "1 tbsp chives, finely chopped", "50g/1¾oz rocket", "2 tsp olive oil"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the vinegar, parsley stalks and chervil into a small saucepan and bring to the boil. Simmer until the volume is reduced to one tablespoon of liquid. ", "Strain the liquid through a sieve and discard the parsley and chervil.", "Place the egg yolks, mustard powder and infused vinegar into a food processor and blend.", "With the blender still running, gradually add the oils. Continue to blend the mixture until all the oil has been incorporated and the mixture has thickened.", "Season with salt and freshly ground black pepper and add a squeeze of lemon juice.", "To serve, mix the cooked beetroot into the mayonnaise, stir in the chives and serve on a plate with fresh rocket drizzled with olive oil."]}, {"isVegetarian": true, "title": "Beetroot relish", "url": "www_bbc_co_uk_food_recipes_beetrootrelish_86997", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 cooked beetroot in vinegar, drained and chopped", "small handful fresh chervil, chopped", "1 tbsp olive oil", "salt and freshly ground black pepper"], "serves": "Serves 1-2", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place all the ingredients into a bowl and mix well."]}, {"isVegetarian": true, "title": "Beetroot soup", "url": "www_bbc_co_uk_food_recipes_beetrootsoup_82121", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "¼ red onion, chopped", "2 beetroot, peeled and sliced", "100ml/3½ fl oz chicken stock (vegetarians may substitute vegetable stock)", "1 tbsp fresh parsley, chopped", "1 tbsp canned borlotti beans, rinsed and drained", "salt and freshly ground black pepper", "1 tbsp Greek yoghurt, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a pan over a medium heat. Add the onions and then sauté for 3-4 minutes, until softened. ", "Add the beetroot, stock, fresh parsley and borlotti beans and bring to the boil. Reduce the heat to simmer gently for 10 minutes, or until the beetroot has softened and iscooked through. Season, to taste, with salt and freshly ground black pepper, then blend with a hand blender until smooth.", "To serve, pour into a bowl and garnish with a tablespoon of Greek yoghurt."]}, {"isVegetarian": true, "title": "Beetroot soup on the quick", "url": "www_bbc_co_uk_food_recipes_beetrootsouponthequi_72798", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["350g/12oz cooked, peeled beetroot, chopped", "1 onion, grated", "1 tsp grated horseradish", "750g/1lb 10oz low-fat Greek-style yoghurt", "½ tsp celery salt", "1 tbsp cider vinegar", "½ tsp ground black pepper", "up to 300ml/½ pint vegetable stock or milk", "4 spring onions, finely chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Blend the cooked beetroot, onion, horseradish, Greek-style yoghurt, celery salt, cider vinegar and black pepper in a food processor until smooth.", "Once at a desired consistency, use vegetable stock or milk to thin down the mixture.", "The soup can be served either hot or cold.  If preferred hot, warm through on a low flame, being careful not to boil. ", "Check for seasoning.", "To serve, pour into a warmed bowl and sprinkle with chopped spring onions."]}, {"isVegetarian": true, "title": "Beetroot soup with feta", "url": "www_bbc_co_uk_food_recipes_beetrootsoupwithfeta_13774", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beetrootsoupwithfeta_13774_16x9.jpg", "ingredients": ["3-4 medium (apple-sized) beetroot (about 500-600g/1lb 2oz-1lb5oz, grated coarsely, or choped into small dice", "500g/1lb 2oz ripe tomatoes, halved", "1 clove garlic, chopped roughly ", "1 medium onion, peeled and  finely chopped ", "2 tbsp olive or sunflower oil", "500ml/16½fl oz good strong stock (beef is best, but chicken or vegetable will do)", "salt and freshly ground black pepper", "125g/4oz real (i.e. Greek not Danish) feta cheese"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the halved tomatoes in an ovenproof dish. Throw over the garlic and drizzle over half the olive oil.", "Roast for 25-30 minutes in a fairly hot oven (190C/375F/Gas 5) until soft and pulpy. Rub through a sieve to remove the skin and pips. ", "Heat the remaining oil in a pan and sweat the onion for a few minutes until soft. Add the beetroot and the stock and bring to the boil. Season lightly with salt and freshly ground black pepper. Simmer gently for 7-10 minutes until the beetroot is tender.", "Stir in the tomato purée, transfer the soup to a blender and process until completely smooth. Taste and adjust the seasoning if necessary ", "To serve cold, chill the soup in the fridge, then divide between six bowls. Using your fingers, crumble a little feta into each bowl. A sprinkling of grated raw beetroot makes a good garnish for the cold version ", "To serve hot, reheat the soup until thoroughly hot but not boiling. Divide between warm bowls and crumble over a little feta into each bowl. Serve with crusty bread."]}, {"isVegetarian": false, "title": "Beetroot with green sauce", "url": "www_bbc_co_uk_food_recipes_beetrootwithgreensau_89906", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 medium raw beetroot", "olive oil", "large-flaked sea salt", "handful fresh mint, finely chopped", "handful fresh parsley, finely chopped ", "2 tbsp baby capers, rinsed and drained", "½ banana shallot (or 1 ordinary shallot), finely chopped", "1 garlic clove, finely chopped", "6 canned anchovy fillets in oil, drained, chopped", "½ tsp Dijon mustard", "4 tbsp olive oil", "½ lemon, juice only"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Put the beetroot into a large pan and cover with water. Bring to the boil, then reduce the heat and simmer for 40 minutes, or until tender. Drain and set aside until just cool enough to handle, then carefully rub off the beetroot skins. Discard the skins.", "Place the mint, parsley, capers, shallot and garlic into a bowl.", "Add the anchovies and the mustard and mix well.", "Add the olive oil and the lemon juice sparingly, adding more as required. Mix well and leave to stand.", "Chop each beetroot into eight equal wedges and place into a bowl. Sprinkle with a little salt and drizzle with the green sauce.", "Serve immediately."]}, {"isVegetarian": false, "title": "Belgian chocolate truffle cheesecake", "url": "www_bbc_co_uk_food_recipes_belgian_chocolate_02043", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz dark Belgian chocolate, broken into pieces", "500g/1lb 2oz full-fat soft cheese", "200ml/⅓ pint soured cream", "150g/5½oz caster sugar", "3 large eggs", "sunflower oil, for greasing", "300g/10½oz chocolate oat biscuits", "50g/2oz butter, melted", "Belgian chocolate truffles", "100g/4oz white cooking chocolate, for grating, or icing sugar"], "serves": "Serves 10", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["Lightly oil a 23cm loose-based spring-clip cake tin and line the base with baking parchment.", "Put the chocolate for the filling in a heatproof bowl and place it over a pan of simmering water. Check that the bottom of the bowl isn’t touching the water. When the chocolate has melted, remove it from the heat and stir until smooth, then set aside to cool for a few minutes.", "To make the crust, break up the biscuits roughly, then put them in a food processor and blitz them into crumbs. ", "Add the melted butter and blend until mixed. ", "Tip the mixture into the tin and press it firmly and evenly over the base. ", "Pop the tin into the freezer to harden.", "Preheat the oven to 180°C/Fan 160°C/Gas 4. ", "Bring a kettle of water to the boil. ", "Put the cheese, soured cream, sugar and eggs in a food processor and blend until smooth. With the motor running, slowly add the melted chocolate and blend until thoroughly combined.", "Remove the biscuit base from the freezer. Take 2 large sheets of foil and place them on the work surface, one across the other. Take the cake tin out of the freezer and place it in the centre of the foil and bring the foil up around it to create a bowl shape. Place the whole thing in a roasting tin. Pour the chocolate mixture on to the biscuit base. Then carefully pour hot water from the kettle into the roasting tin until it rises almost halfway up the sides of the cheesecake.", "Bake the cheesecake in the centre of the oven for 35–45 minutes. It’s ready when the chocolate mixture is almost firm but retains a slight wobble.", " Turn the oven off, but wedge a folded tea towel in the door and leave the cake to cool in the oven with the door ajar for at least 1 hour. Remove, cover with cling film and chill for at least 4 hours or overnight before serving. ", "To serve, loosen the sides of the tin with a knife and release the spring clip. Slide the dessert off the base of the tin on to a plate. ", "Decorate with the chocolate truffles and dust with grated white chocolate or icing sugar. For utter luxury, serve with some cream. Yum, yum!"]}, {"isVegetarian": true, "title": "Bellini cocktail", "url": "www_bbc_co_uk_food_recipes_bellinicocktail_67941", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bellinicocktail_67941_16x9.jpg", "ingredients": ["2 ripe peaches, peeled, halved and stone removed, or the equivalent using tinned peaches in natural juice", "chilled champagne or sparkling wine", "2 chilled champagne glasses"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the peaches in a small blender and purée until totally smooth. This can be done well in advance and kept in the fridge. Spoon half into the chilled champagne glasses and slowly top up with champagne, stirring as you pour. You should ideally have one third peach purée to two thirds champagne. Serve straight away as a pre-dinner drink with the Cupid's Caviar, leaving plenty of time for a second glass each."]}, {"isVegetarian": false, "title": "Belly pork with piccalilli purée", "url": "www_bbc_co_uk_food_recipes_belly_pork_with_75994", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": [" 650g/1lb 6oz pork belly", "150g/5oz salt ", "50ml/2fl oz soy sauce", "50g/2oz honey", "25ml/1fl oz mirin", "25ml/1fl oz sesame oil", "4 slices shonka ham (available from specialist butchers)", "½ cauliflower head, roughly chopped", "1 large onion, roughly chopped", "50g/2oz salt", "600ml/1pint 1fl oz white wine vinegar", "300ml/11fl oz malt vinegar", "pinch dried chilli", "2 tsp cornflour", "15g/½oz turmeric", "25g/1oz English mustard powder", "125g/4½oz sugar", "½ cucumber, peeled, seeds removed", "2 Granny Smith apples", "2 tsp lemon juice", "pinch salt", "1 tbsp apple balsamic vinegar", "4 large cauliflower florets, thinly sliced on a mandolin ", "1 lemon, juice only", "sea salt", "3 tbsp coriander cress", "1 tsp ground cumin"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Rub the meat side of the pork belly with the salt. Cover with clingfilm and chill in the fridge for 24 hours.", "Remove the pork from the fridge and rinse under cold running water for at least 20 minutes.", "Place the pork in a sous vide bag and vacuum seal.", "Heat a water bath to 72C/160F and place the pork in the bath for 24 hours. Alternatively, place into a pressure cooker, cover and cook for one hour.", "Once cooked, place the sealed pork between two baking trays.  Gently press down with a weight and chill in the fridge for a minimum of 12 hours. Once pressed cut the pork into squares.", "Place the soy, honey, mirin and sesame oil into a bowl and whisk together until fully emulsified into a teriyaki sauce.", "Heat a frying pan until hot. Add the pork skin-side down and fry on each side until caramelised. Spoon the teriyaki sauce over to glaze the pork. Remove the meat from the pan and place onto a chopping board. Place the shonka ham over the top and fold over the edges.", "For the piccalilli, place the cauliflower and onion into a colander. Cover with the salt and set aside for 24 hours. Rinse away the salt thoroughly under cold running water.", "Mix the cauliflower and onion with the cucumber until well combined.", "Bring the vinegars to the boil with the chilli, turn off the heat and set aside to infuse for 20 minutes.", "Bring the vinegar mixture to the boil again. Stir in the corn flour, turmeric, mustard and sugar and simmer for three minutes.", "Pour the simmering liquid over the vegetables, transfer to a food processor and blend until smooth. Pass through a fine sieve and chill in the fridge until required.", "Meanwhile, cut the apples into 1.5cm/½in cubes. Dress the cubes with the lemon juice, salt and a drop of apple balsamic.", "For the cauliflower salad, mix the cauliflower with lemon juice and sea salt.", "To serve, brush the piccalilli across the plate. Add a piece of pork on top and scatter over the apple and finish with the cauliflower salad."]}, {"isVegetarian": false, "title": "Bengali fish curry", "url": "www_bbc_co_uk_food_recipes_bengali_fish_curry_44820", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 sea bass or sea bream fillets (each around 200g/7oz), scales removed but skin on", "1 tsp flaked sea salt, plus extra to season", "¼ tsp cayenne pepper", "2½ tsp English mustard powder", "freshly ground black pepper", "4 tbsp sunflower oil", "1 heaped tsp yellow mustard seeds", "¾ tsp black mustard seeds", "¾ tsp cumin seeds", "1 medium onion, finely sliced", "2 long green chillies,  stalk trimmed and cut in half without deseeding", "1 bay leaf", "½ tsp ground turmeric", "½ tsp garam masala", "150g/5½oz ripe tomatoes, roughly chopped", "150g/5½oz rice, cooked according to packet instructions"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Cut the fish fillets into roughly 7cm/3in wide strips. Put in a bowl and toss with the salt, cayenne pepper, half a teaspoon of the mustard powder and lots of freshly ground black pepper. ", "Mix the remaining mustard powder with 300ml/10fl oz water, adding it gradually and stirring constantly until you have thin yellow liquid. Set aside.", "Heat the oil in a large non-stick frying pan and fry the fish over a high heat, skin-side down for a minute, or until the skin begins to crisp. Carefully turn over and cook on the other side for a further minute. Take the fish out of the pan and put on a plate. (Don’t let the fish get crowded in the pan or they will be difficult to turn. If your pan isn’t large enough, cook the fish in two batches instead. It’s nice to have the skin on the fish but you can easily remove it after frying if you prefer.)", "As soon as the fish is cooked, return the pan to the heat and add both the mustard seeds and cumin seeds. Cook for a few seconds, stirring constantly. Add the sliced onion, chillies and bay leaf. Cook for about five minutes, stirring constantly, until the onion is softened and pale golden-brown. Make sure you cook with the extractor on full-speed as the spices could make you sneeze! Sprinkle over the turmeric and garam masala, add the chopped tomatoes and cook for two minutes more, stirring constantly.", "Stir in the reserved mustard liquid and bring to a simmer. Cook for three minutes, or until the sauce has thickened and the volume of liquid has reduced by approximately one-third.  The spices should have mellowed and the sauce should coat the back of a spoon. Return the fish to the pan and warm through in the bubbling sauce for two minutes until hot. ", "Serve immediately with rice."]}, {"isVegetarian": true, "title": "Bengali butternut squash with chickpeas", "url": "www_bbc_co_uk_food_recipes_bengalibutternutsqua_89988", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bengalibutternutsqua_89988_16x9.jpg", "ingredients": ["3 tbsp vegetable oil", "large pinch ground asafoetida", "1 bay leaf", "½ tsp panch phoran (a blend of equal quantities of fenugreek, nigella seeds, fennel seeds, cumin and mustard seeds), available from Asian supermarkets, also known as Bengali five-spice ", "1-2 mild dried red chillies", "1 small onion, chopped", "½ tsp ground turmeric", "2 level tsp ground cumin", "1 heaped tsp ground coriander", "2 tsp ginger paste (available from Asian supermarkets, or make your own by crushing or blending fresh ginger to a rough paste, adding water if necessary to loosen)", "500g/1lb 2oz butternut squash, peeled, seeds removed, flesh cut into 4cm/1½in cubes", "200ml/7fl oz boiling water", "200g/7oz canned chickpeas, drained and washed", "1 tsp ground garam masala", "1 tsp ground fennel seeds", "salt, to taste", "sugar, to taste"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a large non-stick pan over a medium heat. Add the asafoetida, bay leaf, panch phoran and chillies and fry for 1-2 minutes, stirring well to combine.", "Add the onion, stir to coat in the spices, and fry for 2-3 minutes, or until softened and golden-brown. ", "Add the ground turmeric, cumin and coriander, the salt, sugar and ginger paste and stir well. Add a splash of water, stir and cook for a further 1-2 minutes.", "Add the butternut squash pieces and the boiling water. Bring the mixture to the boil, then reduce the heat to a simmer, cover the pan with a lid and simmer for 10-15 minutes, or until the butternut squash is tender.", "Add the chickpeas, ground garam masala and fennel seeds and another splash of water if necessary to keep the mixture loose. Add the salt and sugar, if using. Stir well and continue to cook for 1-2 minutes, or until warmed through. Serve immediately."]}, {"isVegetarian": true, "title": "Bengali-style aubergine cooked in yoghurt", "url": "www_bbc_co_uk_food_recipes_bengalistyleaubergin_86619", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400g/14oz small Japanese-style aubergines, thinly sliced into rounds ", "good pinch ground turmeric", "salt, to taste", "½ tsp red chilli powder", "2 tbsp vegetable oil", "250ml/9fl oz plain yoghurt", "1-1½ tsp sugar", "1 rounded tsp cumin seeds, toasted in a frying pan and ground in a clean coffee grinder or pestle and mortar", "handful fresh coriander leaves, chopped, to garnish"], "serves": "Serves 3-4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Dust the aubergine slices with the turmeric, salt and half the red chilli powder.", "Heat the oil in a large, non-stick frying pan and fry the aubergine pieces until soft (you may have to do this in two batches). Set aside.", "In a bowl, beat 200ml/7fl oz of the yoghurt with the sugar, salt and the remaining red chilli powder. Pour into a small saucepan and heat gently, stirring often to stop it from splitting, for about five minutes.", "Stir in the ground cumin and the aubergine slices. Heat gently and stir to combine.", "Stir in the remaining yoghurt, check the seasoning and serve garnished with the fresh coriander."]}, {"isVegetarian": true, "title": "Non-alcoholic Bloody Mary", "url": "www_bbc_co_uk_food_recipes_bensbloodymary_11199", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 litre/1¾ pint tomato juice", "1 bunch celery leaves (washed and picked from ½ a bunch of celery)", "dash Tabasco sauce (to taste)", "dash creamed horseradish", "dash HP sauce (to taste)", "2 limes, juice only", "crushed ice (optional)"], "serves": "Makes 1 litre jug", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Put everything in a big jug and mix", "Add a handful of crushed ice if you like but Ben has his without!"]}, {"isVegetarian": false, "title": "Boeuf en daube provençale", "url": "www_bbc_co_uk_food_recipes_beouf_en_daube_provenale_77740", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beouf_en_daube_provenale_77740_16x9.jpg", "ingredients": ["1.5kg/3lb 5oz beef brisket, trimmed of excess fat and cut into large 6cm/2½in chunks", "salt, to taste", "2 large onions, finely sliced", "4 carrots, peeled and cut into 1cm/½in rounds", "2 sticks celery, cut into 1cm/½in slices", "6 garlic cloves, finely chopped", "1 bottle red wine", "100ml/3½fl oz brandy or cognac", "50ml/2fl oz red wine vinegar", "4 bay leaves", "2 large sprigs thyme", "few sprigs parsley", "2 pieces pared orange zest", "4 cloves", "1 tsp black peppercorns", "2 x 4cm/1½in pieces cinnamon stick", "4 tbsp olive oil", "150g/5½oz bacon lardons", "1 onion, finely chopped", "2 tbsp tomato purée", "600ml/20fl oz beef stock", "150g/5½oz black olives", "300g/10½oz red camargue rice, cooked according to packet instructions"], "serves": "Serves 4-6", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Put the beef into a large fridge-friendly container. Sprinkle with salt, then add all the marinade ingredients. ", "Divide the ingredients for the bouquet garnis in half and tie into two separate parcels of muslin. Add one of these to the marinade and set the other one aside. Cover and put in the fridge. Leave for at least six hours, but preferably overnight.", "For the casserole, drain the meat, reserving the liquid and the rest of the marinade ingredients. Pat the meat dry and brush off any garlic. ", "Heat half of the olive oil in a large frying pan and fry the meat in batches until well browned. Deglaze the base of the frying pan with a little of the marinade liquid and set aside. ", "In a large casserole, add the remaining olive oil. Add the lardons and fry on a high heat for a few minutes until crisp and brown. Add the onion and reduce the heat to medium. Fry for around 10 minutes, or until the onion has softened and lightly coloured. Stir in the tomato purée. Add the beef to the casserole and stir to coat.", "Strain the marinade and pour over the liquid along with the deglazing liquid from the frying pan and the second bouquet garni. ", "Bring to the boil and simmer until the volume of liquid has reduced by around a third. ", "Add enough beef stock so that the beef is just covered. Return to the boil, then turn down the heat to low. Cover, and simmer for around three hours. ", "If you are able to, leave overnight – cool and leave in the fridge to chill. Once chilled, it will make skimming off any fat much easier. Otherwise, just skim off some of the fat which will collect at the top. ", "Add the olives, then simmer uncovered for a further hour to reduce down the sauce. Serve with red camargue rice."]}, {"isVegetarian": false, "title": "Berkswell toasty pudding", "url": "www_bbc_co_uk_food_recipes_berkswell_toasty_pudding_03447", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 slices white bread", "50g/1¾oz butter", "2 tsp wholegrain mustard ", "4 slices ready-to-eat ham", "2 tbsp ale, optional", "150ml/¼ pint double cream", "1 tsp Worcestershire sauce", "2 free-range egg yolks", "280g/10oz Berkswell cheese, grated ", "salt and freshly ground black pepper", "dressed salad leaves, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Butter the bread, spread with half the mustard and make four ham sandwiches. ", "Using a large circular cutter, cut each sandwich into a circle (if you don’t have a cutter, remove the crusts and cut the sandwiches into triangles). Place in a small oval ovenproof dish and pour a little ale over each sandwich, if using.", "In a pan, bring the cream up to the boil. When it starts to thicken, remove from the heat. Stir in the remaining mustard, the Worcestershire sauce, egg yolks and 225g/8oz of the cheese. Season with salt and pepper. ", "Pour the sauce over the sandwiches and scatter the remaining cheese over the top. ", "Bake for 12 minutes, or until golden-brown and bubbling. Serve with dressed salad leaves. "]}, {"isVegetarian": true, "title": "Berry crumble traybake", "url": "www_bbc_co_uk_food_recipes_berry_crumble_traybake_59984", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/berry_crumble_traybake_59984_16x9.jpg", "ingredients": ["200g/7oz frozen berries (raspberries, blackberries, cherries, blueberries, blackcurrants all work well, or a mix)", "50g/2oz caster sugar", "2 tbsp cornflour", "110g/4oz plain flour", "70g/2½oz cold unsalted butter, cut into smallish cubes", "30g/1oz caster sugar", "220g/8oz plain flour", "¾ tsp baking powder", "½ tsp cinnamon", "50g/2oz ground almonds", "200g/7oz caster sugar", "80g/3oz butter, melted", "2 free-range eggs", "40g/1½oz yoghurt thinned with 2 tbsp milk"], "serves": "Serves 10-12", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Grease and line a rectangular baking tin (approximately 26cm x 20cm/10½in x 8in). ", "In a saucepan combine the fruit with 50ml/2fl oz water. Bring the fruit just to the boil, reduce the heat and simmer for 2-3 minutes.", "In a mixing bowl combine the caster sugar with the cornflour.  Stir into the fruit and continue to cook for 2-3 minutes, stirring frequently, until the mixture is thick and jammy. Set aside to cool.", "For the crumble topping, add the flour to a mixing bowl and rub in the butter until the mixture resembles fine breadcrumbs and no large lumps of butter are left. Stir in the sugar and set aside.", "For the cake, in a large mixing bowl, sift together the flour, baking powder and cinnamon. Stir in the ground almonds until thoroughly combined.", "In another bowl beat together the sugar with the melted butter, eggs, yoghurt and milk mixture until thoroughly mixed.  Stir into the flour mixture just to combine. Don’t overmix it, but watch out for big lumps of unmixed flour.", "Spoon two-thirds of the mixture into the lined tin, gently spreading out evenly to the corners. Spoon the cooled fruit mixture evenly over the top.", "Using a teaspoon, dot the remaining cake batter evenly on top of the fruit.  This will not cover the entire cake, but make little hillocks with gaps in between.", "Sprinkle the crumble mixture over the top, filling in all the gaps to cover the fruit.", "Bake in the oven for 45-50 minutes, until the crumble topping is golden-brown. Allow to cool for ten minutes in the tin, then transfer the cake in its paper to a cooling rack. This is cake is beautiful eaten while still warm, with a dollop of crème fraîche or yoghurt – but is equally nice the next day with a cup of coffee."]}, {"isVegetarian": true, "title": "Berry cheesecake in a glass", "url": "www_bbc_co_uk_food_recipes_berrycheesecakeinagl_92447", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/berrycheesecakeinagl_92447_16x9.jpg", "ingredients": ["150g/5¼oz mixed seasonal berries (such as blackberries, blueberries, or strawberries)", "1 tbsp golden caster sugar", "1 lemon, zest and juice", "4 ginger biscuits", "1 tbsp butter", "2 tbsp icing sugar", "125g/4½oz mascarpone"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the berries, caster sugar and one tablespoon of the lemon juice in a small pan, stirring well to combine, for 3-4 minutes, or until the sugar has dissolved and the berries have broken down. Set aside to cool. ", "Place the biscuits into a freezer bag and crush using a rolling pin until they resemble breadcrumbs. ", "Melt the butter in a small saucepan over a low to medium heat. ", "Mix together the crushed biscuits and melted butter in a bowl until well combined. Spoon the mixture into the bottom of two large serving glasses. ", "Place the mascarpone into a large mixing bowl and fold in the lemon zest, remaining lemon juice and icing sugar. ", "Spoon the mascarpone into the glasses, then spoon over the berries and juice. Serve immediately."]}, {"isVegetarian": true, "title": "Best-ever banoffee pie", "url": "www_bbc_co_uk_food_recipes_best-ever_banoffee_pie_75984", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/best-ever_banoffee_pie_75984_16x9.jpg", "ingredients": ["75g/2½oz butter", "300g/10½oz chocolate oaty biscuits", "115g/4oz butter", "115g/4oz soft dark brown sugar", "397g/14oz can sweetened condensed milk", "450ml/16fl oz double cream", "5 ripe but firm medium bananas", "1 tsp fresh lemon juice", "25g/1oz coarsely grated plain dark chocolate or chocolate curls"], "serves": "Serves 12", "time": {"preparation": "1-2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["To make the base, melt the butter in a small pan. Break the biscuits into chunky pieces and put in a food processor. Blend into crumbs then add the melted butter and, with the motor running, blend until thoroughly mixed. Alternatively, put the biscuits in a strong polythene food bag and bash with a rolling pin. Tip into a bowl and stir in the melted butter.", "Tip the crumbs into the centre of a deep, 23cm/9in fluted loose-based tart tin or quiche dish and press firmly into the base and sides. (Make sure the biscuit base is evenly distributed, especially where the base meets the sides.) Chill in the fridge for 30 minutes, or until set.", "To make the filling, melt the butter in a medium non-stick saucepan and stir in the sugar. Cook over a low heat as the sugar dissolves, stirring constantly until the butter and sugar look smooth and no oil floats to the surface. Add the condensed milk and bring to a gentle simmer, stirring constantly. Cook for three minutes, stirring until the mixture turns a deep, creamy caramel brown. ", "Pour the toffee gently onto the biscuit base and quickly smooth the surface. Leave to chill for one hour (and up to eight hours) before topping.", "Just before serving, lightly whip the cream in a bowl. It should stand in soft peaks, any thicker and it will look over-whipped when mixed with the bananas. Diagonally slice four of the bananas and scatter half of them over the toffee. Fold the rest lightly into the cream and spoon gently on top. ", "Slice the remaining banana and put in a bowl. Pour the lemon juice over and very gently toss together (this will stop the banana turning brown). Decorate the top with the lemony banana, poking into the cream randomly, and sprinkle the pie with grated chocolate or decorate with chocolate curls. Serve in fairly thin slices as it is very rich."]}, {"isVegetarian": true, "title": "Berry yoghurt", "url": "www_bbc_co_uk_food_recipes_berry_yoghurt_95274", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/berry_yoghurt_95274_16x9.jpg", "ingredients": ["175g/6oz frozen mixed berries, defrosted", "340g/12oz fat-free Greek yoghurt", "10g/¼oz flaked almonds, toasted"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Spoon the yoghurt into two glasses, top with half the berries, and then repeat the layers.", "Sprinkle with the flaked almonds and serve."]}, {"isVegetarian": false, "title": "Best-ever spaghetti Bolognese", "url": "www_bbc_co_uk_food_recipes_besteverspaghettibol_89567", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp vegetable oil", "450g/1lb lean beef mince", "100g/3½oz chicken livers, trimmed ", "1 onion, finely chopped ", "2 garlic cloves, chopped", "1 red pepper, finely chopped ", "1 green pepper, finely chopped ", "150g/5oz button mushrooms, sliced ", "2 bay leaves", "200g/7oz tomato purée", "100ml/3½fl oz red wine", "1 x 400g/14oz can chopped tomatoes", "salt and freshly ground white pepper", "1 tsp fresh thyme leaves", "1 tsp fresh parsley", "1 tsp fresh oregano (or half teaspoon dried oregano)", "400g/14oz spaghetti, cooked according to packet instructions", "parmesan, finely grated"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the vegetable oil in a large pan over a medium heat.", "Add the mince and cook until golden-brown all over. Remove the mince from the pan with a slotted spoon and set aside.", "Add the chicken livers to the same pan and cook until browned all over. Remove the livers from the pan and chop into bite-sized pieces and set aside.", "Add the onion to the pan and fry for 4-5 minutes, to soften and colour.", "Add the garlic, red and green peppers and mushrooms and fry for 5-6 minutes, or until softened and lightly coloured.", "Add the cooked mince, the cooked livers, the tomato purée and bay leaves and continue to cook for eight minutes.", "Add the wine and tomatoes and bring to the boil. Reduce the heat and simmer for 30-45 minutes.", "Season, to taste, with salt and freshly ground white pepper.", "Add the thyme, parsley and oregano and stir well to combine.", "To serve, place equal portions of cooked spaghetti into four serving bowls. Spoon equal amounts of Bolognese sauce over each portion and sprinkle with finely grated parmesan."]}, {"isVegetarian": true, "title": "Bewitched", "url": "www_bbc_co_uk_food_recipes_bewitched_92643", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 medium-sized pumpkin, flesh scooped out and chopped, fibres removed; seeds removed, toasted and reserved for garnish", "1 litre/1¾ pints freshly squeezed orange juice", "2 tsp ground allspice", "2 tbsp clear honey", "35ml/1¼fl oz bourbon whiskey", "1 tbsp sour cherry liqueur", "2 tsp herb liqueur", "3 tbsp spiced pumpkin purée (see above)", "ice", "pumpkin seeds, toasted", "pinch freshly grated nutmeg"], "serves": "Makes 1 plus extra purée", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the spiced pumpkin purée, bring a small amount of water to a simmer in a pan. Suspend a steaming basket above the water (do not allow the base of the basket to touch the water). Add the chopped pumpkin and steam for 15-20 minutes, or until tender. Remove from the steaming basket and set aside to cool.", "When the pumpkin has cooled, transfer it to the bowl of a food processor. Add the orange juice, allspice and honey and blend until smooth and well combined.", "For the cocktail, pour the bourbon, sour cherry liqueur, herb liqueur and pumpkin purée into a cocktail shaker. Add ice and shake well.", "To serve, strain the mixture into a flute glass. Garnish the surface of the cocktail with a few toasted pumpkin seeds. Dust with a little freshly grated nutmeg."]}, {"isVegetarian": true, "title": "Big, fat salt and pepper breadsticks", "url": "www_bbc_co_uk_food_recipes_big_fat_salt_and_pepper_59413", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/big_fat_salt_and_pepper_59413_16x9.jpg", "ingredients": ["450g/1lb strong white bread flour, plus extra for dusting ", "1 x 7g/⅛oz sachet fast-action dried yeast ", "1½ tsp salt ", "250–275ml/9-10fl oz warm water ", "vegetable oil or spray oil, for oiling ", "2 tbsp extra virgin olive oil ", "2 tbsp sea salt ", "2 tbsp freshly ground black pepper "], "serves": "Makes 12", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Dust two large baking trays with flour. ", "Put the flour, yeast and the salt into a large bowl and add enough of the water to make a soft but not sticky dough. Knead well for 10 minutes by hand on a lightly floured work surface or for five minutes if using an electric mixer fitted with a dough hook. ", "Divide the mixture into 12 equal portions, each weighing about 60g/2½oz. Roll the portions into balls, then place each ball on a floured surface and roll into a long sausage shape about 25cmx2cm/10inx1in. (For the best visual results make the sausage shape an even thickness.)", "I like to shape half of them into twists. Run a knife down the centre to split the dough, leaving a bit at one end uncut. Braid or plait the two halves over each other to give a twisted effect. ", "Place the breadsticks on the prepared baking trays, spacing them 4cm/1½in apart.  Cover the breadsticks loosely with oiled clingfilm, making sure it is airtight. Leave in warm place for 30 minutes, or until the breadsticks have almost doubled in size.", "Preheat the oven to 200C/400F/Gas 6. ", "Remove the clingfilm and brush each breadstick with the extra virgin olive oil. Sprinkle half of the breadsticks with the sea salt and the remainder with the freshly ground black pepper. Bake on the top third of the oven for about 20 minutes, or until the breadsticks are lightly golden-brown and feel firm to the touch. Remove the breadsticks from the oven and leave to cool on the baking trays. "]}, {"isVegetarian": true, "title": "Bhindi bhaji", "url": "www_bbc_co_uk_food_recipes_bhindibhajji_74849", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp sunflower or vegetable oil", "1 onion, chopped", "½ tsp ground cumin", "½ tsp ground coriander", "½ tsp chilli powder", "¼ tsp ground turmeric", "150g/5¼ oz tomatoes, chopped", "450g/16oz okra, cut into 1in/3cm pieces"], "serves": "Serves 2-3", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a wok. Add the onions and spices and fry for 3-5 minutes until the onions are transparent.  Tip in the tomatoes and cook for a minute or two.  ", "Throw in the okra and simmer for 8-10 minutes or until the okra is cooked through.  ", "Season well and serve."]}]