[{"ingredients": ["2 cucharaditas de aceite de oliva", "2 tortillas de harina grandes", "1-2 rebanadas de jamón, desgarrado en pedazos", "2 huevos grandes de gallinas camperas, a temperatura ambiente", "Pellizque los copos de sal marina", "Queso cheddar de 75 g / 2½ oz, rallado", "salsa picante, al gusto"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Use 1 cucharadita de aceite para engrasar ligeramente la base y los lados de un plato redondo, bajo y resistente al horno. Colóquelo con una de las tortillas, asegurándose de que sobresalga un poco, creando un tazón de tortilla.", "Esparce sobre el jamón, agrieta los huevos - rocía las yemas con un poco de sal - y luego extiende alrededor de un tercio del queso encima.", "Cepille un lado de la segunda tortilla con aceite y coloque el lado con aceite hacia arriba, sin apretar sobre el relleno. Presione los bordes de las tortillas juntas, empujándolas hacia abajo en el plato y hacia los lados, luego cepille estos bordes con un poco más de aceite.", "Cubra con el queso restante, luego agregue algunos apretones o batidos de salsa picante, dependiendo de qué tan ardiente desee que sea. Cueza al horno en el horno por 15 minutos, momento en el cual los huevos serán cocinados adentro, el queso derritió, y los bordes de la corteza de la tortilla se doraron y se doraron. Los hornos varían, por lo que es posible que deba modificar el tiempo de cocción. Comer de inmediato Esto no es un gran problema."], "url": "www_bbc_co_uk_food_recipes_egg_tortilla_pie_60712", "title": "Pastel de tortilla de huevo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1-2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/egg_tortilla_pie_60712_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 papas medianas para hornear, perforadas", "100g / 3½oz de queso de cabra suave, batido", "rociar aceite de oliva", "algunas ramitas de tomillo, hojas recogidas", "4 hojas de pasta fresca lista para usar", "4 yemas de huevo de gallinas camperas", "1 huevo de gallinas camperas, golpeado", "8 zanahorias jóvenes de herencia coloreada", "30g / 1oz de mantequilla", "pizca de pimentón ahumado", "berro vestido, para servir", "sal y pimienta negra recién molida", "150g / 5½oz de queso de cabra", "2 cucharadas de aceite de oliva", "crema doble, si es necesario", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Para hacer los raviolis, hornee las papas durante 45 minutos, 1 hora o hasta que estén suaves. Dejar de lado para enfriar un poco. Retire la piel y macere. Condimentar con sal y pimienta.", "Mezcle el puré y el queso de cabra en un tazón. Sazonar con sal y pimienta y agregar el aceite de oliva y el tomillo.", "Coloque una cucharada grande de la mezcla en una hoja de pasta. Usando la parte posterior de la cuchara, haga un pozo profundo en la papa. Coloque una yema de huevo en el pozo y coloque suavemente una segunda capa de pasta sobre la parte superior. Cepille el lavado de huevos alrededor de los bordes y presione hacia abajo alrededor del relleno, asegurándose de que esté bien sellado y de que no haya bolsas de aire. Repita con las hojas de pasta restantes y el relleno.", "Poner a hervir una olla de agua con sal. Blanquee los raviolis, uno a la vez, durante 2 minutos o hasta que la pasta esté al dente.", "Mientras tanto, coloca las zanahorias en una cacerola y agrega suficiente agua para cubrirlas. Agregue la mantequilla y cocine a fuego lento. Cocine hasta que esté glaseado y suave. Agregue el pimentón ahumado y sazone con sal y pimienta.", "Para hacer la crema de queso de cabra, bata el queso con el aceite de oliva. Sazone con sal y pimienta y, si es necesario, agregue un poco de crema doble para obtener una consistencia suave.", "Para servir, cuchara una cantidad generosa de queso blando en la base de un plato. Rocíe un poco de aceite de oliva. Coloque las zanahorias entre los platos, decore con berros y cubra con los raviolis."], "url": "www_bbc_co_uk_food_recipes_egg_yolk_and_goats_93768", "title": "Ravioles de yema de huevo y queso de cabra", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Fideos de huevo de 55 g / 2 oz", "300ml / ½ litro de caldo de pollo caliente", "3 cucharadas de cilantro fresco picado, más extra para servir", "1 cucharada de salsa de soja, más extra para servir", "1 cucharadita de aceite de sésamo", "1 huevo de gallinas camperas, golpeado", "2 cucharadas de col Savoy en rodajas finas"], "method": ["Coloque los fideos de huevo en un recipiente, vierta suficiente agua hirviendo para cubrirlos y déjelos durante 3-4 minutos, o hasta que se ablanden. Desagüe.", "Coloque el caldo en una cacerola pequeña, agregue el cilantro, la salsa de soja y el aceite de sésamo y deje que hierva. Haga un remolino removiendo la sartén con una cuchara de madera y luego rompa el huevo en la bañera de hidromasaje y bate. Agregue el repollo Savoy rallado y revuelva.", "Para servir, vierta en un tazón y adorne con hojas de cilantro y salsa de soja."], "url": "www_bbc_co_uk_food_recipes_eggdropchickennoodle_88311", "title": "Sopa de fideos de pollo gota de huevo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 huevo, ligeramente batido", "Harina normal de 55g / 2oz", "un poco de leche al gusto", "2 rebanadas de jamón, 1cm / 0.5in de espesor", "2-3 cucharadas de aceite de oliva", "2 hongos grandes", "2-3 cucharadas de queso parmesano, rallado", "1 cucharada de miel", "puñado de cohetes", "sal y pimienta negra recién molida"], "method": ["Hacer una masa batiendo el huevo con la harina. Agregue un poco de leche si es demasiado espesa.", "Sumerja el jamón en la mezcla.", "Fría el jamón en el aceite durante uno o dos minutos por ambos lados hasta que esté crujiente.", "Retire los tallos de los champiñones.", "Rellene los champiñones con el parmesano y rocíe con miel.", "Hornee en un horno caliente de cinco a seis minutos.", "Sazonar y servir el champiñón y el jamón en una cama de cohete."], "url": "www_bbc_co_uk_food_recipes_eggfriedhamandstuffe_72118", "title": "Huevo de jamón frito y champiñones rellenos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 huevo", "2 cucharaditas de aceite de sésamo", "2 cucharadas de aceite vegetal", "200g / 7oz de arroz de grano largo (peso sin cocer), cocido y dejado enfriar", "Guisantes congelados de 100 g / 4 oz, descongelados (enjuague con agua tibia para hacer esto rápidamente)", "4 cebolletas, finamente picadas", "100g / 4oz de soja (opcional)", "1-2 cucharaditas de salsa de soja", "pimienta blanca molida"], "method": ["Batir el huevo y el aceite de sésamo y poner a un lado.", "Caliente el aceite vegetal en un wok o en una sartén grande. Cuando esté brillante y casi humeante, agregue el arroz y saltee por 3-4 minutos hasta que se caliente por completo.", "Agregue los guisantes, cebollas y brotes de soja, si los está usando. Revuelva-fríe, girando el arroz constantemente alrededor de la sartén, durante unos 3 minutos. Sazonar bien con salsa de soja y pimienta, luego empujar a un lado de la sartén. Vierta la mezcla de huevo batido en el otro lado y déjela durante unos 10 segundos para que comience a solidificarse. Con un palillo, gire rápidamente alrededor del huevo para romperlo y revuelva con el arroz. Revuelva freír durante un minuto más y sirva enseguida."], "url": "www_bbc_co_uk_food_recipes_eggfriedrice_67782", "title": "Arroz con huevo frito", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/eggfriedrice_67782_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["guión de aceite vegetal", "½ cebolla, finamente rebanada", "½ puerro, finamente cortado", "2 huevos de gallinas camperas, golpeados", "2 cucharadas de salsa de soja, más extra para servir", "200g / 7oz de arroz basmati, cocido", "1 cucharada de cebolletas frescas picadas", "sal y pimienta negra recién molida"], "method": ["Calentar el aceite vegetal en un wok, agregar la cebolla y el puerro y freír suavemente hasta que estén suaves pero no dorados.", "Agregue los huevos y bata hasta que comiencen a revolver y cocinar. Agregue la salsa de soja y bata.", "Agregue el arroz cocido y revuelva bien para cubrir los huevos. Agregue el cebollino picado, la sal y la pimienta negra recién molida y la cuchara en un plato para servir. Rocíe con salsa de soja y sirva."], "url": "www_bbc_co_uk_food_recipes_eggfriedrice_88279", "title": "Arroz simple frito con huevo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1-2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de cacahuete", "1 pequeño puñado de hongos shiitake o champiñones castaños, en rodajas", "1 pimiento rojo, sin semillas y en cubitos", "75g / 3oz de tocino ahumado, cortado en cubitos", "5 huevos de gallinas camperas, ligeramente golpeados", "dash light salsa de soja", "pizca de pimienta blanca recién molida", "puñado de pollo y / o jamón sobrantes, picados", "2 cebollas tiernas, ralladas", "puñado de hojas de ensalada mixtas", "salsa de chile dulce"], "method": ["Caliente un wok hasta que esté humeando y agregue una cucharada de aceite. Agregue los champiñones, el pimiento rojo y el tocino y saltee por un minuto, o hasta que estén crujientes y dorados.", "Agregue la mezcla de salteado a los huevos batidos y revuelva para combinar.", "Limpie con cuidado el exceso de aceite del wok con papel de cocina. Coloque el wok a fuego alto y agregue el aceite restante, girando para cubrir el wok. Agregue la mitad de la mezcla de huevo batido y cocine durante 1-2 minutos, o hasta que se dore por la parte inferior. Voltee la tortilla y cocine por otro minuto en el otro lado, o hasta que esté dorada y cocida. Sazone con salsa de soya y pimienta blanca recién molida. Deslice sobre una placa calentada y cubra con papel de aluminio. Repita con la mezcla de huevo restante.", "Para servir, llena la tortilla con cebolleta, pollo cocido o jamón y hojas de ensalada. Cuchara sobre la salsa de chile dulce y servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_eggfuyoungwithroaste_89264", "title": "Envoltura de huevo y fu yung con salsa de chile", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Hace 2 envolturas de tortilla", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/eggfuyoungwithroaste_89264_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de cacahuete", "3 huevos de gallinas camperas, golpeados", "400 g / 14oz de arroz cocido de grano largo, refrigerado hasta que esté completamente frío", "½ cabeza pequeña brócoli, cortada en pequeños floretes", "1 zanahoria, cortada en fósforos", "3 tomates, en rodajas", "3 cucharadas de salsa de soja ligera", "guisar aceite de sésamo tostado (opcional)", "pimienta negra recién molida (o pizca de pimienta blanca)", "1 cebolleta grande, finamente rebanada"], "method": ["Caliente un wok hasta que esté humeando y agregue la mitad del aceite de cacahuete, luego agregue los huevos y revuelva durante 1-2 minutos. Transfiera los huevos revueltos a un plato caliente y déjelos a un lado. Limpie el exceso de aceite del wok.", "Vuelva a calentar el wok y agregue el aceite de maní restante. Cuando el trabajo esté caliente, agregue los brotes de brócoli y la zanahoria y saltee durante 3 minutos hasta que estén tiernos, pero crujientes. Agregue el arroz cocido y revuelva bien para romper los granos, luego agregue los tomates y saltee durante 1-2 minutos.", "Regrese el huevo al wok con el arroz y las verduras y sazone, al gusto, con la salsa de soja, el aceite de sésamo y la pimienta. Agregue la cebolla cortada en rodajas.", "Coloque el arroz en un plato y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_eggfriedrice_89260", "title": "Huevo de arroz frito con tomates", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/eggfriedrice_89260_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Jugo de tomate 150ml / ¼ pinta (de la lata de tomates)", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "1 huevo de gallinas camperas", "puñado de perejil fresco, picado, para servir"], "method": ["Coloque el jugo de tomate y el aceite de oliva en una sartén pequeña, sazone con sal y pimienta negra recién molida y deje que hierva.", "Agriete el huevo encima de la salsa y cocine a fuego lento hasta que la clara de huevo se haya solidificado y la yema todavía esté líquida.", "Para servir, transfiera cuidadosamente el huevo y el jugo a un recipiente poco profundo y espárzalos sobre el perejil."], "url": "www_bbc_co_uk_food_recipes_eggintomatosauce_85389", "title": "Huevo en salsa de tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina simple de 450g / 1lb", "40 g / 1½ oz de cacao en polvo", "2 cucharaditas de polvo de hornear", "2 cucharaditas de bicarbonato de soda", "300g / 10½ oz de azúcar en polvo", "125ml / 4fl oz de aceite de girasol", "300 ml / ½ litro de leche", "2 cucharadas de vinagre blanco", "2 cucharaditas de extracto de vainilla"], "method": ["Precaliente el horno a 180 ° C / 160 ° C (ventilador) / gas 4. Engrase y forme una lata de resorte de 23 cm / 9 pulg.", "Tamiza la harina, el cacao en polvo, el polvo de hornear y el bicarbonato de soda en un bol. Agregue el azúcar hasta que todo esté completamente combinado.", "En una jarra, mezcle el aceite, la leche, el vinagre y el extracto de vainilla. Haga un pozo en el centro de los ingredientes secos y vierta la mezcla de aceite y leche. Revuelva constantemente hasta que los ingredientes estén completamente mezclados, asegurándose de que no quedan bolsas de harina.", "Verter la masa inmediatamente en la lata preparada y hornear en el horno durante aproximadamente una hora, o hasta que un pincho insertado en el centro de la torta salga limpio. Esté atento a la torta; es posible que deba cubrir la parte superior con papel de aluminio si los bordes se están atascando.", "Retire la torta del horno y déjela a un lado para que se enfríe un poco. Dé vuelta a una rejilla de alambre y déjela a un lado para que se enfríe por completo. Cuando esté frío, divida la torta por la mitad horizontalmente para formar dos capas. Llene el centro con su relleno favorito: crema de mantequilla, crema y fruta, mermelada o cuajada de fruta."], "url": "www_bbc_co_uk_food_recipes_eggless_sponge_cake_70634", "title": "Bizcocho sin huevo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/eggless_sponge_cake_70634_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1140ml / 2 pintas de leche entera", "6 huevos de gallinas camperas", "50 g / 2 oz de azúcar en polvo", "1 vaina de vainilla, dividida", "20 cerezas frescas, piedras quitadas y cortadas a la mitad", "Brandy 200ml / 7fl oz", "cacao en polvo, para quitar el polvo"], "method": ["Coloque la leche, los huevos, el azúcar y la vaina de vainilla en una cacerola mediana y caliente suavemente, sin hervir, hasta que la mezcla se espese lo suficiente como para cubrir la parte posterior de una cuchara.", "El huevo nog se puede enfriar en esta etapa o servir caliente.", "Para servir, esparza las cerezas en el fondo de cada vaso para servir. Divida el brandy entre las copas y vierta el huevo encima. Polvo con cacao en polvo y servir."], "url": "www_bbc_co_uk_food_recipes_eggnog_9370", "title": "Huevo con cerezas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/eggnog_9370_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["300 ml / 10 fl oz de leche", "Abadejo ahumado sin teñir 200g / 7oz", "1 hoja de laurel", "10 granos de pimienta negra", "4 huevos de gallinas camperas", "40 g / 1½ oz de mantequilla", "15g / ½ oz de harina natural", "50 g / 1¾oz de queso cheddar maduro rallado", "sal marina y pimienta negra recién molida"], "method": ["Vierta la leche en una sartén grande y poco profunda, luego agregue el abadejo ahumado, la hoja de laurel y los granos de pimienta y cocine a fuego lento.", "Cocine durante cinco minutos, o hasta que el pescado se haya cocinado y desmenuce cuando lo empuje suavemente.", "Levante el pescado de la sartén y póngalo a un lado para que se enfríe un poco antes de descascarillarlo suavemente, descartando la piel.", "Mientras tanto, cuele la leche en una olla limpia y bata los huevos juntos en un recipiente aparte.", "Caliente una sartén hasta que esté a fuego medio, agregue 15 g / ½ onza de la mantequilla y los huevos y cocine suavemente, revolviendo con un tenedor hasta que se mantengan juntos.", "Agregue la mitad del pescado copos a la parte superior de la tortilla, luego salga de la sartén en un plato para servir a prueba de horno y cubra con el resto del pescado.", "Precalentar la parrilla a caliente.", "Limpie la bandeja de tortilla y agregue la mantequilla restante de 25 g / 1 oz y derrita, luego agregue la harina y cocine revolviendo bien durante dos minutos. Poco a poco agregue la leche, batiendo todo el tiempo hasta que se forme una salsa suave. Sazonar la salsa con sal y pimienta negra. También puede agregar un botón de mantequilla en esta etapa si lo desea.", "Vierta la salsa en la parte superior de la tortilla, luego esparza el queso rallado sobre la parte superior y colóquelo debajo de la parrilla durante 3-5 minutos, o hasta que se dore y burbujee.", "Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_eggs_arnold_bennett_69867", "title": "Huevos Arnold Bennett", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6 huevos de gallinas camperas, a temperatura ambiente", "2 cucharadas de vinagre de vino blanco", "6 muffins ingleses, cortados a la mitad", "mantequilla, para difundir", "6 rebanadas de jamón o salmón ahumado", "1-2 cucharadas de cebolletas frescas bien cortadas", "225g / 8oz de mantequilla, cortada en pedazos", "4 cucharadas de vinagre de vino blanco", "1 chalote pequeño o ½ chalote de plátano, pelado y muy finamente picado", "10 granos de pimienta negra", "1 hoja de laurel", "3 yemas de huevo de gallinas camperas", "pellizcar copos de sal marina", "pizca de azúcar en polvo"], "method": ["Llene una olla pequeña de poco más de un tercio con agua fría y llévela a ebullición. Agregue el vinagre y reduzca a fuego lento. Agriete los huevos de uno en uno en un tazón pequeño e incline suavemente hacia el agua hirviendo. Poach por 2-3 minutos. Retira con una espumadera y sumérgete en agua helada, luego retira los huevos y colócalos en una toalla de cocina.", "Para la salsa holandesa, derrita lentamente la mantequilla en una sartén mediana a fuego lento, revolviendo ocasionalmente. Retire del fuego y vierta la mantequilla en una jarra. Agregue suficiente agua en una cacerola mediana para llegar un tercio del camino por los lados. Llevar a ebullición, luego reduzca el fuego a fuego lento.", "Ponga el vinagre, el chalote, los granos de pimienta y la hoja de laurel en una cacerola pequeña a fuego alto y deje que hierva. Cocine por 1-2 minutos, o hasta que se reduzca a dos cucharadas de líquido. Retire del fuego.", "Coloque las yemas de huevo en un recipiente resistente al calor y colóquelas sobre la fuente de agua hirviendo a fuego lento. Batir las yemas de huevo con la sal y el azúcar hasta que estén pálidas. Vierta la mezcla de vinagre a través de un colador fino sobre las yemas y continúe batiendo hasta que esté bien combinado. Poco a poco agregue la mantequilla en un flujo constante batiendo constantemente hasta que la salsa esté suave, espesa y brillante.", "Tueste las mitades del panecillo y lleve el recipiente con agua a fuego lento, listo para recalentar los huevos.", "Extienda los muffins con mantequilla. Ponga un muffin a la mitad en cada plato y cubra con jamón o salmón. Con una cuchara ranurada, coloque los huevos cocidos en el agua hirviendo a fuego lento y vuelva a calentar durante un minuto. Retire y escurra sobre papel de cocina.", "Coloque un huevo en cada panecillo y cubra con un poco de holandesa. Espolvorear con cebollines y servir con las otras mitades de panecillos en el lateral."], "url": "www_bbc_co_uk_food_recipes_eggs_benedict_10471", "title": "Huevos Benedict", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["8 lonchas finas de tocino rayado ahumado", "pizca de vinagre", "4 huevos grandes de gallinas camperas", "2 muffins ingleses, cortados a la mitad", "botón de mantequilla, más extra para extender", "200 g / 7 oz espinaca bebé", "2 yemas de huevo de gallinas camperas", "1 cucharadita de vinagre de vino blanco", "100 g / 3½ oz de mantequilla sin sal, derretida", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 180 Fan / Gas 6.", "Coloque el tocino en una bandeja para hornear y hornee durante 10 minutos, o hasta que estén dorados y crujientes. (Freír o asar a la parrilla si lo prefiere). Mantener caliente.", "Para hacer el holandés, mezcle las yemas de huevo y el vinagre de vino blanco en un tazón mediano.", "Coloque el recipiente sobre una fuente de agua hirviendo, asegurándose de que el recipiente no toque el agua. Vierta la mantequilla derretida, batiendo continuamente hasta que la salsa se haya espesado y esté brillante. Condimentar con sal y pimienta. Cubra con film transparente y reserve.", "Para pochar los huevos, hierva el mismo agua hasta que hierva, reduzca a fuego lento y agregue una pizca de vinagre. Agriete cada huevo en un molde o taza y agite el agua, luego cuidadosamente coloque los huevos en la sartén.", "Cocine a fuego lento durante 3-4 minutos, o hasta que los blancos estén listos, pero las yemas estén blandas. Con una cuchara ranurada, levante con cuidado los huevos y drene en papel de cocina.", "Tueste las mitades del panecillo y póngalas en mantequilla. Divida entre cuatro placas.", "Calentar una sartén, agregar la mantequilla hasta que se derrita y freír las espinacas hasta que se marchiten, sazonar con sal y pimienta.", "Coloque la espinaca encima de los muffins, cubra con el huevo, cubra con un poco de holandesa y coloque una cruz de dos lonchas en la parte superior. Servir caliente."], "url": "www_bbc_co_uk_food_recipes_eggs_benedict_florentine_33122", "title": "Huevos Benedicto florentino", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/eggs_benedict_florentine_33122_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Leche 400ml / 14fl oz", "Crema doble de 200 ml / 7 fl oz", "1 hoja de laurel", "½ cucharadita de pimienta negra", "200g / 7oz de abadejo ahumado sin teñir", "25g / 1oz de mantequilla, más extra para engrasar", "Harina normal de 25g / 1oz", "4 huevos de pato", "2 cucharadas de parmesano finamente rallado", "1 cucharada de cebollines finamente picados", "tostada con mantequilla, para servir"], "method": ["Precaliente el horno a 170 ° C / 150 ° Ventilador / Gas 3 y engrase 4 platos pequeños de cocotte con mantequilla.", "Vierta la leche y la crema en una cacerola, agregue la hoja de laurel y los granos de pimienta y cocine a fuego lento. Retire del fuego y deje a un lado para infundir durante 30 minutos.", "Deje que el líquido vuelva a hervir a fuego lento, agregue el eglefino y cocine suavemente durante 4-5 minutos, o hasta que el pescado se desmenuce cuando se lo empuje. Retire el pescado del líquido y vierta en un recipiente.", "Derrita la mantequilla en una olla aparte, agregue la harina y mezcle. Cuele el líquido que caza furtivamente en una jarra y mida 300ml / 10fl oz. Poco a poco bata el líquido en la mantequilla y la harina hasta que quede suave, luego cocine a fuego lento durante 2-3 minutos, o hasta que espese.", "Vierta la mayor parte de la salsa sobre el pescado, reservando un poco para la parte superior de cada huevo y dobla cuidadosamente para combinar. Divida la mezcla entre los moldes, luego rompa un huevo encima de cada uno. Vierta la salsa reservada, espolvoree el parmesano y luego transfiera a una lata honda.", "Vierta suficiente agua hirviendo para llegar hasta la mitad de los lados de los platos, luego hornee durante 10-12 minutos, o hasta que los blancos estén listos y las yemas todavía estén líquidas. Adorne con cebolletas picadas y sirva con tostadas con mantequilla."], "url": "www_bbc_co_uk_food_recipes_eggs_en_cocotte_with_86221", "title": "Huevos en cocotte con abadejo ahumado", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["150 g / 5½ oz de crema", "sal y pimienta negra recién molida", "nuez moscada pizca", "puñado de eneldo picado", "4 huevos de gallinas camperas", "huevas de lumpo rojo", "pequeñas ramitas de eneldo"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Sazone la crème fraîche con sal, pimienta recién molida y una pizca de nuez moscada.", "Coloque una cucharada colmada de crème fraîche en el fondo de un molde, seguido de un poco de eneldo.", "Rompe un huevo encima, agrega una segunda cucharada de crème fraîche y espolvorea con una pizca de sal, pimienta y nuez moscada. Repita con tres moldes más.", "Coloque los moldes en una fuente para hornear y vierta suficiente agua tibia en el plato para llegar hasta la mitad de los lados de los moldes.", "Hornee por 15 minutos o hasta que las yemas de huevo estén a su gusto.", "Si lo desea, termine cada porción con una cucharadita de huevas de lumpo rojo y una ramita o dos de eneldo."], "url": "www_bbc_co_uk_food_recipes_eggs_in_pots_93154", "title": "Huevos en macetas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/eggs_in_pots_93154_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 muffins", "4 huevos de gallinas camperas", "200g / 7oz de hojas de espinaca baby, marchitas en una sartén pequeña", "Salsa holandesa hecha a mano de buena calidad"], "method": ["Llene una bandeja grande y poco profunda con agua, aproximadamente 3 cm (1 pulgada) de profundidad y cocine a fuego lento. Agregue un poco de vinagre (1-2 cucharadas soperas por un litro de agua) para ayudar a que los huevos conserven su forma.", "Rompa cuatro huevos en tazas de café separadas (esto también ayuda a que los huevos conserven su forma cuando se colocan en la sartén). Incline suavemente los huevos en el agua hirviendo a fuego lento y cocine por 2-3 minutos.", "Cortar los muffins por la mitad y tostadas ligeramente.", "Una vez que los huevos estén cocidos, remueva con una espumadera y escurra sobre toallas de papel.", "Coloque la espinaca encima de los muffins, cubra con el huevo y ponga una cantidad generosa de salsa holandesa sobre los huevos.", "Servir a la vez"], "url": "www_bbc_co_uk_food_recipes_eggsbenedict_74872", "title": "Huevos Benedict", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["30g / 1oz de mantequilla", "55g / 2oz de hojas frescas de espinaca", "2 huevos medianos de granja", "Crema doble 50ml / 2fl oz", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Derretir la mantequilla en una sartén pequeña. Agregue la espinaca y cocine hasta que se marchite. Coloque en un plato pequeño a prueba de horno.", "Agriete los huevos en un bol y deslícelos cuidadosamente sobre la espinaca. Verter sobre la crema y sazonar bien con sal y pimienta negra recién molida.", "Coloque en el horno y hornee durante aproximadamente 7-10 minutos, o hasta que los huevos estén listos. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_eggsandspinachencoco_88059", "title": "Huevos y espinacas en cocotte", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["6 cucharadas de salsa holandesa", "6 huevos grandes y muy frescos", "12 rebanadas de panceta, a la parrilla hasta que estén crujientes", "3 muffins ingleses, divididos por la mitad horizontalmente", "un poco de mantequilla"], "method": ["Precalentar la parrilla a su configuración más alta.", "Cueza los huevos en una olla con agua hirviendo.", "Cuando la panceta esté cocida, manténgala en un plato tibio mientras tostas ligeramente las magdalenas por ambos lados.", "Ahora unte los muffins con mantequilla y colóquelos en la bandeja para hornear, luego cubra cada mitad con dos rebanadas de panceta.", "Coloque un huevo escalfado encima de cada panecillo y luego cubra con una cuchara el hollandaise, cubriendo el huevo (debe haber un poco más de 1 cucharada de salsa por cada huevo).", "Ahora coloque los huevos Benedict debajo de la parrilla por solo 25-30 segundos, tan cerca del calor como sea posible, pero no los quite de sus ojos; deben estar teñidos de oro y nada más. Esto debería simplemente glasear la superficie de la holandesa. Servir de inmediato en platos calientes."], "url": "www_bbc_co_uk_food_recipes_eggsbenedict_9435", "title": "Huevos Benedict", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 3-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/eggsbenedict_9435_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["25g / 1oz de mantequilla", "1 cebolla pequeña, finamente picada", "225g / 8oz de champiñones, finamente picados", "hojas de 1 ramita de tomillo", "nuez moscada recién rallada", "6 huevos grandes", "6 cucharaditas de crema doble", "Queso Gruyére de 40 g / 1½ oz, finamente rallado", "sal", "pimienta negra recién molida", "puñado de ensalada de hojas de bebé", "ramitas de perejil, estragón, perifollo, cebollín, hinojo y eneldo de hoja plana", "aceite de oliva de limón o aceite de oliva virgen extra", "sal"], "method": ["Precaliente el horno a 200C / 400F / Gas Mark 6. Derrite la mantequilla en una sartén de tamaño mediano, agregue la cebolla y cocine suavemente hasta que esté suave pero no coloreada.", "Agregue los champiñones y el tomillo y continúe cocinando hasta que todo el exceso de líquido se haya evaporado y la mezcla esté bastante seca. Sazone al gusto con sal, pimienta y nuez moscada.", "Coloque la mezcla de champiñones en seis platos de ramekin ligeramente untados con mantequilla. Rompa los huevos, sazone ligeramente, luego cubra la crema y espolvoree con el queso Gruyére.", "Coloque los moldes en una lata para asar poco profunda y vierta un poco de agua caliente a su alrededor para que llegue a la mitad de los lados de los platos. Hornee durante 15 minutos hasta que los huevos estén listos, pero las yemas todavía están líquidas y el queso es ligeramente dorado.", "Servir con una mezcla de hojas de ensalada de berenjenas y hierbas, aderezado con aceite de oliva de limón o aceite de oliva virgen extra."], "url": "www_bbc_co_uk_food_recipes_eggsencocottewithcho_71187", "title": "Huevos en cocotte, con champiñones, tomillo y gruyere", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]