[{"isVegetarian": false, "title": "Mint lamb chops served with pea purée and roasted shallots", "url": "www_bbc_co_uk_food_recipes_mintlambshallotsserv_76050", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz breadcrumbs", "2 tbsp fresh mint", "1 tbsp fresh parsley", "2 lamb chops ", "100g/3½oz flour", "1 free-range egg, whisked", "1 tbsp olive oil", "1 tbsp fresh parsley, chopped", "1 tbsp white wine vinegar", "25g/1oz butter", "25g/1oz brown sugar", "2 small shallots, peeled"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To prepare the lamb chops, use a blender to mix the breadcrumbs, mint and parsley until well combined.  Place into a bowl.", "Coat the lamb chops in the flour then dip in the egg and into the breadcrumbs until well coated.  Season with salt and freshly ground black pepper.", "Heat a frying pan to a medium heat.  Add the oil and place the lamb chops into the pan.  Cook for three minutes.", "Turn the chops over and cook for a further three minutes.", "Remove the chops and allow them to rest for three minutes.", "To make the pea purée, place half the peas, the parsley and the white wine vinegar into a small blender and blend until smooth.", "Fold the other half of the cooked peas into the pea mixture.", "To make the caramelised shallots, in a small frying pan over a hot heat, add the butter and sugar together for one minute.", "Add the shallots and cook until golden.", "Turn down the heat and cook for a further two minutes.", "Serve the lamb chops with the minted peas and the caramelised shallots on the side."]}, {"isVegetarian": true, "title": "Mint sauce", "url": "www_bbc_co_uk_food_recipes_mintsauce_1303", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz fresh mint, chopped", "1 tsp caster sugar", "1 tbsp hot water", "2 tbsp white wine vinegar"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Mix all the ingredients together and stand for 20 minutes to allow the mint flavour to develop. The classic mint sauce to serve with roast lamb."]}, {"isVegetarian": false, "title": "Chicken in white wine sauce", "url": "www_bbc_co_uk_food_recipes_mirandaschickeninwhi_85673", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 chicken breasts", "1 onion", "1 carrot", "1 stick celery", "1 bay leaf", "6 peppercorns", "30g/1oz butter", "30g/1oz plain flour", "140ml/5fl oz white wine", "1 free-range egg yolk", "2-3 tbsp double cream", "squeeze lemon juice", "salt and freshly ground black pepper ", "small handful fresh parsley, chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Place the chicken breasts in a pan with the vegetables and peppercorns and cover with water. ", "Bring gradually to the boil and simmer until the chicken is cooked all the way through - about 30 minutes. ", "Carefully remove the chicken breasts from the cooking liquid and keep them warm. ", "Strain the cooking liquid into a clean pan, discarding the cooked vegetables. Reserve about 450ml/16fl oz of the liquid.", "Melt the butter in a separate pan and add the flour. Cook until the mixture forms a smooth paste which leaves the sides and base of pan cleanly.", "Gradually add the reserved cooking liquid to the mixture, a ladle at a time, allowing to boil after each addition before beating well. Stir until the mixture blends smoothly.", "Pour the white wine into the sauce and reduce the heat to low. ", "In a small bowl, combine the egg yolk with the double cream. Stir the egg and cream into the sauce. ", "Add a squeeze of lemon juice and salt and freshly ground black pepper to taste.", "Cut the cooked chicken into bite-sized pieces and stir into the sauce. ", "Garnish with chopped fresh parsley and serve at once."]}, {"isVegetarian": false, "title": "Miso-baked black cod", "url": "www_bbc_co_uk_food_recipes_miso-baked_black_cod_01223", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 tbsp white miso paste", "6 tbsp sake", "2 garlic cloves, finely grated", "10g/¼oz fresh root ginger, peeled and finely grated", "2 tbsp caster sugar", "1 tbsp rice wine vinegar ", "4 x 200g/7oz thick black cod fillet, skin on", "splash vegetable oil", "2 limes, quartered", "micro salad, to garnish", "6 tbsp sesame seeds", "½ tsp sugar ", "2 tbsp seasoned soy sauce ", "2 tbsp liquid dashi seasoning", "2 good splashes of citrus juice, such as yuzu lemon juice ", "a dash of Japanese sansho pepper (use white pepper if you can’t get hold of this)", "600g/1lb 5oz choi sum (you could also use pak choi or spinach)"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Mix all of the marinade ingredients together and place in a non-metallic bowl.", "For the black cod, add the fish to the marinade, cover with cling film and place in the fridge preferably overnight or a minimum of two hours.", "Preheat the oven to 180C/350F/Gas 4 (160C fan).", "Lightly oil a non-stick baking tray. Place the fish, skin-side down onto the baking tray.", "Spoon over two tablespoons of the marinade and then bake for 10-12 minutes, depending on the thickness of fish.", "Preheat the grill. Remove the fish from the oven, place the remaining marinade over the fish, place under the grill and cook until golden-brown.", "For the Chinese greens with sesame sauce, heat a small non-stick frying pan and dry-fry the sesame seeds until just lightly golden-brown. Put into a pestle and mortar. Grind to nearly a paste, but still with some texture. ", "Add the sugar, soy sauce, dashi, and citrus juice. Give a good grind to incorporate all the flavours. Add a couple of sprinkles of Japanese sansho pepper.", "Rinse the greens well, trim the base of the stems and cut the rest into bite-sized pieces.", "Place a steamer on top of a pan of boiling water. Steam the broccoli for 1-2 minutes, or until tender. Transfer to a suitable serving dish and spoon over the sauce.", "Serve the fish with the Chinese greens and with lime wedges and micro salad on the side. "]}, {"isVegetarian": false, "title": "Miso-glazed cod with avocado and radish salad, tofu dressing and pickled daikon", "url": "www_bbc_co_uk_food_recipes_miso-glazed_cod_with_13934", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 cod fillets, skin on", "2 limes, juice only", "80g/3oz white miso", "¼ small bunch chervil, finely chopped", "½ small bunch dill, finely chopped", "½ small bunch parsley, finely chopped", "butter for greasing", "olive oil, for frying", "2 daikons, sliced on a mandolin, then cut into circles using a 4cm cutter.", "100g/3½oz caster sugar", "180ml/6fl oz rice vinegar", "1 nashi pear, peeled and cut into pieces", "2 baby turnips, cut in half", "¼ cucumber, seeds removed and cut into pieces", "¼ bunch pink radish, cut in half", "1 avocado, peeled and cut into pieces", "320g /11oz silken tofu\t", "50ml/2fl oz soy sauce", "30g/1oz caster sugar\t", "7g siracha sauce\t", "30ml/1fl oz sherry vinegar", "40ml/1½fl oz sesame oil\t", "120ml/4fl oz vegetable oil\t", "1 lime, zest only", "2 tbsp chopped fresh coriander"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the cod, mix together the lime juice and miso, then rub it onto the cod fillets. Mix the chopped herbs together in a bowl and dip the unskinned side of the cod into them, then place on a sheet of buttered greaseproof paper.", "Heat the oil in a non-stick frying pan. Add the cod fillets, herb-side down, and cook for about 3 minutes on each side. Remove from the frying pan and set aside. When cool enough to handle, remove the skin.", "For the pickled daikon, mix the sugar and vinegar in 180ml//6fl oz water. Add the daikon and set aside.", "For the salad, heat a large saucepan of boiling water and blanch the pear, turnips, cucumber and radishes. Drain and place in iced water, then drain again.", "Mix all the ingredients in large bowl, along with the avocado.", "For the dressing, in a blender, blend the tofu until smooth. Add all the other ingredients apart from the vegetable oil, and pulse until everything binds together.", "Add the vegetable oil a little at a time, while blending, until the consistency resembles a loose pudding.", "To serve, pour the dressing over the salad and mix then garnish with the pickled daikon. Place some greaseproof paper onto a serving plate and top with the cooked cod and grate over some fresh lime zest."]}, {"isVegetarian": true, "title": "Miso aubergine with noodles", "url": "www_bbc_co_uk_food_recipes_miso_aubergine_with_01293", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/miso_aubergine_with_01293_16x9.jpg", "ingredients": ["150g/5½oz rice noodles ", "150g/5½oz mangetout", "3 spring onions, roughly chopped", "1 tbsp sesame oil ", "1 tbsp sesame seeds ", "1 lime, juice only", "2 tbsp finely chopped coriander", "1 large aubergine, halved lengthways, flesh scored in a criss-cross pattern not piercing the skin", "2 tbsp white miso ", "5cm/2in fresh root ginger, peeled and finely grated", "1 tsp runny honey (or vegan alternative)", "1 tsp soy sauce", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Bring a large saucepan of lightly salted water to the boil and cook the noodles according to the packet instructions. ", "Meanwhile, place the mangetout in a steamer or colander and set above the boiling water to steam with a lid on for 2 minutes. Drain the noodles and toss with the mangetout, spring onions, sesame oil and seeds, 1 tablespoon of lime juice and the coriander. Season with salt and pepper and set aside. ", "Heat the grill to high and line a baking tray with kitchen foil. Put the aubergine on the tray, skin-side up, and grill for 10 minutes, or until the skin has hardened and the flesh is soft. ", "Meanwhile, mix the miso, ginger, honey, soy sauce and 1 tablespoon of lime juice together in a small bowl.  ", "Turn the aubergine over and push the miso mixture into the grooves. Grill for 5 minutes, flesh-side up, checking after 3 minutes that the miso is grilling evenly. It should be patched with brown but not burnt.  ", "Cut the aubergine into thick slices and place on top of the noodles. Serve hot or at room temperature or divide between two lunch boxes."]}, {"isVegetarian": true, "title": "Miso-grilled aubergine and homemade ricotta with elephant garlic and green chilli dressing", "url": "www_bbc_co_uk_food_recipes_miso-grilled_aubergine_13151", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 head elephant garlic", "2 cloves elephant garlic, grated", "1 lime, juice and zest", "1 green chilli, finely chopped", "2 tbsp rice wine vinegar", "1 tbsp chopped fresh coriander", "1 tbsp chopped fresh mint", "1 tbsp chopped fresh dill", "1 tbsp chopped fresh basil", "60ml/2fl oz olive oil", "salt and freshly ground black pepper", "600ml/21fl oz Jersey full cream milk", "2 bay leaves", "1 sprig rosemary", "drizzle olive oil", "1 tsp lemon juice", "2 tbsp white miso paste", "1 tbsp sesame oil", "8 baby aubergines (or 2 large aubergines), halved and scored"], "serves": "Serves 2–4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a griddle pan or barbecue to a high heat and colour the elephant garlic head on all sides. Wrap in foil and place on a cool part of the barbecue or in an oven preheated to 120C/100C Fan/Gas ½. ", "To make the ricotta, place the milk in a saucepan with the herbs, olive oil and a pinch of salt. Bring to the boil, then whisk in the lemon juice. Remove from the heat and wait for the milk to split. Pour into a colander lined with cheesecloth over a large bowl and allow to drain.", "To make the aubergine. mix the miso paste with the sesame oil and 2 tablespoons of water, until smooth. Brush each aubergine half with the miso mixture. Cook on the barbecue or on a hot griddle pan for 5–10 minutes on each side, basting with the miso, until cooked through and charred. ", "To make the dressing, place the grated garlic, lime juice and zest, chilli, vinegar and herbs in a pestle and mortar and season with salt and pepper. Squeeze the garlic out from the head and mix with the dressing.", "To serve, arrange the ricotta on a serving plate with the aubergine. Drizzle with the dressing and serve."]}, {"isVegetarian": false, "title": "Miso chicken with walnuts and grapes", "url": "www_bbc_co_uk_food_recipes_miso_chicken_with_63991", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/miso_chicken_with_63991_16x9.jpg", "ingredients": ["8-12 free-range chicken thighs, boned and skin left on", "80g/2¾oz white miso paste", "40g/1½oz root ginger, finely grated", "4 tbsp mirin", "6 tbsp cider vinegar", "12 small shallots, peeled", "1 tbsp sunflower oil", "200ml/7fl oz white wine", "6 tbsp water", "sea salt and freshly ground white pepper", "125g/4½oz walnuts, broken", "80g/2¾oz unsalted butter", "1½ tbsp maple syrup", "250g/9oz small seedless red grapes", "1 tbsp chopped tarragon"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Place the chicken in a large bowl. Stir together the miso paste, ginger, mirin and four tablespoons of the vinegar and pour the mixture over the chicken. Mix until well combined. Cover with clingfilm and leave in the fridge to marinate for at least three hours. Overnight would be ideal.", "Put the shallots in a small saucepan and cover with water. Bring to the boil and cook for five minutes. Strain and cut the shallots in half lengthways.", "Preheat the grill to a high setting. Place the chicken pieces on a baking tray, skin-side up, with all the marinade and grill for 10 minutes. As soon as the chicken goes under the grill, heat the sunflower oil in a pan large enough to fit all the chicken. Add the shallots and fry on a medium heat for four minutes, or until browned. Add the remaining vinegar, reduce for a few seconds then pour in the wine, water, ½ teaspoon of salt and some white pepper and continue to cook for about six minutes.", "Remove the chicken from the grill and add it to the pan along with the cooking juices. Stir gently and bring everything to a low simmer. Cover the pan and cook for 3-4 minutes, or until the chicken is just cooked through.", "Remove the chicken from the pan and set it aside in a warm place. Add the walnuts, butter, maple syrup and grapes to the pan and continue cooking, stirring until the butter emulsifies, for 2-3 minutes.", "Serve the chicken with the sauce spooned on top and scatter over the tarragon."]}, {"isVegetarian": false, "title": "Miso glazed salmon with pickled cucumber salad and sushi rice", "url": "www_bbc_co_uk_food_recipes_miso_glazed_organic_94154", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50ml/2fl oz mirin", "50ml/2fl oz sake", "75g/3oz caster sugar", "150g/5oz white miso paste", "4 x 125g/4½ oz salmon fillets, skinless and boneless, any brown flesh removed", "1 cucumber, peeled in stripes, halved length-wise, seeds removed and cut into 3mm/1/8in slices", "1 large red chilli, halved, de-seeded, finely sliced", "9 black trompettes mushrooms, soaked and torn into strips", "½ tsp fine sea salt", "90ml/6 tbsp rice wine vinegar", "45g/1¾oz caster sugar", "1½ tbsp Japanese pickled ginger, roughly chopped", "60ml/4 tbsp rice wine vinegar", "2½ tbsp caster sugar", "¾ tbsp fine salt", "250g/9oz sushi rice", "black and white sesame seeds, toasted", "herb cress, such as rocket or coriander cress", "Japanese seven spice pepper"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the salmon, combine the mirin, sake and sugar in a small pan. Bring to the boil over a medium heat, to dissolve the sugar.  ", "Add the miso paste and bring to the boil and simmer for three minutes.  ", "Pass the miso mixture through a fine sieve and set aside to cool. ", "Onced cooled, coat the salmon fillets with the miso marinade, (reserving some to finally coat the salmon before cooking), and lay on a tray to marinade for at least six hours. ", "Once the salmon has marinated, preheat the oven to its highest setting.", "To cook the salmon, wipe any excess marinade off the salmon fillets and heat a dry pan until very hot. ", "Sear the salmon fillets briefly in the very hot pan, then place them onto a baking tray.  ", "Rub the top presentation side of the salmon with a little miso marinade and allow to dry for at least 10 minutes. ", "Finish the cooking the salmon in the oven, for about five minutes until just cooked and still slightly pink inside. ", "For the cucumber salad, mix the cucumber, chilli, trompette mushrooms and sprinkle with the salt.  ", "Allow the vegetables to stand for 30 minutes then rinse in cold water and pat dry with kitchen paper.  ", "In a small pan, bring the vinegar with caster sugar to the boil, then pour it over the cucumber mixture. Allow to stand for an hour, then add the pickled ginger.  ", "Drain the pickling liquor off the vegetables when ready to serve.", "For the sushi rice, in a small pan, bring the rice wine vinegar, sugar and salt up to the boil, stirring to dissolve the sugar and salt. Once dissolved, remove the mixture from the heat and allow to cool.", "Wash the sushi rice three or four times in cold water, and set aside in the colander for 30 minutes.", "Place the rice into a saucepan then add 500ml/18fl oz water. Cover the rice and bring to the boil over a low heat. ", "Boil the sushi rice for 12-15 minutes until the water has been absorbed, then remove the pan from the heat, keeping the lid on, and allow finish cooking, off the heat, for 10-15 minutes more.", "Tip the rice into a wide bowl and fold in four tablespoons of the cooled sushi vinegar.  ", "When the rice is cool shape it into balls or triangles. To serve, warm the sushi rice in a steamer or microwave.", "To serve, sprinkle the miso salmon fillet with black and white sesame seeds and place onto serving plates. Serve the pickled cucumber salad alongside with the sushi rice, sprinkled with a few sesame seeds. Garnish with herb cress and a dusting of seven spice pepper."]}, {"isVegetarian": false, "title": "Miso halibut with teriyaki green vegetables", "url": "www_bbc_co_uk_food_recipes_miso_halibut_with_87099", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 x 150-200g/5½-7oz fillet of halibut, skin on, pin-boned", "4 tbsp sake", "4 tbsp mirin", "4 tbsp white miso paste", "3 tbsp caster sugar", "125ml/4fl oz Shaoxing rice wine", "125ml/4fl oz sake", "125ml/4fl oz mirin", "125ml/4fl oz soy sauce", "3 tbsp caster sugar", "2 tbsp groundnut or vegetable oil", "1 shallot, finely chopped", "4 garlic cloves, crushed", "2cm/¾in knob fresh root ginger finely sliced", "2 tsp salt", "750g/1lb 10oz Chinese greens, such as black cabbage (cavolo nero) or bok choi", "2 tbsp chicken stock or water", "2 tbsp red amaranth", "2 tbsp coriander cress"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["For the miso halibut, stir together the sake, mirin, white miso paste and caster sugar in a shallow dish. Remove a couple of tablespoons of the marinade and put it in squeezy bottle for the dressing and set aside. Add the fish to the shallow dish, cover and leave to marinate in the fridge for 24 hours.", "When you are ready to cook the fish, preheat the grill to high. Wipe any excess marinade from the fish and place the fish on a baking tray.", "Grill the fish for three minutes on each side, or until cooked to your liking.", "For the teriyaki green veg and miso dressing, first make the teriyaki sauce. Heat a frying pan until hot, add the rice wine, sake, mirin, soy sauce and caster sugar and bring the mixture to a simmer.", "Simmer for 1-2 minutes, or until the mixture has just thickened.", "Heat a large wok and add the oil. Once the oil is hot, add the shallot, garlic, ginger, salt and the greens and cook for 2-3 minutes.  Pour in the teriyaki sauce and stock (or water) and stir.", "To serve, use the marinade in the squeezy bottle to dress each of four plates. Place the greens on each plate topped with the miso fish. Garnish with the red amaranth and coriander cress."]}, {"isVegetarian": false, "title": "Miso ramen soup with buckwheat noodles", "url": "www_bbc_co_uk_food_recipes_miso_ramen_soup_with_15548", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/miso_ramen_soup_with_15548_16x9.jpg", "ingredients": ["1.5kg beef bones, chicken carcasses, lamb bones (usually free from the butchers) or use the saved bones from a roast", "splash of apple cider vinegar or fresh lemon juice (optional – this can help to extract the minerals from the meat bones)", "1 handful of any onions, leeks, carrots or celery ends", "1 tbsp black peppercorns", "2 bay leaves", "350g/12oz buckwheat noodles", "1 tbsp sesame oil or extra virgin olive oil", "4 heads pak choi, trimmed and thinly sliced", "200g/7oz mixed mushrooms, sliced", "1 carrot, julienned", "½ red cabbage, stalk removed, leaves shredded", "5cm/2in piece fresh root ginger, peeled, grated", "6 spring onions, trimmed, finely sliced on the diagonal", "4 tbsp lime juice", "2 tbsp miso paste, preferably unpasteurised", "1-2 tsp tamari or salt, to taste", "large handful chopped fresh coriander, to serve"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["Put all of the ingredients for the bone broth in a large lidded pot and cover with cold water. The water level should cover the bones by 5cm/2in while still leaving room at the top of the pan. Cover and bring to the boil. Reduce the heat and simmer for at least 6 hours for chicken and 12 for beef or lamb, skimming off any foam that rises to the top. Strain the liquid and return to the pot, set aside. ", "Cook the buckwheat noodles according to the packet instructions, using plenty of water. During the first minute of cooking, use two forks to stir and separate the noodles.", "Drain the cooked noodles and rinse under cold running water for 15-20 seconds to stop them cooking any further. Set aside to drain, then drizzle over a little sesame oil and mix through to prevent the noodles from sticking to each other. ", "Divide the pak choy, mushrooms, carrot and red cabbage equally among four serving bowls.", "Gently heat the bone broth and stir in the grated ginger, spring onions, lime juice, miso paste and tamari.", "Pour the hot broth over the vegetables, sprinkle the coriander on top and serve. "]}, {"isVegetarian": false, "title": "Miso soup with oysters, prawns and baby sweetcorn", "url": "www_bbc_co_uk_food_recipes_miso_soup_with_oysters_18228", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tsp dashi powder", "500ml/18fl oz warm water ", "2cm/1in fresh ginger, peeled and sliced", "2 garlic cloves, sliced", "pinch chilli flakes", "3 tbsp white miso paste", "1 tbsp mirin", "1 tbsp soy sauce", "110g/4oz shiitake mushrooms, sliced", "110g/4oz baby sweetcorn", "8 oysters, oyster meat only, removed from the shell", "200g/7oz raw prawns, head removed, peeled but the tail left on", "150g/5½oz egg noodles", "4 spring onions, sliced", "2 limes, juice only", "1 fillet smoked eel, made into flakes or shavings, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Place the dashi powder, water, ginger, garlic and chilli flakes into a large sauce pan and place on the heat. Whisk in the white miso paste, mirin and soy sauce. Cook for 20-30 minutes.", "Add the mushrooms, baby sweetcorn, oysters and prawns and cook for 4-5 minutes.", "Cook the noodles in a saucepan of boiling water for 2-3 minutes. Drain, set aside and keep warm.", "Just before serving add the spring onions and the lime juice to the soup. ", "Place the cooked noodles into a serving bowl and ladle the stock over the top. Garnish with flakes/shavings of smoked eel."]}, {"isVegetarian": false, "title": "Miso-glazed halibut with prawn dumplings in shiso broth", "url": "www_bbc_co_uk_food_recipes_misoglazedhalibutwit_92903", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp white miso paste (available from Japanese supermarkets)", "3 tbsp sugar", "3 tbsp dark soy sauce", "3 tbsp sake (available from Japanese supermarkets)", "3 tbsp mirin (Japanese rice wine, available from Japanese supermarkets)", "4 x 150g/5oz thick halibut fillets, skins removed", "110g/4oz raw king prawns, heads and shells removed, de-veined, roughly chopped", "1 tsp dark soy sauce", "1 tsp mirin", "¼ tsp freshly grated root ginger", "2 tsp finely chopped spring onion", "12 wonton wrappers (available from Japanese supermarkets)", "1 free-range egg yolk, mixed with 1 tbsp water", "650ml/1 pint 3½fl oz hot chicken stock, preferably homemade", "1 tbsp sake", "1 tbsp dark soy sauce", "1 tsp freshly grated root ginger", "1 tsp sugar", "¼ tsp salt", "6 shiitake mushrooms, washed well, stems removed, finely sliced", "6cm/2½in piece leek (white part only), julienned", "2 small heads bok choi, each cut in quarters", "8 green shiso leaves (available from Japanese supermarkets)", "1 tsp shichimi (seven spice pepper, available from specialist retailers)"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["For the miso halibut, mix the miso paste, sugar, soy sauce, sake and mirin together in a large glass bowl until well combined.", "Add the halibut fillets and mix until completely coated in the marinade. Cover the bowl and chill in the fridge and marinade for at least four hours, or preferably overnight. ", "Meanwhile, for the prawn dumplings, blend the chopped prawns, soy sauce, mirin and ginger in a food processor for 12-15 seconds, or until roughly combined. Transfer the mixture to a bowl and stir in the spring onion.", "Place three wonton wrappers onto a chopping board and place one teaspoonful of the prawn mixture into the centre of each. ", "Brush the edges of the wonton wrappers with a little of the beaten egg mixture, then fold each wrapper in half over the mixture, to form a triangle shape, and seal the edges together.", "Repeat the process with the remaining wonton wrappers and filling mixture.", "Wrap a filled wonton wrapper around your finger so that the two corners at the base of the triangle meet. Press these two corners together (the dumpling should resemble a tortellini.) ", "Repeat the process with the remaining filled wontons.", "Chill the prawn dumplings in the fridge until needed.", "When the halibut fillets have marinated, preheat the grill to its highest setting.", "Remove the halibut fillets from the marinade, shaking off any excess, then transfer them to a lightly oiled baking tray. Grill for 5-6 minutes, turning once during cooking, until just cooked through. (NB: The halibut is cooked through when the flesh is opaque.)", "Just before serving, bring a pan of salted water to the boil. Add the prawn dumplings to the boiling water, in batches, and boil for 2-3 minutes. Remove from the pan using a slotted spoon and set aside to drain on kitchen paper. Repeat the process with the remaining dumplings. ", "Meanwhile, for the shiso broth, bring the stock, sake, soy sauce, ginger, sugar and salt to a simmer in a saucepan. ", "Add the vegetables and simmer for 2-3 minutes, or until just tender, then add the dumplings to the broth and heat until warmed through. ", "To serve, place three prawn dumplings into each of four warmed serving bowls. Pour over the broth and vegetables. Add two shiso leaves to each bowl, then top each portion with a grilled halibut fillet. Sprinkle each dish with a pinch of shichimi pepper."]}, {"isVegetarian": false, "title": "Miso cod with deep-fried cabbage and pink peppercorn dressed cabbage", "url": "www_bbc_co_uk_food_recipes_misocodwithdeepfried_86296", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75ml/3fl oz saké", "75ml/3fl oz mirin (available from some supermarkets and Asian grocers)", "225g/8oz white miso paste (available from some supermarkets and Asian grocers)", "110g/4oz granulated sugar", "4 x 200g/7oz cod fillets", "vegetable oil, for deep frying", "6 outer leaves savoy cabbage, finely sliced", "½ tsp soft brown sugar", "½ tsp sea salt", "¼ pointed cabbage, finely sliced", "2 tbsp chopped fresh coriander leaves", "½ tsp sugar", "½ tsp sea salt", "1 tsp pink peppercorns", "2 tbsp mirin", "2 tbsp sesame oil", "½ lime, juice only"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["For the cod, place the saké and mirin into a saucepan and bring to the boil. Boil for 30 seconds to burn off the alcohol, then reduce the heat.", "Add the white miso and stir to dissolve. Turn the heat back up and add the sugar, stirring once more to dissolve. Remove from the heat, transfer to a large bowl and allow to cool.", "Place the cod fillets into the cold miso mixture, cover and place in the fridge for at least 24 hours, preferably 48 hours.", "When you're ready to cook the cod, preheat the grill to high and the oven to 200C/400F/Gas 6.", "Remove the cod from the miso mixture and wipe off any excess, then place onto a baking sheet. Place under the grill for 2-3 minutes until golden, then remove and place in the oven for ten minutes until cooked through.", "For the deep-fried cabbage, place the vegetable oil into a deep, heavy-bottomed saucepan and heat until a small cube of bread sizzles and turns golden when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Place the shredded savoy cabbage into the hot oil and fry for 30-45 seconds, or until crisp. Remove from the oil with a slotted spoon and drain on kitchen paper. Sprinkle over the sugar and salt.", "Meanwhile, for the pink peppercorn dressed cabbage, place the shredded pointed cabbage and coriander into a bowl.", "Place all the remaining ingredients into a pestle and mortar and pound together to make a light dressing. Pour over the cabbage and stir to combine.", "To serve, divide the deep-fried cabbage equally among four serving plates. Top each pile of cabbage with a piece of cod and place a small pile of dressed cabbage on top of each cod fillet."]}, {"isVegetarian": true, "title": "Miso noodle soup", "url": "www_bbc_co_uk_food_recipes_misonoodlesoup_84732", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp miso paste", "100ml/3½fl oz boiling water", "½ red chilli, sliced", "½ garlic clove, sliced", "1 bay leaf", "½ tsp ground ginger", "75g/2½oz wholewheat noodles", "1 pak choi, leaves separated", "fresh coriander, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the miso paste, water, chilli, garlic, bay leaf and ginger into a saucepan, bring to the boil and stir to combine. ", "Add the noodles to the pan and simmer for 2-3 minutes, or until softened.", "Add the pak choi leaves to the pan and cook for 1-2 minutes. ", "To serve, pour the soup into a serving bowl and garnish with fresh coriander."]}, {"isVegetarian": true, "title": "Mississippi mud pie", "url": "www_bbc_co_uk_food_recipes_mississippimudpie_93659", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mississippimudpie_93659_16x9.jpg", "ingredients": ["300g/10½oz bourbon biscuits, crushed", "75g/2½oz butter, melted ", "85g/3oz dark chocolate, minimum 70 per cent cocoa solids", "85g/3oz butter", "2 free-range eggs", "85g/3oz muscovado sugar", "100ml/3½oz double cream", "150g/5½oz dark chocolate, minimum 70 per cent cocoa solids", "150ml/5½fl oz double cream, plus extra to serve", "3 tbsp golden syrup", "175g/6oz icing sugar, sieved"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/365F/Gas 4.", "Mix the biscuits and melted butter together in a bowl. Press the mixture into the base and sides of a 23cm/9in springfrom tin. Chill in the fridge for 10 minutes.", "For the filling, melt the chocolate and butter together in a heatproof bowl set over a pan of simmering water. (Do not let the base of the bowl touch the water). ", "Meanwhile, whisk the eggs and sugar together in a bowl for 5-6 minutes, or until thick and creamy. Fold in the cream and melted chocolate mixture. Pour into the chilled springform tin and bake in the oven for 40-50 minutes, or until just set. Remove from the oven and set aside to cool completely.", "Meanwhile, for the fudge sauce, heat all of the fudge sauce ingredients in a saucepan, stirring regularly, over a medium heat until the mixture is smooth and glossy. Set aside to cool for 5 minutes.", "Spread the sauce over the cooled pie and chill in the fridge for 20 minutes. Serve with double cream."]}, {"isVegetarian": true, "title": "Mixed bean salad", "url": "www_bbc_co_uk_food_recipes_mixed_bean_salad_89055", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mixed_bean_salad_89055_16x9.jpg", "ingredients": ["1 x 400g tin mixed bean salad, drained and rinsed", "2 spring onions, finely chopped", "2 celery sticks, thinly sliced", "1 large tomato, deseeded and finely diced", "salt and freshly ground black pepper", "3 tbsp olive oil", "1 tbsp white wine vinegar", "1 tsp sugar", "2 tsp Dijon mustard", "1 tbsp chopped fresh tarragon ", "1 tbsp chopped fresh parsley"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Put all the salad ingredients in a bowl and mix well. ", "Mix the dressing ingredients in a separate bowl or jug until well combined. ", "Pour the dressing over the salad, season well with salt and pepper and toss together."]}, {"isVegetarian": false, "title": "Mixed seafood in a Bengali broth (Macher jhol)", "url": "www_bbc_co_uk_food_recipes_mixed_seafood_in_a_40876", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 300g/10½oz piece of halibut fillet, scaled, pin-boned and cut into 5cm/2in cubes", "4 large scallops, cleaned and removed from their shells", "4 large prawns, shells removed, deveined", "1 lobster, meat removed and cut into 2½cm/1in cubes, reserve 1 claw", "1 squid, cleaned and sliced into1cm/½in thick rings", "2 small potatoes, peeled, boiled and sliced (about 1cm/½in thick)", "2 small aubergines, sliced 1cm/½in thick", "8 cherry tomatoes on the vine", "1½ tsp salt", "3 tbsp vegetable oil  ", "½ tsp sugar", "1 tsp ground turmeric", "½ tsp red chilli powder", "½ tsp fennel seeds", "½ tsp nigella seeds", "coriander cress, to garnish", "2 tbsp oil", "4 green cardamom pods, crushed", "10 peppercorns, crushed", "2 bay leaves", "1 tsp onion seeds", "1 tsp fennel seeds", "1 large onion, finely chopped", "¼ tsp ground turmeric", "1 tsp red chilli powder", "1½ tsp ground cumin", "2 tomatoes, finely chopped", "2 hot green chillies, finely chopped", "750ml/1¼ pint fish stock", "1¼ tsp salt", "½ tsp sugar", "2 tbsp chopped fresh coriander ", "1 lemon, juice only", "pinch ground cardamom", "boiled basmati rice"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Wash the seafood and pat dry with kitchen paper. Sprinkle the seafood, potatoes, aubergine and tomatoes with salt and vegetable oil. Sprinkle over the sugar and spices, cover and place in the fridge. ", "Meanwhile for the broth, heat the oil in a large pan over a high heat. Once hot, add the cardamom pods, peppercorns, bay leaves, onion seeds and fennel seeds and let them crackle. Add the onions and cook over a high heat until they are golden-brown, this should take about 10 minutes.", "Add the turmeric, chilli powder and cumin and gently fry for 1 minute. Add the tomatoes and chillies and gently fry for 3 minutes. Add the fish stock, salt and sugar. Reduce the heat and simmer for 10 minutes. ", "Add the coriander and lemon juice and cook for 2 minutes. Pass the broth through a sieve and stir in the ground cardamom. Keep warm.", "Heat a large non-stick pan. Add the seafood mixture, except the lobster and squid. Cook over a moderate heat for 2 minutes. ", "Add the lobster and cook for another minute or so. Add the squid rings and as they colour, turn the mixture over in the pan. Cook the other side for another 2 minutes until the seafood and vegetables are just cooked. ", "Remove from the pan and place in a large serving bowl. Sprinkle with the coriander cress and pour over the broth. Serve immediately with basmati rice."]}, {"isVegetarian": true, "title": "Mixed beetroots and asparagus with goats' cheese", "url": "www_bbc_co_uk_food_recipes_mixedbeetrootsandasp_86324", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz raw beetroot, preferably mixed varieties and colours, such as white, golden and red", "250g/9oz asparagus ", "handful silver sorrel leaves, or green sorrel leaves if unavailable", "150-200g/5½-7oz goats' cheese, broken into small nuggets, preferably from Woolsery ", "2-3 pickled walnuts, chopped into small cubes", "salt and freshly ground black pepper", "1 tbsp cider vinegar ", "3 tbsp cold-pressed rapeseed oil", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the beetroot in their skins in boiling salted water for about an hour or until tender. (If using different colours, cook them separately.) Drain and leave to cool; then rub off the skins (you may wish to wear gloves while doing this to keep your hands from staining). ", "Cut off the woody ends from the asparagus. Cook the spears in boiling salted water for 5-6 minutes or until tender. Drain and leave to cool.", "Cut the beetroots into bite-sized pieces (a mixture of slices and wedges). Cut the asparagus spears in half. ", "Make the dressing by whisking the cider vinegar and rapeseed oil with salt and freshly ground black pepper to taste.", "To serve, carefully arrange the beetroot and asparagus on plates with the sorrel leaves, then scatter the goats' cheese and pickled walnuts over the top. Drizzle over the dressing just before serving."]}, {"isVegetarian": true, "title": "Mixed berry gratin with basil sabayon", "url": "www_bbc_co_uk_food_recipes_mixedberrygratinwith_84245", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 free-range egg yolks", "50g/2oz caster sugar", "110ml/3fl oz champagne", "6 fresh basil leaves, finely chopped", "50g/2oz raspberries", "50g/2oz strawberries", "50g/2oz blackberries", "50g/2oz blueberries", "50g/2oz caster sugar"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the sabayon, place a glass bowl over a saucepan of barely simmering water. Add the egg yolks and sugar and whisk continuously, until pale and light.", "Add the champagne and continue whisking until pale and fluffy. (The foam must be sufficiently thickened so that it won't break down when it cools.) Remove from the heat and cool until tepid.", "For the berry gratin, place all of the berries and the sugar into a bowl and mix together. Then divide evenly among four ovenproof bowls.", "Add the basil to the sabayon, mix well, then spoon the sabayon over the berries.", "Using a mini-blowtorch, heat the top of the sabayon until it turns golden-brown, then serve immediately."]}, {"isVegetarian": true, "title": "Mixed berry parcel with berry coulis", "url": "www_bbc_co_uk_food_recipes_mixedberryparcelwith_86148", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["10cm/4in square ready-rolled puff pastry", "icing sugar, to dust", "1 tbsp frozen berries, defrosted", "1 free-range egg, lightly beaten", "1 tbsp icing sugar", "100g/3½oz frozen berries, defrosted, plus extra to serve", "fresh mint leaves, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the mixed berry parcel, dust the pastry with icing sugar and spoon the berries into the centre.", "Brush the edges of the pastry with the beaten egg and fold the corners up into the centre. Pinch the edges together to seal the filling inside the pastry.", "Place the parcel onto a non-stick baking sheet, transfer to the oven and bake for 10-12 minutes, or until slightly risen and golden-brown.", "For the coulis, place the icing sugar and berries into a food processor and blend until smooth. Strain the mixture through a sieve to remove the pips.", "To serve, pour a pool of coulis onto a serving plate and top with the mixed berry parcel. Garnish with berries and fresh mint."]}, {"isVegetarian": true, "title": "Mixed fruit charlotte", "url": "www_bbc_co_uk_food_recipes_mixedfruitcharlotte_77133", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150ml/5fl oz double cream, whipped", "1 tbsp icing sugar", "10 sponge fingers", "1 orange, sliced", "¼ pineapple, sliced", "4 fresh mint leaves"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Mix the double cream with the sugar.", "Line 5inch/12.5cm ring mould with some sponge fingers.", "Top with the cream, then add the sliced fruit and finish with the mint sprigs.", "Remove the ring mould and serve."]}, {"isVegetarian": false, "title": "Mixed paella", "url": "www_bbc_co_uk_food_recipes_mixedpaella_86766", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["vegetable oil, for frying", "4 boneless chicken thighs, skin on", "100g/3½oz pork belly, cut into 1cm/½in cubes", "100g/3½oz baby squid, cut into rings", "75g/3oz chorizo, chopped", "1 onion, chopped", "1 garlic clove ", "400g/14oz short grain rice or paella rice (such as Calasparra)", "1 tbsp dried rosemary", "pinch saffron strands, soaked in 3-4 tbsp milk", "1 litre/1 pint 15fl oz chicken stock", "salt and freshly ground black pepper", "8 plum tomatoes, chopped", "8 king prawns, shell removed and de-veined", "125g/4oz assorted fresh fish (such as salmon, haddock or cod), skinless, boneless, cut into chunks", "lemon wedges, to serve"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a paella pan or a wide, deep, heavy-bottomed frying pan.", "Add the chicken thighs and cook until browned on all sides. Add the pork cubes, squid and chorizo and fry until golden-brown all over, then remove from the pan and set aside.", "In the same pan, fry the onion and garlic for 3-4 minutes, until softened.", "Add the rice, rosemary, saffron and its milk, and about half of the stock. Bring to the boil, then reduce the heat to simmer for 18-20 minutes, adding more stock if the rice dries out.", "Return the chicken and pork to the pan, stir well and allow continue simmering for ten minutes, adding a little more stock if necessary, until the chicken is completely cooked through.", "Add the cooked squid and chorizo and stir well.", "Add the prawns, assorted fish and the tomatoes and cook for about 8-10 minutes, or until the fish and prawns are just cooked through.", "To serve, spoon the paella into warmed bowls with a lemon wedge alongside."]}, {"isVegetarian": true, "title": "Mixed vegetable curry", "url": "www_bbc_co_uk_food_recipes_mixedvegetablecurry_90225", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mixedvegetablecurry_90225_16x9.jpg", "ingredients": ["½ medium-sized aubergine, chopped", "2 small carrots, chopped", "100g/4oz green beans, halved", "1 medium-sized potato, chopped", "100g/4oz peas (frozen is fine)", "50g/2oz desiccated unsweetened coconut, soaked in a little hot water for five minutes", "4 green chillies, roughly chopped (or to taste)", "1 tsp salt", "3 medium-sized tomatoes, roughly chopped", "1 tbsp plain yoghurt", "1 tsp garam masala", "2 tbsp roughly chopped fresh coriander leaves"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the aubergine, carrots, green beans and potato in a medium-sized pan. Add 250ml/8fl oz water.", "Bring to the boil, add the peas, then cover, turn the heat to medium and cook for four minutes or until the vegetables are just tender.", "Meanwhile, put the coconut, chillies and salt in the bowl of a food processor. Add 150ml/5fl oz water and blend to form a fine paste. Set aside. (You can always finely chop by hand, but you may want to wear gloves when chopping chillies)", "When the vegetables are just cooked, add the chilli paste. Stir and simmer gently for five minutes.", "Add the tomatoes, yoghurt and garam masala. Stir gently to mix well. Bring to the boil, reduce the heat and simmer gently for 2-3 minutes or until the potatoes are cooked through.", "To serve, place the vegetable curry into a serving dish and garnish with the fresh coriander."]}, {"isVegetarian": true, "title": "Mocha and tutti frutti cream horns", "url": "www_bbc_co_uk_food_recipes_mocha_and_tutti_frutti_12936", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mocha_and_tutti_frutti_12936_16x9.jpg", "ingredients": ["150g/5½oz strong white bread flour, chilled, plus extra for dusting", "150g/5½oz chilled plain flour", "pinch of salt", "2 large free-range eggs, plus extra for glazing", "250g/9oz unsalted butter, chilled", "caster sugar, for sprinkling", "200g/7oz plain chocolate (minimum 70% cocoa solids)", "400ml/14fl oz full-fat milk", "100g/3½oz caster sugar", "4 large free-range egg yolks", "40g/1½oz cornflour", "1 tbsp coffee extract", "150g/5½oz double cream", "1 tbsp limoncello", "250g/9oz ricotta", "75g/2½oz candied peel, chopped, plus extra for decoration"], "serves": "Makes 12 cream horns", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the puff pastry, put the flours, salt, eggs and 100ml/3½fl oz cold water into a large bowl and gently mix to an even dough using your fingers. Transfer the dough to a lightly floured surface and knead it for 5-10 minutes until smooth. The dough should feel a little tight at this stage. Shape the dough into a ball and put it into a plastic bag in the fridge to chill overnight, or for at least 7 hours.", "Flatten the butter into a rectangle, about 40x19cm/16x7½in, by hitting it with a rolling pin (you may find it easier if you sandwich the butter between 2 sheets of cling film). Return to the fridge for an hour to harden the butter again.", "Roll out your dough to a rectangle, about 60x20cm/24x8in wide. Put the butter on the dough so it covers the bottom two-thirds. Make sure that it is positioned neatly and covers almost to the edges.", "Lift the exposed dough at the top and fold it down over half of the butter, then fold the butter-covered bottom half of the dough up over the top. You will now have a sandwich of two layers of butter and three of dough. Pinch the edges together to seal. Put it back in a plastic bag and chill for 1 hour.", "Take the dough out of the bag and put it on a lightly floured surface with a short edge towards you. Roll out to a rectangle as before, keeping the edges as neat as possible. Fold the top quarter down and the bottom quarter up so they meet neatly in the centre. Then fold the dough in half along the centre line. This is called a book turn. Chill in the bag for 1 hour.", "Take the dough out of the bag, put it on a lightly floured surface with the short end towards you and roll into a rectangle as before. This time, fold down one-third of the dough and then fold up the bottom third to make a neat square. This is called a single turn. Chill in the bag for another hour.", "Bring the dough out again and do a single turn as previously. Chill in the bag overnight. ", "For the mocha crème pâtissière, melt half of the chocolate in a heatproof bowl set over a pan of simmering water. Pour the milk into a saucepan and bring to the boil, then remove from the heat.", "Whisk the sugar, egg yolks and cornflour together in a large bowl. Pour a little of the hot milk onto the egg mixture, whisking continuously. Whisk in the rest of the hot milk until well-combined, whisking all the time. Return the mixture to the pan and cook over a gentle heat, stirring continuously, until the mixture becomes thick. ", "Remove from the heat and pass the mixture through a sieve into a clean bowl. Add the melted chocolate and coffee extract and stir until thoroughly combined. Cover the surface with cling film to prevent a skin forming and chill thoroughly before using.", "For the tutti frutti filling, whip the cream and limoncello until soft peaks form when the whisk is removed. Fold in the ricotta and chopped peel. Cover with clingfilm and chill before using.", "For the cream horns, line a baking tray with non-stick baking paper. Preheat the oven to 200C/180C Fan/Gas 6. ", "Roll the dough out onto a lightly floured work surface until its longest edge is 60cm/24in long. Cut the pastry into long strips 1cm/½in wide. Starting at the pointed end of a cream horn mould, wrap a pastry strip around the mould in a spiral, with each line overlapping slightly. Place on the baking tray. Repeat to cover all 12 moulds. Brush all the pastry horns with egg wash and sprinkle with sugar.", "Bake in the oven for 12-15 minutes, or until the horns are golden-brown, crisp and the pastry risen. Transfer to a wire rack to cool completely. Once cool, carefully remove the moulds. ", "To assemble, melt the remaining plain chocolate in a heatproof bowl set over a pan of simmering water and dip the wide end of 6 of the cream horns in it. Leave to set. Spoon the chilled mocha crème pâtissière into a piping bag fitted with a star nozzle and use to fill the chocolate dipped cream horns. ", "Spoon the tutti frutti filling into a piping bag fitted with a plain nozzle and use to fill the 6 remaining cream horns. Decorate with chopped candied peel. Serve immediately."]}]