[{"isVegetarian": true, "title": "Aloo gobi y arroz jeera", "url": "www_bbc_co_uk_food_recipes_aloo_gobi_and_jeera_rice_60396", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/aloo_gobi_and_jeera_rice_60396_16x9.jpg", "ingredients": ["350g / 12oz de arroz basmati", "2 cucharadas de aceite de girasol", "1 cebolla grande, finamente rebanada", "2 cucharaditas de semillas de comino", "1 hoja de laurel", "1 ramita de canela", "3 vainas de cardamomo verde", "2 cucharadas de aceite de girasol", "25g / 1oz de mantequilla (o alternativa)", "2 cucharaditas de semillas de comino", "2 cucharaditas de cúrcuma molida", "4cm / 1½en raíz fresca de jengibre, finamente rallada", "2 cebollas, más o menos picadas", "2 cucharaditas de chiles verdes recién picados (o al gusto)", "3 cucharadas de hojas secas de fenogreco (methi)", "1 coliflor, quebrada en florecillas, hojas picadas", "2 patatas grandes, cortadas en cubos de 2cm / ¾in", "2 cucharaditas de sal masala", "sal y pimienta negra recién molida", "puñado de cilantro fresco, para adornar"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Para hacer el arroz jeera, lave y remoje el arroz mientras prepara las especias. Coloque el aceite en una cacerola grande a fuego medio. Agregue las vainas de cebolla, comino, laurel, canela y cardamomo y fríelas suavemente durante unos minutos. Escurra y agregue el arroz, luego vierta más de 800 ml / 1 pinta 8 fl oz de agua. Llevar a ebullición, cubrir, reducir el fuego y hervir a fuego lento durante 15-20 minutos.", "Mientras tanto, para hacer el Aloo Gobi, caliente el aceite y la mantequilla en una cacerola grande a fuego medio. Agregue el comino, la cúrcuma, el jengibre, la cebolla, los chiles y el fenogreco y fríalos durante unos minutos. Agregue los flósculos y las hojas de coliflor, mezcle para cubrir las especias y cocine por unos minutos. Agregue las papas, mezcle nuevamente, tape y deje hervir durante 10-15 minutos, o hasta que las verduras estén blandas. Espolvorear sobre el garam masala y sazonar al gusto. Adorne con cilantro antes de servir con el arroz."]}, {"isVegetarian": true, "title": "Aloo panchporan (Patatas fritas templadas con cinco especias)", "url": "www_bbc_co_uk_food_recipes_aloopanchporanstirfr_77165", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1-2 cucharadas de aceite vegetal", "Patatas de 1kg / 2lb, peladas y cortadas en dados en cubos de 1cm / ½ en cubitos", "½ cucharadita de cúrcuma seca", "½ cucharadita de chile rojo en polvo", "sal", "1 cucharada de semillas de comino", "1 cucharada de semillas de hinojo", "1 cucharada de semillas de alholva", "1 cucharada de semillas de nigella", "1 cucharada de semillas de mostaza negra", "1 cucharadita de aceite vegetal", "2 cucharaditas de mezcla de cinco especias (panchphoran)", "1 chile verde finamente picado", "1 cucharada de cilantro fresco, picado"], "serves": "Sirve 4-6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["En una sartén antiadherente ancha, caliente el aceite a fuego medio-alto y agregue las papas.", "Saltee las papas hasta que estén casi cocidas. Agregue la cúrcuma, el chile en polvo y la sal y fría hasta que estén cocidos.", "En una sartén pequeña y pequeña separada, caliente el aceite hasta que comience a humear. Mezcle los cinco ingredientes de la mezcla de especias y agregue dos cucharaditas a la sartén caliente. Las semillas crujirán y explotarán, así que ten cuidado al manipular la mezcla. Agregue los chiles verdes y el cilantro picado y revuelva por unos segundos. Vierta esta mezcla sobre las papas cocidas.", "Servir inmediatamente."]}, {"isVegetarian": false, "title": "Pollo de sal con guisantes, habas y mousseron", "url": "www_bbc_co_uk_food_recipes_altcrustchickenwithp_88912", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250 g / 9 oz de sal marina gruesa", "4 cucharadas de tomillo picado", "2 cucharadas de romero picado", "2 huevos de gallinas camperas", "50ml / 2fl oz de agua fría", "200g / 7oz pasta tipo '00' harina, más extra para quitar el polvo (disponible en la mayoría de los supermercados y tiendas de delicatessen)", "Pollo, piernas y alas de 1.6kg / 3lb 8oz de corral (retire las patas y las alas para usar en otra receta de su elección)", "1 ramita de romero", "1 ramita de tomillo", "½ limón", "½ cabeza de ajo", "pimienta negra recién molida", "10g / ½ oz de mantequilla", "10g / ½ oz de mantequilla", "1 chalote, finamente picado", "75g / 3oz de guisantes frescos, fuera de sus vainas", "75 g / 3 oz de habas frescas, fuera de sus vainas, membranas externas eliminadas", "50 g / 2 oz de champiñones mousseron, limpios", "Vino de Sauternes 110ml / 4fl oz", "50ml / 2fl oz de vinagre Chardonnay", "175ml / 6fl oz de caldo de pollo", "1 cucharada de crema", "sal y pimienta negra recién molida", "2 cucharadas de perifollo picado"], "serves": "Porciones 2", "time": {"preparation": "1-2 horas", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Para la corteza de sal, mezcle la sal, las hierbas, los huevos y el agua en un tazón.", "Agregue la harina y mezcle lentamente hasta que la masa esté firme y elástica. Envuelva la masa en una película adhesiva y déjela reposar en la nevera durante al menos una hora.", "Desenvuelva la masa y coloque sobre una superficie de trabajo grande, ligeramente enharinada. Extienda la masa a aproximadamente 0.5cm / ¼ de grosor, o hasta que sea lo suficientemente grande como para envolver al pollo (aproximadamente 30 cm / 12 pulgadas de diámetro).", "Para el pollo, precaliente el horno a 220C / 430F / Gas 8.", "Rellene la cavidad del pollo con el romero, el tomillo, el limón y el ajo y sazone la piel del pollo con pimienta negra recién molida.", "Coloque el pollo, con la pechuga hacia abajo, en el centro de la masa enrollada. Envuelva la masa alrededor del pollo para sellar completamente. Pellizque los bordes de la masa para sellar la costra.", "Voltee el pollo envuelto en masa y colóquelo en una bandeja para hornear, con la masa hacia abajo.", "Coloque en el horno para cocinar por 25 minutos. Retire del horno y deje reposar por otros 25 minutos.", "Mientras tanto, para hacer la salsa, caliente una sartén a fuego medio hasta que esté caliente. Agregue la mantequilla y la chalota y el sudor durante un minuto.", "Agregue los guisantes, las habas y las setas mousseron y cocine por 2-3 minutos.", "Agregue el vino de Sauternes y el vinagre de Chardonnay, aumente el fuego y cocine a fuego lento hasta que el líquido se reduzca en dos tercios.", "Agregue el caldo y cocine a fuego lento hasta que el líquido se reduzca a la mitad.", "Agregue la crème fraîche, sazone con sal y pimienta negra recién molida y agregue el perifollo.", "Cuando esté listo para servir, rompa la costra de sal y retire el pollo. Limpie el pollo con papel de cocina para eliminar el exceso de sal.", "Con un cuchillo afilado, retire ambos pechos del cadáver, teniendo cuidado de mantenerlos enteros y mantener la piel.", "Caliente una sartén a fuego medio hasta que esté caliente, agregue la mantequilla y fría las pechugas de pollo, con la piel hacia abajo, hasta que estén doradas y calientes.", "Para servir, cuchara el guisante, la salsa de habas y champiñones en forma pareja entre cada uno de los dos platos tibios. Cubra cada una con una pechuga de pollo y sirva."]}, {"isVegetarian": false, "title": "Alpine pizza", "url": "www_bbc_co_uk_food_recipes_alpine_pizza_32132", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/alpine_pizza_32132_16x9.jpg", "ingredients": ["500g / 1lb 2 oz de harina lisa fuerte, más extra para quitar el polvo", "2 cucharaditas de sal", "1 paquete de 7 g de levadura seca", "320ml / 11fl oz de agua tibia", "pan rallado seco o sémola, para quitar el polvo", "Queso gruyere 80g / 3oz, rallado", "250 g / 9 oz de crema fresca", "sal y pimienta negra recién molida", "1 cebolla roja grande, finamente cortada", "Salami 140g / 5oz, cortado en tiras", "hojas de mejorana, para terminar"], "serves": "Hace 2 pizzas grandes", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 70, "preparationMins": 60}, "recommendations": 0, "method": ["Para la masa de pizza, combine la harina, la sal y la levadura en un tazón grande. Poco a poco agregue el agua, mezcle bien con sus manos para obtener una masa. Si encuentra que la masa es demasiado pegajosa, simplemente agregue un poco más de harina. Forma una pelota, cúbrela con un paño y déjala descansar durante cinco minutos.", "Amase la masa por unos 10 minutos y divídala por la mitad. Espolvoree un poco de harina sobre un paño de cocina limpio y coloque los pedazos de masa sobre él. Cubra con un paño ligeramente húmedo y deje que se levante durante al menos 30 minutos en un lugar cálido.", "Precalentar el horno a 240C / 475F / Gas 9.", "Mientras tanto, para el aderezo, combine el gruyère y la crème fraîche en un bol, agregando un poco de sal y pimienta al gusto. Dejar de lado.", "Una vez que la masa ha subido, rocíe un poco de harina en una superficie de trabajo limpia y distribuya una bola de masa en un círculo de unos 30 cm de diámetro, haciéndolo lo más delgado posible (sin romperlo), con el borde ligeramente más grueso. Repita con la otra bola de masa. Espolvoree dos bandejas planas para hornear con pan rallado o sémola y coloque las bases para pizza sobre ellas.", "Extiende la mezcla de crème fraîche sobre cada base. Cubra con las cebollas y el salami. Hornee en el horno caliente por 10 minutos. Retirar del horno, espolvorear con la mejorana y servir."]}, {"isVegetarian": false, "title": "Peces y patatas fritas alternativos", "url": "www_bbc_co_uk_food_recipes_alternativefishandch_86394", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g / 8oz de patatas harinas, por ejemplo, Maris Piper", "aceite vegetal, para freír", "sal", "2 huevos de gallinas camperas, separados", "200g / 7oz de harina natural, más extra para dragado", "1 cucharada de coco desecado", "200 ml / 7 fl oz de agua helada (más o menos si es necesario)", "1 cucharada de estragón fresco picado", "1 cucharada de menta fresca picada", "4 x 150 g / 5 oz de bacalao", "sal y pimienta negra recién molida", "1 limón, solo jugo", "Mayonesa 150 g / 5 oz", "1 cucharada de alcaparras, enjuagadas y escurridas", "1 cucharada de pepinillos pequeños, enjuagados y escurridos", "1 cucharada de salsa de rábano picante de un tarro", "1 cucharada de perejil fresco picado", "sal y pimienta negra recién molida"], "serves": "Para 4 personas", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Para las virutas, pele las papas fritas, luego corte en una mandolina en su posición más delgada, o corte a mano muy fino.", "Coloque las rodajas de papa en agua fría y déjelas durante 30 minutos (esto romperá el almidón y ayudará a que se cocinen durante la cocción).", "Caliente el aceite en una sartén profunda de fondo grueso hasta que la miga de pan chisporrotee y se ponga marrón cuando se la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Seque las rodajas de patata con papel de cocina y agregue el aceite caliente en lotes para freír durante 2-3 minutos, o hasta que estén crujientes y doradas.", "Con cuidado, retire las virutas cocidas del aceite con una cuchara ranurada, escurrir sobre papel de cocina y espolvorear con un poco de sal.", "Para el pescado, haga un batido batiendo las claras de huevo en un bol hasta que se formen picos rígidos cuando se quite el batidor.", "Batir las yemas de huevo y la harina para combinar, luego agregar el agua, el coco y las hierbas picadas.", "Agregue las claras de huevo batidas y doble suavemente en la masa.", "Sazonar los filetes de bacaladilla con sal y pimienta negra recién molida y agregar un chorrito de jugo de limón a cada uno.", "Seca la merluza en harina, sacudiendo cualquier exceso, luego sumerge los filetes enharinados en la masa para cubrir completamente.", "Coloque con cuidado los filetes de bacata maltratados en el aceite caliente y fríalos durante ocho minutos, o hasta que estén crujientes, dorados y bien cocidos.", "Para la salsa tártara, mezcle la mayonesa, las alcaparras, los pepinillos, la salsa de rábano picante y el perejil en un tazón limpio, luego condimente, al gusto, con sal y pimienta negra recién molida.", "Para servir, coloque un trozo de pescado rebozado en cada uno de los cuatro platos. Coloque una cucharada grande de patatas al lado y una cucharada de salsa tártara al lado."]}, {"isVegetarian": true, "title": "Galletas Amaretti", "url": "www_bbc_co_uk_food_recipes_amaretti_biscuits_77302", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 claras de huevo de rango medio", "1 cucharadita de esencia de almendra", "550g / 1lb 4oz de azúcar glasé, más extra para quitar el polvo", "pizca de sal", "550 g / 1 libra de almendras molidas 4 oz", "almendras copos puñado"], "serves": "Hace 50", "time": {"preparation": "1-2 horas", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Coloque las claras de huevo, esencia de almendras, azúcar glas, sal y almendras molidas en un procesador de alimentos y mezcle hasta obtener una pasta homogénea.", "Espolvorea una superficie de trabajo limpia con azúcar glas, gira la mezcla y enrolla en forma de salchicha. Envuelva con film transparente y colóquelo en la nevera durante 1 hora.", "Precaliente el horno a 130C / 150C Fan / Gas 1 y línea 2 bandejas para hornear con papel de hornear.", "Cuando esté listo para hornear, corte en rodajas de 2 cm / 1 in y enrolle cada una en una bola. Coloque sobre las bandejas forradas para hornear a unos 2cm / 1in de distancia y espolvoree unas almendras en copos sobre la parte superior de cada una.", "Hornee en lotes durante 20-25 minutos o hasta que estén ligeramente dorados."]}, {"isVegetarian": true, "title": "Galletas Amaretti", "url": "www_bbc_co_uk_food_recipes_amarettibiscuits_85527", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 claras de huevo de gallinas camperas", "50 g / 1¾oz de almendras enteras, aproximadamente picadas", "1 cucharada de azúcar glas, más extra para quitar el polvo", "1 naranja, solo ralladura"], "serves": "Hace 8 galletas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Coloque las claras de huevo en un tazón grande y limpio y bata hasta que se formen picos rígidos cuando se quite el batidor.", "Doble suavemente las almendras y el azúcar glas en las claras de huevo.", "Coloque cucharadas pequeñas de la mezcla en una bandeja para hornear antiadherente. Transfiera al horno y hornee durante 8-10 minutos, o hasta que estén doradas.", "Retire del horno y deje enfriar sobre la bandeja para hornear.", "Para servir, coloque las galletas amaretti en un plato para servir y espolvoree sobre la ralladura de naranja rallada y el azúcar glasé."]}, {"isVegetarian": true, "title": "Galletas Amaretti", "url": "www_bbc_co_uk_food_recipes_amarettibistcuits_67183", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/amarettibistcuits_67183_16x9.jpg", "ingredients": ["4 huevos, solo blancos (160g / 6oz)", "Azúcar en polvo 340g / 12oz", "340gr / 12 oz de almendras molidas", "Licor de amaretto 30ml / 1fl oz", "mantequilla, para engrasar"], "serves": "Rinde aproximadamente 20 galletas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 170 C / 325 F / Gas 3.", "En un tazón grande bata las claras de huevo hasta que estén firmes.", "Mezcla suavemente el azúcar y las almendras.", "Agregue el licor de amaretto y dóblelo suavemente hasta que tenga una pasta suave.", "Coloque un poco de papel de hornear en una bandeja para hornear y cepille ligeramente con mantequilla.", "Con una cucharilla coloque pequeños montones de la mezcla aproximadamente a 2 cm / ¾ in de distancia, ya que se expandirán durante la cocción.", "Hornee durante aproximadamente 15 minutos hasta que estén doradas. Dejar enfriar un poco y servir o almacenar en un recipiente hermético."]}, {"isVegetarian": true, "title": "Peras rellenas de Amaretti con vino tinto y salsa de vainilla", "url": "www_bbc_co_uk_food_recipes_amarettistuffedpearw_85489", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 pera, cortada a la mitad a lo largo, sin núcleo", "5 cucharadas de galletas amaretti machacadas", "1 cucharada de ron blanco", "1 yema de huevo de gallinas camperas", "2 cucharadas de vino tinto", "150ml / ¼ de pinta de vino tinto", "1 vaina de vainilla, partido, semillas raspadas", "azúcar glas, al polvo", "Yogur de estilo griego"], "serves": "Porciones 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para las peras rellenas, coloque las mitades de pera con el lado de corte hacia arriba en una bandeja para hornear antiadherente.", "Coloque las galletas amaretti trituradas, el ron y la yema de huevo en un tazón pequeño y mezcle bien. Use esta mezcla para llenar las cavidades de las mitades de pera, luego rocíe sobre el vino tinto.", "Transfiera al horno y hornee durante 8-10 minutos, o hasta que las peras se ablanden.", "Para la salsa de vino tinto, coloque el vino tinto en una olla pequeña y deje que hierva. Reduzca el fuego, agregue la vaina de vainilla y las semillas y cocine a fuego lento durante 10-12 minutos, o hasta que el vino se haya reducido a la mitad. Retire la vaina de vainilla.", "Para servir, coloque las peras en platos y vierta sobre la salsa de vino tinto. Polvo con azúcar glas y servir con una cucharada de yogur griego."]}, {"isVegetarian": true, "title": "Tiramisú de Amaretti", "url": "www_bbc_co_uk_food_recipes_amarettitiramisu_84954", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200ml / 7fl oz de café negro fuerte", "½ brandy miniatura", "6 galletas amaretti", "150ml / 5fl oz de crema doble, batida", "50g / 1¾oz de chocolate rallado", "50g / 1¾oz de cerezas enlatadas, escurridas, sin piedras", "1 cucharada de cacao en polvo, para quitar el polvo", "Leche 250ml / 9fl oz", "75g / 2¾oz de chocolate negro, picado", "2 cucharadas de azúcar glas", "½ naranja, pelada, rebanada"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Coloque el café y el brandy en un recipiente y mezcle.", "Sumerja los bizcochos en la mezcla, luego coloque la mitad de ellos en la base de un vaso de postre.", "Coloque la crema batida en un tazón con el chocolate rallado y las cerezas y revuelva para mezclar.", "Vierta la mitad de la mezcla de crema en los bizcochos, luego repita para hacer una segunda capa de bizcochos seguida de una capa final de crema. Polvo con cacao en polvo.", "Para la salsa de chocolate, caliente la leche en una cacerola, agregue el chocolate y cocine a fuego lento hasta que el chocolate se derrita. Agregue el azúcar glas.", "Para servir, vierta un poco de salsa de chocolate sobre el tiramisú y cubra con las rodajas de naranja."]}, {"isVegetarian": true, "title": "Crema de vainilla Amaretto", "url": "www_bbc_co_uk_food_recipes_amarettovanillacusta_70907", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100ml / 3½ fl oz de leche", "Crema doble de 200 ml / 7 fl oz", "1 vaina de vainilla", "3 yemas de huevo", "Azúcar en polvo de 55 g / 2 oz", "1 cucharada de amaretto, calentado"], "serves": "Sirve 4-6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["En una cacerola de base pesada calienta la leche, la crema doble y la vaina de vainilla.", "Mientras tanto, mezcle las yemas y el azúcar en polvo hasta que estén bien mezclados. Batir en el amaretto caliente.", "Vierta la mitad de la mezcla de leche caliente en la mezcla de huevo, batiendo mientras lo hace hasta que esté bien mezclado.", "Vierta la mezcla de huevo en la cacerola y mezcle con la leche caliente restante.", "A fuego muy lento, cocine la mezcla revolviendo hasta que se espese en una crema suave, teniendo cuidado de que la mezcla no cuaje. Servir."]}, {"isVegetarian": true, "title": "Increíbles tartas de manzana", "url": "www_bbc_co_uk_food_recipes_amazingappletarts_8612", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg / 2¼lb comiendo manzanas, peladas, sin corazón y en rodajas", "½ cucharadita de canela", "buena pizca de especias mixtas", "1 paquete de hojaldre", "limón", "1 huevo", "4 cucharadas de miel clara", "30g / 1oz de mantequilla derretida", "3 cucharadas de azúcar en polvo"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Incline la mitad de las manzanas en una sartén con canela y especias mezcladas, agregue un poco de jugo de limón. Cocine durante 10-15 minutos a fuego medio hasta que las manzanas estén suaves, revolviendo para asegurarse de que las manzanas no se peguen a la sartén (agregue un chorrito de agua, sidra o jugo de manzana si es necesario). Agregue azúcar al gusto si cree que es necesario.", "Estirar la masa para formar un cuadrado y cortar en cuartos. Marque un cuadro de 1 cm / ½ pulgadas alrededor de cada pieza y acople el centro en varios lugares con la punta de un cuchillo afilado. Extienda una cucharada del puré en el centro de cada cuadrado, teniendo cuidado de no pasar por los bordes del marco, ya que esto evitará que la masa se levante correctamente. Cubra con las rodajas de manzana restantes.", "Cepille el marco con huevo batido y rocíe las manzanas con miel, mantequilla y azúcar.", "Hornee a 190C / 375F / Gas 5 por 12-15 minutos hasta que las tartas estén crujientes y caramelizadas."]}, {"isVegetarian": true, "title": "Muffins de desayuno", "url": "www_bbc_co_uk_food_recipes_american-style_breakfast_66044", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/american-style_breakfast_66044_16x9.jpg", "ingredients": ["300g / 10½ oz de harina de auto crianza, tamizada", "1 cucharadita de polvo de hornear", "pizca de sal", "1 cucharadita de canela molida", "150g / 5½oz de azúcar moreno claro", "250ml / 9fl oz de leche entera", "2 huevos de gallinas camperas, golpeados", "100 g / 3½ oz de mantequilla, derretida", "100 g / 3½ oz tostadas, avellanas peladas, picadas", "25 g / 1 oz de cerezas secas", "25 g / 1 oz de arándanos secos", "Granola crujiente de 75 g / 2½ oz"], "serves": "Hace 12", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4 y alinee una bandeja para muffins con cajas de muffin de papel.", "En un tazón grande, tamice la harina, el polvo de hornear, la sal y la canela y luego agregue el azúcar. En otro recipiente, mezcle la leche, los huevos y la mantequilla derretida, luego vierta los ingredientes secos y mezcle rápidamente. Agregue las avellanas, las cerezas secas y los arándanos secos.", "Divida la mezcla entre las 12 cajas de muffins y espolvoree la parte superior de cada una con la granola.", "Hornee durante 20-25 minutos, o hasta que un pincho insertado en el medio de los muffins salga limpio. Deje que se enfríe durante cinco minutos en la lata antes de servirlo caliente o a temperatura ambiente."]}, {"isVegetarian": false, "title": "Panqueques de estilo americano con salchicha", "url": "www_bbc_co_uk_food_recipes_american_style_pancakes_03212", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g / 1lb 2oz de carne de salchicha", "Harina de auto aumento de 450g / 1lb", "1 cucharadita de polvo de hornear", "pizca de sal", "600ml / 20fl oz de suero de leche", "3 huevos grandes de gallinas camperas, separados", "50g / 1¾oz de mantequilla, derretida, más extra para freír", "jarabe de arce, para servir"], "serves": "Hace panqueques de 8 x 20 cm / 8 in", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Coloque la carne de salchicha en una sartén grande y divídala con una espátula de madera o una cuchara. Fría la carne, revuelva regularmente y continúe rompiéndola, hasta que esté dorada y cocida. Si se ha derramado mucha grasa, colóquela sobre un trozo de papel de cocina; de lo contrario, déjela en la sartén, caliente, hasta que la necesite.", "Pon la harina en un tazón grande con el polvo de hornear y agrega una pizca de sal. Mezcle para combinar y elimine los grumos, luego haga un pozo en el medio y déjelo a un lado. Combine las yemas de huevo, la mantequilla derretida y el suero de leche. En un recipiente aparte, bata las claras de huevo hasta que se formen picos rígidos cuando se quite el batidor.", "Vierta la mezcla de suero de leche en la harina y mezcle hasta que esté bien combinado. Agregue una cucharada grande de claras de huevo y dóblelas con una cuchara grande de metal. Agregue el resto de las claras de huevo, tratando de preservar la mayor cantidad de aire en los blancos como sea posible. Deberías tener un batido esponjoso y burbujeante.", "Caliente una sartén (preferiblemente alrededor de 20 cm / 8 in) a fuego medio y frote sobre un poco de mantequilla. Vierta 1½ cucharadas de la mezcla en la sartén - debe extenderse a alrededor de 20 cm / 8 pulgadas de diámetro. Tome un par de cucharadas de la mezcla de salchicha y espolvoree sobre el panqueque. El panqueque se levantará alrededor de la carne de salchicha mientras se cocina. Cuando el panqueque se haya dorado en la parte inferior y esté lo suficientemente firme como para voltearse, voltéelo rápidamente y cocínelo por otro minuto en el otro lado. Repita con el resto de la mezcla y la carne de salchicha. Sirve con jarabe de arce."]}, {"isVegetarian": false, "title": "Panqueques de estilo americano con arándanos", "url": "www_bbc_co_uk_food_recipes_american_style_pancakes_94634", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/american_style_pancakes_94634_16x9.jpg", "ingredients": ["Harina de auto aumento de 450g / 1lb", "1 cucharadita de polvo de hornear", "½ cucharadita de canela molida (opcional)", "pequeña pizca de sal", "50g / 1¾oz de mantequilla, derretida, más una pequeña perilla para freír", "600ml / 20fl oz de suero de leche", "3 huevos grandes de gallinas camperas, separados", "1 cucharadita de extracto de vainilla, o semillas raspadas de 1 vaina de vainilla", "300 g / 10½ oz de arándanos, más extra para servir", "150 g / 5½ onzas de mantequilla, suavizadas", "pizca de canela molida", "4 cucharadas de jarabe de arce"], "serves": "Hace panqueques de 8 x 20 cm / 8 in", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Para los panqueques, ponga la harina, el polvo de hornear, la canela, si está usando, y la sal en un tazón grande, mezcle y haga un pozo en el centro. Ponga el suero de leche, las yemas de huevo, la mantequilla derretida y la vainilla en un tazón grande y bata. En un recipiente de vidrio limpio y separado, bata las claras de huevo hasta que se formen picos.", "Vierta la mezcla de suero de leche en el pozo en la mezcla de harina y bata. Agregue una cucharada grande de claras de huevo y dóblelas con una cuchara de metal para aflojar un poco la pasta. Agregue el resto de las claras de huevo, conservando la mayor cantidad de aire posible, hasta que tenga una masa esponjosa y burbujeante.", "Caliente una sartén de 20cm / 8in a fuego medio y frote sobre un poco de mantequilla. Vierta una cucharada y media de masa en la sartén. Espolvoree un gran puñado de arándanos sobre el panqueque; se levantará alrededor de ellos mientras se cocina. Cuando el panqueque se haya dorado en la parte inferior y esté lo suficientemente firme para voltearse (cocido más allá de la mitad), voltéelo rápidamente y cocínelo por otro minuto en el otro lado. Transfiere a un plato. Repita con el resto de la mezcla y los arándanos.", "Para la mantequilla de arce, ponga la mantequilla, la canela y una pizca de sal en un tazón. Batir con un batidor de mano hasta que esté blanco y esponjoso. Poco a poco mezcle el jarabe de arce hasta que esté todo incorporado y tenga una consistencia batida."]}, {"isVegetarian": true, "title": "Tarta de queso al horno estadounidense", "url": "www_bbc_co_uk_food_recipes_americanbakedcheesec_8358", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/americanbakedcheesec_8358_16x9.jpg", "ingredients": ["Esponja de 25cm / 10 pulgadas (cortada de una gran caja de flan comprado)", "200 g / 7 oz de azúcar en polvo", "ralladura finamente rallada de 3 limones", "4 cucharadas de harina de maíz", "3 cucharadas de sultanas, empapado en un poco de bourbon", "845 g / 29¾oz de queso crema con mucha grasa", "3 huevos medianos", "Esencia de vainilla de 7.5 ml / 1 ½ cucharadita", "1 vaina de vainilla", "Jack Daniels para probar o bourbon (opcional)", "375ml / 12½fl oz crema doble o simple", "10 plátanos pequeños", "25g / 1oz de mantequilla", "2 cucharadas de azúcar", "salsa de caramelo o jarabe de arce", "ramita de menta o albahaca"], "serves": "Sirve 10", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Unte con mantequilla una lata de torta suelta de 25 cm / 10 pulg.", "Corta la esponja horizontalmente en 2 discos. Use uno para alinear una lata de torta untada con mantequilla.", "En un tazón mezcle el azúcar, la ralladura de limón, la harina de maíz y las pasas con una cuchara de madera, luego bata en el queso crema. Agregue los huevos uno por uno, también agregue la esencia de vainilla, batiendo constantemente hasta que todos los huevos estén bien incorporados.", "Rebana la vaina de vainilla, quita las semillas con un cuchillo afilado y coloca las semillas en la mezcla de crema, agrega un chorrito de bourbon (aproximadamente 4 cucharadas), si lo usas, y mezcla todo bien. Agregue la crema y bata bien hasta que la mezcla esté suave. Vierta suavemente sobre la base de esponja en la lata de la torta.", "Siente la lata en una bandeja para hornear llena de 2-3 mm de agua tibia para ayudar a crear vapor durante la cocción. Coloque en el horno precalentado y hornee durante 50 minutos hasta que la parte superior esté dorada. Retire del horno y deje enfriar y fragüe por completo antes de sacarlo de la lata.", "Justo antes de servir, pele los plátanos y fríe en la mantequilla y el azúcar hasta que estén dorados y ligeramente caramelizados.", "Servir, cortar en trozos, con los plátanos y una llovizna de salsa de caramelo o jarabe de arce."]}, {"isVegetarian": true, "title": "Tarta de chocolate con rizo", "url": "www_bbc_co_uk_food_recipes_americanchocolaterip_6334", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/americanchocolaterip_6334_16x9.jpg", "ingredients": ["Galletas digestivas de chocolate liso de 100g / 4oz, aplastadas", "50g / 2oz de mantequilla, derretida", "150g / 5oz de chocolate puro, roto en pedazos", "700 g / 1½ lb de queso blando con mucha grasa", "225 g / 8 oz de azúcar en polvo", "½ cucharadita de esencia de vainilla", "2 huevos de tamaño 2"], "serves": "Sirve 8-10", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precaliente el horno a 160 ° C / 325 ° F / Gas 3. Engrase ligeramente una lata de torta suelta de 20 cm / 8 pulgadas o una lata de liberación de resorte.", "Mezcle los ingredientes para la base y presione en la lata preparada.", "Para rellenar el pastel de queso, derrita el chocolate en un recipiente sobre una fuente de agua caliente. Enfriar ligeramente", "Mida el queso en un tazón grande y bata hasta que esté suave. Agregue el azúcar y bata nuevamente hasta que esté bien mezclado. Batir la esencia de vainilla y luego los huevos, uno a la vez. Vierta la mitad de la mezcla de queso en la corteza de galletas, separando las cucharadas. Agregue el chocolate derretido a la mezcla de pastel de queso restante y mezcle bien para mezclar. Vierta esta mezcla entre la mezcla de pastel de queso que ya está en la lata. Gira la parte superior para darle un efecto marmoleado.", "Hornee la tarta de queso en el horno precalentado durante unos 30 minutos o hasta que la tarta de queso se abulte en los bordes, pero todavía muy suave en el centro. Apague el horno pero deje la torta de queso en el horno para que se enfríe.", "Enfriar bien y luego aflojar la tarta de queso de los lados de la lata con un pequeño cuchillo de paleta. Servir bien frío."]}, {"isVegetarian": false, "title": "Panqueques de suero de leche americanos sin gluten", "url": "www_bbc_co_uk_food_recipes_americanbuttermilkpa_74762", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/americanbuttermilkpa_74762_16x9.jpg", "ingredients": ["175ml / 6fl oz de suero de leche", "1 huevo, preferiblemente de campo abierto", "15 g / ½ onza de mantequilla, derretida", "Harina de tapioca 50g / 2oz", "Harina de maíz fina de 25g / 1oz", "buena pizca de sal", "1 cucharadita de bicarbonato de soda", "mantequilla clarificada", "mantequilla", "tocino crujiente", "miel de maple"], "serves": "Hace 14-15 x 7cm / 3in panqueques", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Mezcle el suero de leche, el huevo y la mantequilla derretida en un tazón grande, hasta que quede suave y mezclado. Tamice la harina de tapioca, la harina de maíz fina, la sal y el bicarbonato de soda y mezcle suavemente en el suero de leche solo hasta que los ingredientes estén humedecidos. No se preocupe por los grumos.", "Caliente una sartén de hierro o antiadherente hasta que esté medio caliente. Engrasar con un poco de mantequilla clarificada. Coloque una cucharada generosa de masa en la sartén y extienda un poco con la parte posterior de la cuchara.", "Cocine hasta que las burbujas suban y se rompan en la parte superior del panqueque. Voltea suavemente. Cocine hasta que dore pálido en el otro lado. Retire y mantenga caliente. Continúa hasta que se haya usado toda la masa.", "Extienda cada panqueque con mantequilla y sirva una pila de tres por persona con tocino crujiente y jarabe de arce."]}, {"isVegetarian": false, "title": "Panqueques de estilo americano con tocino y jarabe de arce", "url": "www_bbc_co_uk_food_recipes_americanpancakeswith_86498", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Harina normal 175g / 6oz", "1 cucharadita de polvo de hornear", "25 g / 1 oz de azúcar en polvo", "2 huevos de gallinas camperas, separados", "Leche 250ml / 9fl oz", "25g / 1oz de mantequilla", "12 lonchas de tocino curado con arce", "jarabe de arce, para servir"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Coloque la harina, el polvo de hornear y el azúcar impalpable en un tazón y revuelva para combinar.", "Agregue las yemas de huevo y la leche al tazón con los ingredientes secos y bata para hacer una mezcla suave.", "En un tazón limpio, bata las claras de huevo hasta que se formen picos suaves cuando se quite la batidora, luego dobla en la masa.", "Calentar una sartén grande hasta que esté caliente, agregar la mantequilla y calentar hasta que se derrita y espuma. Coloque los cucharones de la mezcla en la sartén y cocine durante 1-2 minutos, o hasta que las burbujas comiencen a formarse en la parte superior de la mezcla. Dé la vuelta a los panqueques con una espátula y cocínelos durante un minuto más en el otro lado. Retire de la sartén y mantenga caliente hasta que esté listo para servir. Repita el proceso con la masa restante.", "Mientras tanto, caliente una sartén hasta que esté caliente, agregue el tocino y cocine por dos minutos en cada lado, o hasta que esté crujiente. Retire de la sartén y escurra sobre papel de cocina.", "Para servir, divida los panqueques entre cuatro platos para servir, cubra con el tocino y rocíe con sirope de arce."]}, {"isVegetarian": true, "title": "Anardana chana (curry de granada y garbanzo)", "url": "www_bbc_co_uk_food_recipes_anardana_channa_chickpea_14037", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/anardana_channa_chickpea_14037_16x9.jpg", "ingredients": ["200 g / 7 oz de garbanzos secos, remojados en agua durante la noche", "100 g / 3½ oz chana dal, empapado en agua durante la noche", "2 cucharadas de aceite de girasol", "2 cebollas, más o menos picadas", "Jengibre fresco de la raíz 3cm / 1¼, finamente rallado", "1½ cucharadita de semillas de comino", "1 ramita de canela", "2 cardamomos negros, ligeramente aplastados", "2-3 dientes", "1 guindilla verde pequeña, finamente picada", "1 cucharadita de sal", "1½ cucharada de polvo de anardana (granada triturada), o 1 cucharada de melaza de granada", "1 cucharadita de sal masala", "50g / 1¾oz semillas de granada, para adornar", "puñado de cilantro, finamente picado, para adornar"], "serves": "Para 4 personas", "time": {"preparation": "durante la noche", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Escurra los garbanzos y colóquelos en una cacerola. Cubra con agua y lleve a ebullición. Reduzca el fuego y cocine a fuego lento durante 45 minutos o hasta que esté tierno. Escurrir y apartar.", "Mientras tanto, caliente el aceite en una cacerola de fondo grueso a fuego medio. Cuando esté caliente, agregue las cebollas y cocine durante unos minutos hasta que comience a ablandarse. Agregue el jengibre, las especias, el chile y la sal.", "Escurra el chana dal y agregue a la sartén con 400ml / 14fl de agua. Llevar a ebullición, luego cocine a fuego lento durante 35-40 minutos, o hasta que el dal esté tierno. Agregue un poco más de agua si es necesario.", "Agregue la anardana, el garam masala y los garbanzos, caliente y ajuste el aderezo.", "Para servir, elija las especias enteras si lo desea y decore con cilantro y semillas de granada."]}]