[{"ingredients": ["1 manojo de espárragos, recortado", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "1 diente de ajo, picado", "ramita de romero fresco", "ramita de tomillo fresco", "Hojaldre laminado en rectángulo de 10cm x 15cm / 4in x 6in", "100g / 3½oz de queso de cabra, desmenuzado"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Frote los espárragos con aceite de oliva y sazone con sal y pimienta negra recién molida.", "Caliente una sartén hasta que esté caliente, luego cocine los espárragos con el ajo y las hierbas hasta que estén completamente doradas. Retire de la sartén, deseche las ramitas de romero y tomillo y déjelas a un lado.", "Marca un borde de 1 cm / ½ pulgada alrededor del borde de la masa y pincha dentro del borde con un tenedor.", "Coloque la masa en una bandeja para hornear y hornéela en el horno durante cinco minutos, o hasta que la masa empiece a dorarse y esté ligeramente levantada.", "Coloque el queso de cabra en el centro de la masa y cubra con los espárragos a la plancha.", "Transfiera al horno y hornee por 12-15 minutos.", "Para servir, coloque en un plato de servir."], "url": "www_bbc_co_uk_food_recipes_griddledasparagusand_85686", "title": "Tarta de queso de cabra y espárragos cuajados", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Aceitunas negras 150g / 5oz, picadas", "1 cucharada de cebollín", "1 cucharada de hojas frescas de cilantro", "3 cucharadas de aceite de oliva", "puñado de hojas de albahaca fresca", "rociar aceite de oliva", "4 lanzas de espárragos blanqueadas en agua hirviendo", "sal y pimienta negra recién molida", "Filete de salmón 150 g / 5 oz"], "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Para hacer la pasta de aceitunas, coloque las aceitunas, el cebollino, el cilantro, el aceite de oliva y la albahaca en un procesador de alimentos y mezcle hasta que quede suave.", "Mientras tanto, para los espárragos, caliente el aceite en una sartén a prueba de horno hasta que fume. Agregue las lanzas de espárragos y chargrill durante 2-3 minutos. Sazonar, al gusto, con sal y pimienta negra recién molida. Sacar de la sartén y mantenga caliente.", "Para el salmón, coloque el filete de salmón en la sartén de la plancha caliente y cocine durante 1-2 minutos, hasta que se dore. Voltee el salmón y extiéndalo con la pasta de aceitunas. Transfiera el salmón al horno y tápelo durante 5-6 minutos, hasta que el salmón esté completamente cocido.", "Para servir, coloque las espárragos a la plancha en un plato y cubra con el salmón."], "url": "www_bbc_co_uk_food_recipes_griddledasparaguswit_80985", "title": "Espárragos cuajados con salmón frito y pasta de aceitunas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "½ chapata, rebanada por la mitad", "sal y pimienta negra recién molida, para sazonar", "100g / 3½oz de tocino rayado ahumado, cortado en cubitos", "1 diente de ajo, en rodajas finas", "½ cebolla, finamente picada", "1 hongo, picado en rodajas", "Crema doble de 100ml / 3½oz", "100 g / 3½ oz de queso Stilton, desmenuzado", "1 yema de huevo de gallinas camperas"], "method": ["Caliente una sartén hasta que fume.", "Rocíe el aceite de oliva sobre la chapata y condimente, al gusto, con sal y pimienta negra recién molida.", "Coloque la chapata en la bandeja de la plancha y cocine durante dos minutos en cada lado para crear líneas de parrilla.", "Calienta una sartén de tamaño mediano y agrega el tocino. Cocine por tres minutos y luego escurra la grasa.", "Regrese el tocino a la sartén, agregue el ajo, la cebolla y los champiñones y cocine por un minuto.", "Agregue la crema y Stilton y cocine para permitir que el Stilton se derrita en una salsa.", "Retire del fuego, agregue la yema de huevo y sazone, al gusto, con sal y pimienta negra recién molida.", "Para servir, coloque la chapata en un plato y vierta sobre el tocino grueso y la salsa de queso."], "url": "www_bbc_co_uk_food_recipes_griddledcarbonaracro_79474", "title": "Crostini de carbonara molido", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pechuga de pollo, cortada en 6 tiras y marinada con 1 diente de ajo picado, aceite de oliva y tomillo fresco picado", "1 yema de huevo", "1 limón, solo jugo", "1 anchoa", "salpicaduras de vinagre de sidra", "110g / 4oz Cornish yarg, desmenuzado", "aceite de oliva", "8 tomates cherry, cepillados con aceite de oliva, tomillo y adobo de ajo", "hojas mezcladas (p. ej. berro, rúcula, achicoria y pousse)", "perejil de hoja plana, picado"], "method": ["Chamusca las tiras de pollo en una sartén plancha. A continuación, freír los tomates cherry en los jugos. En un tazón, coloque el huevo, el jugo de limón, la anchoa, el hilo y el vinagre.", "Con una batidora de mano, agregue lentamente suficiente aceite de oliva para formar un aderezo grueso. Acumula las hojas, coloca el pollo encima, esparce los tomates cherry y vierte el aderezo. Adornar con el perejil."], "url": "www_bbc_co_uk_food_recipes_griddledchickenandth_70430", "title": "Ensalada de tomillo y pollo cuajada con aderezo de Cornish Corn", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 berenjenas medianas, cortadas longitudinalmente, en tiras de 1½ cm / ½ pulgada", "125ml / 4½fl oz de aceite vegetal, más extra para cepillar", "4 cebollas tiernas cortadas en diagonal", "3 chiles rojos, sin semillas, en rodajas finas", "4 cucharadas de salsa de ostras tailandesa", "1 cucharada de salsa de pescado (nam pla)", "2 cucharadas de hojas de cilantro", "Jengibre de raíz de 2.5 cm / 1 pulgada, pelado, cortado en finas tiras", "4 pechugas de pollo, con la piel puesta", "25g / 1oz de cebollas de primavera fritas"], "method": ["Precalentar el horno a 180C / 365F / Gas 4.", "Coloque las tiras de berenjena en un wok o sartén y cubra con agua fría.", "Llevar a ebullición, retirar del fuego, escurrir y dejar enfriar.", "Seque el wok o la sartén, coloque a fuego alto con aceite vegetal y agregue la berenjena fría.", "Asegúrate de que las piezas de berenjena estén bien planchadas, pero evita demasiada agitación ya que esto hará que quede blanda.", "Cocine por 5-6 minutos hasta que la berenjena esté bien dorada. Agregue las tres cuartas partes de las cebollas cortadas en rodajas y la mitad de los chiles.", "Vierta la mayor parte del aceite, luego vuelva al fuego y agregue la salsa de ostras y la salsa de pescado. Cocine por dos minutos y reserve.", "En un tazón pequeño mezcle los chiles restantes y las cebolletas en rodajas con las hojas de cilantro y el jengibre.", "Suavemente retire la piel de las pechugas de pollo y extienda la mezcla de hierbas uniformemente sobre la carne.", "Coloque la piel sobre la carne y cepille con un poco de aceite.", "Caliente una plancha o sartén hasta que fume y cocine los senos, con la piel hacia abajo, durante dos minutos.", "Gire y dore el otro lado durante dos minutos, luego retírelo de la bandeja y colóquelo en una bandeja para hornear.", "Asar en el horno durante 10-15 minutos, hasta que esté completamente cocido, retirar del horno y dejar reposar.", "Coloque un montículo de berenjena en cada plato y coloque un trozo de pollo encima. Espolvorear con cebollas de primavera fritas y servir."], "url": "www_bbc_co_uk_food_recipes_griddledchickenwiths_87181", "title": "Pollo a la parrilla con berenjena con especias marinas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100g / 3½oz de queso de cabra, cortado en dos discos iguales", "aceite de oliva", "pizca de copos de chile seco", "sal y pimienta negra recién molida", "dash aceite de oliva", "¼ de piña baby, finamente picada", "pizca de copos de chile seco", "1 cucharadita de vinagre balsámico", "1 cucharada de cilantro fresco picado", "hojas frescas de perejil de flatleaf, para adornar"], "method": ["Para el queso de cabra a la parrilla, rocíe las mitades de queso de cabra con aceite de oliva y espolvoree con hojuelas de chile, sal y pimienta negra recién molida.", "Caliente una sartén hasta que esté caliente, agregue el queso de cabra y la plancha hasta que el queso recién empiece a derretirse, pero aún conserva su forma. Retirar del fuego y mantener caliente.", "Para el aderezo, caliente el aceite de oliva en una sartén, agregue la piña picada y fría por 3-4 minutos. Agregue los copos de chile y el vinagre balsámico y fría por 1-2 minutos. Agregue el cilantro picado y revuelva bien.", "Para servir, coloque un montón de perejil de flatleaf en un plato de servir. Coloque el queso de cabra a la plancha encima y vierta sobre el aderezo."], "url": "www_bbc_co_uk_food_recipes_griddledchilligoatsc_88033", "title": "Queso de cabra en rodajas con salsa de piña y cilantro", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 bulbo de hinojo, cortado y cortado en rodajas de 1cm / ½", "1 cucharada de aceite de oliva", "150g / 5½oz de tomates cherry", "2 cucharadas de vinagre balsámico", "2 cucharadas de aceite de oliva", "1 diente de ajo, picado"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Ponga a hervir un recipiente de agua con sal.", "Para el hinojo a la parrilla, coloque las rodajas de hinojo en un cocedor de vapor o metal, colóquelo sobre el agua hirviendo y cúbralo con una tapa. Cocine al vapor durante 6-8 minutos, o hasta que el hinojo esté solo tierno.", "Caliente un recipiente a fuego medio a fuego lento, agregue el hinojo al vapor y cocine durante 3-4 minutos por cada lado, o hasta que se dore.", "Para el tomate caliente y el aderezo balsámico, coloque los tomates en una sartén pequeña, no reactiva, a prueba de horno a fuego medio. Agregue el vinagre balsámico, el aceite de oliva y el ajo, y caliente hasta que la mezcla empiece a chisporrotear. Transfiera al horno y cocine por 6-8 minutos.", "Para servir, coloque el hinojo a la plancha en un plato y espolvoree el tomate balsámico y el aderezo balsámico en la parte superior."], "url": "www_bbc_co_uk_food_recipes_griddledfennelwithah_89415", "title": "Hinojo enharinado con tomate caliente y aderezo balsámico", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 x 100 g / 3½ oz de filete de ternera", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "25 g / 1 oz de queso azul, desmenuzado", "1 cucharada de mantequilla, ablandada", "pequeñas hierbas frescas, tales como perifollo, cebollino, perejil y salvia, solo hojas, finamente picadas", "1 cucharadita de mostaza Dijon", "1 cucharadita de aceite de oliva", "botón de mantequilla", "¼ repollo savoy, toscamente picado", "1 hongos portobello, descuartizados"], "method": ["Para la carne a la parrilla, frote la carne con aceite de oliva y sazone con sal y pimienta negra recién molida.", "Caliente una sartén hasta que esté caliente y cocine la carne durante 3-4 minutos en cada lado, o hasta que esté cocida a su gusto. Aparta y deja descansar.", "Para la mantequilla de queso azul, coloque todos los ingredientes de mantequilla de queso azul en un tazón y mezcle aproximadamente con un tenedor hasta que se combinen.", "Para los champiñones y el repollo salteados, caliente el aceite y la mantequilla en una sartén y fríe con cuidado las piezas de repollo y champiñones durante 5-6 minutos, o hasta que estén tiernas.", "Para servir, coloque el repollo y los champiñones en un plato y cubra con la carne y una cucharada de la mantequilla de queso azul. Rocíe sobre cualquier jugo de carne de la sartén."], "url": "www_bbc_co_uk_food_recipes_griddledfilletofbeef_85373", "title": "Filete de ternera con mantequilla azul y champiñones salteados y repollo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 calabacín, cortado en tiras", "½ cucharadita de hojas frescas de tomillo", "2 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "4 rebanadas de halloumi", "2 rebanadas de chapata tostada"], "method": ["Mezcle el calabacín, las hojas de tomillo, el aceite de oliva y el aderezo en un tazón.", "Caliente una sartén hasta que esté caliente. Coloque la mezcla de calabacín en la sartén de la plancha y cocine durante 1-2 minutos.", "Agregue las rodajas de halloumi y continúe planchando durante 3-4 minutos, o hasta que aparezcan rayas doradas en la superficie del queso.", "Coloque la chapata tostada en un plato y coloque el halloumi a la plancha y el calabacín encima para servir."], "url": "www_bbc_co_uk_food_recipes_griddledhalloumi_79154", "title": "Halloumi cuajado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/griddledhalloumi_79154_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 x 200 g / 7 oz de chuleta de cordero", "2 dientes de ajo, finamente picados", "3 ramitas de tomillo fresco, solo hojas", "1 cucharada de aceite de oliva", "½ alcachofa de Jerusalén, pelada y cortada longitudinalmente en forma de chips", "1 tallo brócoli brotación púrpura, recortado", "1 cucharada de aceite de oliva", "cuña de limón, para adornar"], "method": ["Para la chuleta de cordero a la parrilla, coloque la chuleta de cordero en un bol con el ajo, el tomillo y el aceite y mezcle bien. Dejar macerar por unos minutos.", "Caliente una sartén a la plancha y cocine el cordero durante 4-5 minutos en cada lado, o hasta que esté cocido a su gusto. Reserve para descansar durante cinco minutos.", "Para las verduras a la parrilla, coloque las astillas de alcachofa y el brócoli en un tazón con aceite de oliva y revuelva bien para cubrir las verduras. Coloque las verduras en la sartén de la plancha y délas al carbón, volteándolas de vez en cuando, hasta que estén cocidas.", "Para servir, coloque la chuleta de cordero en un plato con las verduras a la plancha y una rodaja de limón."], "url": "www_bbc_co_uk_food_recipes_griddledlambchopwith_85243", "title": "Chuleta de cordero con ajo y tomillo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 pierna de filetes de cordero", "2 limones, cortados a la mitad y en jugo", "100ml / 3½fl oz de aceite de oliva", "3 ramitas de romero", "Condimento", "2-3 remolachas cocidas", "30g / 1¼ oz de cohete salvaje", "400 g / 14 oz de estaño de alubias, lavadas y escurridas", "2 naranjas, segmentadas y jugo reservado", "90ml / 6tbsp de aceite de oliva virgen", "1 cucharadita de mostaza Dijon", "una pizca de azúcar", "1 cucharada de cebollín, finamente picado"], "method": ["Para el adobo, mezcle las mitades de limón, el jugo de limón y el aceite de oliva en un tazón. Agregue el romero y sazone al gusto. Cubra los filetes de cordero en el adobo y déjelos en el tazón de 20 a 30 minutos.", "Caliente una sartén a la plancha y cocine el cordero durante aproximadamente 3 minutos en ambos lados.", "Mientras cocinas, corta la remolacha y coloca alrededor del borde de un plato para servir. Agregue las hojas y los frijoles del cohete y decore con los segmentos de color naranja.", "Para el aderezo, mezcle el aceite de oliva con el jugo de naranja restante en una jarra. Cuchara en la mostaza y el azúcar y revuelva bien.", "Coloque el cordero en el centro del plato, rocíe con el aderezo y cubra con cebollino."], "url": "www_bbc_co_uk_food_recipes_griddledlambwithbeet_11311", "title": "Cordero guisado con ensalada de remolacha y frijoles", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6x1cm / ½ en rebanadas de mango", "1 cucharada de azúcar glas", "600 ml / 1 litro de leche", "200g / 7oz de crema de coco", "3 yemas de huevo de gallinas camperas", "2 cucharadas de azúcar en polvo", "1 lima, ralladura solamente"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para preparar el mango, caliente una sartén hasta que fume. Espolvorea las rebanadas de mango con azúcar glas y la plancha durante 2 minutos por cada lado.", "Para hacer la crema pastelera, vierta la leche en una cacerola y agregue el coco batido. Permita que el coco batido se derrita. Escaldar el líquido y dejar enfriar durante 1 minuto.", "En un tazón grande, mezcle las yemas y el azúcar. Poco a poco vierta la mezcla de leche y coco, batiendo continuamente.", "Regrese la mezcla a la cacerola a fuego suave. Revuelva continuamente hasta que la mezcla sea lo suficientemente espesa como para cubrir la parte posterior de una cuchara de madera. Retirar del fuego y mezclar con la ralladura de lima.", "Para servir, vierta la crema en un recipiente tibio colocado en un plato grande y apile el mango a un lado."], "url": "www_bbc_co_uk_food_recipes_griddledmangowithcoc_80973", "title": "Mango con pepino y crema de coco", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 x 200 g / 7 oz de chuletas de cerdo, francés recortado", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "4 cucharadas de puré de tomate", "2 cucharadas de salsa de soja", "2 cucharadas de miel", "4 cucharadas de vinagre de vino tinto", "1 cucharada de aceite de oliva", "200 g / 7 oz de patatas Roosevelt, u otras papas para ensalada, peladas, par-hervidas y rebanadas", "200g / 7oz de cocción de chorizo, en rodajas gruesas", "125g / 4½oz de ajo silvestre", "125 g / 4½ oz de pimientos piquilllo, de una lata o tarro, finamente rebanados", "gran pizca ahumada pizca", "4 cucharadas de albahaca fresca finamente picada", "2 cucharadas de perejil fresco de flatleaf recién picado", "3 cucharadas de menta fresca finamente picada", "1 cucharada de alcaparras, enjuagadas y escurridas, más o menos picadas", "1 cucharadita de mostaza Dijon", "4 filetes de anchoa, toscamente picados", "½ limón, solo jugo", "½ diente de ajo, finamente picado", "200ml / 7fl oz de aceite de oliva virgen extra", "1 cestillo de berro de albahaca, para adornar"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Precalienta una sartén hasta que esté caliente.", "Para el cerdo, frote una cucharada de aceite de oliva sobre las chuletas de cerdo, y sazone con sal y pimienta negra recién molida.", "Coloque las chuletas en la plancha y cocine durante 1-2 minutos a cada lado, hasta que aparezcan marcas doradas a ambos lados.", "Mientras tanto, coloque todos los ingredientes del adobo en un tazón y bata para combinar. Coloque el adobo sobre las chuletas de cerdo y transfiéralo al horno durante 6-7 minutos, o hasta que esté completamente cocido.", "Para las papas, caliente una sartén hasta que esté caliente y agregue una cucharada de aceite. Agregue las papas hervidas y fría por 2-3 minutos, luego agregue el chorizo ​​y cocine durante 2-3 minutos más.", "Agregue el pimentón, los pimientos del piquillo y el ajo silvestre y cocine por un minuto.", "Para el aderezo, coloque todos los ingredientes del aderezo, excepto el berro de albahaca en un tazón y mezcle bien.", "Para servir, coloca las papas y el chorizo ​​en platos y coloca una chuleta de cerdo encima. Vierta el aderezo y adorne con unas hojas de berro de albahaca."], "url": "www_bbc_co_uk_food_recipes_griddledporkchopwith_86414", "title": "Chuleta de cerdo rellena con chorizo, ajo silvestre, patatas y aderezo de hierbas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pera cortada en cuartos, sin corazón y piel dejada en", "50g / 1¾oz de perejil fresco de flatleaf, picado", "50g / 1¾oz de perifollo fresco, picado", "50 g / 1¾oz de cebollín fresco, picado", "50g / 1¾oz de tomates cherry, picados", "100 g / 3½ oz de queso Stilton, desmenuzado", "sal y pimienta negra recién molida", "Hojas de espinaca baby 55g / 2oz", "3 cucharadas de aceite de oliva", "1 diente de ajo", "100 g / 3½ oz de piñones", "sal y pimienta negra recién molida"], "method": ["Caliente una sartén hasta que fume. Agregue los cuartos de pera y la plancha en ambos lados durante un minuto para crear líneas de parrilla, luego retírelos del fuego y déjelos a un lado.", "Para el pesto, coloque la espinaca, el aceite de oliva, el ajo y los piñones en un procesador de alimentos y mezcle. Sazonar, al gusto, con sal y pimienta negra recién molida y transferir a un tazón de servir.", "Para la ensalada, coloque el perejil, perifollo, cebollín y tomate en un tazón grande. Mezcle bien y rocíe con el pesto de espinacas.", "Sirva en un tazón con Stilton derrumbado y los cuartos de pera colocados alrededor."], "url": "www_bbc_co_uk_food_recipes_griddledpearandtomat_79475", "title": "Ensalada de pera y tomate cuajada con pesto de espinacas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite vegetal", "1 paquete de tortillas de harina de 15cm / 6in", "1 lata de frijoles refritos", "1 salchicha ahumada, picada", "Sabor a barbacoa", "1 aguacate maduro", "crema agria", "1 cucharada de jugo de limón", "400g / 14oz de queso rallado (cheddar, Monterey jack, mozzarella)", "1 tomate cherry en cilantro", "sal y pimienta", "ramitas de cilantro"], "method": ["Mash aguacate con jugo de limón, agregue 1 cucharada de crema agria y sazone al gusto.", "Caliente los frijoles con la salchicha y agregue el aroma de la barbacoa.", "Cepille dos tortillas con aceite y marque las tajadas en una sartén.", "Cubra una tortilla con los frijoles y el queso y agregue la mezcla de aguacate a la otra tortilla, presione los dos juntos.", "Cocine en horno precalentado 200C / 400F / Gas 6 durante aproximadamente 5 minutos, hasta que el queso se derrita y lo una.", "Dejar enfriar un poco y luego cortar en triángulos desde el centro como una pizza.", "Adorne con tomates cherry, una porción de crema agria y ramitas de cilantro.", "Sirva en pizarras o azulejos."], "url": "www_bbc_co_uk_food_recipes_griddledquesadillasw_10975", "title": "Quesadillas rellenas con frijoles BBQ y queso con salsa de tomate cherry y aguacate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 chuleta de cerdo", "½ manzana, sin corazón y picado", "Queso cheddar de 25 g / 1 oz, rallado", "25 g / 1oz de pasas", "3 cucharadas de hojas frescas de perejil", "1 cucharada de vinagre de vino blanco", "1 cucharada de aceite de oliva", "1 cucharadita de semillas de sésamo"], "method": ["Coloque la chuleta de cerdo en una sartén caliente durante 3-4 minutos por cada lado o hasta que esté bien cocida. Retire de la sartén y deje reposar durante cinco minutos.", "Mientras tanto, mezcle la manzana, el queso, las pasas y las hojas de perejil.", "Corte la carne de cerdo en rodajas y mezcle con la mezcla de manzana y queso.", "Vístase con el vinagre, el aceite de oliva y las semillas de sésamo y sirva."], "url": "www_bbc_co_uk_food_recipes_griddledporkwithappl_76790", "title": "Cerdo cuajado con ensalada de manzana", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 filetes de grupa de ternera de 4 x 200 g / 7oz", "3 cucharadas de aceite de oliva", "1 ramita de romero, solo hojas", "sal y pimienta negra recién molida", "150 g / 5 oz de champiñones frescos, limpios y cortados en rodajas gruesas", "3 dientes de ajo, triturados para pegar con un cuchillo", "75g / 3oz de mantequilla", "25 g / 1 oz de perejil flatleaf, picado grueso", "1 limón, solo jugo", "1 cabeza Castelfranco, solo hojas, rasgada (use otro radicchio si no hay ninguno disponible)", "1 lechuga de Batavia, hojas recogidas y rotas (utilice hojas de otro tipo de lechuga si no hay ninguna disponible)", "Achicoria de Treviso de 1 cabeza, solo hojas, desgarrada (use otra achicoria roja si no hay ninguna disponible)", "1 achicoria de cabeza, solo hojas, rasgado", "Mitades de nuez 75g / 3oz, ligeramente trituradas", "1 cucharada de vinagre de Jerez", "3 cucharadas de aceite de oliva"], "method": ["Para la ternera, caliente una sartén hasta que esté caliente. Cepille la ternera con la mitad del aceite de oliva y presione los trozos más pequeños de romero en la superficie de la ternera.", "Sazone con sal y pimienta negra recién molida y coloque la ternera directamente sobre la sartén de la plancha. Planche en ambos lados durante 1-2 minutos cada uno (para raros), o hasta que esté cocido a su gusto, luego retírelo y colóquelo en un plato tibio, tapado, para que descanse.", "Mientras tanto, caliente una sartén hasta que esté caliente, agregue el aceite de oliva restante y los champiñones. Freír durante 2-3 minutos hasta que se dore, luego sazone con un poco de sal y pimienta negra recién molida.", "Agregue el ajo triturado y la mantequilla a la sartén, reduzca el fuego y cocine por un minuto más. Agregue el perejil picado y el jugo de limón y revuelva para combinar. Pruebe nuevamente y ajuste el aderezo según sea necesario.", "Para la ensalada, mezcle las hojas de ensalada junto con las nueces en una ensaladera.", "En un tazón pequeño, mezcle el vinagre de jerez y el aceite de oliva. Vierta el aderezo sobre las hojas de la ensalada y mezcle bien.", "Para servir, corte la ternera en diagonal y colóquela en cuatro platos para servir. Coloque los champiñones en la parte superior y sirva la ensalada en el lado."], "url": "www_bbc_co_uk_food_recipes_griddledrosevealrump_90892", "title": "Ramillete de ternera rosada con ceps tostados y ensalada mixta de hojas y nueces", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 x 175 g / 6oz gruesos filetes de salmón, huesos de piel y alfiler extraídos", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "½ limón no encerado, solo jugo", "2 bulbos de hinojo, hojas externas eliminadas, cortadas por la mitad, finamente cortadas en una mandolina (hojas verdes reservadas)", "100g / 3½oz de piñones, ligeramente tostados en una sartén seca", "8 tomates mi-cuit, picados", "100g / 3½ oz de crema", "½ limón no encerado, solo jugo, más 1 limón no ceroso, solo cáscara", "1 chile, sin semillas, finamente picado", "3 ramitas de menta fresca, solo hojas, más o menos picadas", "100ml / 3½fl oz de aceite de oliva", "exprimir jugo de limón", "4 rodajas de limón, para servir"], "method": ["Para el salmón, caliente una sartén a fuego alto. Frote los filetes de salmón por todas partes con aceite de oliva y sazone en ambos lados con sal y pimienta negra recién molida.", "Cuando la sartén de la plancha esté caliente, agregue los filetes de salmón y ase a la parrilla durante 4-5 minutos, volteándolos una vez, o hasta que tengan marcas doradas pardas en ambos lados y estén recién cocidos.", "Transfiera los filetes de salmón a un plato caliente. Vierta sobre el jugo de limón y reserve para descansar.", "Para la ensalada, en un tazón grande, mezcle el hinojo cortado en rodajas, las hojas de hinojo, los piñones y los tomates mi-cuit hasta que estén bien combinados. Agregue la crème fraîche, el jugo de limón y la ralladura de limón y reserve.", "Para el aderezo de chile y menta, mezcle todos los ingredientes del ají y del aderezo de menta en un tazón hasta que estén bien combinados.", "Para servir, divida la ensalada de hinojo y piñones por igual entre cuatro platos para servir. Coloque un trozo de salmón a la plancha encima de cada uno. Rocíe el chili y el aderezo de menta y adorne con una rodaja de limón."], "url": "www_bbc_co_uk_food_recipes_griddledsalmonwithfe_91326", "title": "Salmón cuajado con ensalada de hinojo y piñones", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ filete de salmón, butterflied", "1 cucharada de aceite de oliva", "2 cebollas de primavera, en rodajas", "50g / 1 ¾oz de granos de maíz dulce", "½ tomate, sin semillas y picado", "puñado de migas de pan", "Crema doble 100ml / 3 ½ oz", "sal y pimienta negra recién molida"], "method": ["Caliente una sartén de plancha y cocine al salmón durante 1-2 minutos en cada lado.", "Caliente el aceite en una sartén y saltee suavemente las cebollas, el maíz dulce, el tomate y las migajas de pan durante 3-5 minutos.", "Agregue la crema y cocine durante 2-3 minutos más.", "Sazonar con sal y pimienta negra recién molida y servir con el salmón a la plancha."], "url": "www_bbc_co_uk_food_recipes_griddledsalmonwithgr_75890", "title": "Salmón grillado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pieza de salmón ahumado", "2 cucharaditas de aceite vegetal", "2 puñados de radicchio, rallado", "cuñas de limón, para servir"], "method": ["Caliente una sartén a fuego alto.", "Cepille el salmón ahumado con el aceite y ase a la parrilla durante 1-2 minutos en cada lado, o hasta que esté bien carbonizado.", "Servir encima de la radicchio con rodajas de limón."], "url": "www_bbc_co_uk_food_recipes_griddledsmokedsalmon_78254", "title": "Salmón ahumado en cuadritos en radicchio", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]