[{"isVegetarian": false, "title": "Lobster rolls", "url": "www_bbc_co_uk_food_recipes_lobster_rolls_14094", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tsp pickling spices", "½ tsp coriander seeds", "½ tsp peppercorns ", "250ml/9fl oz rice vinegar ", "2 tsp sugar", "2 sticks celery, thinly sliced", "1 cooked lobster, shell removed, chopped  into chunks ", "1 small sprig tarragon, finely chopped", "3 tbsp mayonnaise", "lemon juice, to taste", "salt and pepper, to taste", "2 brioche rolls ", "butter, to taste", "celery leaves, for garnish (optional)"], "serves": "Makes 2 rolls", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the pickling spices, coriander seeds and peppercorns in a muslin bag. ", "In a saucepan, heat the vinegar, sugar and the bag of spices.  Add the celery, bring to a simmer and remove from the heat. Leave the celery to cool.", "Mix the lobster, tarragon, mayonnaise and lemon juice together in a bowl. Remove the celery from the pickling ingredients and add it to the bowl. Mix together well and add salt and pepper to taste.", "Spread butter on the outer sides of the rolls and toast slightly with the blow-torch.", "Split the rolls down the centre and fill with the lobster mayonnaise. Dress with a few celery leaves and serve."]}, {"isVegetarian": false, "title": "Lobster salad with Thai crab and lobster cakes and sweet chilli sauce", "url": "www_bbc_co_uk_food_recipes_lobster_salad_with_thai_64088", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5oz fresh white crab meat", "75g/3oz cooked lobster meat", "75g/3oz cooked cold mashed potato", "1 red chilli, finely diced", "1cm /½in fresh ginger, finely grated", "1 lime, juice and zest only", "1 small bunch coriander, finely chopped", "salt and freshly ground black pepper", "75g/3oz plain flour", "2 free-range eggs, lightly beaten", "50g/2oz panko breadcrumbs", "2 red chillies, finely diced", "75g/3oz caster sugar", "75ml/3fl oz rice wine vinegar", "1 mango, peeled and finely diced", "½ vanilla pod, split and seeded", "1 lime, juice only", "salt and freshly ground black pepper", "75g/3oz butter", "4 large cooked lobster claws", "1 small handful frisée lettuce", "1 small handful lambs lettuce", "1 small handful watercress leaves", "2 tbsp coriander cress", "olive oil, for dressing"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the crab and lobster cakes, heat a deep fat fryer to 190C/375F. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Place the crab, lobster, potato, chilli, ginger and lime juice and zest into a bowl and mix thoroughly.", "Add the coriander and season with salt and black pepper.", "Using two small spoons, form quenelles from the mix, then carefully coat each quenelle in the flour, then the beaten egg and then coat in the breadcrumbs.", "Place gently into the fat fryer and fry until golden-brown and hot through – about two minutes. Remove with a slotted spoon and drain onto kitchen paper.", "For the sweet chilli sauce, place the chillies, sugar, vinegar and 25ml/1floz water into a saucepan and bring to a boil.", "Reduce the heat and simmer for five minutes, or until thickened.", "Place into a food blender and blend to a purée, then pass through a fine sieve and allow to cool.", "For the salad, place half of the mango, the vanilla seeds and lime juice into a small food processor and blend to a purée, and then pass through a fine sieve into a bowl.", "Check for seasoning, adding more lime, salt and black pepper, if needed.", "Heat a frying pan until medium hot, add the butter and heat until melted then add the lobster and warm through, flipping over half way through. Remove from the heat.", "Toss the rest of the mango with all the leaves in a bowl, dressing with a little olive oil, salt and black pepper.", "To serve, place a dollop of mango dressing onto each of four plates, then quickly spread it across the plate.", "Top with a little pile of salad and a lobster claw.", "Place a few crab and lobster cakes around the plate and then finish with several drops of sweet chilli sauce."]}, {"isVegetarian": false, "title": "Lobster Thai curry with butter basmati rice and coriander cress", "url": "www_bbc_co_uk_food_recipes_lobster_thai_curry_with_47060", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["10 long red chillies, seeds removed, finely chopped", "2 shallots, finely chopped", "2 garlic cloves, finely chopped", "2cm/¾in piece galangal, chopped (alternatively use root ginger)", "1 lemongrass stalk, finely chopped", "2 tbsp coriander roots", "2 kaffir lime leaves", "¼ tsp shrimp paste", "½ tsp ground cumin", "½ tsp ground coriander", "½ tsp paprika", "200ml/7fl oz coconut milk", "1 tbsp fish sauce", "1 tbsp tamarind paste", "1 lime, juice only", "1 tsp palm sugar", "2 cooked lobsters, meat removed", "2 tbsp coriander cress", "2 tbsp unsalted butter", "2 cloves", "1 cinnamon stick, broken in two", "250g/9oz basmati rice"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the paste, place all the ingredients into a small food processor and blend until smooth.", "For the lobster Thai curry, heat a wok, then add the paste and cook for 2-3 minutes.", "Add the lime leaves, shrimp paste , cumin, coriander and paprika. Cook for one minute.", "Add the coconut milk, fish sauce, tamarind, lime juice and palm sugar.", "Meanwhile remove the meat from the lobster and chop the meat, leaving the claw intact.", "Add the lobster to the wok and cook until the lobster is hot. Reduce the heat and let the curry simmer gently until ready to serve.", "Meanwhile for the butter basmati rice, heat a medium saucepan and add one tablespoon of butter.", "Once the butter has melted, add the cloves and cinnamon and cook for one minute. Add the rice and enough water to cover.", "Cover with a lid and turn the heat down to the lowest setting and cook for 20 minutes. Turn off the heat and leave the lid on until ready to serve.", "Just before serving stir the remaining butter though the rice.", "To serve, serve the rice in a serving bowl along with the lobster curry, topped with coriander cress."]}, {"isVegetarian": false, "title": "Lobster thermidor", "url": "www_bbc_co_uk_food_recipes_lobster_thermidor_16349", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1.5kg/3lb 5oz whole cooked lobster, cut in half lengthways, meat removed, shells cleaned and reserved", "50g/1¾oz butter", "2 shallots, finely chopped", "125ml/4fl oz white wine", "500ml/18fl oz fish stock", "250ml/9fl oz double cream", "1 tsp Dijon mustard", "100g/3½oz chanterelle mushrooms, cleaned", "2 tbsp roughly chopped flatleaf parsley", "squeeze lemon juice", "25g/1oz grated Parmesan", "2 free-range egg yolks", "25g/1oz fresh breadcrumbs", "4 King Edward potatoes, peeled and cut into matchsticks", "vegetable oil, for deep frying", "sea salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to its highest setting. Place the lobster shells onto a large baking tray and set aside.", "Heat half of the butter in a frying pan over a medium heat until foaming. Fry the shallots for 3-4 minutes, until softened.", "Pour in the wine and bring the mixture to the boil. Simmer until the volume of liquid has reduced by half, then add the stock and continue to simmer until reduced slightly. Add the double cream and mustard and simmer again for 3-4 minutes, until slightly thickened.", "Meanwhile, heat the remaining butter in a separate frying pan over a medium heat. Add the mushrooms and fry for 2-3 minutes, until just softened. Transfer to a bowl and season well with salt and pepper.", "When the sauce has reduced, add the mushrooms and lobster meat and stir through. Add the parsley, lemon juice and half of the Parmesan and season again.", "Whisk in the egg yolks and continue to cook the mixture  over a low heat for 1-2 minutes, until just thickened.", "Divide the lobster meat and sauce between the lobster shells, then sprinkle over the breadcrumbs and remaining Parmesan.", "Meanwhile, heat the vegetable oil in a deep-fat fryer to 190C. Alternatively, heat the oil in a heavy-based, deep-sided pan until a breadcrumb sizzles and turns golden-brown when dropped into it. (CAUTION: hot oil can be dangerous; do no leave unattended.)", "Carefully lower the chipped potatoes into the hot oil and fry for 4-6 minutes, or until tender and golden-brown. Remove and drain on kitchen paper.", "Meanwhile, grill the lobster thermidor for 3-4 minutes, or until the topping is crisp and golden-brown.", "Serve the lobster halves on plates with a pile of matchstick fries alongside."]}, {"isVegetarian": false, "title": "Lobster, tomato and basil spaghetti", "url": "www_bbc_co_uk_food_recipes_lobster_tomato_and_basil_97507", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 cooked lobsters", "75g/3oz butter", "1 onion, roughly chopped", "1 carrot, roughly chopped", "4 sprigs fresh thyme", "1 tbsp tomato purée", "75ml/3fl oz white wine", "500ml/18fl oz fish stock ", "salt and freshly ground black pepper", "400g/14oz spaghetti", "6 tbsp olive oil", "2 shallots, finely chopped", "2 garlic cloves, finely chopped", "4 tomatoes, peeled, de-seeded, diced", "salt and freshly ground black pepper", "3 tbsp chopped fresh basil, plus extra small leaves for garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the bisque, cut the cooked lobsters in half lengthways and remove the meat. Roughly chop the lobster meat, except the claw meat, into 2cm/¾in pieces. Reserve the claw meat and lobster shells, and keep everything in the fridge until needed.", "Heat half of the butter in a frying pan until foaming, add the onion, carrot and thyme and cook for 2-3 minutes, or until softened but not coloured.", "Add the reserved lobster shells and tomato purée and cook for a further minute, stirring well.", "Add the white wine and cook until reduced in volume by half.", "Add the fish stock, bring the mixture to the boil, then reduce the heat and simmer for 10 minutes, until the liquid has reduced and thickened a little.", "Take off the heat, and allow to cool slightly, then blend in batches in a food processor to a purée. ", "Strain the puréed bisque through a sieve into a clean saucepan and whisk in the remaining butter.", "Season, to taste, with salt and freshly ground black pepper. Keep warm.", "For the spaghetti, bring a large pan of salted water to the boil, add the spaghetti and cook according to the packet instructions.", "Drain the spaghetti, reserving a little of the cooking water, and set aside.", "Meanwhile, heat the olive oil in a frying pan and add the shallots and garlic and cook for two minutes.", "Add the chopped lobster meat and chopped tomato and heat through.", "Season with salt and freshly ground black pepper then add the basil, spaghetti, reserved cooking water and a couple of ladles of the bisque. Toss together. (Save the remaining lobster bisque for use in other dishes.)", "Heat a frying pan until hot, add the butter and reserved lobster claw meat and cook for 1-2 minutes on each side.", "To serve, pile the spaghetti into serving bowls and top with one lobster claw each and a few basil leaves."]}, {"isVegetarian": false, "title": "Lobster with escargot butter", "url": "www_bbc_co_uk_food_recipes_lobster_with_escargot_84055", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz soft butter", "2 tbsp rapeseed oil", "50g/2oz Parma ham, finely chopped", "100g/3½oz button mushrooms, finely chopped", "3 garlic cloves, finely chopped", "100g/3½oz shallots, finely chopped", "100g/3½oz fennel, finely chopped", "1 tbsp finely chopped fresh parsley", "1 tbsp finely chopped fresh tarragon", "1 tbsp Pommery mustard", "1 tbsp dried breadcrumbs", "1 cooked lobster coral", "2 tbsp ground almonds", "2 whole cooked lobster", "50g/2oz butter", "200g/7oz samphire "], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Place the butter into a food processor and blend until it is fluffy and white.", "Heat a large frying pan and add the oil. Once hot add the Parma ham, button mushrooms, garlic, shallots, fennel and herbs and cook for 2-3 minutes. Allow to cool. ", "Add the cooled mixture to the blended butter along with the mustard, breadcrumbs, cooked lobster coral and ground almonds. Mix thoroughly and roll in cling film into a log shape and place in the fridge.", "Blanch the lobster in salted water for 1½ minutes, then cut in half.", "Remove the meat from the claws, knuckles and tails, reserving the body shells in tact. Place the meat back into the half-shell and onto a baking tray.", "Unwrap the herb butter and slice into eight rounds. Place two slices of the butter on each half of lobster. Bake the lobsters in the oven for 4-5 minutes, until hot and bubbling.", "Meanwhile, for the samphire, heat a medium frying pan and add the butter. Once melted add the samphire and cook for a couple of minutes."]}, {"isVegetarian": false, "title": "Lobster with garlic butter, new potatoes and watercress salad", "url": "www_bbc_co_uk_food_recipes_lobster_with_garlic_36735", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp sea salt", "1 sprig thyme", "6 white peppercorns", "1 bay leaf", "1 lemon ", "4 x 450g/1lb live lobsters", "50g/1¾oz butter", "450g/1lb new potatoes", "salt and freshly ground black pepper", "1 tsp English mustard", "2 tbsp white wine vinegar", "4 tbsp olive oil", "4 tbsp vegetable oil", "4 little gem lettuce, washed and halved", "1 large bunch watercress, washed", "225g/8oz butter", "1 shallot, finely chopped", "4 garlic cloves, crushed", "12 cooked whelks, chopped into small dice", "6 tbsp parsley, chopped"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Put the lobsters in the freezer for two hours to put it into a torpid state. Bring a large pot of water to the boil. Add the salt, thyme, white peppercorns and bay leaf. Cut the lemon in half, squeeze the juice into the pan then add the halves of lemon too. ", "Push the tip of a large, sharp, heavy knife or skewer into the lobsters at the point where a cross forms in the shell on its back, then lower into the boiling water and bring back to the boil. Boil for five minutes, then remove the pan from the heat. Leave the lobsters in the water for another five minutes, then remove from the pan and set aside to cool.", "Gently cook the potatoes in boiling water for 10-15 minutes until tender. Drain and season with salt and pepper.", "Cut the lobsters in half lengthways. Take out the tail meat, cut in half lengthways again and remove the intestinal tract. Take off the claws, removing the meat, leaving the carcass whole and clean. ", "In a frying pan, melt the butter and gently warm through the lobster meat.", "For the garlic butter, melt the butter in a pan over a low heat. Gently fry the shallot and garlic without browning them, then add the whelk meat. When warmed through, add the parsley.", "To finish the salad, mix the mustard and vinegar together in a bowl, then whisk in the oils and season.", "Dress half of the little gems in the serving bowl. Shred the remaining lettuces, mix with the watercress and add to the serving bowl (do not dress until serving).", "When you are ready to serve, put the meat from the claws in the head space of the shells and the tail meat back in the shells.", "Put the lobsters onto plates. Put the potatoes in the middle of the plates, pour the garlic butter over the lobsters and serve with the dressed salad."]}, {"isVegetarian": false, "title": "Lobster with ginger and spring onions", "url": "www_bbc_co_uk_food_recipes_lobster_with_ginger_and_31721", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 x 225g/8oz lobsters", "2 tsp sesame oil", "2cm/1in fresh root ginger, peeled and finely chopped", "8 spring onions, trimmed and chopped", "4 pak choi, leaves separated", "4 tbsp soy sauce", "pinch white pepper ", "pinch caster sugar", "4 tbsp rice vinegar or Shoaxing rice wine ", "100ml/3½fl oz chicken stock  "], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Freeze the lobsters for 2 hours prior to cooking. Working quickly, take the first lobster, cut off the head using a sharp knife, then immediately cut the tail down the centre. Remove the flesh from the shell. Repeat with the second lobster. Cut each one into 6–8 pieces. Reserve and clean the shell for serving.", "Heat a wok or sauté pan over a high heat. Add half the sesame oil. Once hot, fry the lobster for 1 minute, then transfer it to a warm plate.", "Add the rest of the sesame oil to the pan. Fry the ginger, half the spring onions and the pak choi until softened. Return the lobster to the pan and stir in the remaining ingredients. Cover with a lid and simmer for 1 minute.", "Fill the shells with the meat. Divide between serving plates and garnish with the reserved spring onions."]}, {"isVegetarian": false, "title": "Lobster with lobster tortellini", "url": "www_bbc_co_uk_food_recipes_lobster_with_lobster_74162", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 500g/1lb 2oz lobster ", "150ml/5fl oz white wine, plus a splash", "300ml/11fl oz fish stock", "50g/2oz butter", "85g/3oz scallop meat", "1 free-range egg white", "80ml/3fl oz double cream", "100g/3½oz cooked lobster meat, diced", "pinch chopped fresh herbs ", "1 pack wanton wrappers", "2 free-range egg yolks", "knob of butter", "250g/9oz wild orach (you can use spinach)", "110ml/4fl oz double cream", "handful sea purslane "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the lobster in a large pan of boiling water for 3-4 minutes, then remove the lobster from the pot.", "Remove the claws and return them to the boiling water for an extra minute.", "Heat an ovenproof frying pan, add the lobster, lobster claws and white wine, cover with a circle of greaseproof paper and cook for 1-2 minutes.  Turn the lobster and lobster claws over, then cook for further 1-2 minutes.", "Remove the lobster from the pan and cut the tail into pieces, with the shell still on. Crack the claws and knuckles and remove the meat. Chop the lobster meat and set aside.", "Chop the head and reserved claw shells and return to the pan with the white wine. Add the fish stock, cover with a lid and simmer gently for 5-10 minutes.", "Strain the stock through a sieve, pressing the shells with a ladle to squeeze all the juices out. Return the stock to the heat and bring to a simmer.", "Continue to cook until the volume of the stock has reduced by three-quarters. Whisk in the butter, a splash of wine and season, to taste, with salt and freshly ground black pepper. Keep warm.", "For the lobster tortellini, blend the scallop meat with a good pinch of salt in a blender or food processor until smooth; then add the egg white and blend until smooth. Gradually blend in the cream. ", "Stir in the lobster meat and herbs and leave to chill in the fridge for 15 minutes.", "To make the tortellini, lay a wanton wrapper on a chopping board and place a teaspoon of the lobster mixture in the centre. Brush the edges with the beaten egg and fold over to form a triangle. ", "Cut out a semi-circle using a 10cm/4in round cutter. Wrap the edges of the semi-cirlce around your index finger and join together with a little more beaten egg.", "Repeat with the remaining mixture and wonton wrappers.", "To serve, heat three-quarters of the lobster sauce until boiling and cook the tortellini for 3-4 minutes, or until tender.  Remove with a slotted spoon and set aside, then add the reserved lobster tail pieces to the sauce and warm through.", "Meanwhile, heat the butter in a frying pan and fry the orach (or spinach) for 1-2 minutes, or until wilted. Remove the orach from the pan and set aside. Add the cream to the pan and continue to cook until reduced slightly. Chop the orach, stir it into the cream and season, to taste, with salt and freshly ground black pepper.", "Blend the remaining lobster sauce with a hand blender to create a foam.", "Place the lobster tail onto serving plates and spoon some orach alongside. Sit the tortellini on a small spoon alongside the orach, drizzle over some of the sauce and the foam and sprinkle over the sea purslane.     "]}, {"isVegetarian": false, "title": "Lobster and crab linguine", "url": "www_bbc_co_uk_food_recipes_lobsterandcrablingui_83673", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400g/14oz dried linguine pasta", "3 tbsp olive oil", "1 red onion, peeled and finely chopped", "1 x 415g/14½oz can of lobster bisque", "1 tbsp brandy or Pernod", "2 ripe tomatoes, seeds removed and finely chopped", "100ml/3½fl oz double cream", "sea salt and freshly ground black pepper ", "2 cloves garlic, chopped", "1 long red chilli, seeds removed and finely chopped ", "2 x 170g/6oz can white crab meat, drained and flaked", "2 tbsp chopped flatleaf parsley"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the pasta in boiling salted water according to packet instructions, or until just cooked through (al dente).", "While the pasta is cooking, heat one tablespoon of the olive oil in a saucepan.", "Add the onion and cook for about five minutes, until softened, but not browned.", "Pour in the bisque and brandy or Pernod and bring to the boil. Reduce the heat to simmer for 5-6 minutes, or until the liquid has reduced by a third.", "Add the tomatoes, cream and season with salt and pepper. Cook for 3-4 minutes, until the tomatoes have softened. ", "Meanwhile, heat the remaining two tablespoons of olive oil in a frying pan. Add the garlic and chilli and fry for 1-2 minutes, until softened.", "Add the crab meat and toss in the pan until it is heated through. Season with salt and freshly ground black pepper and add the parsley.", "Drain the pasta and add to the lobster sauce.", "To serve, divide the pasta and sauce between four plates or bowls and scatter the chilli crab mixture over the top of each one."]}, {"isVegetarian": false, "title": "Lobster and langoustine with champagne sauce, skinny fries and green beans", "url": "www_bbc_co_uk_food_recipes_lobsterandlangoustin_90597", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 x 750g/1½lb cooked lobsters", "16 langoustines, cooked and peeled", "150ml/10fl oz fish stock", "110ml/4fl oz double cream", "90ml/3½fl oz champagne", "40g/1½oz avruga caviar", "50g/2oz butter", "110g/4oz black trompette mushrooms, cleaned and torn into strips", "salt and freshly ground black pepper", "200g/7oz baby leaf spinach", "4 tbsp Japanese breadcrumbs (available from Asian grocers)", "20g/1oz Gruyère cheese, grated", "vegetable oil, for deep-frying", "2 large baking potatoes, peeled and sliced into ½cm strips", "salt and freshly ground black pepper ", "200g/7oz French beans, trimmed", "75g/3oz butter"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to high.", "For the lobster, slice the lobster in half and remove the meat from the claws and tail. Set aside with the langoustines. Remove any head matter and discard,  reserving the shells.", "Place the fish stock into a pan and bring to the boil. Cook for 10-15 minutes, or until the liquid is reduced by half, then add the cream and simmer for a further 10-15 minutes, or until reduced again by half. ", "Add the champagne and cook for 2-3 minutes, stirring well, then stir in the caviar, lobster and langoustines to heat through. ", "Meanwhile, melt half of the butter in a frying pan and add the mushrooms. Fry for 2-3 minutes, or until just softened. Season, to taste, with salt and freshly ground black pepper.", "Heat the remaining butter in a clean frying pan, then add the spinach and cook for 1-2 minutes, or until wilted. ", "Spoon a little spinach into the bottom of each lobster shell, followed by the mushrooms, finishing with the lobster and langoustine mixture. Sprinkle over the breadcrumbs and grated Gruyère. Place on a grill tray set under the grill and cook for 2-3 minutes, or until the topping is golden-brown and bubbling. ", "For the vegetables, heat a deep-fat fryer to 190C/375F. Alternatively, half-fill a deep, thick-based pan with the vegetable oil and heat until a cube of bread dropped in sizzles and turns golden-brown in 30 seconds (CAUTION: hot oil can be dangerous. Do not leave unattended).", "Fry the potato strips in the oil for 4-5 minutes, or until golden-brown and crisp. Remove with a slotted spoon and drain on kitchen paper, then season with salt. ", "Bring a saucepan of salted water to the boil, add the beans and cook for 3-4 minutes, or until tender. Drain, return to the pan and mix with the butter and season with salt and freshly ground black pepper.", "To serve, place the lobster halves on two serving plates, and place the fries and green beans alongside."]}, {"isVegetarian": false, "title": "Lobster, chilli and tomato linguine", "url": "www_bbc_co_uk_food_recipes_lobsterchilliandtoma_85708", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "2 garlic cloves, chopped", "1 green chilli, chopped", "200g/7oz baby plum tomatoes, halved", "1 tbsp chopped fresh flatleaf parsley ", "100ml/3½fl oz white wine", "1 cooked lobster tail, chopped", "1 tbsp chopped fresh chives", "salt and freshly ground black pepper ", "250g/9oz linguine, cooked according to packet instructions and drained", "lime wedges, to garnish"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a large pan, add the garlic and chilli and fry over a low heat for 1-2 minutes.", "Add the tomatoes, parsley and wine and simmer for 3-4 minutes. Add the lobster and cook for two minutes. Stir in the chives and season well with salt and freshly ground black pepper.", "Add the cooked linguine to the pan and stir to coat.", "To serve, place the linguine into two serving dishes and garnish with lime wedges."]}, {"isVegetarian": false, "title": "Lobster roll with Thousand Island dressing", "url": "www_bbc_co_uk_food_recipes_lobsterrollwiththous_86520", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 1kg/2lb 2oz native lobster  (Dorset blue if possible), cooked, flesh removed and broken into chunks", "2 large free-range egg yolks ", "1 tsp white wine vinegar", "½ tsp powdered mustard", "1 tsp salt ", "275ml/10fl oz rape seed oil ", "freshly ground black pepper, to taste", "2 tbsp tomato ketchup", "1 tsp Worcestershire sauce", "1 tbsp brandy", "¼ tsp cayenne pepper", "½ lemon, juice only", "1 red pepper, finely diced", "1 yellow pepper, finely diced", "2 tbsp chives, roughly chopped", "1 dill pickle, finely diced", "1 punnet mustard cress", "2 large brioche rolls"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["For the mayonnaise, place the egg yolks, vinegar, mustard and salt into a food processor.", "Blend to combine, then, with the motor still running, gradually add the rape seed oil. Continue until all the oil has been added and the mayonnaise has thickened.", "Season with black pepper and a little more salt if necessary, to taste.", "For the dressing, place the mayonnaise and all the other dressing ingredients into a bowl and mix to combine.", "Add the lobster and stir gently.", "To serve, split the rolls in half and spoon the lobster salad inside it. Top with mustard cress and serve."]}, {"isVegetarian": false, "title": "Lobster thermidor", "url": "www_bbc_co_uk_food_recipes_lobsterthermidor_73972", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lobsterthermidor_73972_16x9.jpg", "ingredients": ["1x750g/1½lb lobster, cooked", "20g/¾oz fresh parmesan, grated", "25g/1oz butter", "1 shallot, finely chopped", "275ml/10fl oz fish stock", "55ml/2fl oz white wine", "110ml/4fl oz double cream", "½ tsp English mustard", "2 tbsp chopped parsley", "½ lemon, juice only", "salt and freshly ground black pepper", "2 large floury potatoes, cut into 1.5cm/½in thick long chips", "vegetable oil, for deep-frying"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to a medium heat.", "Cut the lobster in half and remove the meat from the claws, tail and head. Set aside. Chop the meat into pieces and place back into the shell.", "To make the sauce, place the butter into a pan over a medium heat. Add the shallots and cook until softened. Pour in the stock, wine and double cream and bring to the boil. Reduce by half, stirring occationally. Add the mustard, herbs, lemon juice and season to taste.", "Spoon the sauce over the lobster meat. Sprinkle with Parmesan. Grill for 3–4 minutes until golden brown.", "To make the chips, heat the vegetable oil in a deep-fat fryer to 140C (CAUTION: Hot oil is very dangerous. Do not leave unattended). Carefully drop in the chips and cook for 5–6 minutes or until just tender, without colour. Remove using a metal slotted spoon. Turn the heat to 190C. Place the chips back into the hot oil and fry for 3–4 minutes or until golden and cooked through. Remove using a metal slotted spoon and drain on kitchen paper. Season to taste and serve alongside the lobster."]}, {"isVegetarian": false, "title": "Chicken breast with asparagus, broad beans, wild mushrooms and a Somerset cider brandy sauce", "url": "www_bbc_co_uk_food_recipes_localarkchickenbreas_81704", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz shallots, sliced ", "2 cloves garlic, peeled ", "200g/7oz unsalted butter", "5 sprigs thyme ", "1 bay leaf", "50ml/2fl oz Somerset cider brandy, or other similar cider brandy ", "500ml/17fl oz chicken stock", "50ml/2fl oz double cream ", "salt and freshly ground black pepper", "4 free-range chicken breasts, each 200g/7oz ", "salt and freshly ground black pepper", "12 asparagus tips", "100g/3½oz shelled broad beans ", "unsalted butter", "200g/7oz mixed wild mushrooms ", "200g/7oz baby spinach leaves"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["First make the sauce. Sweat the shallots and garlic in 25g/1oz of the butter, without colouring. Add the thyme and bay leaf and sweat for a further 2 minutes, then add the brandy and reduce until the liquid has almost disappeared. ", "Add the chicken stock and cook to reduce by half, then add the cream. Whisk in the remaining butter. Season with salt and freshly ground black pepper and set aside.", "For the chicken, season the chicken breasts with salt and freshly ground black pepper, then wrap them individually in cling film to help retain their shape. ", "Heat a saucepan of water until just boiling and poach the wrapped chicken breasts for 12-15 minutes or until cooked. Remove and leave to rest for 10 minutes.", "Cook the asparagus and broad beans separately in boiling salted water until tender; drain and refresh in iced water. Cut all the asparagus tips to the same length and peel the broad beans to remove their tough skins.", "Unwrap the chicken breasts. Heat a knob of butter in a frying pan, add the chicken and slowly colour the skin until golden and crisp. ", "Meanwhile, fry the mushrooms in a little butter with salt and freshly ground black pepper. Add the mushrooms to the sauce together with the asparagus and broad beans and reheat. Quickly fry the spinach with a little butter, salt and freshly ground black pepper, then drain on a tray lined with kitchen paper. ", "To serve, slice each chicken breast into five rounds and arrange around warm plates. Place the spinach in the middle. Add three asparagus tips to each plate, then spoon around the mushrooms and broad beans with some sauce."]}, {"isVegetarian": false, "title": "Lobster with cheese sauce", "url": "www_bbc_co_uk_food_recipes_lobsterwithcheesesau_83810", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["40g/1½oz butter ", "40g/1½oz plain flour ", "600ml/20fl oz/1 pint milk, warmed ", "110g/4oz Cheddar or Cheshire cheese, grated ", "1 tsp mustard  ", "pinch cayenne pepper ", "salt", "1 large cooked lobster"], "serves": "2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the butter in a saucepan over a low heat. Add the flour and stir until the mixture forms a smooth paste which leaves the sides of the pan cleanly. Cook for two to three minutes until the butter and flour make a floury ball.", "Remove from the heat and gradually add the milk, stirring constantly to avoid lumps. ", "Bring to the boil, still stirring, and simmer for about five minutes, stirring occasionally.", "When smooth and creamy, stir in the grated cheese a little at a time until melted. If the sauce is too thick, add a little extra milk. ", "Preheat the grill to hot.", "Add the mustard, cayenne pepper and salt to the cheese sauce.", "Cut the lobster horizontally down the middle. Place on a baking tray and liberally pour the cheese sauce over both halves. ", "Cook the lobster under the grill until the cheese is golden and bubbling."]}, {"isVegetarian": false, "title": "Pork loin with scrumpy sauce, candied walnuts and cabbage", "url": "www_bbc_co_uk_food_recipes_loin_of_pork_with_00990", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/loin_of_pork_with_00990_16x9.jpg", "ingredients": ["25g/1oz unsalted butter", "4 bramley apples, peeled and cut into chunks", "50g/1¾oz caster sugar", "200ml/7fl oz scrumpy cider", "100g/3½oz caster sugar", "100g/3½oz walnut halves", "rapeseed oil, for shallow frying", "200g/7oz black pudding", "50g/1¾oz plain flour", "2 free-range eggs, beaten", "50g/1¾oz panko breadcrumbs", "rapeseed oil, for deep frying", "1 kg/2lb 4oz bone-in pork loin, French trimmed, cut into four thick chops", "salt and freshly ground black pepper", "25g/1oz unsalted butter", "1 hispi cabbage, sliced thickly", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the apple scrumpy sauce, heat the butter in a saucepan. Add the apples, sugar and the scrumpy cider. Bring to a simmer over a gentle heat and cook until the apples are very soft. Add a little more cider or water if the mixture becomes too dry. Stir from time to time.", "Next make the candied walnuts. Make a syrup by heating the sugar with 100ml/3½fl oz water until the sugar is dissolved. Bring to the boil and add the walnut halves. Remove from the heat and set aside to cool.", "For the crisp black pudding, cut the pudding into 2½cm/1in chunks. Dust the pieces in flour, dip in the beaten egg and coat with panko breadcrumbs. Store in the fridge until ready to cook.", "For the pork, season the pork chops with salt and pepper. Heat a dry non-stick pan over a medium heat until hot. Place the chops in the pan to render down the fat (this needs to be done gently so that the fat becomes brown and crisp). Turn over and cook in the same way as before. When the pork is cooked (approximately 10 minutes), remove from the pan and set aside to rest in a warm place until ready to serve.", "For the candied walnuts, drain the walnuts and discard the syrup.", "In a deep frying pan or sauté pan, heat the rapeseed oil until hot. Shallow fry the walnuts until crisp (approximately 30 seconds), then drain on kitchen paper. Repeat the process with the black pudding. Set aside to drain on kitchen paper.", "For the cabbage, heat the butter with 50ml/2fl oz water to make an emulsion. Add the cabbage, cover with a lid and steam for 2-3 minutes. Season with salt and pepper.", "To serve, place a pork chop on each plate with a spoonful of apple sauce, some candied walnuts, crisp black pudding and hispi cabbage. Drizzle over any cooking juices from the pan the pork chops were cooked in."]}, {"isVegetarian": false, "title": "Loin of roe deer on brioche with chanterelles and elderberry jus", "url": "www_bbc_co_uk_food_recipes_loin_of_roe_deer_on_08600", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 loin of venison, sinew and skin removed", "2 tbsp olive oil", "50g/2oz butter", "500ml/18fl oz venison jus", "1 brioche loaf, sliced", "1 tbsp hazelnut oil", "1 shallot, finely chopped", "small handful chanterelle mushrooms", "2 sprigs fresh tarragon", "2 sprigs elderberries, berries removed", "salt and freshly ground black pepper"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Heat a heavy-based frying pan over a high heat and add the olive oil and butter. Add the venison to the pan and fry, turning regularly, until browned all over.", "Place the meat onto a trivet in a roasting tin and roast in the oven for about five minutes. Remove from the oven and set aside in a warm place to rest.", "Meanwhile, heat another frying pan over a medium heat, add the hazelnut oil followed by the finely chopped shallot and fry until the shallot is softened but not coloured. ", "Increase the heat (add a splash more hazelnut oil if necessary) and when the pan is hot, add in the chanterelles and tarragon and fry for 1-2 minutes.  Remove the pan from the heat, season with salt and freshly ground black pepper.", "Meanwhile, reheat the venison jus until piping hot, check the seasoning and add the elderberries. Toast the brioche slices.", "Place a slice of toasted brioche onto each plate, carve the venison and place onto the brioche. Spoon over the jus and then generously scatter over the chanterelles."]}, {"isVegetarian": false, "title": "Loin of venison in a sloe gin and blackberry glaze", "url": "www_bbc_co_uk_food_recipes_loin_of_venison_in_a_52978", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/loin_of_venison_in_a_52978_16x9.jpg", "ingredients": ["1 kg/2lb 2oz venison loin, fat trimmed ", "1 tbsp olive oil", "1 tsp dried thyme", "250g/9oz pancetta, thinly sliced", "1 tbsp vegetable oil", "2 tbsp sloe gin", "200ml/7fl oz reduced beef stock", "6 juniper berries, crushed", "200g/7oz blackberries", "knob of butter", "salt and freshly-ground black pepper"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Trim the venison of any remaining fat or sinew and wipe clean with kitchen paper or a clean tea towl. Rub with the olive oil, season with salt and freshly ground black pepper and rub in the dried thyme. Set aside.", "Lay the pancetta slices on a piece of cling film to make one long sheet of pancetta. Place the loin on one end of the pancetta sheet and roll up to wrap the loin. Remove the cling film.  ", "Heat the vegetable oil in an ovenproof frying pan. Sear the loin on all sides until the pancetta is turning golden-brown.", "Place the pan in the oven for 6-8 minutes, or until the venison is cooked, but still pink inside (alternatively cook for longer if you prefer your meat less pink). Remove the meat from the pan and set aside.", "Pour the sloe gin into the pan used for the venison and cook until most of the liquid has been absorbed. Add the beef stock and juniper berries and simmer for about 5 minutes until the volume of stock has reduced slightly.", "Strain the sauce and return it to the pan, then add the blackberries. Cook for about 4 minutes or until the blackberries are softened, then crush them slightly.  ", "Add the butter to the sauce and season with salt and freshly ground black pepper.  ", "Cut the loin into thick slices, discarding the beginning and end bits.  ", "Serve about 3 slices per person with the sloe and blackberry glaze.  "]}, {"isVegetarian": false, "title": "Loin of pork with braised artichokes and courgettes with thyme and lemon zest", "url": "www_bbc_co_uk_food_recipes_loinofporkwithbraise_89306", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["180g/6oz organic pork loin, trimmed", "1 lemon, zest only", "1 small bunch fresh thyme, leaves only, chopped", "salt and freshly ground black pepper", "3 tbsp extra virgin olive oil, plus extra for drizzling", "3 small violet artichokes, quartered", "3 small courgettes", "1 garlic clove, finely chopped", "1 punnet micro cress (you can substitute normal cress)"], "serves": "Serves 1-2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cut the pork loin into four equal-sized pieces. Lay the pieces between two pieces of cling film and bash with a meat mallet or rolling pin until very thin. ", "Lay the flattened pork pieces onto a plate and sprinkle with half of the lemon zest and half of the chopped thyme. Season well with salt and freshly ground black pepper.", "Heat two tablespoons of the olive oil in a frying pan over a low heat. Add the artichoke quarters and fry, turning occasionally.", "Chop the courgettes to the same size as the artichoke pieces and add to the pan when the artichokes are just beginning to become golden-brown and tender. ", "Add the garlic and the remaining lemon zest, thyme leaves and a splash of water. Stir gently and add one more tablespoon of the olive oil. Season, to taste, with salt and freshly ground black pepper. Remove from the heat and set aside in a warm place.", "Meanwhile, heat a griddle pan until smoking. Add the flattened pieces of pork loin (you may have to do these in batches). Cook for 1-2 minutes on each side, or until golden-brown griddle marks are formed on both sides and the pork is cooked through.", "To serve, place a piece of pork loin onto a serving plate and arrange some of the artichokes and courgettes on top. Place another pork piece over the top, then add another layer of vegetables. Repeat this layering until all of the pork pieces are used up. Snip some micro cress around the plate and finish with a drizzle of olive oil."]}, {"isVegetarian": false, "title": "Loin of venison en croute with buttered Savoy cabbage", "url": "www_bbc_co_uk_food_recipes_loinofvenisonencrout_92734", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 fennel bulb, roughly chopped", "250g/9oz field mushrooms, roughly chopped", "1 onion, peeled, roughly chopped", "50g/2oz butter", "salt and freshly ground black pepper ", "150ml/5fl oz double cream", "110g/4oz plain flour", "½ tsp sugar", "salt and freshly ground black pepper ", "350ml/12¼fl oz full-fat milk", "1 free-range egg, beaten", "1 tbsp butter, melted", "3 tbsp chopped fresh parsley", "3 tbsp vegetable oil", "25g/1oz butter", "450g/16oz loin of venison, trimmed", "275g/9¾oz ready-made puff pastry", "flour, for dusting", "1 free-range egg, beaten", "1 Savoy cabbage", "50g/2oz butter", "1 tbsp chopped fresh sage", "500ml/17fl oz beef stock, simmered in a pan until the volume of liquid has reduced to 100ml/3½fl oz, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the fennel and mushroom duxelles, blend the fennel, mushrooms and onion in a food processor to a paste.", "Heat a pan over a low to medium heat, then add the butter. When the butter is foaming, add the fennel and mushroom paste and cook until all of the moisture has evaporated from the paste. Season, to taste, with salt and freshly ground black pepper.", "Stir in the cream, then continue to cook the paste until heated through and well combined.", "For the parsley pancakes, sift the flour into a large glass bowl. Add the sugar. Season, to taste, with salt and freshly ground black pepper.", "Make a well in the centre of the flour and sugar mixture. Gradually add the milk and beaten egg, a little at a time, whisking well after each addition until all of the liquid has been incorporated into the batter before adding the next. ", "Cover the pancake batter with cling film, then chill in the fridge for 30 minutes.", "When the pancake batter has chilled, stir in the melted butter and chopped parsley.", "Heat one tablespoon of the oil in a frying pan over a high heat. When the oil is smoking, add a ladleful of the chilled pancake batter, then swirl the pan until it covers the bottom of the pan evenly. Fry for 30 seconds, then flip over and continue to cook for a further 30 seconds. Set aside on a plate and cover with a sheet of greaseproof paper. Keep warm.", "Repeat the process until all of the pancake batter has been used up (you should get three pancakes from this mixture). Separate each pancake with greaseproof paper and keep the pancakes warm.", "For the venison en croûte, line a baking tray with greaseproof paper.", "Heat a frying pan over a medium to high heat, then add the butter. When the butter is foaming, fry the venison loin on all sides until browned all over. Remove the venison loins from the pan and set aside to rest on a plate.", "Roll out the puff pastry onto a lightly floured work surface to a 25cm x 30cm/10in x 12in rectangle. ", "Lay the three pancakes on top of the pastry rectangle to cover the pastry. Spread three tablespoons of the duxelles mixture onto the pancakes.", "Place the seared venison into the centre of the pancakes. Spread the remaining duxelles mixture all over the top of the venison loin.", "Fold the pancakes as tightly as possible around the venison (do not allow the duxelles mixture to seep out).", "Brush the edges of the pastry with some of the beaten egg, then wrap the pastry around the venison and pancakes, overlapping the edges and folding to seal. Brush the outside of the pastry with more of the beaten egg.", "Transfer the venison parcel to the prepared baking tray, then chill in the fridge for 30 minutes.", "Preheat the oven to 220C/425F/Gas 7.", "When the venison parcel has chilled, brush all over again with the remaining beaten egg. Bake in the oven for 15-20 minutes, or until the pastry has risen and is golden-brown (the venison will be cooked to medium after 15-20 minutes). Remove from the oven and set aside to rest for five minutes.", "For the buttered Savoy cabbage, blanch the cabbage leaves in a pan of boiling, salted water for 3-4 minutes, or until just tender. Drain well, then refresh in cold water. Drain again and squeeze the leaves dry. Slice the blanched leaves into strips.", "Heat the butter in a frying pan over a medium heat. Add the blanched cabbage leaves and fry for 3-4 minutes, or until coated in the melted butter. Just before serving, stir in the sage until well combined.", "While the venison is cooking, reduce the beef stock in a pan over a medium heat, until the volume of liquid has reduced to 100ml/3½fl oz. Keep warm.", "To serve, slice the venison en croûte into four slices, each approximately 0.75cm/1½in thick. Place one slice into the centre of each serving plate. Serve the buttered cabbage alongside. Drizzle over the reduced beef stock."]}, {"isVegetarian": true, "title": "Lokanta stew", "url": "www_bbc_co_uk_food_recipes_lokanta_stew_91668", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lokanta_stew_91668_16x9.jpg", "ingredients": ["1 large onion, roughly chopped", "6 peppers, assorted red and yellow, deseeded and quartered", "400g/14oz tomatoes assorted sizes and colours", "20 thyme sprigs", "8 tbsp olive oil", "2 x 400g tins butter beans", "2 tsp ground allspice ", "350g/12oz green beans", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan /Gas 6.", "Transfer the onion and other vegetables to a roasting tin with the whole thyme sprigs and trickle over the olive oil. Roast the vegetables for 1 hour.", "Add the butter beans and ground allspice to the roasting tray and mix well, making sure that any dry parts are well coated in olive oil. Bake for a further 30 minutes.", "Cut the stem ends off the green beans. Cook in a pan of boiling salted water for 4 minutes. Remove and refresh in a bowl of iced water.", "Fold the green beans into the roasted vegetables. Season with salt and pepper and serve."]}, {"isVegetarian": false, "title": "Lollipop chicken with honey and sesame seeds", "url": "www_bbc_co_uk_food_recipes_lollipopchickenwithh_89019", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz chicken breast, cut into strips", "2 tbsp olive oil", "2 tbsp honey", "1 tbsp sesame seeds, toasted", "1 small handful fresh parsley leaves"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Soak two wooden skewers in a bowl of cold water for ten minutes. ", "Thread the chicken onto the skewers and drizzle over half of the olive oil. ", "Heat a griddle pan until smoking and cook the chicken skewers for 4-5 minutes on both sides, or until golden-brown and cooked through. Drizzle over the honey and sprinkle over the sesame seeds. ", "To serve, place the chicken skewers onto a serving plate. Toss the parsley leaves with the remaining olive oil and drizzle on the plate next to the chicken skewers."]}, {"isVegetarian": false, "title": "Lomo saltado with chips", "url": "www_bbc_co_uk_food_recipes_lomo_saltado_with_chips_31800", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 garlic cloves, chopped", "150ml/5fl oz soy sauce", "2 tbsp red wine vinegar ", "2 tsp worcestershire sauce", "½ tsp dried oregano ", "½ tsp ground cumin", "sea salt and freshly ground black pepper", "600g/1lb 5oz fillet steak, cut into 3cm/1¼in cubes", "vegetable oil, for frying", "1 large red onion, cut into thick wedges", "2 tomatoes, halves, seeds removed and cut into eighths", "1 amarillo chilli, seeds removed and sliced lengthways", "2 tsp pisco", "25g/1oz fresh coriander, finely chopped", "10g/¼oz fresh flat-leaf parsley, finely chopped", "600g/1lb 5oz chipping potatoes, peeled, cut into chips", "sunflower oil, for deep frying"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the marinade, mix all the ingredients together in a bowl with two tablespoons of water until well combined. ", "Add the meat to the bowl and mix so that it is well covered in the marinade.  Cover with cling film and leave to marinate in the fridge for about four hours.", "Rinse the chips in a colander under plenty of cold water to remove excess starch. Pat dry with kitchen paper. ", "Heat a deep, heavy-bottomed saucepan or deep-fat fryer half-full of sunflower oil to 130C/275F. Add the potatoes to the deep-fat fryer and fry for 10 minutes, or until softened. Remove from the pan with a slotted spoon and set aside to drain on kitchen paper. ", "When ready to serve, reheat the oil to 190C/375F. With a slotted spoon, lower all the par-cooked chips gently into the pan and cook for 4-5 minutes, or until crisp and golden-brown. Remove from the pan with a slotted spoon and drain on kitchen paper. Season with a little salt and keep warm while you cook the steak.", "Drain the meat, reserving the marinade. Heat the vegetable oil in a wok over high heat until just smoking and add the meat to the wok- be careful, it might splutter at you. Cook as quickly as possible, tossing it until the meat is browned on all sides.", "Add the red onion wedges and cook for one minute. Add the tomato and chilli and immediately pour in the pisco.", "Pour over the reserved marinade and bring to a simmer. Turn off the heat and leave the meat to rest in the sauce for a couple of minutes.", "Place the steak on one side and the chips on another and garnish with chopped coriander and parsley."]}, {"isVegetarian": true, "title": "Long Island iced tea", "url": "www_bbc_co_uk_food_recipes_long_island_iced_tea_42582", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/long_island_iced_tea_42582_16x9.jpg", "ingredients": ["15ml/½fl oz vodka", "15ml/½fl oz gin", "15ml/½fl oz  light rum", "15ml/½fl oz orange liqueur", "15ml/½fl oz fresh lemon juice", "15ml/½fl oz freshly squeezed orange juice", "1 tsp sugar syrup", "cola, to top up", "lemon wedge, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place all of the ingredients into a cocktail shaker with a handful of ice and shake hard. ", "Strain the cocktail into a highball glass, top up with cola and garnish with a lemon wedge. "]}]