[{"ingredients": ["Cerezas glaseadas rojas o naturales (sin colorear) de 350g / 12oz, enjuagadas, secadas y cortadas en cuartos", "225g / 8oz de piña enlatada en jugo de piña, escurrida, seca y picada", "Albaricoques secos listos para el consumo 50 g / 2 oz, picados", "100 g / 3½ oz de almendras blanqueadas, más o menos picadas", "2 limones, ralladura fina solamente", "Sultanas 350 g / 12oz", "250 g / 9 oz de mantequilla sin sal, ablandada, más extra para engrasar", "250 g / 9 oz de azúcar en polvo", "5 huevos grandes de gallinas camperas, ligeramente golpeados", "Harina de auto aumento 250g / 9 oz", "75g / 2½ oz de almendras molidas", "pequeño puñado blanqueado almendras enteras", "pequeñas mitades de nuez puñado", "pequeñas cerezas glaseadas rojas o naturales (sin colorear), cortadas a la mitad", "50 g / 1¾oz de cáscara de naranja entera (disponible en tiendas de alimentos naturales), cortada en pedazos", "100 g / 3½ oz de mermelada de albaricoque"], "method": ["Precaliente el horno a 160 ° C / 320 ° F / Gas 3. Engrase una lata honda profunda de pastel de 23 cm / 9 pulg con mantequilla, luego forre la base y los lados con una doble capa de pergamino para hornear.", "En un tazón, mezcla suavemente las cerezas, la piña, los albaricoques, las almendras, la ralladura de limón y las pasas sultanas hasta que estén bien combinadas. Dejar de lado.", "En un procesador de alimentos, bata la mantequilla y el azúcar hasta que esté suave y esponjoso. Vierta los huevos batidos poco a poco, agregando una cucharada de la harina para evitar que la mezcla se cuaje y palpite después de cada adición.", "Con cuidado, doble la harina restante y las almendras molidas en la mezcla de pastel con una cuchara de metal, luego doble suavemente la mezcla de frutas y nueces hasta que se combinen.", "Vierta la mezcla de la torta en la lata preparada y alise la superficie con una espátula.", "Para el relleno, decore el pastel con las almendras enteras escaldadas, mitades de nueces, mitades de cereza glaseadas y cáscara de naranja.", "Hornee la torta en el horno durante 2-2 ¼ horas, o hasta que esté dorada en la parte superior y cocida. (El pastel está cocido cuando una brocheta insertada en el centro del pastel sale limpia). Cubra el pastel ligeramente con papel de aluminio después de una hora para evitar que la parte superior quede demasiado oscura.", "Coloque la tarta a un lado en la lata para que se enfríe durante 30 minutos, luego retírela de la lata, retire el pergamino para hornear de los lados y colóquelo en una rejilla para que se enfríe por completo.", "Mientras tanto, caliente la mermelada de albaricoque en una sartén pequeña a fuego lento, luego cuele a través de un colador fino para eliminar cualquier trozo de fruta. Cuando el pastel se haya enfriado, cepilla la parte superior con la mermelada de albaricoque tibia. Envuelva una cinta alrededor de la torta y ate con un lazo, si lo desea, luego sirva."], "url": "www_bbc_co_uk_food_recipes_marys_christmas_genoa_32386", "title": "Pastel de Navidad Génova", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Hace 1 x 23 cm / 9 en pastel", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/marys_christmas_genoa_32386_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 cucharadas de aceite de oliva", "2 rebanadas de pan blanco de un día, costras quitadas, en cubos", "1 corazón de lechuga romana, en rodajas", "30g / 1oz de queso parmesano, rasurado", "sal y pimienta negra recién molida", "6 cucharadas de mayonesa light", "1½ cucharada de mostaza Dijon", "2 cucharadas de queso parmesano rallado", "½ diente de ajo, aplastado", "unas gotas de salsa Worcestershire"], "method": ["Calentar el aceite de oliva en una sartén antiadherente, agregar el pan y freír a fuego alto durante 3-4 minutos hasta que se dore. Retirar con una cuchara ranurada, transferir a un recipiente y sazonar con sal y pimienta.", "Coloque todos los ingredientes del aderezo en un recipiente y bata hasta que estén suaves con 1-2 cucharadas de agua.", "Mezcle la lechuga romana en el aderezo y esparza los croûton tostados y el parmesano rallado."], "url": "www_bbc_co_uk_food_recipes_marys_classic_caesar_72903", "title": "Ensalada César clásica de María", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50g / 1¾oz de mantequilla", "50g / 1¾oz demerara azúcar", "50g / 1¾oz de jarabe dorado", "50g / 1¾oz de harina natural", "25 g / 1 oz de arándanos secos o cerezas glaseadas, finamente picadas", "50g / 1¾oz de cáscara confitada, finamente picada", "Almendras 25 g / 1 oz, finamente picadas", "Piezas de nogal de 25 g / 1 oz, finamente picadas", "200 g / 7 oz% 20plain% 20chocolate% 20 (70%% 20cocoa% 20solids)"], "method": ["Precalienta el horno a 180 ° C / 350 ° F / Gas 4. Pasa tres bandejas para hornear con pergamino para hornear o láminas de silicona.", "Mida la mantequilla, el azúcar y el jarabe en una sartén pequeña y caliente suavemente hasta que la mantequilla se derrita. Retire del fuego y agregue la harina, los arándanos picados o las cerezas, la cáscara confitada y las nueces a la sartén. Revuelva bien para mezclar.", "Haga 18 florentinas colocando seis cucharaditas de la mezcla en cada una de las bandejas preparadas para hornear, dejando suficiente espacio para que se extiendan durante la cocción.", "Hornee por 8-10 minutos, o hasta que estén doradas. Deje que los florentinos se enfríen antes de elevarlos a un estante de enfriamiento con una espátula (si los florentinos se han horneado en bandejas de horno engrasadas, luego déjelos endurecer por unos momentos antes de elevarlos a los estantes de enfriamiento para que se enfríen por completo). Si los florentinos se vuelven demasiado difíciles de eliminar, vuelva a introducirlos en el horno durante unos minutos para que se ablanden.", "Coloque un recipiente a prueba de calor sobre una fuente de agua hirviendo a fuego lento, sin dejar que el recipiente toque el agua. Temple el chocolate rompiendo la mitad del chocolate en el tazón. Revuelva hasta que el chocolate alcance una temperatura de fusión de 53 ° C / 127 ° F. Mientras tanto, corta o ralla finamente el chocolate restante.", "Retire con cuidado el tazón de la sartén, agregue el resto del chocolate y revuelva suavemente hasta que el chocolate se haya enfriado a 26 ° C / 79 ° F.", "Extienda un poco de chocolate derretido sobre la base plana de cada florentino y deje enfriar un poco antes de marcar un zigzag en el chocolate con un tenedor. Dejar reposar, con el lado del chocolate hacia arriba en una rejilla para enfriar. Almacenar en un recipiente hermético."], "url": "www_bbc_co_uk_food_recipes_marys_florentines_49833", "title": "Florentinos de María", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 18 galletas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/marys_florentines_49833_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["225g / 8oz de harina de auto crianza, tamizada", "1 cucharadita de polvo de hornear", "100 g / 3½ oz de nueces, finamente picadas", "225g / 8oz de mantequilla, ablandada, más extra para engrasar", "225 g / 8 oz de azúcar en polvo", "4 huevos grandes de gallinas camperas, golpeados", "100 g / 3½ oz de azúcar en polvo", "10 mitades de nuez", "125g / 4½oz de mantequilla, suavizada", "½ cucharadita de extracto de vainilla", "2 cucharadas de leche", "250 g / 9 oz de azúcar glas", "2 claras de huevo grandes", "Azúcar en polvo 350g / 12oz", "¼ cucharadita de crema de tártaro"], "method": ["Precaliente el horno a 160 ° C / 140 ° Ventilador / Gas 3. Engrase 3 x 20 cm / 8 pulgadas de latas de sándwich y forre la base de cada lata con papel para hornear.", "Mezcle la harina, el polvo de hornear y las nueces en un bol. En otro recipiente, unte la mantequilla y el azúcar hasta que estén pálidos y esponjosos. Batir los huevos un poco a la vez.", "Dobla la mezcla de harina con una cuchara grande de metal. Divida la mezcla por igual entre las 3 latas y nivele las superficies.", "Hornee durante unos 25-30 minutos, o hasta que los pasteles estén dorados y elásticos al tacto. Deje enfriar en las latas durante unos minutos, luego salga, desprenda el pergamino y termine de enfriar en una rejilla de alambre.", "Para las nueces caramelizadas, verter el azúcar y 2 cucharadas de agua en una sartén y calentar a fuego lento hasta que el azúcar comience a derretirse. Aumente el fuego y cocine el caramelo en un color dorado oscuro (PRECAUCIÓN: el azúcar en ebullición es extremadamente caliente. Maneje con mucho cuidado). Retire del fuego, agregue las mitades de nuez y revuelva para cubrir con el caramelo. Transfiera las mitades de nogal a una lámina de silicio y déjelo fraguar.", "Para la crema de mantequilla, coloca la mantequilla, el extracto de vainilla, 1 cucharada de leche y la mitad del azúcar glas en un tazón grande y bate hasta que quede suave. Batir el azúcar glas restante. Vierta el resto de la leche, si es necesario para que la crema de mantequilla tenga la consistencia adecuada.", "Extienda la mitad de la crema de mantequilla sobre una de las esponjas enfriadas y coloque la segunda esponja encima. Extienda la crema de mantequilla restante sobre la segunda esponja y cubra con la tercera esponja.", "Para la formación de hielo hervida, mida las claras de huevo, el azúcar, 4 cucharadas de agua y la crema de tártaro en un recipiente resistente al calor colocado sobre una fuente de agua caliente y bata durante 8-10 minutos hasta que espese.", "Trabajando rápidamente (la formación de hielo se pone rápidamente), cubra la parte superior y los lados de la torta con el glaseado, agitando la formación de hielo para formar picos suavizados. Deje que se coloque en un lugar fresco, pero no en la nevera. Decora con las nueces caramelizadas."], "url": "www_bbc_co_uk_food_recipes_marys_frosted_walnut_15679", "title": "Pastel de nueces helado de Mary", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 1 torta grande", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/marys_frosted_walnut_15679_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["750 g / 1 libra de 10 onzas de hojaldre listo para usar con mantequilla, refrigerado", "harina común, para quitar el polvo", "1 huevo de gallinas camperas, batido, para esmaltar", "100g / 3½oz de mantequilla sin sal, ablandada", "100 g / 3½ oz de azúcar en polvo", "1 huevo grande de gallinas camperas, más 1 yema, a temperatura ambiente", "100 g / 3½ oz de almendras molidas", "50g / 1¾oz de almendras en copos", "1 cucharadita de extracto de almendra"], "method": ["Alinee una bandeja para hornear con un pergamino para hornear. Extienda la mitad de la masa sobre una superficie de trabajo ligeramente enharinada hasta que tenga un tamaño aproximado de 25x25 cm / 10x10 pulgadas y sea un poco más delgada que una moneda de una libra.", "Corta un círculo de 23cm / 9 pulgadas de la masa cortando alrededor de la parte inferior de una lata de pastel de 23 cm / 9 pulgadas con un cuchillo afilado. Transfiera el círculo de repostería a la bandeja de horneado preparada y cubra con una película adhesiva.", "Repita el proceso con la otra mitad de la masa, colocando el segundo círculo de masa sobre la película adherida y cubriendo con más película adhesiva. Enfríe hasta que sea necesario.", "Para el relleno, bata la mantequilla ablandada hasta que quede cremosa con una cuchara de madera o una batidora independiente. Agregue el azúcar y bata nuevamente hasta que la mezcla esté pálida y esponjosa.", "En un tazón pequeño, bata el huevo con la yema de huevo hasta que se combine. Poco a poco agregue a la crema de mantequilla y la mezcla de azúcar, una cucharada a la vez, batiendo bien después de cada adición para incorporar el huevo en la mezcla.", "Cuando la mezcla sea muy ligera en color y textura, mezcle suavemente las almendras molidas, las almendras en copos y el extracto de almendras. Cubra el tazón con film transparente y enfríe en la nevera durante 15-20 minutos.", "Cuando la masa y el relleno se hayan enfriado, retire la película adhesiva de la masa y deje un círculo de masa en la bandeja para hornear. Con una cuchara, coloque la mezcla de relleno en el círculo de repostería de la bandeja de hornear, amontonándola en un pequeño montículo en el centro y dejando un borde de 2 cm en todo el borde. Cepille el borde de la repostería con un poco del huevo batido, luego coloque suavemente el segundo círculo de repostería sobre el relleno, presionando los bordes firmemente para sellar.", "Sosteniendo una cuchilla pequeña en ángulo recto con el borde de la pastelería, \"golpea\" el borde de la galette haciendo pequeñas hendiduras alrededor del borde de la masa. Vierte el borde de la pasta al presionar las hendiduras a intervalos de 2 cm / 1 pulg usando la parte posterior de la cuchilla. Cepille la parte superior de la galette con más huevo batido, luego enfríe la galette en la nevera durante 30 minutos.", "Precalentar el horno a 220C / 200C Fan / Gas 7.", "Cepilla toda la parte superior de la galette fría nuevamente con el huevo batido restante, luego puntúa con un patrón entrecruzado con la punta de un cuchillo filoso. Haga un par de pequeños orificios de vapor en el centro de la galette. Hornee en el horno durante 25-30 minutos, o hasta que la masa esté crujiente y dorada. Dejar enfriar un poco antes de servir."], "url": "www_bbc_co_uk_food_recipes_marys_galette_38999", "title": "Galette", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Hace 1 tarta grande", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/marys_galette_38999_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal 225g / 8oz", "175g / 6oz de mantequilla", "45g / 1¾oz de azúcar glas", "1 huevo grande de gallinas camperas, golpeado", "6 limones, cáscara y jugo", "65g / 2¼ oz de harina de maíz", "250 g / 9 oz de azúcar en polvo", "6 yemas de huevo de gallinas camperas", "4 claras de huevo de gallinas camperas", "225 g / 8 oz de azúcar en polvo", "2 cucharadas de harina de maíz"], "method": ["Precaliente el horno a 180C / 350F / Gas 4.", "Primero haz la masa. Mida la harina y la mantequilla en un procesador de alimentos y mezcle hasta que la mezcla se asemeje a finas migas de pan. Agregue el azúcar glas, el huevo y una cucharada de agua y vuelva a aceitar hasta que se combinen para formar una bola.", "Incline la masa sobre una superficie de trabajo y extiéndala hasta un grosor de 3 mm. Use el rodillo para levantar la masa y transferirla a la línea de una lata de flan sin fondo de 23cm / 9 pulgadas. Tenga cuidado de no estirar la masa mientras la coloca en las esquinas. Cubra la película adhesiva y colóquela en el refrigerador para enfriar durante 30 minutos.", "Saque la lata revestida de pasta de la nevera y corte el exceso de masa. Presione el borde superior de la masa para que quede un poco más alto que la parte superior de la lata.", "Alinee la caja de pastelería con pergamino y rellene con alubias para hornear. Hornee por unos 15 minutos, luego quite los frijoles y el pergamino y vuelva al horno por otros cinco minutos.", "Retire del horno y reduzca la temperatura a 170C / 340F / Gas 3½.", "Para el relleno, mezcle la ralladura de limón y el jugo con la harina de maíz y revuelva para formar una pasta suave. Mida 450 ml / 16 fl oz de agua en una sartén y llévela a ebullición. Agregue la mezcla de harina de maíz con limón al agua caliente y revuelva sobre el fuego hasta que la mezcla se espese, luego retire del fuego.", "En un recipiente, mezcle el azúcar y las yemas de huevo y mezcle con cuidado la mezcla de limón en la sartén. Revuelva a fuego medio hasta que espese. Dejar de lado por unos minutos y luego verter en la caja de pastelería horneada.", "Para el merengue, bata las claras de huevo en una batidora independiente hasta que se formen picos suaves cuando se quita la batidora. Agregue el azúcar en polvo un poco a la vez, aún batiendo hasta que el merengue esté tieso y brillante. Agregue la harina de maíz y bata de nuevo.", "Coloque una cuchara sobre la caja de repostería llena y extienda el merengue para cubrir completamente el relleno de limón. Luego crea un remolino en la parte superior del merengue.", "Hornee en el horno por unos 15 minutos hasta que el relleno esté completamente listo y el merengue esté ligeramente dorado y crujiente. Deje que se enfríe completamente antes de cortar o sirva ligeramente tibio."], "url": "www_bbc_co_uk_food_recipes_marys_lemon_meringue_pie_02330", "title": "Pastel de merengue de limón de Mary", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/marys_lemon_meringue_pie_02330_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100 g / 3½ onzas de mantequilla, ablandadas, más extra para engrasar", "175g / 6oz de azúcar mascabado ligero", "2 huevos grandes de gallinas camperas", "Harina de levante 225g / 8oz", "1 cucharadita de polvo de hornear", "1 cucharadita de bicarbonato de soda", "3 cucharadas de melaza negra", "275ml / 9½fl oz de leche entera", "crema doble o helado de vainilla, para servir", "100 g / 3½ oz de mantequilla", "125g / 4½oz de azúcar mascabado ligero", "1 cucharada de melaza negra", "300 ml / 10 fl oz crema de vertido doble", "1 cucharadita de extracto de vainilla"], "method": ["Precaliente el horno a 180 ° C / 160 ° C Ventilador / Gas 4. Aplique mantequilla a un plato ancho y poco profundo de 1,7 litros / 3 pulgadas para horno.", "Ponga la mantequilla, el azúcar, los huevos, la harina, el polvo de hornear, el bicarbonato de soda y la melaza en un tazón. Batir con un batidor de mano eléctrico durante unos 30 segundos o hasta que se combinen. Vierta la leche gradualmente y bata de nuevo hasta que quede suave. Vierta en el plato preparado. Hornee por 35-40 minutos o hasta que esté bien levantado y elástico en el centro.", "Para hacer la salsa, coloque todos los ingredientes en una cacerola y revuelva a fuego lento hasta que el azúcar se haya disuelto y la mantequilla se haya derretido. Llevar a ebullición, revolviendo por un minuto.", "Para servir, vierte la mitad de la salsa sobre el pudin en la fuente para hornear. Sirve con la crema o el helado."], "url": "www_bbc_co_uk_food_recipes_marys_sticky_toffee_41970", "title": "Pudín de caramelo toffee de María", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/marys_sticky_toffee_41970_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 huevos grandes de gallinas camperas", "225 g / 8 oz de azúcar en polvo, más extra para rociar", "Harina de levante 225g / 8oz", "1 cucharadita de polvo de hornear de nivel", "225g / 8oz de mantequilla sin sal, ablandada, más extra para engrasar", "Frambuesas 200 g / 7 oz", "250g / 9oz de mermelada de azúcar", "100g / 3½oz de mantequilla sin sal, ablandada", "200g / 7oz de azúcar glas, tamizado", "2 cucharadas de leche"], "method": ["Precaliente el horno a 180C / 160C Ventilador / Gas 4. Engrase y alinee dos latas de emparedado de 20cm / 8in: use un trozo de papel para hornear o silicona para untar un poco de bicarbonato o mantequilla alrededor del interior de las latas hasta que los lados y la base estén ligeramente cubierto. Alinee la parte inferior de las latas con un círculo de papel para hornear.", "Rompa los huevos en un tazón grande para mezclar, agregue el azúcar, la harina, el polvo de hornear y la mantequilla blanda. Mezcle todo junto hasta que esté bien combinado. Tenga cuidado de no mezclar demasiado: tan pronto como todo esté mezclado, debe detenerse. La mezcla final debe ser de consistencia blanda.", "Divida la mezcla de manera uniforme entre las latas. Use una espátula para eliminar toda la mezcla del bol y suavemente alise la superficie de los pasteles.", "Coloque las latas en el estante del medio del horno y hornee durante 25 minutos. No se sienta tentado a abrir la puerta mientras cocina, pero después de 20 minutos mire por la puerta para revisarla.", "Mientras los pasteles se cocinan, prepare el atasco. Coloque las frambuesas en una cacerola pequeña de lados profundos y aplastelas con un triturador. Agregue el azúcar y deje hervir a fuego lento hasta que el azúcar se derrita. Aumente el fuego y hierva por 4 minutos. Retirar del fuego y verter cuidadosamente en un recipiente poco profundo. Dejar enfriar y establecer.", "Los pasteles están hechos cuando son dorados y salen del borde de las latas. Presiónalas suavemente para comprobar: deben ser elásticas al tacto. Retírelos del horno y déjelos a un lado para que se enfríen en las latas durante 5 minutos. Luego, coloque una paleta o un cuchillo de mantequilla alrededor del borde interior de la lata y con cuidado pase las tortas a una rejilla para enfriar.", "Para sacar los pasteles de las latas sin dejar una marca de rejilla en la parte superior, coloque la toalla de té limpia sobre la lata, coloque la mano sobre la toalla de cocina y coloque la lata boca abajo. La torta debe salir en su mano y la toalla de té, luego puede pasarla de su mano a la rejilla. Dejar de lado para enfriar por completo.", "Para la crema de mantequilla, bata la mantequilla en un tazón grande hasta que esté suave. Agregue la mitad del azúcar glas y bata hasta que quede suave. Agregue el azúcar glas restante y una cucharada de leche y bata la mezcla hasta que quede cremosa y suave. Agregue la cucharada restante de leche si la crema de mantequilla es demasiado espesa. Coloque la crema de mantequilla en una bolsa de plástico con una boquilla simple.", "Para ensamblar, elija la esponja con la mejor tapa, luego coloque la otra torta de arriba hacia abajo en un plato de servir. Extienda con la mermelada y luego vierta la crema de mantequilla encima del atasco. Coloque la otra esponja encima (arriba arriba) y espolvoree con azúcar impalpable para servir."], "url": "www_bbc_co_uk_food_recipes_marys_victoria_sandwich_58140", "title": "El sándwich de Victoria de María", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 8-10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/marys_victoria_sandwich_58140_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Frambuesas 200 g / 7 oz", "250g / 9oz de mermelada de azúcar", "250g / 9oz de mantequilla sin sal muy suave", "50g / 1¾oz de azúcar glas", "Harina normal 225g / 8oz", "25g / 1 oz de harina de maíz", "100g / 3½oz de mantequilla sin sal, ablandada", "200g / 7oz de azúcar glas, más extra para quitar el polvo", "½ cucharadita de extracto de vainilla"], "method": ["Para la mermelada, coloca las frambuesas en una cacerola pequeña y profunda y tritúralas con un machacador de papas. Agregue el azúcar y deje hervir a fuego lento. Cuando el azúcar se derrita, aumente el fuego y hierva por otros 4 minutos. Retire del fuego y vierta cuidadosamente en un recipiente poco profundo (páselo por un colador si prefiere no tener semillas en el atasco). Dejar enfriar y establecer.", "Para las galletas, precaliente el horno a 190C / 170C Fan / Gas 5. Línea 3 bandejas para hornear con pergamino para hornear antiadherente. Con una cuchilla redonda de 5 cm / 2 pulgadas como guía, dibuje 8 círculos en cada hoja de papel, separados unos de otros. Dé la vuelta al papel para que las marcas de lápiz queden debajo.", "Mida la mantequilla y el azúcar glas en un bol y bata hasta que quede pálido y esponjoso. Tamizar la harina y la harina de maíz y batir bien, hasta que esté bien mezclado. Coloque la mezcla en una bolsa para tubos con una boquilla de estrella media. Pipe 24 rondas en espiral (no rosetas), dentro de los círculos en las bandejas para hornear.", "Hornee en el centro del horno durante 13-15 minutos, hasta que se dore. Dejar enfriar en las bandejas de hornear durante 5 minutos y luego transferir cuidadosamente a una rejilla de alambre para que se enfríe por completo y se endurezca.", "Para el relleno, mida la mantequilla en un recipiente y tamice el azúcar glas en la parte superior. Agregue el extracto de vainilla y bata con una cuchara de madera o un batidor eléctrico hasta que quede muy liviano y suave. Coloque una cuchara en una manga pastelera equipada con una boquilla de estrella grande.", "Coloque un poco de mermelada en el lado plano de 12 de los bizcochos y colóquelo boca abajo sobre una rejilla para enfriar. Pipe la crema de mantequilla sobre el atasco y sándwich con los bizcochos restantes. Polvo con azúcar glas para terminar."], "url": "www_bbc_co_uk_food_recipes_marys_viennese_whirls_96895", "title": "Giros vieneses de María", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 12-14", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/marys_viennese_whirls_96895_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200g / 7oz de almendras blanqueadas", "1 semilla de ciruela (la semilla suave dentro de la piedra de ciruela)", "200g / 7oz de azúcar glasé", "10 hebras de azafrán, empapadas en 4 cucharadas de agua", "1 cucharada de canela"], "method": ["En una mezcla de mortero y mortero 50 g / 2 oz de almendras.", "Coloque los restantes 150 g / 5 oz de almendras y el núcleo de ciruela y en un procesador de alimentos", "En una sartén, derrita el azúcar glas con una pizca de agua hasta que se vuelva transparente. En este punto, viértalo en el procesador de alimentos y mezcle bien hasta que la mezcla tenga una pasta espesa.", "Regrese las almendras procesadas a la sartén, agregue el contenido del mortero y la mezcla, y mezcle bien con una cuchara de madera a fuego lento.", "Cuando las almendras estén bien mezcladas, ponlas en una salchicha gruesa y envuélvelas en papel de aluminio. Dejar reposar durante al menos una hora.", "Coloque la canela en un tazón pequeño y el azafrán remojado en el otro. Forma formas de pelota de golf de mazapán y luego enróllalas con el sabor deseado y sírvelas."], "url": "www_bbc_co_uk_food_recipes_marzipan_70975", "title": "mazapán", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Hace 12-15 dulces", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50g / 1¾oz de mantequilla, más extra para engrasar", "25g / 1oz de chocolate puro", "Galletas digestivas 150 g / 5½ oz, aplastadas", "Botones de chocolate blanco de 300g / 10½oz o una barra picada en pedazos", "400g / 14oz de queso crema con toda su grasa", "150ml / 5fl oz de crema agria", "2 huevos de gallinas camperas", "1 cucharadita de extracto de vainilla", "4 piezas de tallo de jengibre (de un tarro), finamente picado", "150g / 5½oz de chocolate puro, derretido", "algunas gotas de colorante de comida roja", "Mazapán de 25g / 1oz", "azúcar en polvo, para quitar el polvo", "300ml / 10½ fl oz crema doble"], "method": ["Precaliente el horno a 170 ° C / 150 ° C Ventilador / Gas 3. Engrase la base de una lata de torta con forma de resorte de 20 cm / 8 pulg con mantequilla, luego enlínea con un círculo de papel para hornear.", "Para la base, derrita la mantequilla y el chocolate en una cacerola pequeña a fuego lento. Agregue los bizcochos triturados.", "Transfiera la mezcla base a la lata de la torta y, con los dedos, presione hacia abajo hasta que cubra por completo la parte inferior de la lata de la torta en una capa uniforme. Enfriar en la nevera hasta que sea necesario.", "Para el llenado, suspenda un recipiente resistente al calor sobre una fuente de agua hirviendo a fuego lento (no permita que la base del recipiente toque el agua). Agregue el chocolate blanco al cuenco y derrita hasta que se moje y suavice, revolviendo ocasionalmente con una cuchara de madera.", "En un tazón grande, bata el queso crema y la crema agria juntos hasta que estén suaves y bien combinados. Agregue los huevos y el extracto de vainilla hasta que esté completamente suave, luego agregue el chocolate blanco derretido hasta que esté bien combinado. Dobla el jengibre picado.", "Vierta la mezcla de relleno sobre la base enfriada y nivele la parte superior con una espátula. Hornee en el horno durante 40-45 minutos, o hasta que esté firme alrededor del borde y justo en el medio.", "Retire la tarta de queso del horno y descanse durante 10 minutos, luego coloque un pequeño cuchillo romo alrededor del borde interior de la lata de la torta. Dejar de lado hasta que la tarta de queso se haya enfriado por completo en la lata, luego enfriar en la nevera.", "Para la decoración, coloque dos tiras de papel para hornear sobre una superficie de trabajo. Coloque el chocolate derretido en una pequeña bolsa de plástico equipada con una boquilla de escritura de tamaño dos y coloque once pequeñas hojas de acebo de chocolate en las tiras de pergamino para hornear (cinco en una, seis en la otra).", "Coloque las tiras de papel de hornear pergamino sobre dos rodillos o superficies similares ligeramente curvas. Asegure las tiras en cada extremo con bandas elásticas. Coloque los bolos en las bases de dos cajas de huevos vacías para evitar que rueden, luego permita que las hojas de chocolate se enfríen y pongan.", "Mientras tanto, agregue unas gotas de colorante de comida roja al mazapán y amase hasta que el mazapán tenga un color rojo brillante uniforme. Espolvorea tus manos con azúcar glas y luego enrolla el mazapán en 27 bolitas pequeñas (estas serán bayas para las hojas de acebo de chocolate).", "Retire el anillo de la torta de estaño de la tarta de queso y coloque la tarta de queso, todavía en su base, en un plato de servir.", "Batir la crema hasta que se formen picos suaves cuando se quita la batidora, luego colocar la cuchara en una manga pastelera equipada con una boquilla en forma de estrella. Pipe ocho rosetas o remolinos alrededor del borde de la tarta de queso y una roseta o remolino en el medio.", "Coloque una hoja de acebo de chocolate y tres bayas de acebo en el centro de cada remolino de crema, luego coloque tres hojas de acebo de chocolate y las bayas de mazapán restantes en la parte superior del remolino central de crema. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_marys_white_chocolate_55940", "title": "Pastel de chocolate blanco y jengibre", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/marys_white_chocolate_55940_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["250 g / 9 oz de azúcar en polvo", "Almendras molidas 250 g / 9 oz", "1 huevo de gallinas camperas, solo blanco, ligeramente batido", "¼ cucharadita de extracto de almendra", "500g / 1lb 2oz de toda la mantequilla de hojaldre listo para usar", "1 huevo de gallinas camperas, golpeado", "4 manzanas, muy finamente cortadas", "75g / 3oz de mantequilla", "4 cucharadas de azúcar en polvo", "4 cucharadas de mermelada de albaricoque", "115g / 4 oz de azúcar morena oscura", "115g / 4oz de mantequilla", "Crema doble 175ml / 6fl oz", "250ml / 9fl oz de helado de vainilla", "4 ramitas de menta"], "method": ["Para hacer el mazapán, caliente el azúcar y 75 ml / 5 cucharadas de agua en una cacerola hasta que se disuelva, luego hierva el almíbar hasta que la mezcla alcance los 100 ° C / 220 ° F (use un termómetro de azúcar para medir esto). Esto se conoce como la etapa de bola blanda, cuando una gota se coloca en agua fría para enfriarse, formará una bola suave.", "En un tazón, mezcle las almendras molidas, la clara de huevo y el extracto de almendras.", "Vierta el jarabe de azúcar sobre las almendras molidas y mezcle vigorosamente hasta que la mezcla forme una pasta espesa.", "Enfríe el mazapán en el refrigerador durante 1-2 horas, o hasta que esté firme.", "Para la tarta, precaliente el horno a 210C / 425F / Gas 7. Cubra una bandeja para hornear con papel para hornear.", "Ruede la masa de hojaldre sobre una superficie enharinada. Recorta 4 x 12 cm / 4½ en círculos y colócalos en la bandeja para hornear. Dejando un espacio de aproximadamente un centímetro alrededor del borde, marque ligeramente los puntos medios de cada círculo de masa con un pequeño cuchillo afilado, formando una cuadrícula de líneas. Esto evitará que la pastelería se hinche demasiado en el medio. Cepille cada círculo de masa con el huevo batido.", "Ruede el mazapán frío a 5 mm / ¼ de grosor. (Si el mazapán es demasiado difícil de poner en marcha, deje que se caliente un poco a temperatura ambiente.) Recorte 4 círculos de 11 cm en cada círculo de mazapán sobre un círculo de masa.", "Coloque las rebanadas de manzana, superpuestas en círculos concéntricos, encima de cada círculo de mazapán para que todo el mazapán esté cubierto.", "Calienta la mantequilla en una cacerola hasta que se derrita, luego pasa la brocha sobre la parte superior de las manzanas y espolvorea el azúcar por encima.", "Transfiera al horno para hornear durante 15-18 minutos, o hasta que la masa esté dorada.", "Mientras tanto, coloca la mermelada de albaricoque y una cucharada de agua en una cacerola y calienta hasta que la mermelada se haya derretido. Pasar la mermelada a través de un colador fino en un recipiente.", "Retire las tartas del horno y cepille con la mermelada de albaricoque derretido.", "Para la salsa, caliente el azúcar y la mantequilla en una cacerola pequeña hasta que se derrita y se combine bien.", "Vierta la crema doble y cocine a fuego lento durante 3-5 minutos o hasta que la mezcla se espese un poco.", "Para servir, coloque una tarta en el centro de cada plato de servir, rocíe la salsa de caramelo por el exterior. Cubra con una bola de helado y una ramita de menta y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_marzipan_and_apple_tart_98603", "title": "Tarta de mazapán y manzana con salsa de caramelo", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["180g / 6¼ oz de azúcar en polvo", "180g / 6¼ oz de mantequilla, suavizada", "2 huevos de gallinas camperas", "Harina normal de 80g / 2¾oz", "150gr / 5 oz de almendras molidas", "Mazapán de 100g / 3½oz, cortado en pedazos de 1cm / ½ en", "100 g / 3½ oz de arándanos", "azúcar glas, para servir"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Recorte cuadrados de pergamino para hornear que cubran fácilmente los agujeros de una bandeja para bollos. Línea de cada uno.", "Batir el azúcar y la mantequilla en un tazón con una batidora eléctrica hasta que esté pálida y esponjosa.", "Poco a poco golpee los huevos, luego gradualmente introduzca la harina y las almendras molidas. Continúa latiendo hasta que todo esté bien incorporado.", "Doble el mazapán en la mezcla.", "Divida la mezcla entre las copas forradas de la bandeja para bollos. Esparce 3-4 bayas sobre cada una.", "Hornee los pasteles por 30 minutos o hasta que estén suaves al tacto.", "Espolvorea con un poco de azúcar glas y sirve caliente."], "url": "www_bbc_co_uk_food_recipes_marzipan_berry_cakes_91508", "title": "Bizcochos de mazapán", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 12 pasteles", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/marzipan_berry_cakes_91508_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["250g / 9oz de hojaldre", "Mazapán 150g / 5½oz, corte", "2 naranjas, peladas, segmentadas y en rodajas", "en piezas del tamaño de un bocado", "1 cucharada de miel", "½ cucharadita de canela", "1 huevo de gallinas camperas, golpeado", "2 cucharadas de azúcar glas", "Crema doble de 55 ml / 2 onzas líquidas, batida", "125g / 4oz mascarpone"], "method": ["Para hacer la trenza anaranjada de mazapán, precaliente el horno 180C / 350F / Gas 4.", "Estirar la masa de hojaldre para formar un rectángulo grande.", "Coloque el mazapán en el centro de la masa de hojaldre y cubra con las rodajas de naranja.", "Rocíe con miel y espolvoree canela.", "Corta los lados de la masa cortando los cortes a una pulgada de distancia. Trenza la masa en el medio.", "Cepille con el huevo batido y coloque la trenza en la bandeja para hornear.", "Cocine en un horno precalentado durante 20 minutos hasta que estén dorados.", "Polvo con azúcar glas y servir.", "Para hacer la crema de mascarpone, mezcle la crema batida y el mascarpone en un bol para obtener una consistencia suave y espesa. Sirve con la trenza naranja."], "url": "www_bbc_co_uk_food_recipes_marzipanandorangepla_75825", "title": "Plato de mazapán y naranja con crema de mascarpone", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 x 100 g / 3½ oz / 12 pulgadas cuadrados de pasta filo prefabricado", "2 x 100 g / 3½ oz / 12 pulgadas rebanadas cuadradas de mazapán", "50 g / 1¾oz de mantequilla sin sal, derretida", "2 mitades de melocotón", "azúcar glas para espolvorear"], "method": ["Precalentar el horno a 200C / 400F / Gas6", "Ruede los cuadrados de mazapán a 1cm / ½ de grosor.", "Coloque los dos cuadrados de 12 pulgadas de masa filo en capas sobre una superficie enharinada. Cepille cada cuadrado de masa con mantequilla derretida.", "Coloque un cuadrado de mazapán en el centro de cada cuadrado de repostería.", "Coloque un melocotón con la mitad del lado plano hacia abajo en la parte superior de cada cuadrado de mazapán.", "Doble las esquinas, asegurándose de que cada melocotón en el centro sea visible.", "Cepille con la mantequilla derretida y transfiera a una bandeja para hornear. Hornea por seis minutos.", "Para servir, coloque en un plato con un poco de azúcar glas."], "url": "www_bbc_co_uk_food_recipes_marzipanandpeachfilo_77970", "title": "Corona de mazapán y melocotón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["250 g / 9 oz de azúcar en polvo", "75ml / 3fl oz de agua", "Almendras molidas 250 g / 9 oz", "1 clara de huevo de granja, ligeramente batida", "¼ cucharadita de extracto de almendra", "500g / 1lb 2oz de toda la mantequilla de hojaldre listo para usar", "1 huevo de gallinas camperas, golpeado", "Frambuesas 200 g / 7 oz", "50g de almendras en copos", "Crema doble de 200 ml / 7 fl oz", "1½ cucharada de azúcar glas", "½ cucharadita de extracto de vainilla", "Frambuesas 200 g / 7 oz", "1½ cucharada de azúcar glas, más extra para quitar el polvo"], "method": ["Caliente el azúcar y el agua en una cacerola hasta que se disuelva, luego hierva el almíbar hasta que la mezcla llegue a la etapa de bola blanda, 100C / 220F (use un termómetro de azúcar para medir esto).", "Coloque las almendras molidas, la clara de huevo y el extracto de almendras en un bol. Vierta sobre el jarabe de azúcar y mezcle vigorosamente hasta que la mezcla forme una pasta espesa. Enfríe la mezcla de mazapán en la nevera durante 1-2 horas, o hasta que esté firme.", "Mientras tanto, precalentar el horno a 210C / 425F / Gas 7.", "Ruede la masa de hojaldre sobre una superficie enharinada. Corta círculos de 4 x 12 cm / 5 pulgadas, colócalos en una bandeja para hornear y marca el centro de cada círculo con un cuchillo. Cepille cada círculo de masa con el huevo batido.", "Ruede el mazapán frío a 0.5cm / ¼ de grosor. (Si el mazapán es demasiado difícil de poner en marcha, deje que se caliente un poco a temperatura ambiente.) Recorte 4 círculos de 11 cm en cada círculo y coloque cada círculo sobre un círculo de masa.", "Coloque las frambuesas en círculos concéntricos encima de cada círculo de mazapán para cubrir todo el mazapán. Espolvorea sobre las almendras copos.", "Transfiera al horno para hornear durante 15-18 minutos, o hasta que la masa esté dorada. Retire las tartas del horno y espolvoree con azúcar glas de inmediato.", "Mientras tanto, bata la crema doble en un bol hasta que se formen picos rígidos cuando se quite el batidor. Agregue el azúcar glas y el extracto de vainilla.", "Para el puré de frambuesa, mezcle las frambuesas y el azúcar glas en un procesador de alimentos para hacer un puré. Tamiza la salsa en un tazón.", "Para servir, espolvoree un poco del puré de frambuesa en cada uno de los 4 platos para servir y cubra con una tarta. Cubra con una quenelle de la crema de vainilla."], "url": "www_bbc_co_uk_food_recipes_marzipanandraspberry_93745", "title": "Tarta de mazapán y frambuesa con crema de Chantilly", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["6 cápsulas de cardamomo", "2 cucharadas de semillas de comino", "2 cucharadas de semillas de cilantro", "4 dientes enteros", "1 cucharadita de pimienta negra", "1 cucharadita de alholva molida", "2 cucharaditas de cúrcuma molida", "1 cucharada de pimentón", "1-2 cucharaditas de chile en polvo (cuanto más se usa, más picante es el plato)", "¼ cucharadita de canela molida", "1 cucharadita de sal marina en copos", "4 dientes de ajo, pelados y aplastados", "Jengibre fresco de la raíz de 40g / 1½oz, pelado y rallado fino", "100g / 3½oz de yogur natural bajo en grasa", "Pollo de 1.65kg / 3lb 8oz", "1 lima, descuartizado", "pimienta negra recién molida", "berros frescos o ensalada de hojas de bebé, para servir", "200g / 7oz de yogur natural bajo en grasa", "1 cucharadita de salsa de menta lista para usar"], "method": ["Para hacer el adobo, divide las vainas de cardamomo y quita las semillas. Coloque las semillas de cardamomo en una sartén antiadherente seca y deseche las cáscaras. Agregue las semillas de comino y cilantro, clavos de olor y pimienta negra y coloque la sartén a fuego medio. Cocine durante 1-2 minutos, revolviendo regularmente hasta que las especias estén ligeramente tostadas, usted sabe que están listas cuando puede oler el aroma picante.", "Incline las especias tostadas en un almirez y un mortero, o un molinillo de especias eléctrico, y mezcle hasta obtener un polvo fino. Transfiera a un recipiente para mezclar y mezcle la alholva, la cúrcuma, el pimentón, el chile en polvo, la canela y la sal. Agregue el ajo, el jengibre y el yogur, luego mezcle bien y deje reposar mientras prepara el pollo.", "Coloque el pollo sobre el pecho en una tabla de cortar resistente y corte con cuidado a ambos lados de la columna vertebral con tijeras buenas o tijeras de aves de corral. Tira el hueso y corta las articulaciones de los pies y las puntas de las alas.", "Quite toda la piel del ave aparte de los extremos de las alas (que son más fáciles de quitar después de cocinar). Te resultará más fácil hacerlo si recortas la membrana entre la piel y la carne de pollo sobre la marcha. Corte y deseche cualquier grasa obvia: tendrá un color blanco cremoso. Abra el pollo y colóquelo en el tablero para que el lado de la pechuga quede hacia arriba.", "Presione fuertemente con las palmas de sus manos para romper el esternón y aplanar el pollo lo más uniformemente posible. Esto lo ayudará a cocinar más rápido. Cortar la carne con un cuchillo a través de las partes más gruesas de las piernas y el pecho. Coloque el pollo en un plato no metálico poco profundo, un plato de lasaña es ideal, y meta las piernas y las alas.", "Cuchara sobre el adobo y masajee realmente en el pollo en ambos lados, asegurándose de que cada pedazo de ave esté bien cubierto - pon tus manos ahí y realmente apúntate. Cubra el plato con film transparente y coloque el pollo en el refrigerador para marinar durante al menos cuatro horas o idealmente durante la noche.", "Precaliente el horno a 200C / 400F / Gas 6. Saque el pollo del plato y colóquelo en un estante dentro de una bandeja grande para hornear, con la pechuga hacia arriba. Exprima un poco de jugo de la lima y sazone con pimienta negra molida.", "Asar durante 1-1 ¼ horas hasta que el pollo esté ligeramente dorado y cocido, tirando los barriles de lima en la parrilla durante los últimos 20 minutos para cocinar junto con el pollo. Serán buenos para exprimir la carne más tarde. Los jugos deben quedar claros cuando la parte más gruesa de uno de los muslos se perfora con un pincho. Cúbralo con papel de aluminio y déjelo reposar durante 10 minutos antes de tallar.", "Mientras el pollo está en reposo, prepare la salsa. Con una cuchara, vierta el yogur en un tazón para servir y agregue la salsa de menta hasta que esté bien mezclado. Transfiera el pollo a un plato o tabla de madera y talle en rebanadas, descartando cualquier piel. Sirve con la salsa y un poco de berro o ensalada y ¡disfruta!"], "url": "www_bbc_co_uk_food_recipes_masala-marinated_chicken_18088", "title": "Pollo adobado Masala con salsa de yogur acuchillado", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Sirve 4-5", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/masala-marinated_chicken_18088_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100g / 3½oz de almendras copos tostadas", "100 g / 3½ oz de anacardos", "½ cucharadita de semillas de cardamomo, molidas", "300g / 10½ oz de azúcar granulada", "100 g / 3½ oz de miel clara", "3 bolsitas de té para el desayuno", "¼ cucharadita de semillas de cardamomo", "Jengibre de raíz fresco de 2½ cm / 1 en pieza, finamente picado", "12 hojas de pasta de filo lista para usar", "75g / 2½oz de mantequilla sin sal, derretida"], "method": ["Para el relleno, combine las almendras, anacardos y cardamomo en una licuadora y pulse hasta que esté finamente picado. Dejar de lado.", "Para hacer el almíbar, combine el azúcar, la miel, las bolsitas de té, el cardamomo y el jengibre con 200 ml / 7 onzas de agua en una olla mediana y caliente hasta que el azúcar se disuelva. Baje el fuego y cocine a fuego lento durante 15-20 minutos y luego deje enfriar.", "Cuando el almíbar haya alcanzado una temperatura segura, tamice el almíbar y deje que se enfríe completamente en el congelador.", "Precaliente el horno a 180 ° C / 350 ° F / Gas 4 y engrase una bandeja para hornear con mantequilla.", "Cepille una hoja de hojaldre con mantequilla y luego dóblela. Extienda sobre ella una cucharada de la mezcla de relleno, dejando un borde de 5 mm / ¼ pulgada en todos los lados.", "Comenzando en uno de los bordes largos, enrolle el filo en forma de cilindro largo. Cepille generosamente con mantequilla y enrolle el cilindro en una espiral apretada. Cepillar con mantequilla nuevamente y colocar en la bandeja de hornear preparada. Repita el proceso con las hojas restantes de filo y colóquelas una al lado de la otra en la bandeja de hornear.", "Hornee durante 50 minutos o hasta que estén dorados.", "Cuando esté cocido, vierta la mitad del almíbar sobre los baklavas. Deja durante cinco minutos y luego cuchara sobre el resto del jarabe. Deje que el baklava se enfríe un poco, luego sirva."], "url": "www_bbc_co_uk_food_recipes_masala_chai_baklava_33678", "title": "Masala chai baklava", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharadita de lentejas negras partidas o urad dal", "2 cucharadas de aceite vegetal", "pizca de asafétida", "1 cucharadita de semillas de comino", "½ cucharadita de semillas de mostaza marrón o negra", "8-10 hojas de curry", "3 chiles rojos medio secos, tallos eliminados", "½ cucharadita de cúrcuma", "1 cebolla mediana española, finamente rebanada", "¼ cucharadita de sal", "1 cucharadita de jengibre raíz, pelado y finamente rallado", "600g / 1lb 5oz de papas blancas o rojas, peladas, picadas y hervidas", "1 tomate mediano, aproximadamente picado", "Hojas de cilantro de 20 g / 1 oz, finamente picadas", "2-3 chapatis o panes naan, para servir"], "method": ["Recoge las lentejas y quita cualquier piedra pequeña.", "Remoje las lentejas en una taza de agua caliente durante cinco minutos.", "Calienta el aceite en la sartén. Agregue la asafétida, luego las semillas de comino y mostaza. Cuando chisporrotean, agregue las hojas de curry, las lentejas, los chiles rojos, la cúrcuma y la cebolla y mezcle. Freír a fuego medio durante cuatro minutos, luego agregar la sal, el jengibre, las papas, el tomate y las hojas de cilantro y mezclar bien.", "Ase los chapatis o los panes naan por unos minutos a cada lado.", "Coloque la mezcla de papa sobre los panes. Enrollar y servir."], "url": "www_bbc_co_uk_food_recipes_masaladosainachappat_74794", "title": "Masala dosa in a chapati", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 2-3", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/masaladosainachappat_74794_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 filetes de bacalao con un peso de 100-120 g / 3½-4½ oz cada uno", "1 cucharada de jugo de lima", "pizca de sal", "1 cucharada de jengibre o pasta de ajo", "½ cucharadita de polvo de cúrcuma", "½ cucharadita de chile rojo en polvo o pimienta negra molida", "¼ cucharadita de polvo de garam masala", "½ cucharadita de mango en polvo", "½ cucharadita de semillas de ajwain (opcional)", "100 g / 4½ oz de harina de gramo", "1 cucharada de harina de maíz", "1 gota de color naranja (opcional)", "120ml / 4¼fl oz de agua con gas", "aceite en un wok para freír", "1 cucharadita de chaat masala", "1 pepino pequeño de espesor en rodajas", "2 tomates medianos, en rodajas", "½ cebolla roja mediana, pelada y en rodajas", "10 ramitas de hojas de cilantro", "sal marina al gusto", "pizca de pimienta negra recién molida o chile en polvo rojo", "1 cucharadita de jugo de lima", "½ cucharadita de aceite de ensalada o aceite de oliva"], "method": ["Marinar el pescado con jugo de limón y sal y mantener a un lado durante 20 minutos.", "Mezcle todos los ingredientes de la mezcla en un bol hasta que quede un líquido suave y fluido. con el agua con gas", "Limpie el pescado con papel de cocina o una toalla para eliminar el exceso de humedad.", "Marinar el pescado en la mezcla por otros diez minutos.", "Caliente el aceite en el wok y fría los filetes a fuego medio hasta que estén crujientes.", "Retirar, colocar sobre la toalla de cocina y espolvorear con polvo de chaat masala.", "Para hacer la ensalada mezcle todos los ingredientes de la ensalada.", "Mezcle los ingredientes del aderezo y mezcle la ensalada con el aderezo.", "Sirve el pescado frito crujiente en la ensalada."], "url": "www_bbc_co_uk_food_recipes_masalamachchi_83901", "title": "Masala", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]