[{"ingredients": ["3 cucharadas de aceite de oliva", "12 mejillas de cerdo, recortadas", "1 chalote de plátano grande, finamente picado", "1 zanahoria grande, finamente picada", "2 palitos de apio, finamente cortados en cubitos", "2 dientes de ajo, finamente cortados en cubitos", "1 bouquet garni", "200ml / 7fl oz de vino tinto", "Jus de ternera 400ml / 14fl oz o carne de vacuno", "100 g / 3½ oz de mantequilla sin sal, cortada en cubitos", "1kg / 2lb 4 oz de papas esponjosas, preferiblemente el Rey Eduardo, cortadas en trozos", "150g / 5½oz de mantequilla sin sal", "150ml / 5fl oz de crema doble", "sal y pimienta negra recién molida", "4 zanahorias pequeñas, cortadas a la mitad en ángulo", "75g / 2¾oz de mantequilla", "2 cucharadas de azúcar en polvo", "2 manzanas Bramley, peladas, sin corazón y picadas", "50g / 1¾oz de mantequilla", "2-4 cucharadas de azúcar en polvo, al gusto", "50 g / 1¾oz de mantequilla sin sal", "cabeza de col rizada, hojas removidas y toscamente picadas"], "method": ["Precalentar el horno a 150 ° C / 130 ° Ventilador / Gas 2.", "Calentar un plato grande a prueba de horno en la placa, una vez caliente agregue el aceite de oliva. Freír las mejillas de los cerdos por lotes hasta que estén de color marrón dorado, apartadas. Agregue la chalota, las zanahorias, el apio y el ajo y cocine suavemente durante 3-4 minutos. Agregue el bouquet garni y devuelva las mejillas de cerdo al plato.", "Aumenta el fuego y agrega el vino tinto. Cocine hasta que el líquido se haya reducido a la mitad, luego agregue el jus de ternera. Transfiera el plato al horno y cocínelo durante 2-2½ horas, o hasta que las mejillas del cerdo estén tiernas.", "Retire del horno y cuele el líquido en una olla separada, mantenga las mejillas calientes. Reduzca la salsa a la mitad y luego agregue gradualmente la mantequilla en cubos hasta que tenga una salsa espesa. Coloque las mejillas en la salsa y caliente.", "Mientras tanto, para el puré de papas, poner las papas en una sartén con agua con sal, llevar a ebullición. Luego cocine a fuego lento durante 15 minutos, o hasta que estén tiernos. Drene y devuelva las papas a la sartén sobre el calor para eliminar el exceso de humedad. Mash bien, agregue la mantequilla y la crema y bata hasta obtener un puré suave. Condimentar con sal y pimienta.", "Para las zanahorias, ponga las zanahorias, la mantequilla, el azúcar y 200 ml / 7 fl oz de agua en un recipiente con tapa y deje hervir a fuego lento. Cubra y cocine suavemente durante 4-5 minutos, o hasta que las zanahorias estén tiernas. Condimentar con sal y pimienta.", "Para la salsa de manzana Bramley, ponga las manzanas, la mantequilla y 50 ml / 2 fl oz de agua en una olla con tapa, cubra y coloque a fuego medio. Cocine hasta que la manzana se haya descompuesto, esto debería tomar de 4 a 5 minutos. A continuación, bata con una cuchara para formar un puré, sazone con azúcar y sal al gusto.", "Para la col rizada con mantequilla, caliente la mantequilla en una sartén. Agregue las hojas de col rizada y 2 cucharadas de agua y cocine hasta que se marchiten.", "Para servir, ponga una cucharada de puré de papa en un tazón para servir, coloque las mejillas de los cerdos encima y cubra la salsa. Sirva las zanahorias, la col rizada y la salsa de manzana al lado."], "url": "www_bbc_co_uk_food_recipes_braised_pig_cheeks_with_47819", "title": "Mejillas de cerdo braseadas con puré de papa y salsa de manzana Bramley", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["25 g / 1 oz de hongos shiitake secos enteros", "1 cebolleta pequeña, cortada en rodajas finas, el resto cortado en longitudes de 4cm / 1½ pulgadas", "2 cucharadas de aceite vegetal", "Jengibre fresco de la raíz de los 5cm / 2in, pelado y cortado fino", "3 dientes de ajo, finamente picados", "1 estrella de anís", "1 pieza de corteza de cassia", "800g / 1lb 12 oz de vientre de cerdo (idealmente un corte de 5 capas - piel / grasa / carne / grasa / carne), cortado en cubos", "3 cucharadas de vino de arroz Shaoxing", "3 cucharadas de salsa de soja oscura", "1 cucharada de salsa de soja ligera", "2 cucharadas de azúcar en polvo"], "method": ["Remoje los champiñones en agua hirviendo durante 15 minutos.", "Caliente el aceite en una olla grande con tapa a fuego medio-alto. Freír las rebanadas de cebolleta con jengibre, ajo, anís estrellado y cassia durante 3-4 minutos, o hasta que estén fragantes.", "Agregue el cerdo y cocínelo hasta que empiece a dorarse. (Freír en tandas, si es necesario).", "Agregue el vino de arroz, las salsas de soja, el azúcar, los champiñones y su líquido de remojo y suficiente agua para cubrir el cerdo. Cubra la sartén y cocine a fuego lento durante 1½-2 horas, o hasta que el cerdo esté muy tierno y se deshaga.", "Retire la tapa, suba el fuego y cocine destapado a fuego alto durante 10-15 minutos hasta que el volumen de la salsa se reduzca a la mitad y sea espeso y almibarado.", "Ajuste el aderezo al gusto, espolvoréese con la cebolla en rodajas y sirva con arroz al vapor."], "url": "www_bbc_co_uk_food_recipes_braised_pork_belly_with_35944", "title": "Barriga de cerdo estofada con champiñones", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "1 conejo entero, incluidas las patas, unidas, en cubitos, incluido el hueso", "1 chile rojo, semillas retiradas y picadas", "2 dientes de ajo, en rodajas", "2 ramitas de romero, finamente picadas", "4 alcachofas para bebés, preparadas y en rodajas", "1 limón, ralladura y jugo", "300ml / 10fl oz de vino blanco", "400ml / 14fl oz de caldo de pollo", "2 cucharadas de aceite de oliva", "2 bulbos de hinojo, cortados y descuartizados", "2 cucharadas de perejil de flatleaf"], "method": ["Para el conejo, caliente una sartén grande y agregue el aceite. Una vez caliente, agregue el conejo y el sello en todos los lados hasta que estén dorados. Agregue el chile, el ajo y el romero y cocine durante 2 minutos. A continuación, agregue las alcachofas y la ralladura de limón y cocine por un minuto más.", "Agregue el vino y cocine hasta que se reduzca en volumen a la mitad. Agregue el caldo de pollo y cocínelo durante 30-40 minutos, o hasta que esté tierno. Termine con un poco de jugo de limón.", "Mientras tanto, para el hinojo tostado, precaliente el horno a 180C / 160C Fan / Gas 4.", "Calentar una sartén y agregar el aceite, una vez caliente agregar las cuñas de hinojo y cocinar a cada lado hasta que estén doradas. Asar en el horno durante 10-15 minutos, o hasta que estén blandos. Justo antes de servir agregue el hinojo al conejo y termine con el perejil fresco."], "url": "www_bbc_co_uk_food_recipes_braised_rabbit_with_62688", "title": "Conejo estofado con chile, ajo y alcachofas con hinojo asado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 x 1.5kg / 3lb 5 oz de conejo de granja (pídale a su carnicero que una el conejo en 2 patas, 2 hombros, con la silla y el estante cortados en 4. Mantenga los riñones intactos)", "2 cucharadas de mostaza Dijon", "1 cucharada de aceite de oliva, más extra para lloviznar", "1 cebolla, más o menos picada", "2 dientes de ajo, picados", "1 bombilla de hinojo grande, más o menos picada", "1 limón, solo jugo", "Pastillas de 250ml / 9fl oz", "4 rebanadas de ahumado ventreche o panceta", "sal marina y pimienta negra recién molida", "1 cucharada de tapas de hinojo picadas o eneldo fresco, para servir", "1 x 400 g de garbanzos cocidos en hojalata, escurridos", "2 dientes de ajo picados", "150ml / 5fl oz de aceite de oliva virgen extra"], "method": ["Precalentar el horno a 160C / 140C Fan / Gas 3.", "Coloque el conejo en un tazón grande y sofoque con la mostaza.", "Caliente el aceite en una sartén a prueba de horno y fría la cebolla, el ajo y el hinojo por 2 minutos. Agregue el conejo, jugo de limón y pastis y sazone con sal y pimienta. Coloque el ventreche en la parte superior.", "Cubra con una tapa hermética y hornee durante 1-1¼ horas. Deja enfriar por 15 minutos.", "Para hacer el puré de garbanzo, mezcle los garbanzos y el ajo en un procesador de alimentos y agregue gradualmente el aceite de oliva hasta que se forme un puré suave. Calentar en una olla.", "Transfiere el conejo a los tazones para servir. Rocíe con un poco de aceite de oliva y espolvoree sobre las tapas de hinojo. Coloque el ventreche cocido encima y sirva con el puré de garbanzo."], "url": "www_bbc_co_uk_food_recipes_braised_rabbit_with_63312", "title": "Conejo estofado con hinojo, puré de pastis y garbanzo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Espinilla de res de 4kg / 9lb, en el hueso", "sal marina y pimienta negra recién molida", "aceite de oliva, para freír", "2 zanahorias picadas", "1 cebolla picada", "1 tallo de apio, picado", "1 diente de ajo, aplastado", "Anís de 2 estrellas", "400ml / 14fl oz de vino tinto", "Puerto 100ml / 3½oz", "1 trotón de cerdo", "300ml / 10fl oz de caldo de carne", "425ml / 15fl oz de grasa", "4 cucharadas de salsa de soja oscura", "2 cucharadas de salsa de pescado", "1 kg / 2 lb 4 pastillas de chirivía, cortadas en cubos pequeños", "2 chalotes, finamente picados", "200ml / 7fl de leche en oz", "100 ml / 3½ fl oz crema", "2 hojas de laurel", "1 cucharada de aceite de oliva", "½ limón, solo jugo"], "method": ["Precaliente el horno a 190 ° C / 375 ° F / Gas 5. Recorte la mayor parte del exceso de grasa de la espinilla de res, dejando algo de color y sabor. Prepare la carne quitándola del hueso en las costuras y córtela en trozos grandes. Sazonar bien con sal marina y pimienta negra recién molida. Calentar un poco de aceite en una sartén y freír los trozos de carne hasta dorar por todos lados.", "Calienta un poco más de aceite en una cazuela a prueba de fuego de base pesada. Agregue las verduras y el anís estrellado y cocine brevemente hasta que las verduras estén suaves. Vierta el vino tinto y el puerto y burbujee hasta que el líquido se haya reducido a la mitad. Agregue la carne de res y el trotón de cerdo y cubra con el caldo. Llevar a ebullición, rozando cualquier espuma que se eleva a la superficie, luego agregue la salsa de soya, fuerte y salsa de pescado. Transfiera al horno y cocine por tres horas, o hasta que la carne esté muy tierna.", "Saque la cazuela del horno, retire la carne de la sartén y manténgala caliente. Colar el líquido de cocción, devolverlo a la sartén y llevarlo a ebullición. Deje que burbujee hasta que la salsa esté espesa, luego sazone con sal marina y pimienta negra recién molida. Quite el trotón de cerdo de la mezcla de carne y reserve la carne; es deliciosa sobre una tostada. Regrese la carne a la sartén y vuelva a ponerla en el horno por otros 30 minutos.", "Mientras tanto, prepara el puré de chirivía. Coloque las chirivías y chalotas en una olla con leche, crema y hojas de laurel y cúbralas con agua. Agregue el aceite de oliva y el jugo de limón y una buena pizca de sal y deje que hierva. Reduzca el fuego y cocine a fuego lento durante 15-20 minutos. Drene las verduras, reservando el líquido de cocción y deseche las hojas de laurel. Coloque las verduras en un procesador de alimentos y mezcle con suficiente líquido de cocción para hacer un puré con la consistencia de la crema batida. Sazonar con sal y pimienta blanca recién molida y mantener caliente.", "Coloque la carne en platos calientes y sirva con puré de chirivía."], "url": "www_bbc_co_uk_food_recipes_braised_shin_of_beef_43227", "title": "Espina de vaca estofada con puré de chirivía", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 8-10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 filetes estofados (aproximadamente 200 g / 7 oz cada uno)", "3 cucharadas de aceite de girasol", "1 cebolla mediana, cortada a la mitad y cortada en 12 cuñas", "1 diente de ajo, aplastado", "500ml / 18fl oz de caldo de res hecho con 1 caldo de carne de vacuno, o 500ml / 18fl oz de caldo de res fresco", "1 cucharada de puré de tomate", "1 cucharada de tomillo fresco picado, o ½ cucharadita de tomillo seco", "1 hoja de laurel", "1 cucharada de harina de maíz", "½ cucharadita de mostaza en polvo inglesa", "sal y pimienta negra recién molida", "Chips caseros, (ver receta en el enlace)"], "method": ["Precalentar el horno a 170 C / 325 F / Gas 3.", "Cortar cualquier grasa dura de la carne y sazonar a ambos lados con sal y mucha pimienta negra recién molida.", "Caliente una cucharada de aceite en una sartén antiadherente grande.", "Freír los filetes, de dos en dos, a fuego medio-alto durante unos minutos a cada lado, o hasta que estén dorados, luego transfiéralos a una cazuela grande a prueba de llamas. Agregue un poco más de aceite a la sartén si es necesario.", "Regrese la sartén a la placa y reduzca el fuego. Agregue el aceite restante y fríe con cuidado la cebolla durante cinco minutos, o hasta que esté suave y ligeramente dorado, revolviendo regularmente.", "Agregue el ajo, cocine por un minuto más, luego transfiera la cebolla y el ajo a la cazuela.", "Vierta sobre el caldo y agregue el puré de tomate, el tomillo y la hoja de laurel.", "Llevar a ebullición, luego cubrir la cazuela y transferir cuidadosamente al horno. Cocine por 1¼-1½ horas, o hasta que la carne esté tierna.", "Mezcle la harina de maíz y el polvo de mostaza en un tazón pequeño y agregue una cucharada de agua fría hasta que quede suave. Retire la tapa de la cazuela y agregue la mezcla de harina de maíz. Sazone al gusto con sal y pimienta negra recién molida.", "Coloque la cazuela a fuego medio-alto y cocine a fuego lento durante 2 o 3 minutos, o hasta que la salsa se reduzca y se espese y sature, revolviendo regularmente.", "Transfiera los filetes a cuatro platos calientes y espolvoree la salsa. Servir con patatas fritas"], "url": "www_bbc_co_uk_food_recipes_braised_steak_with_gravy_24508", "title": "Filete estofado con salsa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/braised_steak_with_gravy_24508_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 mazorcas de maíz dulce, sin cáscara", "4 coronas de palomas de madera", "sal y pimienta", "2 cucharadas de aceite vegetal", "20 cebollas baby, peladas", "1 zanahoria, cortada en tiras", "2 lonchas de tocino rayado ahumado, picado", "300 ml / 10 fl oz de maíz dulce (desde arriba)", "100 g / 3½oz de granos de maíz dulce cocinados (del caldo de maíz dulce)", "50g / 1¾oz de mantequilla"], "method": ["Para el caldo de maíz dulce, precaliente el horno a 200C / 400F / Gas 6.", "Coloque el maíz dulce en una bandeja para hornear y cocine en el horno durante 20 minutos. Dejar de lado para enfriar.", "Cuando el maíz dulce se haya enfriado, coloque las mazorcas en posición vertical sobre una tabla de cortar y corte lo más cerca posible del núcleo para eliminar los granos. Ponga a un lado los granos y corte los núcleos del maíz dulce por la mitad y colóquelos en una cacerola grande. Cúbralos con el agua y llévelos a ebullición. Cocine a fuego lento durante 20 minutos, luego cuele en una jarra y reserve, reservando tanto el caldo como los granos.", "Para palomitas de maíz y palomitas de maíz estofadas, reduzca la temperatura del horno a 160 ° C / 320 ° F / Gas 3.", "Sazonar la paloma de madera con sal y pimienta y calentar una sartén grande.", "Cuando la sartén esté caliente, agregue una cucharada de aceite y coloque las palomas en la sartén caliente. Cocinado hasta que esté coloreado por completo, y luego colócalos en el horno durante 10-12 minutos. Las palomas se hacen cuando la parte más gruesa del muslo se perfora con un pincho y los jugos corren limpios.", "Cuando estén cocidos, coloque las palomas en un plato, cúbralas y déjelas reposar durante 10-12 minutos.", "Ponga a hervir una olla de agua y blanquee las cebollas y las zanahorias durante 2-3 minutos. Escurrir y refrescar en agua helada. Retire las cebollas y las zanahorias y coloque en un plato forrado con rollo de cocina.", "Caliente una sartén grande y agregue la cucharada restante de aceite. Una vez caliente, agregue el tocino y cocine hasta que esté crujiente y dorado. Agregue las cebollas y cocine por otros dos minutos.", "Cubra el tocino y las cebollas con el caldo de maíz dulce y deje que hierva. Agregue los granos de maíz dulce y las zanahorias y cocine a fuego lento durante cinco minutos.", "Agregue la mantequilla, sazone con sal y pimienta y reserve en un lugar cálido mientras retira la carne de paloma del cadáver.", "Para servir, vierta la sopa de maíz dulce y tocino en un tazón grande y coloque la carne de paloma en la parte superior."], "url": "www_bbc_co_uk_food_recipes_braised_sweetcorn_and_80968", "title": "Palomitas de maiz y Palomitas de Maíz", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["8 lonchas de tocino ahumado rayado", "1 cucharada de aceite ligero de colza", "100g / 3½oz de mantequilla sin sal", "20 chalotas pequeñas, peladas y dejadas enteras", "12 dientes de ajo, pelados y dejados enteros", "1 ramita de romero", "100ml / 3½fl oz de vinagre de vino tinto", "750ml / 26fl oz de cerveza", "500ml / 18fl oz de caldo de pescado", "1 x 1.5kg / 3lb 5 oz de rodaballo, aletas recortadas, divididas en el centro y cortadas en filetes con el hueso adentro", "Guisantes 200g / 7oz frescos o congelados", "3 cucharadas de perejil de hojaldre fresco picado, más extra para adornar", "sal y pimienta negra recién molida"], "method": ["Caliente la parrilla y cocine el tocino hasta que esté crujiente. Poner a un lado para enfriar y luego cortar en trozos pequeños.", "Para hacer el líquido de cocción, caliente una sartén grande y agregue el aceite y 75 g / 2½ oz de la mantequilla.", "Cuando el aceite esté caliente, agrega los chalotes y el ajo. Cocine por cuatro minutos y luego agregue el romero y cocine por otros dos minutos para que el ajo y los chalotes comiencen a colorear.", "Agregue el vinagre y cocine hasta reducir su volumen a casi nada.", "Agregue la cerveza y reduzca el volumen nuevamente a la mitad de la cantidad.", "Agregue el caldo de pescado y lleve a ebullición. Elimine cualquier impureza que llegue a la parte superior y cocine a fuego lento durante cinco minutos.", "Para cocinar el pescado, coloque las porciones en el licor de cerveza y cubra con papel de aluminio, con la lámina tocando la superficie del líquido. Cocine a fuego lento durante 12 minutos. Retire la lámina y con cuidado gire el pescado y agregue los guisantes y el perejil. Cocine por un minuto y quite del fuego.", "Caliente un plato grande para servir, luego retire cuidadosamente el pescado de la cerveza y colóquelo en el plato.", "Calentar el licor de cocción y batir con la mantequilla restante de 25 g / 1 oz. Sazone al gusto con sal y pimienta.", "Para servir, espolvoree un poco de licor sobre el pescado y espolvoree sobre el tocino crujiente y un poco más de perejil."], "url": "www_bbc_co_uk_food_recipes_braised_turbot_in_beer_52606", "title": "Rodaballo estofado en cerveza con tocino, chalotes y guisantes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 dientes de ajo, aplastados", "2 cucharaditas de raíz de cilantro picada", "2 cucharaditas de salsa de soja ligera", "1 cucharadita de azúcar", "4 cucharadas de aceite de cacahuete", "1 cucharadita de aceite de sésamo", "1 paquete de tofu firme (cuajada de frijoles), cortado por la mitad horizontalmente, luego cada pieza cortada en 8 triángulos (16 triángulos en total)", "6 cucharadas de aceite de cacahuete", "150ml / 5fl oz de caldo de verduras", "2 cucharadas de salsa de soja ligera", "1 cucharada de puré de tomate", "1 cucharada de arroz o vinagre de vino blanco", "1 flecha arribada tsp colmada", "1 cucharadita de pimienta negra molida", "2 cucharaditas de aceite de sésamo", "Para Decorar:", "½ pepino, cortado a la mitad y en rodajas finas", "4 cebollas de primavera, ralladas"], "method": ["Para hacer el adobo, moler todos los ingredientes en una maja y mortero para formar una pasta.", "Coloque los triángulos beancurd en un plato plano y cubra con el adobo. Dejar actuar durante al menos 30 minutos (o durante la noche).", "Caliente el aceite y fría el frijol marinado hasta dorarlo por ambos lados. Retire de la sartén y escurra sobre papel de cocina.", "Elimine todo el exceso de aceite que quede en la sartén, luego coloque el caldo de verduras, la salsa de soja, el puré de tomate y el vinagre en la sartén junto con el arrurruz que debe hacerse en pasta con un poco de agua. Llevar a ebullición, revolviendo para espesar, y devolver el beancurd a la sartén para que se caliente.", "Retire la sartén del fuego y agregue la pimienta negra y el aceite de sésamo.", "Transfiera a un plato de servir y decore con pepino y cebolletas."], "url": "www_bbc_co_uk_food_recipes_braisedbeancurdwithg_8815", "title": "Cuajada de frijol estofado con ajo y pimienta", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Costillas cortas de carne de 2 kg / 4 lb 6 oz cortadas a través del hueso hasta 10 cm de largo", "sal y pimienta negra recién molida", "2 cucharadas de harina", "2 cebollas, peladas, más o menos picadas", "2 palitos de apio, más o menos picados", "1 zanahoria, pelada, más o menos picada", "1 cucharadita de puré de tomate", "330ml / 11½ fl oz de cerveza Innis y Gunn, o botella de cerveza o cerveza similar", "2 litros / 3½ pintas de caldo de carne", "1 hoja de laurel", "algunas ramitas de tomillo fresco", "3 dientes de ajo, pelados, más o menos picados", "5 granos de pimienta negra", "6-8 palitos de salsifí, pelados, cortados en ángulo en piezas de 2.5cm / 1 in", "sal y pimienta negra recién molida", "25g / 1oz de mantequilla", "1 cucharada de perejil fresco picado", "Nabos o colinabos de 400g / 14oz, pelados, cortados en trozos", "50g / 2oz de mantequilla", "sal y pimienta negra recién molida"], "method": ["Para las costillas, precaliente el horno a 220C / 430F / Gas 7.", "Sazonar las costillas de ternera con sal y pimienta negra recién molida y polvo con la mitad de la harina. Colóquelos en una bandeja de asar con cebolla, apio y zanahoria y tueste en el horno durante 30-40 minutos, volteándolos de vez en cuando, hasta que estén dorados.", "Cuando esté cocido, transfiera las verduras y las costillas a una cacerola de fondo grueso, dejando la grasa y los jugos detrás, y déjelos a un lado.", "Coloque la bandeja de tostado con la grasa y los jugos a fuego lento. Agregue la harina restante y el puré de tomate y cocine por un minuto, revolviendo. Poco a poco agregue la cerveza y el caldo de carne, revolviendo bien para evitar la formación de grumos. Llevar a ebullición.", "Vierta la salsa de cerveza en la sartén con las costillas y las verduras y coloque a fuego medio. Agregue la hoja de laurel, el tomillo, el ajo y los granos de pimienta. Sazonar con sal y pimienta negra recién molida y cubrir. Llevar a ebullición, luego baje el fuego y cocine a fuego lento durante 1½-2 horas, o hasta que la carne esté tierna: debe estar casi cayendo del hueso sin ser demasiado suave.", "Retire las costillas y verduras con una cuchara ranurada, descartando las verduras. Continúe hirviendo a fuego lento la salsa hasta que se reduzca y se espese a una consistencia rica en salsa. Puedes agregar un poco de harina de maíz mezclada en agua si no es lo suficientemente espesa.", "Para el salsifí, coloca el salsifí en una olla con agua con sal y lleva a ebullición. Baje el fuego y cocine a fuego lento durante 6-8 minutos, hasta que estén tiernos.", "Escurra y mezcle la mantequilla y el perejil y sazone con sal y pimienta negra recién molida al gusto.", "Para los neeps aplastados, coloque los nabos o el colinabo en una olla de agua y deje que hierva. Reduzca el fuego y cocine a fuego lento durante 10-15 minutos, hasta que estén tiernos.", "Drene y regrese a la sartén. Agrega la mantequilla. Aplaste los nabos en un puré con un machacador de papas y sazone con sal y pimienta negra recién molida.", "Para servir, recaliente las costillas en la salsa. Sirva con una cucharada de neeps, el salsifí y una generosa cucharada de salsa."], "url": "www_bbc_co_uk_food_recipes_braisedbeefshortribs_85339", "title": "Costillas de ternera estofadas con salsifí y pechugas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["800 g / 1¾ lb de ternera o hombro redondo", "20ml / ¾fl oz de aceite", "Mirepoix 100 g / 3½ oz - ver abajo", "Guarniciones del tocino 60g / 2oz, blanqueadas", "1 diente de ajo, con la piel puesta", "200g / 7oz de tomates frescos, cortados en cuartos", "sal pimienta", "500ml / 17fl oz de vino tinto", "500ml / 17fl oz brown stock", "un poco de harina de maíz", "zanahorias, puerro bebé, cebollas perla", "comer todo, blanqueado", "champiñones", "1 zanahoria", "tomillo fresco", "romero fresco", "1 cebolla pequeña", "1 palo de apio", "1 cucharada de puré de tomate"], "method": ["Sasona la carne con sal y pimienta.", "Brown la carne en aceite. Retire la carne de la sartén.", "Agregue los ingredientes mirepoix a la sartén junto con el tocino, el ajo, los tomates y el puré a la sartén. Cocine hasta que se ablande.", "Agregue el caldo marrón a la sartén y revuelva. Reduzca el líquido hasta que tenga una consistencia almibarada.", "Devuelve la carne a la sartén. Desglasar la carne con el vino o el adobo.", "Cubra la sartén y cocine la carne hasta que esté tierno 180C / 350F / Gas 4 por aproximadamente 1½ horas, volteándola de vez en cuando.", "Retire la carne de la sartén. Reduzca la salsa y, si es necesario, úntela con almidón de maíz.", "Cuela la salsa y rocía la grasa. Sazone al gusto agregando un poco más de caldo marrón.", "Coloque la carne en un plato para servir. Vierta una pequeña cantidad de salsa sobre la carne esculpida antes de servir.", "Adorne con las zanahorias blanqueadas, puerro bebé, cebollas perla, salsa de sarna, champiñones fritos en un poco de mantequilla con el tocino restante."], "url": "www_bbc_co_uk_food_recipes_braisedbeef_10377", "title": "Estofado de ternera", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "2kg / 4lb 4oz cortas costillas de ternera", "2 zanahorias, peladas, cortadas en pedazos", "1 cebolla grande, pelada, rebanada gruesa", "5 dientes de ajo, pelados", "2-3 ramitas de tomillo fresco", "400g / 14oz de tomates picados enlatados", "350ml / 12fl oz de vino tinto", "200ml / 7fl oz de caldo de carne", "sal y pimienta negra recién molida", "Patatas de 2 kg / 4 lb 4 oz, peladas, cortadas en trozos grandes", "110g / 4oz de mantequilla", "200ml / 7fl de leche en oz", "2-4 cucharaditas de rábano picante batido", "sal y pimienta negra recién molida"], "method": ["Para las costillas, precaliente el horno a 170 C / 325 F / Gas 3.", "Caliente el aceite en una bandeja grande para asar a fuego medio a alto. Agregue las costillas de ternera y fría, volteándolas regularmente, hasta que se doren por todos lados.", "Agregue las zanahorias, la cebolla y el ajo y revuelva hasta que se cubra con los jugos de aceite y sartén.", "Agregue las ramitas de tomillo, luego vierta los tomates picados, el vino tinto y el caldo de carne y mezcle bien para combinar. Ponga la mezcla a ebullición, luego transfiera al horno y cocine, sin tapar, durante 2-2½ horas, o hasta que la salsa se espese y la carne se caiga de los huesos. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Mientras tanto, para el puré de rábano picante, hierva las papas en una sartén de agua con sal durante 15-18 minutos, o hasta que estén tiernas. Escurrir bien y luego regresar a la sartén.", "Regrese la sartén al fuego por unos segundos para eliminar el exceso de humedad y luego retírela del fuego. Aplaste las papas hasta que estén suaves usando un triturador de papas o ricer, luego bata la mantequilla y la leche con una cuchara de madera.", "Agregue el rábano picante a la crema hasta que esté bien combinado, luego condimente, al gusto, con sal y pimienta negra recién molida.", "Para servir, divida las costillas de ternera por igual entre cuatro platos para servir. Cuchara sobre las verduras cocidas y la salsa. Coloque una cucharada de puré junto a cada porción."], "url": "www_bbc_co_uk_food_recipes_braisedbeefshortribs_93391", "title": "Costillas cortas de res a la brasa con puré de rábano picante", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 naranja, pelar solo", "10 bayas de enebro", "1 estrella de anís", "10g / ½ oz de granos de pimienta", "5cm / 2½in pieza de jengibre, pelar solo", "1 x 1kg / 2¼lb pieza de cerdo de vientre", "1 cebolla, cortada a la mitad, cada mitad tachonada con 3 dientes", "6 chalotes, pelados", "4 zanahorias, cortadas por la mitad a lo largo", "8 dientes de ajo, pelados", "2 puerros grandes, cortados en trozos de 5cm / 2in", "1 cucharadita de caldo de pollo", "1 litro / 1¾pt de caldo de pollo", "1 bouquet garni (tallos de perejil, tomillo, laurel y apio con puerros)", "3litres / 5¼pt de agua"], "method": ["Envuelva la cáscara de naranja, las bayas de enebro, el anís estrellado, los granos de pimienta y la piel de jengibre en un trozo de tela de muselina y asegúrelos con una cuerda.", "Coloque el paquete de muselina y el resto de los ingredientes en una cacerola con agua y deje que hierva, luego reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento y cocine por 2-3 horas. Retirar del fuego y reservar para enfriar.", "Una vez que esté frío, retire la barriga de cerdo del líquido de cocción y colóquela en una tabla de cortar.", "Retire el exceso de grasa y corte en rodajas.", "Cuele la mezcla restante a través de un tamiz, reservando el líquido y las verduras.", "Corte las verduras en trozos más pequeños y vuelva a colocarlas en el líquido colado junto con el vientre rebanado de carne de cerdo.", "Sirva con papas nuevas trituradas."], "url": "www_bbc_co_uk_food_recipes_braisedbellyofpork_11369", "title": "Barriga estofada de cerdo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite vegetal", "2 patatas Shetland, cortadas en cubos de 1cm", "Col de Saboya 200g / 7oz, rallada", "3 ramitas de tomillo fresco", "puñado de cilantro fresco", "1 limón, solo jugo"], "method": ["Calentar el aceite en una sartén. Agregue la papa y cocine por seis minutos, hasta que esté dorada y suave.", "Agregue el repollo savoy y las ramitas de tomillo y saltee durante otros cuatro minutos.", "Agregue el cilantro y el jugo de limón y remueva suavemente.", "Para servir, coloque en un tazón grande."], "url": "www_bbc_co_uk_food_recipes_braisedcabbagewithsh_79107", "title": "Repollo estofado con patatas negras Shetland", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["8 alitas de pollo, sin puntas", "sal y pimienta negra recién molida", "50g / 2oz de mantequilla", "1 cebolla pequeña, pelada, finamente picada", "1 zanahoria mediana, pelada, cortada en dados pequeños", "1 apio, cortado en dados pequeños", "110ml / 4fl oz de vino blanco", "500ml / 18fl oz de caldo de pollo", "1 cucharadita de hojas frescas de tomillo", "Avellanas 50 g / 2 oz, tostadas, finamente picadas", "2 cucharaditas de aceite de oliva", "8 vieiras medianas", "1 limón, solo jugo", "sal"], "method": ["Para las alitas de pollo estofadas, sazone las alitas de pollo, al gusto, con sal y pimienta negra recién molida.", "Caliente la mantequilla en una sartén hasta que haga espuma y fríe las alitas de pollo con la piel hacia abajo durante 2-3 minutos o hasta que estén doradas. Retire de la sartén y reserve.", "Agregue la cebolla, la zanahoria y el apio a la sartén y fría por 2-3 minutos, o hasta que se ablanden.", "Verter el vino blanco, llevar la mezcla a ebullición y cocinar hasta que el volumen del líquido se haya reducido a la mitad.", "Regrese las alitas de pollo a la sartén, vierta sobre el caldo de pollo y deje que hierva. Reduzca el fuego y cocine a fuego lento durante 30-40 minutos. Retire la sartén del fuego y déjela enfriar.", "Una vez que se haya enfriado, retire las alitas de pollo de la sartén, retire los huesos de las alas y enfríe la carne en la nevera.", "Para las vieiras, calentar el aceite de oliva en una sartén y freír las vieiras durante 1 minuto, luego con cuidado voltee las vieiras y freír durante 30 segundos. Retire las vieiras de la sartén y sazone al gusto, con jugo de limón y sal.", "Agregue las alitas de pollo a la sartén y fría por 2-3 minutos o hasta que la piel esté crujiente.", "Para servir, recaliente las verduras y el caldo y agregue el tomillo y las avellanas.", "Coloque 2 alitas de pollo y 2 vieiras en cada uno de los 4 tazones para servir y una cucharada del caldo y las verduras."], "url": "www_bbc_co_uk_food_recipes_braisedchickenwingsa_93748", "title": "Alitas de pollo estofadas y vieiras con avellanas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Por aproximadamente 1 litro de salsa:", "170 g / 6 oz de castañas secas, empapadas en agua fría durante la noche", "85 g / 3 oz de zanahorias, cortadas por la mitad", "85g / 3oz de apio, cortado por la mitad", "85 g / 3oz de puerros, cortados por la mitad", "1 cebolla pequeña, pelada y cortada a la mitad", "1 cucharadita de ajo machacado", "2 hojas de laurel", "2 dientes", "1 cucharadita de bayas de enebro", "1 cucharadita de pimienta negra", "ramita de tomillo fresco", "ramita de perejil fresco", "2 cucharadas de mantequilla o aceite de girasol", "570ml / 1 pinta de agua", "570 ml / 1 pinta de vino tinto", "2 cucharaditas de extracto de levadura", "2 cucharadas de harina de maíz", "1 cucharada de puré de tomate"], "method": ["Escurra y enjuague las castañas, quite las pieles sueltas y deseche las castañas con agujeros sospechosos.", "Coloque castañas, zanahoria, apio, puerro, cebolla, ajo, especias sueltas y mantequilla / aceite en una olla de 1,5 litros / 3 pinta de capacidad. Freír juntos hasta que la mezcla comience a dorarse. Agregue agua y vino, lleve a ebullición y cocine a fuego lento con la tapa puesta durante 90 minutos. Las castañas deben ser tiernas pero no desmoronarse.", "Cuele el caldo en una sartén limpia, saque las castañas de las verduras y guárdelas como guarnición. Deseche la mezcla vegetal restante.", "Mezcle el extracto de levadura, la harina de maíz y el puré de tomate hasta obtener una pasta con 4 cucharadas de agua fría y mezcle con el caldo de castaña caliente. Llevar a ebullición revolviendo con frecuencia, cocine a fuego lento durante 5 minutos hasta que espese.", "Sirve con un asado de nueces."], "url": "www_bbc_co_uk_food_recipes_braisedchestnutsinre_8862", "title": "Castañas estofadas en salsa de vino tinto", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "Pollo de 1,6 kg / 3 lb 8 oz, cortado en 8 piezas", "1 cebolla roja, en rodajas", "12 dientes de ajo, pelados pero dejados enteros", "1 limón, cortado en trozos", "175ml / 6fl oz de caldo de pollo", "125g / 4½ oz de miel", "pequeñas hojas frescas de orégano", "Garbanzos de hojalata de 400g / 14oz, enjuagados y escurridos", "150g / 5oz de queso feta, desmenuzado", "pequeño puñado de perejil fresco de flatleaf", "2 pepinos libaneses, picados", "1 pimiento verde, el centro y las semillas eliminadas, picadas", "50g / 2oz de aceitunas negras, picadas y partidas por la mitad", "3 cucharadas de aceite de oliva", "1 cucharada de jugo de limón", "sal marina", "pimienta negra recién molida"], "method": ["Para el pollo, caliente una sartén grande a fuego alto, agregue el aceite y el pollo y cocine durante cinco minutos hasta que estén dorados.", "Eliminar y reservar.", "Reduzca el fuego a medio-alto, agregue la cebolla y cocine por un minuto.", "Agregue el ajo y cocine por un minuto.", "Regrese el pollo a la sartén con el limón, el caldo de pollo y la miel, reduzca el fuego, cubra la sartén y cocine a fuego lento durante 20 minutos o hasta que el pollo esté bien cocido.", "Levanta el pollo y pon en una bandeja para hornear.", "Aumente el calor debajo de la salsa, y cocine a fuego lento, destapado por otros 15 minutos para espesar.", "Coloque el pollo debajo de una parrilla caliente durante cinco minutos hasta que quede crujiente.", "Coloque el pollo en un plato, rocíe con la salsa y espolvoree con orégano.", "Para la ensalada, mezcle suavemente los garbanzos, el queso feta, el perejil, el pepino, el pimiento verde y las aceitunas en un tazón grande.", "Batir el aceite de oliva y el jugo de limón y sazonar con sal y pimienta.", "Mezcle el aderezo con la ensalada.", "Servir."], "url": "www_bbc_co_uk_food_recipes_braisedchickenwithle_83777", "title": "Estofado de limón y miel de pollo con ensalada de queso feta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite vegetal", "4 asas de cordero, recortadas de cualquier exceso de grasa", "2 cucharadas de cebada perlada", "300 ml / 10 fl oz de caldo de cordero (o agua)", "1 ramita de tomillo fresco", "½ cucharadita de tomillo seco", "1 ramita de perejil fresco", "1 cucharadita de sal", "150g / 6oz de zanahorias, aproximadamente picadas", "1 puerro grande, cortado en ocho piezas iguales", "4 papas pequeñas, peladas, descuartizadas", "2 cebollas pequeñas, descuartizadas", "sal y pimienta negra recién molida", "4 cucharadas colmadas de hojas de perejil, blanqueadas y refrescadas en agua fría"], "method": ["Precalentar el horno a 160 ° C / 325 ° F / Gas 3.", "Caliente el aceite en una sartén grande a fuego alto. Agregue las espigas de cordero y fría, volteándolas ocasionalmente, hasta que estén doradas por todos lados.", "Transfiera las cañas de cordero a una cazuela a prueba de llamas grande o una cacerola a prueba de horno con una tapa, y agregue la cebada, el caldo o el agua, las hierbas y la sal. Cubra bien con papel de aluminio y luego con la tapa, y cocine en el horno durante 1 hora y media.", "Retire la cazuela del horno, agregue las verduras y un poco más de agua si es necesario. Sazonar, al gusto, con sal y pimienta negra recién molida, luego volver a tapar la cazuela y volver a ponerla en el horno durante otra hora.", "Retire la cazuela del horno y verifique que el cordero esté húmedo y casi caiga del hueso. Si crees que no está listo, devuélvelo al horno por otros 15 minutos y verifica nuevamente.", "Transfiera las espigas de cordero de la olla a un plato de servir calentado y cubra con papel de cocina mientras termina las verduras estofadas.", "Coloque la cazuela a fuego medio y deje hervir el líquido. Reduzca el fuego y cocine a fuego lento. Agregue más agua si es necesario para proporcionar una buena salsa.", "Agregue las hojas de perejil escaldadas y sazone al gusto con sal y pimienta negra recién molida.", "Para servir, coloque las verduras estofadas sobre placas calentadas y coloque una espiga en la parte superior de cada porción."], "url": "www_bbc_co_uk_food_recipes_braisedlambshankswit_88343", "title": "Estofado de corderos con cebada perlada y tubérculos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 corderos", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "350ml / 12fl oz de vino tinto", "1 cebolla, cortada en cuartos", "1 cabeza de ajo, cortado por la mitad horizontalmente", "2 ramitas de romero fresco", "5 filetes de anchoa", "1 litro / 1¾ pintas de caldo de carne caliente", "50g / 2oz de mantequilla", "75g / 3oz de mantequilla", "1 cebolla, finamente picada", "1 diente de ajo, finamente picado", "1 cucharadita de Romero fresco picado", "4 tomates, pieles y semillas retiradas, picadas", "400g / 14oz de frijoles flageolet enlatados, escurridos y enjuagados", "3 cucharadas de perejil de flatleaf fresco picado"], "method": ["Para las patas de cordero, precaliente el horno a 150C / 300F / Gas 2.", "Sazone las espigas de cordero con sal y pimienta negra recién molida.", "Caliente el aceite en una cazuela grande a fuego medio. Cuando el aceite esté caliente, agregue las espigas de cordero y fría en todos los lados hasta que se dore por todas partes.", "Agregue el vino tinto y cocine a fuego lento. Continúe cocinando a fuego lento hasta que el volumen de líquido se haya reducido en un tercio.", "Agregue los filetes de cebolla, ajo, romero y anchoa y revuelva bien para combinar.", "Agregue suficiente caldo de carne caliente para cubrir el cordero (los huesos deben sobresalir de la superficie del líquido). Regrese la mezcla a fuego lento.", "Transfiera la cazuela al horno y cocínela, destapada, durante tres horas, y déle la vuelta a los corderos ocasionalmente (aproximadamente una vez cada 45 minutos).", "Mientras tanto, para los frijoles flageolet, caliente la mitad de la mantequilla en una sartén a fuego medio. Cuando la mantequilla esté espumosa, agregue la cebolla, el ajo y el romero y fría por 2-3 minutos, o hasta que se suavice.", "Agregue los tomates y cocine por otros 2-3 minutos, o hasta que se hayan descompuesto levemente.", "Agregue los frijoles flageolet escurridos y revuelva hasta que se caliente. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Agregue la mantequilla restante y revuelva hasta que la mantequilla se derrita. Agregue el perejil y mezcle bien para combinar.", "Cuando las espigas de cordero estén cocidas, retírelas del líquido de cocción y déjelas a un lado sobre un plato tibio.", "Vuelva a colocar la cazuela en la cocina y deje que hierva el líquido de cocción. Hierva durante 4-5 minutos, o hasta que se haya reducido ligeramente.", "Cuele el líquido de cocción reducido a través de un colador fino en una olla limpia, luego sazone, al gusto, con sal y pimienta negra recién molida. Agregue la mantequilla y bata hasta que se derrita y la salsa esté brillante.", "Para servir, divida los frijoles flageolet por igual entre cuatro platos para servir. Coloque una pierna de cordero encima de cada uno. Rocíe la salsa reducida sobre y alrededor de las patas de cordero."], "url": "www_bbc_co_uk_food_recipes_braisedlambshankswit_91429", "title": "Estofado de cordero con frijoles flagelados", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 filetes de solla", "sal y pimienta negra recién molida", "2 tallos de limoncillo", "2 chalotes, picados", "2 dientes de ajo, ligeramente triturados", "2 tomates", "50g / 2oz de mantequilla", "110ml / 4fl oz de vino blanco", "175ml / 6fl oz de caldo de pescado", "Crema doble de 110 ml / 4 fl oz, ligeramente batida", "2 ramitas de estragón fresco, solo hojas, más o menos picadas", "300 g / 10 oz espinaca bebé"], "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Sazone la solla con sal y pimienta negra recién molida, luego enrolle como cigarros. Corta uno de los tallos de limoncillo longitudinalmente en cuatro para crear pinchos y empuja un pincho a través de cada rollo de solla para asegurarlo.", "Unte con mantequilla un plato pequeño a prueba de horno y agregue los chalotes y el ajo.", "Blanquee los tomates por un minuto en agua hirviendo, luego quite los hollejos y córtelos en cuartos. Reserve las pieles.", "Desmenuce los tomates y coloque las semillas y la piel en el plato con mantequilla con los chalotes y el ajo.", "Cortar los cuartos de tomate en cubos muy pequeños y reservarlos.", "Caliente una sartén hasta que esté caliente y agregue la mitad de la mantequilla y todos los rollos de solomillo. Cocine por un minuto en cada lado, hasta que quede dorado. Coloque los rollos de platija en el plato y vierta sobre el vino blanco y caldo de pescado.", "Cubra el plato con papel de cocina y colóquelo en el horno durante 7-10 minutos, hasta que el pescado esté recién cocido.", "Retire del horno y retire la solla del plato y reserve en un lugar cálido.", "Vierta el líquido de cocción del plato a través de un colador en una sartén limpia. Cocine a fuego lento hasta que se reduzca en volumen a la mitad.", "Agregue las rodajas de tomate reservadas, la crema batida, el estragón y el tallo restante de limoncillo y caliente. Sazonar con sal y pimienta negra recién molida.", "Calentar una sartén por separado hasta que esté caliente. Agregue la mantequilla restante y todas las espinacas y cocine hasta que la espinaca se haya marchitado.", "Para servir, coloca una cucharada de espinaca en el centro de cada una de las dos placas. Cubra cada uno con dos rollos de solla y cuchara sobre la salsa."], "url": "www_bbc_co_uk_food_recipes_braisedlemongrassske_89243", "title": "Plato de solomillo al curry estofado con salsa cremosa de tomate y estragón y espinacas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]