[{"isVegetarian": true, "title": "Chocolate and chilli buns", "url": "www_bbc_co_uk_food_recipes_chocolate_and_chilli_25191", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp strong white bread flour", "150ml/5fl oz water", "275g/9¾oz strong white bread flour", "2 tbsp custard powder", "70g/2½oz cocoa powder", "5 tsp chilli powder", "55g/2oz caster sugar", "¾ tsp salt", "1 sachet instant dried yeast", "3 free-range eggs, lightly beaten", "40g/1½oz butter, softened", "1 large fresh red chilli, seeds removed and finely chopped", "about 225ml/8fl oz lukewarm water", "200g/7oz good quality chocolate chips", "1 free-range egg, beaten", "1 tbsp water", "2 large fresh red chillies, seeds removed and sliced"], "serves": "Makes 12", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["To make the roux, mix the flour and water in a small saucepan. Cook over a low to medium heat until it starts to thicken, then continue to cook for one more minute, then remove from the heat. Cover the paste with cling film and leave until it has cooled to room temperature.", "To make the dough, sift the dry ingredients into a large bowl. Stir in the yeast then add the beaten eggs, softened butter, chopped chilli and the roux mixture. Gradually add enough lukewarm water to form a soft dough then turn it out onto a floured board and knead for 10 minutes.", "Form the dough into a ball, place it in an oiled bowl and cover with cling film. Set it aside to rise in a warm place until it has doubled in size.", "Turn the dough onto a floured board, knock it back then knead in the chocolate chips and divide into 12 portions. Form the dough into balls, place on a greased baking sheet and set aside to rise for 20 minutes.", "Preheat the oven to 190C/375F/Gas 5. To glaze the buns, mix the egg with the water, brush onto the buns and scatter over the sliced chillies. Bake in the oven for about 12 minutes."]}, {"isVegetarian": true, "title": "Chocolate and coffee fondant fancies", "url": "www_bbc_co_uk_food_recipes_chocolate_and_coffee_11819", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_and_coffee_11819_16x9.jpg", "ingredients": ["5 free-range eggs", "165g/5¾oz caster sugar", "5 tsp coffee extract (or 2 tsp instant espresso powder dissolved in 25ml/1fl oz boiling water, cooled)", "150g/5½oz plain flour", "10g/½oz cocoa powder", "40g/1½oz unsalted butter, melted", "190g/6½oz unsalted butter, softened", "375g/13oz icing sugar, sifted", "2 tbsp Irish cream liqueur", "90g/3¼oz dark chocolate (70% cocoa solids)", "720g/1lb 9½oz icing sugar, sifted", "40g/1½oz glucose syrup", "50g/1¾ oz white chocolate, melted (optional)", "20 chocolate coffee beans (optional)"], "serves": "Makes 20 fondant fancies", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. Grease and line a 35x25cm/14x10in Swiss roll tin with baking paper.", "Add the eggs and sugar to a large heatproof mixing bowl and place over a saucepan of simmering water. (Make sure the bottom of the bowl does not touch the water.)", "Using an electric handheld whisk, whisk the mixture on low speed for about 3 minutes until the mixture is warm to the touch. Remove the bowl from the heat and whisk on high speed for 7 minutes until trebled in volume. The mixture should hold ribbons on the surface when the beater is lifted. Whisk in the coffee extract or espresso.", "Sift the flour and cocoa powder into the mixture in thirds, gently folding each batch in using a large metal spoon until completely combined. Slowly pour the melted butter against the inside of the bowl and fold in very gently.", "Gently pour the mixture into the prepared tin and tilt the tin to even out the surface. Push the mixture into all the corners. Bake for 15 minutes until slightly springy to the touch. Cool in the tin for 5 minutes, then transfer to a wire rack to cool completely. ", "Meanwhile, for the buttercream, whisk the butter with a handheld electric whisk until light and fluffy. Gradually add the icing sugar on a low speed, then mix on high speed for 5 minutes. Whisk in the Irish cream liqueur the set aside until needed.", "When the cake is completely cool, cut in half to make two rectangles about 17.5x12.5cm/7x5in each. Spread a thin layer of buttercream on top of one rectangle. Place the other on top. Freeze for 10 minutes to firm up the icing.", "Remove the cake from the freezer. Trim the edges square with a sharp serrated knife, then measure a grid to divide the cake into 3.5cm/1¼in squares. Carefully cut the sponge into individual fancies. Return the cakes to the freezer for at least 20 minutes until they are firmly frozen.", "Working with three fancies at a time, spread the buttercream thinly, but smoothly, around the sides and top before returning them to the freezer. Repeat with the remaining fancies, ensuring that they all are in the freezer for 20 minutes before applying the fondant.", "For the chocolate fondant, melt the dark chocolate in a small bowl in the microwave or over a pan of simmering water. Allow to cool slightly.", "Mix the sifted icing sugar in a large heatproof bowl with 125ml/4fl oz water and the glucose syrup. Place the bowl over a pan of simmering water. Stirring constantly, cook the fondant until it reaches 45C. Remove from the heat and allow it to cool to 38C. Stir in the melted chocolate. Place the bowl back over the heat to maintain a temperature of 38C – this is warm enough to pour smoothly but cool enough not to slide off the fancies.", "Place a large thin-wire cooling rack over a baking tray to catch any drips of fondant. Take each fondant from the freezer and insert a fork horizontally in the bottom layer of sponge. Hold the fancy over the bowl of fondant and generously spoon over the fondant to completely cover the sides and top. Gently tap to shake off any excess icing, then place on the cooling rack to set, using another fork to push the fancy free.", "When set, carefully lift the fancies from the cooling rack with a large offset palette knife. Decorate the top of the fancies with a swirl of buttercream, piped lines of white chocolate or chocolate coffee beans, as desired. "]}, {"isVegetarian": true, "title": "Chocolate and fig mousse cake", "url": "www_bbc_co_uk_food_recipes_chocolate_and_fig_mousse_33864", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz plain chocolate", "150g/5½oz butter, plus extra for greasing", "8-10 fresh figs, cut in half from top to bottom", "6 free-range eggs, separated", "50g/1¾oz caster sugar", "4 tbsp orange liqueur, such as Cointreau or Grand Marnier, plus extra to taste", "300ml/10½fl oz double cream", "2 tbsp cocoa powder"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. Grease a 24cm/9½in loose-bottomed cake tin with butter and line with silicone or baking paper.", "Suspend a large heatproof bowl over a pan of simmering water. Do not allow the base of the bowl to touch the surface of the water. Add the chocolate and butter to the bowl and stir until melted. Remove the bowl from the pan and set aside to cool slightly.", "Arrange the fig halves, cut-side down, in the bottom of the cake tin in concentric circles, with the widest part of the figs facing outwards.", "Whisk the egg yolks in a bowl with half of the sugar and until thickened and pale. Add the orange liqueur and whisk again.", "In a separate bowl, whisk the egg whites until soft peaks form when the whisk is removed. ", "Pour the egg yolk mixture onto the melted chocolate, whisking to combine. Beat in half of the whisked egg whites to lighten the mixture, then gently and quickly fold the remaining egg whites into the mixture, making sure they are fully incorporated.", "Pour the chocolate mousse mixture into the cake tin, taking care not to dislodge the fig halves. Bake the cake in the oven for 18-20 minutes, or until just set. There will be a bit of a wobble to the middle of the cake.", "Meanwhile, lightly whip the double cream until soft peaks form when the whisk is removed. Stir in a little orange liqueur, to taste.", "Dust the cooked cake with the cocoa powder, then carefully remove it from the tin. Serve straight away or at room temperature, with a dollop of the boozy cream."]}, {"isVegetarian": true, "title": "Chocolate and ginger tarts", "url": "www_bbc_co_uk_food_recipes_chocolate_and_ginger_92855", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_and_ginger_92855_16x9.jpg", "ingredients": ["plain flour, for dusting", "375g/13oz ready-made shortcrust pastry ", "250g/8oz dark chocolate, roughly chopped ", "250ml/8floz double cream ", "75g/3oz stem ginger, finely chopped "], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Dust the work surface with flour and roll the dough out thinly. Use it to line one large 25cm/10in tart ring or 6 individual tartlet rings 10cm/4in in diameter. Trim away any excess.", "Line the tart case with baking parchment, fill with baking beans and bake in the oven for 12-15 minutes. Remove the baking beans and paper and cook for a further 10 minutes or until the base of the tart is golden-brown and cooked through. Remove the tart from the oven and set aside to cool. ", "Meanwhile, heat the chocolate and cream in a saucepan set over a medium heat, stirring continuously until the chocolate melts and mixture is smooth and thick. ", "Sprinkle the finely chopped stem ginger over the base of the tart, reserving a little to garnish. ", "Pour the chocolate mixture into the tart shell and chill in the fridge for 45 minutes, or until set. Sprinkle over the remaining stem ginger. "]}, {"isVegetarian": true, "title": "Chocolate and hazelnut cake (Torta gianduia)", "url": "www_bbc_co_uk_food_recipes_chocolate_and_hazelnut_38207", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_and_hazelnut_38207_16x9.jpg", "ingredients": ["250g/9oz whole blanched hazelnuts", "200g/7oz butter, cubed, plus extra for greasing", "200g/7oz dark chocolate, broken into squares", "6 medium eggs, separated", "200g/7oz caster sugar, preferably golden", "3 tbsp hazelnut liqueur or amaretto liqueur (or fresh orange juice)", "150g/5½oz chocolate and hazelnut spread"], "serves": "Serves 10", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. ", "Put the hazelnuts on a baking tray and roast them in the centre of the oven for 10 minutes, giving the pan a shake halfway through, until they are golden brown. Watch them carefully so that they don’t burn. Remove and leave them to cool for a few minutes. ", "Reduce the oven temperature to 180C/350F/Gas 4.Butter a 23cm/9in springform cake tin and line the base with baking parchment. ", "Place 200g/7oz of the hazelnuts in a food processor and blend them until they are fairly finely ground. If you blend the nuts to the consistency of fine breadcrumbs, they should work a treat, but leave a few coarser pieces to add texture. Set the remaining 50g/2oz hazelnuts aside.", "Put the butter and chocolate in a heatproof bowl and set it above a pan of gently simmering water. Stir occasionally and as soon as nearly all the chocolate has melted, remove the bowl from the pan and continue to let the chocolate melt in the residual heat. ", "Stir in the ground hazelnuts and leave the mixture to cool for 5 minutes.", "Beat the egg yolks and sugar together with an electric hand-whisk for at least 5 minutes until pale and creamy, then stir into the chocolate mixture until thoroughly combined. Wash and dry the beaters well. ", "In a clean bowl, whisk the egg whites until stiff peaks form – they are ready when you can turn the bowl upside down without the eggs sliding out. Do not over whisk.", "Working quickly, stir the hazelnut liqueur, amaretto or orange juice, into the chocolate mixture to soften. Add a couple of tablespoonfuls of the whisked egg whites and stir until thoroughly combined, then gently fold in the remaining egg whites. ", "Spoon the mixture into the prepared tin and bake in the centre of the oven for 35–40 minutes or until the cake is well risen and firm.", "Remove the cake from the oven and leave it to cool in the tin for 30 minutes. Undo the springclip and invert the cake on to a serving plate, then peel off the lining paper and leave it to cool completely. ", "When the cake is cold, spread it with the chocolate and hazelnut spread and sprinkle with the hazelnuts that you set aside – these can be whole or chopped, whatever you prefer."]}, {"isVegetarian": true, "title": "Chocolate and hazelnut filo rolls", "url": "www_bbc_co_uk_food_recipes_chocolate_and_hazelnut_54460", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz butter", "3 x 32cm x 38cm/13in x 15in filo pastry sheets", "250g/9oz chocolate and hazelnut spread", "100ml/3½fl oz double cream", "1 tbsp caster sugar", "½ tsp vanilla extract", "icing sugar, sifted for dusting"], "serves": "Makes 12", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the pastry, preheat the oven to 200C/400F/Gas 6 and line a large baking tray with greaseproof paper.", "Melt the butter in a small saucepan, then remove from the heat.", "Cut each sheet of filo pastry into 4 even-sized rectangles and brush each rectangle lightly with the melted butter.", "Spread one tablespoon of the chocolate spread, as evenly as possible, across the long side of each piece of pastry, keeping a 2cm/¾ in border. Fold the two short sides of the pastry over the filling to seal the chocolate spread. Roll up the pastry from the long side, to fully enclose the filling.  ", "Repeat with the remaining rectangles of filo pastry to make 12 rolls.", "Place the rolls on the lined baking tray and brush them with a little more melted butter, then bake in the oven for 8-10 minutes or until the pastry is a pale golden brown.", "Remove the rolls from the oven and leave to cool on a wire rack.", "For the vanilla cream dip, whip the cream very lightly with the sugar and vanilla extract.  Spoon into a small serving bowl. ", "To serve, dust the chocolate filo rolls with a little sifted icing sugar, and arrange them onto a serving plate with the vanilla cream dip placed alongside. "]}, {"isVegetarian": true, "title": "Chocolate and mandarin pudding", "url": "www_bbc_co_uk_food_recipes_chocolate_and_mandarin_42366", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 heaped tsp instant hot chocolate powder, plus extra to serve", "8-10 sponge fingers", "16 mandarin segments (tinned or fresh), plus extra to serve", "75g/3oz cream cheese", "125g/4½oz plain yoghurt", "½ tsp vanilla extract"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 120, "preparationMins": 120}, "recommendations": 0, "method": ["In a bowl, mix the two teaspoons of hot chocolate powder with 50ml/2fl oz boiled warm water until smooth.", "Arrange half of the sponge fingers in a layer at the bottom of a small trifle bowl. Drizzle over half of the drinking chocolate mixture to soak the sponge fingers.", "Arrange eight of the mandarin segments on top of the sponge fingers.", "Whisk the cream cheese in a mixing bowl until smooth and loose. Whisk in the yoghurt and  vanilla extract until well combined.", "Spoon half of the cream-cheese mixture into the trifle dish and smooth with a palette knife. ", "Repeat the layering process once more with the remaining sponge fingers, drinking chocolate mixture, mandarin segments and cream cheese mixture. Dust the top with a little extra hot chocolate powder.", "Cover the trifle dish with cling film and chill in the fridge for about one hour.", "To serve, spoon the trifle onto serving plates and garnish with a few extra mandarin segments."]}, {"isVegetarian": false, "title": "Chocolate and orange cake", "url": "www_bbc_co_uk_food_recipes_chocolate_and_orange_26890", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_and_orange_26890_16x9.jpg", "ingredients": ["275g/9¾oz plain flour", "3 tbsp cocoa powder ", "1½ tsp bicarbonate of soda", "1½ tsp baking powder", "150g/5½oz golden caster sugar", "65g/2¼oz soft brown sugar", "1 orange, zest only, finely grated", "25g/1oz ground almonds", "3 large free-range eggs", "225ml/8fl oz coconut oil, melted and slightly cooled", "225ml/8fl oz whole milk", "3 tbsp golden syrup", "115g/4oz self-raising flour", "1 tsp baking powder", "115g/4oz soft unsalted butter", "115g/4oz golden caster sugar, plus 2 tbsp for the syrup", "2 large free-range eggs", "1 orange, finely grated zest and juice", "10 cardamom pods, seeds only, crushed", "300ml/10½fl oz double cream", "200g/7oz orange and almond dark chocolate ", "200g/7oz plain chocolate", "1 orange, zest only, finely grated", "500g/1lb 2oz dark chocolate ", "225g/8oz unsalted butter", "50g/1¾oz white chocolate, melted", "toasted flaked almonds"], "serves": "Serves 20", "time": {"preparation": "1-2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. Grease and line 3 x 20cm/8in round cake tins.", "For the chocolate sponge, mix together the flour, cocoa, bicarbonate of soda and baking powder in a mixing bowl. Stir in the sugars, orange zest and ground almonds. Make a well in the middle. Using an electric handheld whisk, mix in the eggs, melted coconut oil, milk and syrup until well-combined and smooth. ", "Divide equally between two tins and bake for 30 minutes, or until springy to the touch. Leave to cool for a few minutes in the tin, then turn out onto a cooling rack. Remove the paper and allow to cool completely.", "For the orange sponge, put the flour, baking powder, butter, sugar and eggs, orange zest and the ground cardamom seeds in a bowl with half the orange juice. Mix well using an electric handheld whisk until smooth. Spoon into the prepared tin, smooth the surface out evenly and bake for 25 minutes, or until springy to the touch. Leave to cool in tin for few minutes then turn out onto cooling rack and leave to cool completely.", "Put the remaining orange juice and 2 tablespoons of sugar for the syrup in a saucepan. Cook over a low heat, stirring, until the sugar is dissolved and the syrup is thickened slightly. Set aside.", "For the ganache filling, put the cream into a saucepan over a medium heat until just approaching a boil. Take the cream off the heat and add the chopped chocolates and orange zest. Leave to melt for a few minutes before mixing until smooth and shiny. Cool until the mixture is a thick spreadable consistency. ", "For the chocolate icing, put the plain chocolate in a heatproof bowl over a pan of simmering water (ensure the bottom of the bowl does not touch the water). Melt until smooth then add the butter, stirring until the butter is melted and incorporated. Cool until the mixture is just pourable.", "To assemble the cake, trim the tops of the cakes so the layers are flat. Spread one quarter of the ganache filling over the top of one of the chocolate sponges. Brush the orange sponge with the orange syrup and place on top. Spread another quarter of the ganache over the orange sponge and place the second chocolate sponge on top. Use the remaining ganache to cover the outside of the cake completely, making a smooth surface. ", "Set the cake on a rack placed over a sheet of newspaper. Pour the chocolate icing over the top of the ganache and use an offset palette knife to push the icing over the whole cake. Carefully transfer the cake to a serving plate before the icing has set completely.", "Put the melted white chocolate into a disposable piping bag and drizzle over the cake. Scatter with flaked almonds to decorate. "]}, {"isVegetarian": true, "title": "Chocolate and hazelnut semifreddo", "url": "www_bbc_co_uk_food_recipes_chocolate_and_hazelnut_81026", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz dark chocolate, broken into pieces", "30g/1oz unsalted butter", "50g/1¾oz icing sugar", "75ml/2½fl oz double cream", "1 large free-range egg", "3 large free-range egg yolks", "1 tsp vanilla extract", "150g/5½oz caster sugar", "400ml/14fl oz double cream", "75g/2½oz toasted skinless hazelnuts, finely chopped", "200g/7oz dark chocolate, broken into pieces"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Double line a 900g/2lb loaf tin with cling film. ", "For the ganache, melt the chocolate and butter in a large heatproof bowl over a saucepan of simmering water (do not allow the bottom of the bowl to touch the water). Stir in the icing sugar and double cream. Set aside.", "Meanwhile, place the egg, egg yolks, vanilla extract and sugar in a heatproof bowl and set it over a saucepan of simmering water, making sure the bowl doesn’t touch the water. Beat the mixture over the heat for about 8 minutes using a hand-held electric whisk, until it is thick and pale. Remove from the heat and set aside.", "In a separate large bowl, whip the double cream until it is just stiff. Gently fold in the pale egg mixture until combined.", "Pour half the mix into the prepared loaf tin. Make a shallow well along the centre and pour in the ganache. Pour the rest of the semifreddo mix over the top and use a knife to make swirls with the ganache. Cover with cling film and place in the freezer to set for 6 hours.", "Just before serving, melt the chocolate pieces in a bowl standing over a pan of simmering water (do not allow the bottom of the bowl to touch the water). Set aside to cool to room temperature. ", "To serve, turn the semifreddo out onto a serving platter and carefully remove the cling film. Pour the cooled chocolate over the top, sprinkle with the toasted hazelnuts and serve in generous slices. "]}, {"isVegetarian": true, "title": "Chocolate and orange soufflé with orange liqueur sauce", "url": "www_bbc_co_uk_food_recipes_chocolate_and_orange_34113", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz butter, melted, for greasing", "75g/2½oz caster sugar, plus extra for dusting", "150ml/5fl oz milk", "100ml/3½fl oz double cream", "150g/5½oz dark chocolate, broken into pieces", "½ orange, finely grated zest only", "3 large free-range eggs, separated", "15g/½oz cornflour", "15g/½oz plain flour", "10g/⅓oz cocoa powder", "300ml/10fl oz orange juice", "½ lemon, juice only\t", "100g/3½oz caster sugar", "2 tbsp orange liqueur"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/170C Fan/Gas 5.", "Brush the ramekins with melted butter using a pastry brush and dust with sugar until well coated. Place in the freezer until you need them.", "For the soufflé, gently heat the milk in a saucepan until almost boiling then set aside. Meanwhile, in a separate saucepan, heat the cream and chocolate until the chocolate is melted. Beat until thick and glossy, stir in the orange zest and set aside to cool.", "Whisk the egg yolks with 50g/1¾oz sugar until creamy. Sieve the cornflour, plain flour and cocoa together, then sprinkle over the egg yolks and beat until smooth. Pour the milk over the yolk mixture, stirring constantly, then transfer back to the saucepan. Stir over a low heat until thickened a little, then leave to cool, whisking regularly to make sure it doesn’t develop a skin. Beat in the melted chocolate mixture.", "Whisk the egg whites in a clean bowl until soft peaks form. Beat in the remaining 25g/1oz sugar a teaspoon at a time until the mixture is stiff and glossy. Carefully fold the egg whites into the chocolate mixture a third at a time, incorporating them fully before adding any more. ", "Divide the mixture between the ramekins, flattening the top with a palette knife. Put the ramekins on a tray and bake for 12–15 minutes, or until well risen with a slight wobble in the middle.", "Meanwhile, for the sauce, put the orange juice, lemon juice and sugar in a saucepan. Heat gently, stirring constantly, until the sugar is dissolved. Increase the heat a little and simmer for a few minutes, or until it reaches a syrup consistency. Stir in the orange liqueur a tablespoon at a time and mix well.", "Serve the soufflés immediately with the sauce on the side for diners to pour into the centre of the soufflés."]}, {"isVegetarian": true, "title": "Chocolate and orange iced biscuits", "url": "www_bbc_co_uk_food_recipes_chocolate_and_orange_56288", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_and_orange_56288_16x9.jpg", "ingredients": ["165g/5¾oz unsalted butter, softened", "135g/5oz caster sugar", "330g/11½oz plain flour, plus extra for kneading", "75g/2½oz cornflour", "6 tsp baking powder", "75g/2½oz cocoa powder ", "5 tbsp golden syrup", "4 large oranges, zest only ", "600g/1lb 5oz royal icing sugar", "1 large orange, juice only ", "gel food colouring in green, orange, red and yellow"], "serves": "", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["In a large bowl, beat the butter and sugar using a wooden spoon until just combined.", "In a separate bowl, sift in the flour, cornflour, baking powder and cocoa powder. Mix well and add to the butter mixture. Stir in the golden syrup and orange zest. Mix until incorporated then, using your hands, knead gently until everything is fully combined. Wrap the dough in cling film and refrigerate for 15 minutes.", "Preheat the oven to or 185C/165C Fan/Gas 4½ and line a large baking tray with baking paper.", "Roll out the dough on a lightly floured work surface until it is about 5mm/¼in thick. Using a template, cut out shapes to resemble a bunch of flowers. Place on the prepared tray and place in the freezer for 10 minutes or the fridge for 30 minutes.", "After chilling, bake the biscuits for approximately 17 minutes. Let the biscuits cool on the tray for 10 minutes, then transfer to cooling racks.", "Meanwhile, make the icing. Put the icing sugar in a large mixing bowl or freestanding mixer. Add half the orange juice and mix on a medium-high speed for 5 minutes – the texture should be thick but runny enough to pipe, add extra juice if it’s too thick. ", "Spoon about a sixth of the icing into a piping bag fitted with a small, plain nozzle. Pipe a line of icing right around the edge of the biscuits to form an outline, ensuring there are no gaps (this will be filled with thinner icing later using a ‘flooding’ technique). Set aside for 15 minutes to allow the icing to set. Any leftover icing can be returned to the main bowl.", "Put half the remaining icing in a separate bowl and mix in enough orange juice to make a pourable consistency (it should be thin enough to slowly run off a teaspoon). To fill in the outline piped in the thicker icing, use a teaspoon to spoon the thin icing into the middle of the biscuit and gently nudge it towards the edges. Shake the biscuit gently to smooth the surface and ensure the icing completely fills the outline. Repeat with the remaining biscuits then set aside for 20-30 minutes, or until the icing is set.", "To decorate, divide the remaining thicker icing between 4 bowls. Use gel colouring to make green, orange, pink and yellow icing. Spoon the coloured icings into piping bags fitted with small plain nozzles.", "Decorate each biscuit by piping a small bouquet of flowers, using the green to make stalks and the other colours as flower heads. Set aside to dry before serving."]}, {"isVegetarian": false, "title": "Chocolate and orange panna cotta", "url": "www_bbc_co_uk_food_recipes_chocolate_and_orange_61942", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["sunflower or vegetable oil, for greasing", "1 litre/1¾pints pouring double cream", "200g/8oz plain chocolate, finely chopped (50% cocoa solids is fine)", "7 oranges", "100g/3½oz caster sugar", "4 leaves platinum grade gelatine or 9 leaves regular gelatin, soaked in water for 10 minutes."], "serves": "Serves 10", "time": {"preparation": "overnight", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 10, "preparationMins": 0}, "recommendations": 0, "method": ["Very lightly oil the pudding basins or ramekins.", "Heat the double cream in a small pan until it comes to the boil. Remove from the heat, then stir in the chocolate and stir continuously until the chocolate has completely melted. ", "Grate the zest of four oranges and add it to the chocolate cream. Squeeze the juice from two oranges and add eight tablespoons of the juice to the chocolate mixture with the sugar. Set aside all the remaining oranges.", "When the gelatin has softened, remove it from the water, shake off any excess water and place the gelatine into the hot chocolate mixture - stir until dissolved. ", "Strain the mixture through a sieve and then divide equally between the oiled pudding basins", "Place in the fridge and allow the panna cotta to set overnight or for at least six hours.", "Meanwhile, prepare the orange segments. Using a serrated knife, cut off all the peel and white pith from the remaining oranges (including the one that you have zested), working over a bowl to catch the juices. Cut between the orange membranes to remove the segments. Place the orange segments into the juice and chill in the fridge with the panna cottas.", "To turn out, fill a bowl with boiling water, then dip the moulds for just a second into the boiling water - no longer or the mixture will melt too much. Invert the moulds onto a plate to serve, with a few orange segments on each plate."]}, {"isVegetarian": false, "title": "Chocolate and orange mousse cake", "url": "www_bbc_co_uk_food_recipes_chocolate_and_orange_84539", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz unsalted butter, softened, plus 15g/½oz butter, melted", "200g/7oz icing sugar", "200g/7oz pasteurised egg whites", "220g/8oz plain flour", "orange food colouring", "180g/6oz pasteurised egg whites, at room temperature", "25g/1oz granulated sugar", "225g/8oz ground almonds", "225g/8oz icing sugar, sifted", "6 free-range eggs", "40g/1½oz plain flour", "40g/1½oz cocoa powder", "85g/3oz clarified butter, melted", "1 orange, zest and juice ", "1 tsp powdered gelatine", "175g/6oz good quality plain chocolate, broken into pieces", "2 free-range eggs, separated", "300ml/½ pint double cream, whisked to soft peaks", "300ml/½ pint orange juice", "5 tsp arrowroot", "300ml/½ pint double cream, whisked to soft peaks", "3 oranges", "cocoa powder"], "serves": "Serves 10-12", "time": {"preparation": "1-2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7. Line two 45cm x 30cm/18in x 12in baking trays with greaseproof paper and brush with the melted butter. Line the base and sides of a 25cm/10in springform cake tin with greaseproof paper.", "To make the joconde paste, cream the butter and sugar until light and fluffy then gradually add the egg whites, beating continuously. Fold in the sifted flour then add the food colouring. Spoon the mixture into a piping bag fitted with a 5mm/¼in plain nozzle. Pipe the mixture onto the baking trays in a swirl pattern.", "To make the joconde sponge, whisk the egg whites until soft peaks form when the whisk is removed. Add the granulated sugar and continue whisking until stiff peaks are formed. Cover with cling film to prevent the meringue collapsing.", "Beat the almonds, icing sugar and eggs in a bowl until the mixture is light and fluffy. Mix in the flour and cocoa powder. ", "Gently fold in the meringue mixture using a large spatula. Mix a cupful of the sponge batter into the clarified butter, then fold this into the remaining batter. ", "Remove the baking trays with the decorated sheets of greaseproof paper from the freezer. Divide the batter evenly between the two baking trays, spreading it smoothly over the decorations and ensuring it is level.", "Bake for 5-7 minutes or until the sponges are lightly browned. Cover each sponge with a sheet of greaseproof paper then upturn the baking trays onto the work surface and peel off the paper to reveal the pattern.", "Cut strips of sponge to line the sides of the cake tin, ensuring the pattern is facing outwards, then cut a circle of sponge to line the base. Cut a second circle to make the top of the cake.", "For the mousse, pour the orange juice through a fine sieve into a small bowl and sprinkle over the gelatine. Set the mixture aside for three minutes then place the bowl over a small pan of simmering water, taking care the bottom of the bowl does not touch the water, and stir gently until the gelatine has dissolved.", "Meanwhile, place the chocolate in a large bowl and melt it in the microwave, stirring every 45 seconds. Mix the orange zest and egg yolks into the melted chocolate, then stir in the gelatine mixture and fold in the whipped cream.", "Whisk the egg whites until they form stiff peaks then gently fold into the chocolate mixture. Pour the mousse into the cake tin, place the sponge circle on top and chill in the fridge for at least two hours. ", "For the orange gelée, mix the arrowroot with a little orange juice and stir into the rest of the juice. Heat in a saucepan until the mixture thickens and clears then remove from the heat and set aside to cool. Carefully remove the cake from the tin and place onto a serving plate. Cut thin strips of peel from the oranges and curl them around a straw. Pour the cooled gelée over the mousse cake, decorate with whipped cream and orange zest curls and dust with cocoa powder."]}, {"isVegetarian": true, "title": "Chocolate and orange scones", "url": "www_bbc_co_uk_food_recipes_chocolate_and_orange_87739", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_and_orange_87739_16x9.jpg", "ingredients": ["700g/1lb 9oz self-raising flour", "150g/5½oz butter", "150g/5½oz caster sugar", "2 large oranges, finely grated zest of both and juice of one orange", "150g/5½oz chocolate drops", "200ml/7fl oz whole milk, plus extra for brushing", "clotted cream", "2 satsumas "], "serves": "Makes 14 scones", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 210C/400F/Gas 6. Lightly butter two baking trays.", "Sift the flour into a bowl. Rub in the butter using your hands until the mixture resembles fine breadcrumbs. Stir in the sugar, chocolate drops and orange zest.", "In a measuring jug, mix the milk with the juice of one orange. Add to the flour mixture gradually until the dough just comes together. You may not need all the liquid. Be careful not to overwork the scone dough.", "Roll out the dough to approximately 2cm/1in thickness and cut out scones using a 5-6cm/2-2½in cutter.", "Transfer the scones to the buttered baking trays, brush the tops with milk and bake in the centre of the oven for 10-12 minutes, or until risen and golden-brown.", "Remove from the oven and cool on wire rack. Serve with clotted cream and satsumas."]}, {"isVegetarian": true, "title": "Chocolate and peppermint roulade", "url": "www_bbc_co_uk_food_recipes_chocolate_and_peppermint_25149", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_and_peppermint_25149_16x9.jpg", "ingredients": ["125g/4½oz dark chocolate", "4 free-range eggs, separated", "125g/4½oz caster sugar, plus extra for dusting", "2 tbsp cocoa powder, sifted", "325g/11½oz icing sugar, sifted", "100g/3½oz butter, softened", "2 tbsp milk", "3-4 drops peppermint flavour oil", "2 tbsp dark chocolate chips"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Line a 24x35cm/9½x14in Swiss roll tin with greaseproof paper and preheat the oven to 180C/350F/Gas 4.", "Melt the chocolate in a heat-proof bowl set over a pan of simmering water.", "Whisk the egg yolks with the sugar in a bowl. Add the cocoa powder, stir to combine until the mixture has thickened, is pale and increased in volume.", "Whisk the egg whites in a separate bowl until stiff.", "Pour the melted chocolate into the egg yolk and sugar mixture. Stir until the chocolate is fully incorporated. ", "Gently fold in the egg whites. ", "Pour the mixture into the prepared tin. Tilt the tin so that the mixture spreads into the corners.", "Bake for 18-20 minutes, or until firm and springy to touch.", "Once cooked, turn the roulade out onto a piece of greaseproof paper dusted with caster sugar.", "Gently remove the lining paper and cover with a damp tea towel. Leave to cool completely.", "For the filling, gradually add the icing sugar to the softened butter. Beat until all the icing sugar is incorporated. Add the edible peppermint oil to the milk, and then stir into the buttercream. ", "Spread the filling onto the cooled roulade, leaving a 1.5cm/¾in gap at each edge. Sprinkle over the chocolate chips.", "Using the greaseproof paper to help you, roll up the roulade from one of the short ends. Don’t worry if it cracks a little. Transfer onto a serving plate."]}, {"isVegetarian": true, "title": "Chocolate and pistachio biscotti", "url": "www_bbc_co_uk_food_recipes_chocolate_and_pistachio_53327", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["90g/3¼oz plain flour", "1 tsp baking powder", "55g/2oz sugar", "35g/1¼oz pistachios", "25g/1oz dark chocolate chips", "1 free-range egg yolk", "½ tsp vanilla paste"], "serves": "Makes 12 biscotti", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 160C/350F/Gas 4.  ", "Combine all the dry ingredients in a bowl, add the egg yolk and vanilla and mix well to form a dough.", "Lightly knead the dough on a floured work surface until smooth then shape into a log and place on a baking tray lined with parchment.  ", "Bake for 25 minutes, allow to cool, then cut into slices about 1cm/½in thick.  Place slices onto the baking tray and bake again for 5-10 minutes. "]}, {"isVegetarian": true, "title": "Chocolate and prune tart", "url": "www_bbc_co_uk_food_recipes_chocolate_and_prune_tart_06797", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_and_prune_tart_06797_16x9.jpg", "ingredients": ["150g/5½oz ready-to-eat prunes (ideally d’Agen), cut into quarters", "1 tbsp brandy", "1 tsp vanilla extract", "50ml/2fl oz boiling water", "75g/2½oz dark chocolate, broken into small pieces ", "125ml/4fl oz double cream", "200g/7oz mascarpone", "2 free-range medium eggs, beaten", "175g/6oz plain flour", "2 tbsp icing sugar", "2 tbsp cocoa powder", "100g/3½oz cold unsalted butter, cut into roughly 1cm/½in dice", "1 free-range egg, yolk only", "1 tsp lemon juice", "2 tbsp cold water"], "serves": "Serves 6", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["For the filling, put the prunes, brandy and vanilla in a bowl. Pour on the boiling water and leave to soak for several hours or overnight.", "To make the pastry, sift the flour, icing sugar and cocoa together. Add the diced butter and rub it in lightly with your fingertips until the mixture looks like fine breadcrumbs. Alternatively, do this in a food processor or a mixer and then transfer to a bowl.", "Mix the egg yolk with the lemon juice and water. Use a table knife to work the liquid into the flour. Add a splash more water if you need to. When the dough begins to stick together, use your hands to gently knead it into a ball. Wrap the pastry in cling film and put in the fridge to rest for at least 15 minutes.", "Preheat the oven to 200C/400F/Gas 6.", "Roll out the pastry on a lightly floured surface large enough to line a 23cm/9in loose-based tart tin, 3.5cm/1½in deep, leaving excess pastry hanging over the edge. Keep a little uncooked pastry back in case you need to patch any cracks later. Line the pastry with baking parchment or foil, then fill with baking beans, or uncooked rice or lentils.", "Bake blind for 15 minutes, then remove the parchment and baking beans and return to the oven for about eight minutes, or until the pastry looks dry.", "Use a small, sharp knife to trim away the excess pastry from the edge. Use a tiny bit of the reserved raw pastry to patch any cracks or holes if necessary. Turn the oven down to 180C/350F/Gas 4.", "For the filling, put the chocolate and cream in a basin over a pan of simmering water, without letting the basin touch the water. Leave it until the chocolate has just melted, stirring from time to time. Take it off the heat and leave to cool for three minutes, then beat in the mascarpone and eggs. Use a balloon whisk to remove any lumps. Stir in the prunes and any soaking juices.", "Pour the chocolate and prune mixture into the tart case. Bake for 20–25 minutes, or until almost set, with a bit of wobble still in the centre. Leave in the tin to cool completely.", "Serve at room temperature, with whipped double cream."]}, {"isVegetarian": false, "title": "Chocolate and raspberry doughnuts", "url": "www_bbc_co_uk_food_recipes_chocolate_and_raspberry_74498", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_and_raspberry_74498_16x9.jpg", "ingredients": ["250g/9oz strong white flour, plus extra for dusting", "4g salt", "25g/1oz caster sugar, plus extra for rolling", "5g instant yeast", "70ml/2⅓fl oz full-fat milk, warmed", "2 large free-range eggs", "125g/4½oz unsalted butter, softened", "9 large raspberries", "100g/3½oz plain chocolate (36% cocoa solids), broken into 9 squares", "sunflower oil, for deep-fat frying", "50g/1¾oz white chocolate, melted", "50g/1¾oz dark chocolate, melted"], "serves": "Makes 18 doughnuts", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["For the doughnuts, put the flour into the bowl of a freestanding mixer fitted with a dough hook. Add the salt and sugar to one side of the bowl and the yeast to the other. Add the milk and eggs and mix on a low speed for two minutes, then on a medium speed for a further 6-8 minutes, until you have a soft, glossy, elastic dough. ", "Add the softened butter to the dough and continue to mix on a medium speed for a further 4-5 minutes, scraping down the sides of the bowl occasionally to ensure that the butter is incorporated. The dough will be very soft.", "Place the dough in a plastic bowl, cover with cling film and place in the fridge overnight (or for at least seven hours), until it has firmed up and you are able to shape it.", "Tip the dough out onto a very lightly floured work surface, and knead it a few times.", "Divide the dough into 18 equal portions (approximately 30g/1oz each) and flatten each portion slightly.  Place a piece of chocolate or a raspberry in the centre of each piece of dough. Then gently fold the dough up and over the raspberry or chocolate and shape each portion into a ball. Keep the two flavours separate and place on a large baking tray in a plastic bag and leave to prove for 20 minutes. ", "Preheat a deep-fat fryer, filled with sunflower oil, to 170C/340F (CAUTION: hot oil can be dangerous. Do not leave unattended). ", "Lower the chocolate doughnuts carefully into the fryer, cooking each side for about three minutes, or until golden-brown. Using a slotted spoon, carefully remove the doughnuts from the fryer and set aside to drain on kitchen paper and cool completely.", "Lower the raspberry doughnuts carefully into the fryer, cooking each side for about three minutes, or until golden-brown. Remove from the oil with a slotted spoon and immediately roll in caster sugar so that the hot fat helps the sugar stick to the sides. Set aside and leave to cool.", "To decorate the chocolate doughnuts, spoon the melted dark and white chocolate into two small, disposable piping bags. Snip off the ends and pipe a zigzag pattern of dark chocolate, then of white chocolate, over each chocolate doughnut. Leave to set. Once set, serve and enjoy. "]}, {"isVegetarian": true, "title": "Chocolate and raspberry two-tier opera cake", "url": "www_bbc_co_uk_food_recipes_chocolate_and_raspberry_84016", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz raspberries", "150g/5½oz caster sugar", "¼ lemon, juice only", "50ml/2fl oz raspberry vodka", "6 free-range egg whites ", "25g/1oz granulated sugar", "225g/8oz ground almonds", "225g/8oz icing sugar, sifted", "6 free-range eggs", "40g/1½oz plain flour", "40g/1½oz cocoa powder, sifted", "85g/3oz butter, melted", "3 free-range egg yolks, room temperature", "55g/2oz caster sugar", "2 tbsp water", "225g/8oz unsalted butter, cubed, softened", "1 tsp vanilla essence", "125g/4½oz white chocolate, melted", "300g/10½oz raspberries", "115g/4oz unsalted butter, softened", "115g/4oz icing sugar", "115g/4oz plain chocolate (minimum 70% cocoa solids), melted", "30-50ml/1-2fl oz raspberry liqueur", "250g/9oz plain chocolate (minimum 70% cocoa solids)", "125ml/4fl oz golden syrup", "125ml/4fl oz double cream"], "serves": "Serves 20", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the raspberry syrup, preheat the oven to its lowest setting. ", "Place the raspberries into an ovenproof bowl, cover with the sugar and place in the oven for an hour.", "Press the softened fruit with a spoon to release the juice. Stir the mixture until the juice and sugar are well combined, then press the mixture through a sieve.", "Stir in the lemon juice and raspberry vodka, allow to cool, then place in the fridge.", "For the joconde sponge, preheat the oven to 220C/425F/Gas 7. Grease and line two 46cm x 33cm/18in x 13in baking trays.", "Whisk the egg white in a clean bowl until soft peaks form when the whisk is removed. Slowly whisk in the sugar and continue to whisk until stiff peaks form. Cover the bowl with cling film and set aside.", "Beat the almonds, icing sugar and eggs together in a separate bowl for 3-5 minutes, or until the mixture has doubled in volume. Fold in the flour and cocoa powder.", "Gently fold the whisked egg whites into the mixture. ", "Spoon a little of the mixture into the melted butter and mix until well combined. ", "Tip the butter mixture into the cake mixture and fold together until just combined.", "Divide the mixture evenly between the two tins, spreading it smooth, especially at the corners.", "Bake for 5-7 minutes, or until pale golden-brown and cooked through. Remove the cakes from the oven, cover with a large piece of greaseproof paper and carefully turn out the cakes. Peel off the greaseproof paper from the bottom of the tin. Cut each cake in half and set aside to cool completely.", "Meanwhile, for the French buttercream, whisk the egg yolks for five minutes in a bowl, or until pale and foamy.", "Heat the sugar and water in a saucepan until it reaches 120C/250F (use a sugar thermometer to check this).", "While whisking the egg yolks, slowly pour the syrup down the sides of the bowl. Continue to whisk for a further five minutes, or until the bowl is no longer warm to the touch.", "Beat the butter into the mixture, one piece at a time, then add the vanilla essence and melted chocolate. Gently fold the raspberries into the buttercream. Set aside.", "For the chocolate buttercream, beat the butter and icing sugar together in a bowl until pale and fluffy. Beat in the melted chocolate and liqueur.", "For the chocolate ganache, break the chocolate into small pieces and place into a bowl.", "Heat the golden syrup and double cream in a saucepan until just boiling. Pour the cream mixture onto the chocolate and set aside for two minutes.", "Whisk the ganache until smooth, then whisk in enough hot water to loosen the ganache into a pouring consistency.", "To assemble the cake, place one cake square onto a serving plate and generously brush with raspberry syrup. Spread over half of the French buttercream.", "Top with another cake square and generously brush with more raspberry syrup. Spread over the chocolate buttercream. Place another cake square on top and generously brush with the raspberry syrup. Spread over most of the remaining French buttercream (reserving three tablespoons for the top). ", "Top with the final cake square and generously brush with the raspberry syrup. Spread with the remaining French buttercream. ", "Finally, spread the chocolate ganache over the top of the cake, right to the edges. ", "Leave the cake to chill in the fridge for 30 minutes, or until the icing has hardened, then trim the edges with a sharp knife."]}, {"isVegetarian": true, "title": "Chocolate and salted caramel banoffee cheesecake", "url": "www_bbc_co_uk_food_recipes_chocolate_and_salted_32364", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz full-fat cream cheese", "100ml/3½fl oz crème fraîche", "1 vanilla pod, split in half and seeds scraped out", "75ml/3fl oz double cream", "50g/1¾oz dulce de leche", "½ tsp sea salt", "40g/1½ oz caster sugar", "1 banana, peeled, ends trimmed off", "25g/1oz butter", "1 chocolate digestive biscuit", "25g/1oz dark chocolate, 70% cocoa, grated"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the caramel cream, put the cream cheese, crème fraiche, vanilla seeds and 50ml/2fl oz of the double cream in a bowl and whisk until well combined.", "Put the dulce de leche and salt into a small bowl and mix. Lightly fold into the cream mixture until just marbled through. Set aside.", "Heat the sugar in a frying pan until golden-brown and liquid. Add the banana and coat in the caramel. ", "Remove the banana, whisk the butter and the rest of the cream into the caramel in the pan, then put the banana back in and coat once more.", "To serve, crumble the biscuit onto a serving plate, place the caramel-coated banana on top, drizzle with the caramel sauce from the pan you cooked the banana in. Finish with a scoop of caramel cream. Finally, sprinkle the grated chocolate over the top."]}, {"isVegetarian": true, "title": "Chocolate and salted caramel molten puddings", "url": "www_bbc_co_uk_food_recipes_chocolate_and_salted_33158", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz flaked almonds ", "cake release spray ", "1 tbsp cocoa powder, for dusting", "1 tbsp golden syrup ", "65g/2¼oz caster sugar", "80ml/3oz double cream", "¼ tsp rock salt", "55g/2oz butter, unsalted  ", "100g/3½oz dark chocolate (minimum 70% cocoa solids), broken into pieces ", "30g/1oz plain flour, sieved ", "3 large free-range eggs ", "30g/1oz caster sugar", "35g/1¼oz dark muscovado sugar", "pinch salt", "100ml/3½fl oz double cream ", "50g/1¾oz icing sugar ", "1 vanilla pod, split in half lengthways and seeds scraped out"], "serves": "Makes 4 individual puddings", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Lightly toast the flaked almonds in a dry frying pan over a low heat. When pale golden-brown set them aside to cool.", "Spray the pudding moulds with cake release spray and then divide the flaked almonds between the moulds.  Using a small sieve, generously dust the inside of the moulds with cocoa powder. Place in the freezer.", "For the salted caramel, place the golden syrup, caster sugar and four tablespoons of water in a small pan. Heat gently until the sugar dissolves. ", "Using a sugar thermometer, check the temperature of the caramel. When it reaches 160C/320F remove from the heat and stir in the cream and salt. Carefully pour the caramel into an ice cube tray. Allow to cool and then place in the freezer for about 30 minutes.", "For the puddings, melt the butter in a large saucepan over a low heat. Remove from the heat and add the chocolate. Set aside to let the chocolate melt in the hot butter, stirring occasionally. Once cool (but still liquid) add the sieved flour and stir until incorporated and smooth.", "Break the eggs into a large heatproof bowl. Place the bowl over a pan of gently simmering water (do not allow the water to touch the bowl). Whisking the eggs all the time, gradually add the sugars until the mixture is pale, light and fluffy (about seven minutes using a hand-held mixer). Remove the mixture from the heat and fold in the chocolate mixture and a pinch of salt.", "Take the moulds from the freezer and fill evenly with the mixture. Place the moulds in the fridge and chill for at least 30 minutes.", "For the vanilla cream, whisk the cream until it begins to thicken then fold in the sugar and vanilla seeds. Spoon into a piping bag and put in the fridge.", "For the puddings, preheat the oven to 180C/350F/Gas 4. Select a baking tray large enough to fit the pudding moulds.", "Working quickly, remove the moulds from the fridge and place on the baking tray. Remove the salted caramel from the freezer and scoop out the contents with a teaspoon and push into the pudding mixture, ensuring the caramels are encased in the pudding mixture.", "Bake for 12 minutes, or until the sides look cooked but the middle is still a little wobbly. Remove from the oven and let the puddings sit in their moulds for three minutes.", "Slide a small palette knife around the inside edges of the moulds and carefully turn them out onto serving plates. Pipe some vanilla cream next to each pudding and serve."]}, {"isVegetarian": true, "title": "Chocolate and strawberry lime ice cream roll", "url": "www_bbc_co_uk_food_recipes_chocolate_and_strawberry_83139", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz fresh strawberries ", "200g/7oz preserving jam sugar", "1 lime, zest and 1 tbsp juice only", "400g/14oz full-fat coconut cream", "1½ tbsp instant coffee granules", "50g/1¾oz caster sugar", "1½ tbsp cocoa powder", "¼ tsp table salt ", "1 tsp agar-agar ", "2 large free-range eggs", "200g/7oz coconut cream", "3 tbsp agave nectar", "6g freeze-dried strawberries", "2 tbsp strawberry jam (from the cooled jam above)", "50g/1¾oz strawberries, mashed up ", "1 tsp agar-agar", "1 lime, zest only ", "1 large free-range egg white", "40g/1½oz plain flour ", "30g/1oz caster sugar ", "30g/1oz dairy-free butter (soy spread), plus extra for greasing", "rose pink food colouring", "4 large free-range eggs ", "100g/3½oz caster sugar, extra for dusting ", "100g/3½oz self-raising flour", "200g/7oz fresh strawberries, hulled", "100g/3½oz dairy-free dark chocolate", "50g/1¾oz dairy-free white chocolate", "dehydrated strawberries"], "serves": "Makes 1 large ice cream roll", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the jam, put the strawberries in a pan and use a potato masher to squash the strawberries. Add the sugar. Cook on a medium heat until the jam reaches 105C or test for wrinkles on a cold plate to check if the jam is ready. Add the lime zest and juice and leave to cool. Once cooled, blend using a hand-blender to get rid of any lumps. Set aside.", "For the chocolate ice cream, make sure the freezing components of your ice cream maker are in the freezer and frozen.", "Warm the coconut cream in pan very gently - do not boil. Once warm, add the coffee granules.", "In a bowl, whisk together the sugar, cocoa, salt and agar-agar. Add the eggs and mix well. Add the warmed coconut cream gradually, whisking all the time. Transfer the mixture back to the pan and stir for 8-10 minutes, or until the mixture has thickened. Once thick, transfer to a shallow tray and leave in the freezer for the mixture to cool. Once cooled, churn in the ice cream maker for at least 45 minutes. Place the ice cream in the freezer.", "For the strawberry and lime mousse ice cream, whisk the coconut cream in a bowl until light and fluffy. Add the agave nectar, dried strawberries, 2 tablespoons of the strawberry jam, strawberries, agar-agar and lime zest and mix well. Whisk until the mixture is light and fluffy and well incorporated. Transfer to an ice cream maker and churn until soft set. Place in a piping bag and pipe a line about 2.5cm/1in wide and as long as your Swiss roll tin (about 33cm/13in). Wrap the piped line in cling film in the shape of sausage. Leave in the freezer to set completely.", "For the decorative paste, mix all the ingredients, except the food colouring, together to a smooth paste. Add the food colouring to make a vibrant pink colour. Put the paste into piping bags fitted with a nozzle coupler and writing tip attached (ideally Wilton 2).", "Draw a paisley template onto a sheet of baking parchment. Line a Swiss roll tin with the paper and grease slightly. Pipe the design using the decorative paste. Place the tray in the freezer for 10 minutes.", "For the fatless sponge, preheat the oven to 200C/180C Fan/Gas 6. Whisk together the eggs and sugar in a bowl until they get to the ribbon stage (this means that the mixture holds its shape for a few seconds when you drizzle the mixture back over itself). Sift the flour and fold it in with a metal spoon. Spread the mixture over the design and bake for 8-10 minutes on the middle shelf.", "Remove the sponge from the oven and turn out onto a sheet of baking parchment on a cooling rack. Press the sponge down and trim to make slightly thinner if need be. Turn it over so that the pattern side is facing down then roll up gently and leave to cool in a clean tea towel.", "For the dipped strawberries, break the chocolate into pieces and melt in separate bowls set over a pan of simmering water. Place dots of white chocolate into the dark chocolate and drag a skewer through to feather it. Dip the strawberries in the feathered chocolate and leave to set in the fridge.", "To assemble, pipe the softened chocolate ice cream onto a sheet of cling film into a rectangle as long as the Swiss roll tin and approximately 12.5cm/5in wide. Place the frozen strawberry mousse on top. Wrap in cling film encasing the strawberry mousse into the chocolate ice cream. Roll into cling film and leave in the freezer to firm up again. Unroll the sponge and layer with a thin spreading of the jam.", "Place the firm ice cream roll on top and roll together. Cut off any uneven ends, re-wrap in greaseproof paper and return to the freezer to freeze. ", "Squeeze to make everything adhere. Unwrap and place on a serving platter. Arrange the dipped strawberries on top. Scatter over some dehydrated strawberries and serve."]}, {"isVegetarian": true, "title": "Chocolate avocado shake", "url": "www_bbc_co_uk_food_recipes_chocolate_avocado_shake_50246", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_avocado_shake_50246_16x9.jpg", "ingredients": ["1 small peeled ripe banana,chopped, frozen", "3 tbsp cacao powder", "2 tsp coconut oil", "1 ripe avocado", "1 tsp vanilla extract ", "1-2 tbsp honey, preferably raw honey, to taste", "tiny pinch salt"], "serves": "Makes 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Blend all of the ingredients and 750ml/1 pint 6fl oz cold water together in a food processor until smooth. Add more water to loosen, if necessary.", "To serve, pour into small glasses."]}, {"isVegetarian": true, "title": "Chocolate banana cake", "url": "www_bbc_co_uk_food_recipes_chocolate_banana_cake_06955", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_banana_cake_06955_16x9.jpg", "ingredients": ["250g/9oz plain flour", "25g/1oz cocoa powder", "1 tsp baking powder", "¼ tsp bicarbonate of soda", "pinch salt", "200g/7oz golden caster sugar", "2 very ripe bananas, peeled, mashed", "2 free-range eggs, beaten", "125g/4½ butter, melted", "100g/3½oz good-quality white chocolate, chopped", "50g/2oz toasted chopped hazelnuts"], "serves": "Serves 8-10", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Grease and line a loaf tin.", "Sift the plain flour, cocoa powder, baking powder, bicarbonate of soda, salt and sugar into a large bowl and mix until well combined.", "Mash the bananas in a separate bowl, stir in the eggs and melted butter.", "Fold the banana mixture into the flour mixture until just combined. Fold in the chocolate and nuts and spoon the mixture into the loaf tin.", "Bake for 50-60 minutes, or until the cake is risen and a skewer inserted in the centre comes out clean. Remove the cake from the oven, cool on a wire rack for 10 minutes, then remove the cake from the tin. Serve in slices."]}, {"isVegetarian": true, "title": "Chocolate barmbrack bread", "url": "www_bbc_co_uk_food_recipes_chocolate_barmbrack_09509", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_barmbrack_09509_16x9.jpg", "ingredients": ["300g/10½oz strong white flour, plus extra for dusting", "2½ tbsp ground mixed spice", "¼ tsp salt", "8g fast-action yeast ", "33g/1¼oz unsalted butter, softened", "66g/2½oz golden caster sugar", "200ml/7fl oz semi-skimmed milk", "1 large free-range egg", "100g/3½oz mixed dried fruit ", "30g/1oz mixed candied peel ", "100g/3½oz Belgian milk chocolate chips", "1 tbsp sunflower oil, for greasing", "1 tbsp caster sugar", "50ml/2fl oz boiling water", "50g/1¾oz dark chocolate, finely chopped", "50g/1¾oz white chocolate, finely chopped"], "serves": "Makes 1 large loaf", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the bread, line a baking tray with baking paper and dust generously with flour.", "Sift the flour, mixed spice and salt into a large mixing bowl. Add the yeast on the opposite side to the salt. Add the butter and sugar. Mix using your hand in a claw position until well combined.", "Gently warm the milk until it is warm to touch, then whisk in the egg.", "Make a well in the middle of the dry mixture and pour the milk mixture into it. Dust your hands with flour and mix using your hand as before, until the dough comes together. It will form a very wet dough. Knead the dough for 10-15 minutes in the bowl (use a dough scraper if you have one), or until the dough starts to tighten (though it will still be sticky). Regularly scrape off any dough stuck to your hands.", "Flour the work surface and your hands. Spread the dough out in a rough rectangle and add the dried fruit, candied peel and chocolate into the middle of the dough. Knead for a further 2 minutes to incorporate.", "Place the dough on the prepared tray and shape into an oval. Lightly dust with flour and cover with oiled cling film. Leave in a warm place to prove for an hour or until doubled in size.", "Preheat the oven to 195C/175C Fan/Gas 5.", "Once the dough is proved, remove the cling film and slash once lengthways across the top with a sharp knife. Bake for 40 minutes on the bottom shelf of the oven, rotating the tray midway through cooking to ensure you get an even crust (the loaf should be a dark-brown colour). If the bottom edges brown too early, wrap a strip of aluminium foil around the loaf.", "Just before the loaf is cooked, make the glaze. Mix the sugar with the boiling water in a small bowl until the sugar is dissolved.", "Place the loaf on a wire rack and, while it is is still hot, liberally brush the glaze all over the crust.", "To decorate, gently melt the dark chocolate in a microwave or bain-marie. Allow to cool for 5 minutes then drizzle liberally over the loaf. Repeat with the white chocolate. "]}]