[{"isVegetarian": false, "title": "Whisky-cured salmon with pickled beetroot, cucumber, shallots and cucumber ketchup", "url": "www_bbc_co_uk_food_recipes_whisky-cured_salmon_with_58695", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz caster sugar", "25g/1oz fine salt", "1 vanilla pod, seeds scraped out", "2 tbsp whisky", "1 x 500g/1lb 2oz side of salmon, skin on, pin bones removed", "½ bunch baby heritage beetroots, cleaned, small stalk left on", "200ml/7fl oz white wine vinegar", "75g/2½oz caster sugar", "1 tsp salt", "½ tsp black peppercorns", "2 banana shallots, thinly sliced", "½ cucumber, thinly sliced", "2cm/1in piece root ginger, peeled and sliced", "100ml/3½fl oz white wine vinegar", "2 tsp caster sugar", "2 cucumbers, roughly chopped", "1 tsp xantham gum", "2 tbsp mustard cress", "2 tbsp coriander cress"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["For the whisky cured salmon, put the sugar, salt, vanilla seeds and whisky in a large bowl and mix together. Sprinkle some of the mixture on the bottom of a non-reactive baking tray and lay the salmon on top, skin-side down.", "Cover the salmon with the rest of the curing mixture and cover with cling film. Place in the fridge for 4-6 hours, or overnight.", "For the pickled beetroot, cucumber and shallots, put the baby beetroot in a large saucepan of boiling water and cook for 15-20 minutes. Drain and leave until cool enough to handle. Peel carefully and cut in half.", "For the pickled shallots, heat the white wine vinegar, sugar, salt and peppercorns in a pan over a medium heat until the sugar has dissolved. Put the shallots, cucumber, beetroot and ginger in a bowl and pour over the hot vinegar mixture. Mix together to coat then set aside to pickle for at least an hour, but preferably 24 hours.", "For the cucumber ketchup, place the vinegar and sugar in a saucepan and heat until the sugar has dissolved. Remove from the heat and allow to cool slightly before pouring it into a large food processor with the cucumber. Blend until smooth. With the processor still running, add the xantham gum until well-combined and thickened. Season with salt and set aside.", "To serve, slice the salmon into thin strips. Spread the cucumber ketchup on a serving plate and add the salmon. Garnish with the pickled vegetables and cresses."]}, {"isVegetarian": false, "title": "Whisky-cured salmon with cucumber ketchup and chargrilled cucumber", "url": "www_bbc_co_uk_food_recipes_whisky-cured_salmon_with_72948", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz caster sugar", "25g/1oz fine salt", "1 vanilla pod, seeds scraped out", "2 tbsp whisky", "1 x 500g/1lb 2oz side of salmon, skin on, pin bones removed", "100g/3½oz tapioca pearls", "200ml/7fl oz vegetable stock", "2 tsp beetroot juice", "vegetable oil, for deep-frying", "salt", "100ml/3½fl oz white wine vinegar", "2 tsp caster sugar", "2 cucumbers, roughly chopped", "1 tsp xantham gum", "1 cucumber, peeled, with the ends and round edges trimmed off", "rapeseed oil, for drizzling", "large handful watercress or 2 tbsp watercress sprouts"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the whisky-cured salmon, place the sugar, salt, vanilla seeds and whisky in a large bowl and mix together. Sprinkle some of the mixture on the bottom of a non-reactive baking tray and lay the salmon on top, skin-side down.", "Cover the rest of the salmon with the curing mixture and cover with cling film. Place in the fridge for 4-6 hours, or overnight.", "For the tapioca crisps, place the tapioca in a saucepan with the stock and cook, stirring constantly. Add the beetroot juice and stir. Tip out onto a lined baking tray. Allow to dry for 2-3 hours.", "Heat a deep-fat fryer (or large heavy-based saucepan half filled with oil) to 190C/380F. (CAUTION: Hot oil can be dangerous. Do not leave unattended.) Break off bits of the dried tapioca and place in the fryer with for a second, then lift out with a slotted spoon and set aside to drain on kitchen paper. Sprinkle with salt.", "For the cucumber ketchup, place the vinegar and sugar into a medium saucepan and heat until the sugar has dissolved. Remove from the heat and allow to cool slightly before pouring it into a large food processor with the cucumber. Blend until smooth.", "With the processor still running, add the xantham gum until well-combined and thickened. Season with salt and set aside.", "For the chargrilled cucumber, heat a large griddle pan until hot. Drizzle the cucumber with the rapeseed oil and cook until evenly charred on each side. Remove from the heat and cut into four pieces.", "To serve, slice the salmon into thin slices on an angle and place a few slices in the centre of each of four plates. Spoon a little of the cucumber ketchup alongside, with a piece of chargrilled cucumber. Scatter over a few watercress leaves and tapioca crisps and serve."]}, {"isVegetarian": false, "title": "Whisky and orange mustard rib of beef with potato and turnip dauphinoise", "url": "www_bbc_co_uk_food_recipes_whisky_and_orange_31001", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150ml/5fl oz cider vinegar", "5 tbsp caster sugar", "60g/2¼oz yellow mustard seeds", "25g/1oz brown mustard seeds", "2 tbsp English mustard powder", "50ml/1¾fl oz single malt whisky", "50ml/1¾fl oz orange juice", "2 tsp honey", "50g/1¾oz butter, plus extra for greasing", "1 garlic clove, cut in half", "500g/1lb 2oz King Edward potatoes, peeled and thinly sliced", "500g/1lb 2oz turnips, peeled and thinly sliced", "salt and freshly ground black pepper", "300ml/10fl oz double cream ", "300ml/10fl oz whole milk ", "pinch freshly grated nutmeg", "4kg/8lb 8oz 3-bone forerib of 28-day aged beef", "200ml/7fl oz white wine", "300ml/10fl oz beef stock"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the mustard, place the vinegar and sugar in a saucepan and bring to a simmer. Add the mustard seeds and powder and stir well.", "Simmer over a high heat for three minutes until the volume of the liquid has reduced by half and the seeds slightly softened.", "Pour into a food blender and blend to a purée – it takes a few of minutes for the seeds to break down and the mustard to become creamy.", "Add the whisky, orange juice and honey, then blend once more. Season with a little salt and freshly ground black pepper and set aside.", "For dauphinoise, preheat the oven to 170C/325F/Gas 3.", "Butter an ovenproof dish with a little of the butter then rub the garlic clove around the dish.", "Toss the potatoes and turnips together in a bowl, season with salt and freshly ground black pepper. Tip into the ovenproof dish, pressing the slices down to form an even layer.", "Place the cream and milk in a bowl and whisk to combine. Season with salt, black pepper and nutmeg and pour the cream and milk over the potatoes and turnips.", "Dot with the remaining butter and then cover tightly with aluminium foil. Place in the oven and cook for an hour until the vegetables are just tender. After an hour, remove from the oven and set aside.", "For the beef, increase the oven temperature to 200C/400F/Gas 6. Spread some of the mustard all over the beef (any remaining mustard can be kept in a container in the fridge for a few weeks).", "Heat a large frying pan until very hot. Add a little oil to the pan and fry the beef on all sides until nicely browned. Transfer to a roasting dish and place in the oven for 1 hour 30 minutes.", "Remove from the oven, cover with foil and rest for 15-30 minutes.", "For the dauphinoise, remove the foil and return to the oven for a further 30 minutes until golden-brown on top.", "For the beef, place the beef on a board ready to carve and then return the roasting pan to the heat. Make a gravy by heating the meat juices over a medium heat until bubbling, then add the wine and cook until the liquid has reduced by half. Add the beef stock and cook until reduced by half again, then season to taste.", "To serve, carve the beef and serve with a spoonful of dauphinoise and dollop of mustard. Drizzle over the gravy to finish."]}, {"isVegetarian": false, "title": "Whisky and chilli tiger prawns", "url": "www_bbc_co_uk_food_recipes_whisky_and_chilli_tiger_72921", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/whisky_and_chilli_tiger_72921_16x9.jpg", "ingredients": ["2 limes, 1 juice and zest, 1 juice only", "90ml/3½fl oz whisky ", "180g/6½oz soft light brown sugar ", "20 raw tiger prawns, peeled, deveined", "1 red chilli, seeds removed, finely chopped ", "1 tbsp vegetable oil "], "serves": "Serves 4 as a starter or 2 as a main course", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. ", "Heat the lime juice, whisky and sugar in a saucepan over a medium heat, stirring gently, until the sugar has dissolved. Once the sugar has all dissolved, stop stirring, turn up the heat and boil for 5–7 minutes, or until the mixture becomes syrupy and thickens. To tell if it is ready, dip a wooden spoon in the mixture and tap off the excess – some glaze should still stick to the spoon, but it will not be as thick as honey. (Sometimes the whisky catches alight and you will see a blue-orange flame coming from the pan. Just take it off the heat and the whisky will burn itself out. )", "Stir in the finely grated lime zest, then remove the pan from the heat and set aside. ", "Put the prawns in a shallow ovenproof dish and sprinkle over the chilli. Brush the prawns with the oil and then with the glaze. Bake in the oven for 10–15 minutes, or until the prawns turn opaque. Remove from the oven and brush with more glaze, reserving any extra glaze for dipping, and set aside to cool slightly before serving."]}, {"isVegetarian": false, "title": "Whisky-cured salmon with beetroot and blinis", "url": "www_bbc_co_uk_food_recipes_whisky_cured_salmon_with_14937", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/whisky_cured_salmon_with_14937_16x9.jpg", "ingredients": ["1 side of salmon ", "150g/5½oz sea salt", "150g/5½oz caster sugar", "100ml/3½fl oz whisky", "200g/7oz plain flour", "7g sachet instant yeast", "250ml/9fl oz milk", "1 tsp salt", "1 tsp sugar", "2 free-range egg whites", "50g/1¾oz butter", "200g/7oz redcurrant jelly", "3 cloves", "50ml/2fl oz whisky", "100ml/3½fl oz red wine vinegar", "50g/1¾oz Dijon mustard", "10 beetroots, cooked and cut into cubes", "250g/9oz crème fraîche", "mustard cress or micro herbs, to garnish"], "serves": "Serves 10-12", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Lay long strips of cling film over a work surface. Lay the salmon on top and cover with the sea salt, sugar and whisky. Wrap the fish tightly in cling film and place in the fridge for 12 hours.", "Wash the salmon to remove the salt rub, then slice it thinly.", "To make the blinis, whisk together the flour, yeast, milk, salt and sugar. Set aside in a warm place to prove for an hour. ", "For the beetroot, heat the redcurrant jelly, cloves, whisky and vinegar in a saucepan. Simmer until the volume of liquid has reduced by half. Strain through a sieve.", "Whisk in the mustard, then stir through the beetroot. Set aside until ready to serve.", "For the blinis, whisk the egg whites in a separate bowl until stiff peaks form when the whisk is removed. When the batter has proved fold in the egg whites.", "To cook the blinis, melt the butter in a large frying pan. Add a tablespoon of batter to the pan per blini and cook until golden-brown on the underside. Flip over and cook the other side. Remove the blini and place onto kitchen paper. Repeat until you have used all the batter. Keep the blinis warm until ready to serve.", "To serve, place slices of salmon onto serving plates, with a few blinis, a spoonful of beetroot and a quenelle of crème fraîche. Garnish with mustard cress or micro herbs."]}, {"isVegetarian": true, "title": "Whisky shortbread ding dangs", "url": "www_bbc_co_uk_food_recipes_whisky_shortbread_ding_77063", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/whisky_shortbread_ding_77063_16x9.jpg", "ingredients": ["175g/6oz unsalted butter, softened", "100g/3½oz caster sugar", "185g/6½oz plain flour", "½ tsp table salt", "85g/3oz fine semolina ", "50ml/2fl oz malt whisky", "40g/1½oz instant porridge oats, blitzed in a food processor ", "rice flour, for dusting ", "6 tbsp warm water", "2½ tbsp meringue powder ", "½ tsp cream of tartar", "500g/1lb 2oz icing sugar", "green gel food colouring ", "red gel food colouring"], "serves": "Makes 12 large biscuits", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the shortbread, put the butter and sugar in a mixing bowl and cream together until soft and fluffy. Add the flour, salt, semolina, oats and whisky. Mix to a dough and chill in the fridge for 15 minutes. ", "Dust a work surface with rice flour and roll the dough out to 4mm thickness. Using a biscuit cutter or a template cut into 12-15 large biscuits (the exact number will vary depending on the shape). Chill in the fridge for 15 minutes. ", "Preheat the oven to 170C/150C Fan/Gas 3½. ", "Place biscuits on lined baking trays or mesh baking sheets and bake for 15 minutes, do not allow to 'brown'. Leave to cool on wire racks.", "For the royal icing, put the water and meringue powder in the bowl of a food mixer, and mix for a minute. Add the cream of tartar and mix for 45 seconds. Slowly add the icing sugar and beat for 10 minutes on a slow speed (you may find it beneficial to drape a damp towel over the bowl when adding the icing sugar as it gets everywhere!). ", "Put a quarter of the icing into a small bowl and add the green gel food colour. In a separate bowl colour another quarter of the icing red. This leaves you with half the icing still white. Put the green and red icing into separate piping bags fitted with fine plain nozzles. Put a third of the white icing into a piping bag fitted with a plain nozzle.", "Pipe a circle of white icing on the surface of each biscuit quite close to the edge and leave to set. Using a teaspoon, fill the circle with the remaining white icing (if the white icing is a bit too thick to spread on the biscuits, add a drop of water, but be careful not to make it too runny). Before the white icing sets, pipe thin alternating lines of red and green icing across. Using a cocktail stick, drag the icing in the opposite direction to the red and green lines to create a feather effect. Leave to set. ", "If you want the biscuits to hang on a Christmas tree, use a cocktail stick to pierce a hole near the top and push some thread or fine ribbon through."]}, {"isVegetarian": false, "title": "Whisky mustard crusted pork chop with sautéed potatoes", "url": "www_bbc_co_uk_food_recipes_whiskymustardcrusted_93746", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75ml/3fl oz whisky", "25g/1oz honey", "1 lemon, juice only", "75g/3oz yellow mustard seeds", "25g/1oz brown mustard seeds", "50ml/2fl oz water", "4 x pork loin chops, French trimmed, fat removed", "75g/3oz dried breadcrumbs", "1 tbsp olive oil", "25g/1oz butter", "50g/2oz butter", "3 tbsp olive oil", "4 small potatoes, peeled, cut into thick slices", "1 garlic clove, peeled, finely sliced", "2 fresh sprigs rosemary, leaves only", "salt and freshly ground black pepper", "400g/14oz  baby spinach leaves", "2-3 tbsp water"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Heat the whisky, honey, lemon juice and water into a saucepan and heat until the honey dissolves.", "Stir in the mustard seeds and cook for 1-2 minutes, or until most of the liquid has been absorbed.", "Blend the mixture in a food processor until creamy (this will take a few minutes).", "Sprinkle the breadcrumbs onto a plate.", "Brush the pork chop on one side with the mustard mixture and dredge in the breadcrumbs. Spoon the remaining mustard into a small bowl and set aside.", "Heat the olive oil and butter in an ovenproof frying pan until hot. Fry the pork chops for 2-3 minutes on each side, or until golden-brown on each side. ", "Transfer to the oven for 6-8 minutes, or until the pork is cooked through. Remove from the oven and set aside to rest.", "For the sautéed potatoes, heat the olive oil and half of the butter in a frying pan until hot.  Fry the potatoes for 4-5 minutes, or until golden-brown and tender. Add the garlic and rosemary and season, to taste, with salt and freshly ground black pepper.", "Heat the remaining butter in a frying pan, add the spinach and water and cook for 2-3 minutes, or until the spinach has wilted.", "To serve, spoon some potatoes onto each of 4 serving plates, top with a pork chop and spoon some spinach alongside.  Serve with the remaining mustard."]}, {"isVegetarian": true, "title": "White bread", "url": "www_bbc_co_uk_food_recipes_white_bread_38648", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tsp caster sugar", "425ml/15fl oz warm water", "2½ tsp dried yeast, or 20g/¾oz fresh yeast", "750g/1lb 9oz strong bread flour, plus extra for dusting", "2 tsp salt", "40g/1½oz butter, or 4 tbsp olive oil", "vegetable oil, for greasing", "1 free-range egg, beaten", "poppy or sesame seeds, for the top of the loaf (optional)"], "serves": "Makes 2 loaves", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["In a measuring jug, mix the sugar with 150ml/5fl oz of the warm water and yeast and let stand in a warm place for five minutes, or until frothy. If using fast-acting yeast, there is no need to let the mixture stand.", "Sift the flour and salt into a large bowl. Rub in the butter and make a well in the centre. (If using olive oil instead of butter, pour the olive oil into the remaining water.) Pour in the yeast mixture and most of the remaining water (and the olive oil, if using). Mix to a loose dough, adding the remaining water if needed, plus extra if necessary.", "Knead for about ten minutes or until the dough is smooth and springy to the touch. (If kneading in an electric food mixer with a dough hook, five minutes is usually long enough.) Put the dough in a large oiled bowl. Cover the top tightly with cling film and place somewhere warm to rise until doubled in size. This may take up to two or even three hours.", "Preheat the oven to 220C/425F/Gas 7.", "When the dough has more than doubled in size, knock back and knead again for 2–3 minutes. Leave to relax for ten minutes before you begin to shape the bread.", "Shape the bread into loaves or rolls, transfer to a baking tray and cover with a clean tea towel. Allow to rise again in a warm place for 20–30 minutes, or until the shaped dough has again doubled in size. When fully risen, it should leave a dent when you gently press the dough with your finger.", "Gently (as the bread is full of air at this point and therefore very fragile) brush with egg wash and sprinkle with poppy or sesame seeds (if using), or dust lightly with flour for a rustic-looking loaf.", "Bake in the oven for 10–15 minutes for rolls, or 30–45 minutes for a loaf, depending on its size. Turn the heat down to 200C/400F/Gas 6 after 15 minutes for the remaining cooking time. When cooked, the bread should sound hollow when tapped on the base. Transfer to a wire rack to cool."]}, {"isVegetarian": false, "title": "White cabbage escabeche with free-range quail and chanterelles", "url": "www_bbc_co_uk_food_recipes_white_cabbage_escabeche_33284", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 large white cabbage leaves", "4 carrots, peeled and thinly sliced", "4 shallots, broken into ‘petals’", "100ml/3½fl oz white wine vinegar", "100ml/3½fl oz olive oil", "3 garlic cloves", "2 tbsp sugar", "1 tbsp coriander seeds", "100g/3½oz unsalted butter", "50ml/2fl oz vegetable oil", "4 large free-range quail", "sea salt ", "20 Scottish chanterelles", "freshly ground black pepper", "carrot tops, to garnish"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Bring a large pan of salted water to the boil and add the cabbage leaves, carrots and shallots. Bring the water back to the boil and cook for two minutes then drain and quickly refresh the vegetables in a large bowl of iced water. Drain again, pat the vegetables dry then place them in a heatproof dish.", "Place the vinegar, oil, garlic, sugar and coriander seeds into a small saucepan, bring to a boil then pour over the vegetables and leave to cool. ", "Preheat the oven to 180C/350F/Gas 4. Heat the butter and oil in a large frying pan. Season the quails with the salt and seal them in the frying pan until browned all over, basting with the butter as they brown. Transfer the quail to a roasting tin and roast in the oven for two minutes. Fry the chanterelles in the frying pan for one minute then season with salt and freshly ground black pepper.", "To serve, place the quail on a plate with the chanterelles. Arrange the vegetables around the quail and drizzle over a little of the escabeche sauce. Garnish with the carrot tops."]}, {"isVegetarian": true, "title": "White chocolate cheesecake", "url": "www_bbc_co_uk_food_recipes_white_chocolate_22234", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/white_chocolate_22234_16x9.jpg", "ingredients": ["200g/7oz cooking white chocolate, roughly chopped", "300g/10½oz full-fat cream cheese, at room temperature, liquid drained", "300ml/10fl oz double cream ", "1 tsp lemon juice", "1 tsp vanilla extract ", "175g/6oz gingernut biscuits ", "50g/1¾oz unsalted butter, softened "], "serves": "Makes 8 slices", "time": {"preparation": "overnight", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 10, "preparationMins": 0}, "recommendations": 0, "method": ["To make the filling, gently melt the white chocolate in a heatproof bowl sat over a saucepan filled with 4cm/2in just boiled water on a low heat. Make sure the base of the bowl doesn’t touch the water. Once there are only a few small lumps of unmelted chocolate left, give it another stir then remove the bowl and sit it somewhere for about 10 minutes, until the chocolate remains liquid but is cooled to room temperature. ", "To make the base, break the biscuits into a food processor and blend until you have almost all crumbs. Add the butter and process again until the mixture starts to clump and cleave to the blade. If doing this by hand, put the biscuits into a bag, crush to crumbs, then melt the butter and stir into the biscuit crumbs until well mixed.", "Press the biscuit mixture into the cake tin, letting some come a little way up the sides. The back of a spoon is the easiest tool for the job here. Stash the tin in the fridge while you get on with the cheesecake filling. ", "Beat the cream cheese with a wooden spoon in a large bowl, until it is soft. Gently fold in the slightly cooled, melted white chocolate. ", "Softly whip the cream so it is thickened but the peaks don’t hold their shape, then fold it into the white chocolate mixture in two batches. Add the lemon juice and vanilla extract and fold these in, then pour and scrape the pale, almost-moussy mixture into the biscuit-lined tin. Smooth the top, cover the tin with cling film and refrigerate overnight before serving. ", "When ready to serve, remove from the fridge for 10 minutes before unclipping from the tin and cutting it into slices. "]}, {"isVegetarian": true, "title": "White chocolate and raspberry cheesecake", "url": "www_bbc_co_uk_food_recipes_white_chocolate_and_48500", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/white_chocolate_and_48500_16x9.jpg", "ingredients": ["150g/5½oz digestive biscuits", "75g/2¾oz butter, plus extra for greasing", "250g/9oz mascarpone cheese", "300ml/10fl oz double cream", "1 tsp vanilla extract", "200g/7oz white chocolate, broken into chunks", "400g/14oz fresh raspberries"], "serves": "Serves 6–8", "time": {"preparation": "over 2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["Grease the base of a 20cm/8in springform cake tin with butter, then line with a circle of baking parchment.", "To make the cheesecake base, put the biscuits in a plastic bag and crush with a rolling pin until it resembles fine crumbs but still has texture. Melt the butter in a small saucepan over a low heat. Add the biscuits and stir. Spoon into the base of the tin and press using the back of a spoon until level, then cover and chill in the refrigerator.", "To make the filling, put the mascarpone and double cream into a bowl and whisk with an electric hand whisk until it is smooth and has very soft peaks. Stir in the vanilla.", "Put the chocolate into a small heatproof bowl, and place on top of a pan of simmering water. Stir until melted but not hot. Set aside for 5–10 minutes, until cool but still liquid. Pour into the mascarpone and stir, but be careful not to over mix.", "To make the coulis, put half the raspberries in a small blender. Blitz until runny, then pour through a sieve into a bowl to remove the seeds.  ", "Spoon half of the white chocolate mixture over the base. Use the handle of a teaspoon to make a few narrow holes in the mixture right down to the base. Pour or pipe the coulis into the holes, reserve some for decorating. Spoon the remaining white chocolate mixture on top, then smooth and level it. Cover with cling film and chill for at least 6 hours, or overnight.", "Run a palette knife around the edges of the tin. Remove the sides and base and sit on a plate. It may be easier to serve on the base or carefully run a knife under the biscuit base to release. Arrange the remaining raspberries on top of the cheesecake and drizzle over the remaining coulis. "]}, {"isVegetarian": true, "title": "White chocolate and raspberry bread", "url": "www_bbc_co_uk_food_recipes_white_chocolate_and_89452", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["375g/13oz strong white flour, plus extra for dusting", "250g/9oz sourdough starter", "7g salt", "100-130ml/3½-4fl oz tepid water", "olive oil, for kneading", "150g/5½oz white chocolate chips", "100g/3½oz fresh raspberries (not frozen)", "fine semolina flour, for dusting"], "serves": "Makes 1 loaf", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Combine the flour, starter and salt in a large mixing bowl. Add the water and mix with your hands until you have a soft dough. ", "Coat a chopping board with olive oil, then tip the dough onto it and knead the dough for 5-10 minutes, or until the dough forms a soft, smooth skin. ", "Tip the dough into a lightly oiled bowl and cover with a clean tea towel. Leave to rise in a warm place (22-24C/71-51F) for five hours, or until at least doubled in size.", "Once risen, knead the dough until it is smooth, knocking the air out. Add the white chocolate chips and raspberries and continue to knead until the chocolate and raspberries are well mixed into the dough.", "Roll into an elongated shape to fit into a long proving basket.", "Flour the proving basket and place the dough into the basket. Leave to rise for 5-9 hours.", "Preheat the oven to 220C/425F/Gas 7.", "Liberally sprinkle semolina on to the exposed dough in the proving basket; this will give it grip on the baking tray and stop it from spreading. ", "Place a baking tray over the proving basket, then quickly flip it over, removing the basket and leaving the loaf shape on the baking tray. ", "Bake for 20 minutes, then reduce the oven temperature to 190C/375F/Gas 5 and bake for another 20-25 minutes.  If the bread looks like it is colouring very quickly reduce the heat earlier and cover with foil."]}, {"isVegetarian": false, "title": "White chocolate and whisky bread and butter pudding with honeycomb foam and whisky ice cream", "url": "www_bbc_co_uk_food_recipes_white_chocolate_and_94872", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400ml/14fl oz double cream", "100ml/3½fl oz full fat milk", "1 vanilla pod, split in half lengthways and seeds scraped out", "6 free-range egg yolks", "100g/3½oz caster sugar", "100ml/3½fl oz whisky", "3 large all-butter croissants, thickly sliced", "25g/1oz sultanas", "40g/1½oz butter, softened", "500ml/18fl oz double cream", "500ml/18fl oz milk", "300g/10½oz white chocolate, roughly chopped", "3 free-range eggs", "6 free-range egg yolks", "200g/7oz caster sugar", "75ml/3floz whisky", "2 tbsp icing sugar, to dust", "400ml/14fl oz milk", "75g/2½oz honeycomb toffee (cinder toffee)", "1 tsp lecithin powder"], "serves": "Serves 6", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["For the ice cream, put the cream and milk in a saucepan with the vanilla pod (reserve the seeds for the pudding) and bring to a simmer.", "Whisk the egg yolks and sugar together in a bowl. ", "Add the whisky to the hot cream and bring to a simmer then pour it over the eggs and whisk to combine. Return the mixture to the pan and heat until thick enough to coat the back of a spoon.", "Strain and reserve the vanilla pod for making the pudding. Pour into an ice cream maker and churn following the manufacturer’s instructions. Freeze until needed.", "For the pudding, preheat the oven to 180C/350F/Gas 4.", "Lay the croissants in an ovenproof dish with the sultanas layered in between, then dot with the softened butter.", "Place the cream, milk and reserved vanilla pod and seeds in a saucepan. Bring to the boil, add the chocolate and whisk until melted.", "Place the eggs, egg yolks and sugar in a bowl and whisk to combine. Pour the hot chocolate custard through a sieve over the eggs and whisk to combine. Add the whisky and mix. Ladle it through a fine sieve over the croissants and set aside for 15-20 minutes to soak.", "Cover with aluminium foil and place in the oven for 25-30 minutes, or until golden-brown and the custard is just set.", "Remove from the oven and dust with icing sugar. Use a blowtorch or place under the grill to caramelise.", "For the foam, place the milk, honeycomb and lecithin into a small saucepan and bring to the boil, then froth with a stick blender until foaming.", "To serve, place a slice of the pudding in the centre of the serving plates with some of the sauce from the dish, top with a scoop of ice cream and a spoonful of foam."]}, {"isVegetarian": true, "title": "White chocolate, bourbon and raspberry cheesecake", "url": "www_bbc_co_uk_food_recipes_white_chocolate_bourbon_02403", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["oil, for greasing", "25cm/10in sponge cake disc (cut from a large ready-made sponge flan case)", "300g/11oz white chocolate, roughly chopped", "350ml/12fl oz double cream", "750g/1lb 10oz full-fat soft cream cheese", "1½ tsp vanilla extract", "2 lemons, zest and juice", "50ml/2fl oz bourbon, plus extra for sprinkling", "3 free-range eggs, separated", "200g/7oz caster sugar", "4 tbsp cornflour", "250g/7oz raspberries", "250g/9oz raspberries ", "2 tbsp icing sugar"], "serves": "Serves 8-10", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Lightly grease a 25cm/10in spring-form cake tin. ", "Place 200g/7oz of the white chocolate and the double cream into a bowl suspended over a pan of simmering water (do not let the bottom of the bowl touch the water) and heat until just melted.", "Place the sponge disc in the base of the tin. Sprinkle with a little bourbon, if you like. ", "Place the cream cheese into another bowl and add the vanilla extract. Then beat together with the lemon zest and juice, bourbon and egg yolks. ", "Stir in the sugar, corn flour and white chocolate cream and mix until thoroughly combined.", "Carefully fold in the raspberries and the remaining chopped white chocolate.", "Whisk the egg whites until stiff peaks form when the whisk is removed. Fold the whisked egg whites into the cream cheese mixture with a large metal spoon, making sure they are fully incorporated, then pour the mixture over the sponge base in the cake tin. ", "Set the cheesecake on a large sheet of foil and wrap the foil up around the base of the tin to seal the bottom.", "Pour 2-3mm of warm water into a roasting tray, and sit the cake tin in the tray. (This will help create steam during cooking.) Bake for one hour until the top is golden-brown but the middle of the cake still has a slight wobble. ", "Remove from the oven and leave to cool and set completely before removing from the tin. ", "For the raspberry sauce, place the raspberries, icing sugar and 50ml/2fl oz water into a blender and purée until smooth.  ", "Strain the sauce through a fine sieve pushing it through with a spatula or spoon.", "Slice the cheesecake and serve with a drizzle of raspberry sauce."]}, {"isVegetarian": false, "title": "White chocolate, hazelnut and raspberry layered genoise mousse cake", "url": "www_bbc_co_uk_food_recipes_white_chocolate_hazelnut_53975", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 sheets leaf gelatine", "400g/14oz good quality white chocolate, cut into small pieces ", "568ml/1 pint double cream", "3 free-range eggs whites", "125g/4½oz plain flour", "35g/1¼oz skinned hazelnuts ", "4 free-range eggs", "1 free-range egg yolk", "185g/6½oz caster sugar", "60g/2¼oz butter, melted", "300g/10½oz chopped hazelnuts", "150g/5½oz caster sugar", "200ml/7fl oz hazelnut liqueur", "500g/1lb 2oz raspberries "], "serves": "Serves 10-12", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["For the mousse, place the gelatine in a small bowl of cold water and set aside to soften. Place the chocolate in a glass bowl and melt in the microwave for about two minutes, stirring from time to time until the chocolate is thoroughly melted and smooth. Set aside to cool. ", "Gently heat 100ml/3½fl oz of the cream in a small saucepan on the hob. Remove the pan from the hob, squeeze the water from the gelatine, then stir it into the cream until completely dissolved. Set aside in the fridge to cool. ", "Whisk the egg whites until stiff peaks form when the whisk is removed.", "Whisk the remaining cream until stiff peaks form when the whisk is removed. Fold in the melted chocolate with a metal spoon. Add the gelatine and cream mixture and mix until well combined. Gently fold in the egg whites then cover the bowl with clingfilm and chill in the fridge for 1-2 hours.", "For the sponge cake, preheat the oven to 180C/350F/Gas 4. Grease two 15cm/6in cake tins and line the bases and sides with greaseproof paper, making sure the paper extends above the top of the tins.", " Place the flour and hazelnuts in a food processor and pulse until very finely ground.", "Place the eggs, egg yolk and sugar in a bowl set over a pan of barely simmering water, making sure the bottom of the bowl does not touch the water. Whisk the eggs and sugar over the heat for about five minutes or until the mixture is light, fluffy and warm.", "Remove the bowl from the heat and whisk with an electric whisk for about five minutes or until the mixture has tripled in volume and has the consistency of softly whipped cream. ", "Sift one-third of the flour and hazelnut mixture over the whipped eggs and gently fold in using a large rubber spatula. Fold in half of the remaining flour mixture, then the rest.  (Do not over mix the batter.) ", "Mix a cupful of the batter into the melted butter with a small spatula.  When completely combined, fold the butter mixture into the batter with a spatula.  Divide the batter between the prepared cake tins, smoothing the top level. (The batter should not reach more than half the depth of the tins.)", "Bake the cakes in the oven for 20-25 minutes or until the mixture shrinks slightly from the edges of the pan and the top springs back when lightly pressed. Cool on a wire rack, removing the cake tins and greaseproof paper as soon as they are cool enough to handle. ", "To make the praline, place the chopped hazelnuts and sugar in a small saucepan. Heat gently until the sugar has dissolved and turned a pale caramel colour. Pour the mixture onto the prepared baking tray and set aside to cool. When the caramel has set, break into pieces by smashing it with a rolling pin then place the pieces in a food processor and pulse until you have a coarse powder.", "To assemble the cake, cut each sponge in half horizontally with a serrated knife.  Position one cut sponge onto a cake stand, brush with hazelnut liqueur and pipe or spread the mousse on top. Repeat these layers with the remaining sponges, then coat the whole cake with the remaining mousse, using a palette knife. Arrange the raspberries on top of the cake then gently press the powdered praline onto the sides, using greaseproof paper to make a smooth finish. Brush any excess praline away from the cake stand with a pastry brush. "]}, {"isVegetarian": true, "title": "White chocolate bread and butter pudding with whisky ice cream", "url": "www_bbc_co_uk_food_recipes_white_chocolate_bread_66263", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["175g/6oz brown wholemeal breadcrumbs ", "300ml/10fl oz double cream ", "300ml/10fl oz single cream ", "125g/4½oz icing sugar ", "2 free-range eggs, separated", "1 tablespoon whisky, (optional) ", "350ml/12fl oz milk", "350ml/12fl oz double cream", "1 vanilla pod, split ", "2 free-range eggs", "4 free-range egg yolks", "150g/5½oz caster sugar", "150g/5½oz white chocolate, roughly chopped", "8-10 slices white bread, cut into quarters", "110g/3¾oz butter, softened, plus extra for greasing", "4 tbsp whisky", "2 tbsp icing sugar, to dust", "4 free-range egg yolks", "40g/1½oz caster sugar", "150ml/5fl oz milk", "150m/5fl ozl double cream", "1 vanilla pod, seeds removed"], "serves": "Serves 6-8", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the ice cream, preheat the oven to 200C/180C Fan/Gas 4.", "Spread the breadcrumbs out on a baking tray and toast in the oven for a couple of minutes until crisp and slightly browned.", "Meanwhile, beat the two creams with the sugar. Mix together the egg yolks and whisky, if using, and add to the cream mixture, beating it in well. When the breadcrumbs are cool, fold them gently into the cream mixture, making sure they are evenly distributed.", "Lastly, whip the egg whites until stiff and fold into the mixture. Transfer to a sealable container, place in the freezer and store until needed. (There is no need to stir this ice cream while it freezes.)", "For the bread and butter pudding, preheat the oven to 130C/110C Fan/Gas 2.", "Put the milk, cream and vanilla pod in a saucepan and bring slowly to the boil.", "Place the eggs, egg yolks and sugar into a bowl and whisk to combine.", "When the cream mixture has come to the boil, remove from the heat and remove the vanilla pod. Whisk the egg mixture into the cream mixture. Add the white chocolate and whisk until melted and smooth.", "Grease an ovenproof dish and butter the bread. Place the bread into the dish, overlapping the slices. Drizzle the whisky over the bread. Pour over the custard mixture.", "Bake for 20-25 minutes, or until golden-brown and just set. Remove from the oven and dust with icing sugar. Place under a preheated grill or use a mini-blowtorch to caramelise the top.", "For the crème Anglaise, place the egg yolks and sugar in a bowl and whisk until well blended. Combine the milk, cream and vanilla pod in a saucepan and bring to the boil. Immediately reduce the heat and simmer for one minute", "Pour the milk onto the egg mixture and whisk in. Return the mixture to the saucepan and heat slowly, until the custard has thickened enough to coat the back of the spoon. Remove and discard the vanilla pod.", "Cut the pudding into squares and remove from the dish, dust with icing sugar and use a blow torch to colour the top. Serve with the brown bread ice cream and crème Anglaise."]}, {"isVegetarian": true, "title": "White chocolate wedding cake", "url": "www_bbc_co_uk_food_recipes_white_chocolate_wedding_01746", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/white_chocolate_wedding_01746_16x9.jpg", "ingredients": ["600g/1lb 5oz unsalted butter, plus extra for greasing", "600g/1lb 5oz caster sugar", "12 free-range eggs", "450g/1lb self-raising flour", "150g/5½oz cocoa powder", "150g/5½oz dark chocolate, melted", "300g/10½oz unsalted butter, softened at room temperature", "1 tsp vanilla extract", "750g/1lb 10oz icing sugar", "150g/5½oz white chocolate, melted", "300g/10½oz unsalted butter, softened at room temperature ", "1 tsp vanilla extract", "750g/1lb 10oz icing sugar", "150g/5½oz dark chocolate, melted", "400ml/13fl oz double cream", "400g/14oz white chocolate", "fresh flowers, to decorate"], "serves": "Serves 60", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 170C/325F/Gas 3. Grease and line the 23cm/9in cake tin and 15cm/6in cake tin.", "Cream the butter and sugar together in a bowl until light and fluffy, then beat in the eggs, one at a time, until well combined.", "Fold in the flour and cocoa powder, then stir in the melted chocolate until well combined.", "Divide the mixture among the prepared cake tins. ", "Bake the 23cm/9in cake for 1 hour-1 hour 15minutes and the 15cm/6in cake for 45 minutes or until the cakes are golden-brown and a skewer inserted into the centre of the cakes comes out clean.", "Remove the cakes from the oven and set aside to cool, then carefully remove them from the tins and allow to cool completely. ", "Meanwhile for the white chocolate buttercream, cream the butter, vanilla and icing sugar together in a bowl until light and fluffy. Stir in the melted chocolate.", "For the dark chocolate buttercream, repeat the method for the white chocolate buttercream.", "For the ganache, heat the double cream in a saucepan until just boiling, then remove from the heat. Pour the cream over the chopped chocolate and stir until the chocolate has melted and the mixture is smooth. Set aside to cool slightly, or until the mixture has thickened.", "Carefully cut each cake in half horizontally and fill with the dark chocolate buttercream. Spread a teaspoon of buttercream onto each cake board and place the cakes onto them.", "Spread the white chocolate buttercream over the top and sides of each cake until covered. Chill in the fridge for 30 minutes, or until the icing has set. ", "Spread the ganache over each cake with a palette knife, trying to make it as smooth as possible.  Chill in the fridge for 30 minutes, or until the icing has set. ", "To stack the cakes, hold a dowelling rod at the side of the 23cm/9in cake and mark with a pencil where the icing comes to. Cut the rod and three others to the same length. Push the rods into the cake about 5cm/2in away from the sides, to form the four corners of a square in the centre of the cake. Place the pillars on top of the largest cake, positioning each one over a dowelling rod, then top with the 15cm/6in cake. Decorate with fresh flowers."]}, {"isVegetarian": false, "title": "White crab spaghetti", "url": "www_bbc_co_uk_food_recipes_white_crab_spaghetti_65861", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100m/3½fl oz olive oil ", "2 sprigs fresh rosemary ", "2 garlic cloves, peeled and left whole ", "400g/14oz dried spaghetti", "½ fennel bulb, very finely sliced ", "4 spears asparagus, finely sliced using a vegetable peeler ", "1 shallot, finely chopped", "1 garlic clove, crushed  ", "1 chilli, finely chopped", "50ml/2fl oz dry white wine", "200g/7oz fresh white crab meat ", "1 lemon, zest and juice only", "handful fresh parsley, roughly chopped ", "50ml/2fl oz olive oil", "salt and freshly ground black pepper", "1 tbsp fresh chervil leaves, to serve ", "1 tbsp fresh tarragon leaves, to serve"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Heat the oil in a sauté pan and add the rosemary and garlic and cook for 1-2 minutes.", "Cook the spaghetti according to the packet instructions, with a little of the infused oil added to the water. Drain well and set aside. ", "Take the rosemary and garlic out of the oil and drop in the fennel and asparagus to cook for 1 minute. Remove the fennel and garlic and set aside.", "Heat the rest of the infused oil in a large frying pan. Add the shallot and cook over a medium heat until soft. Add the garlic, chilli and a splash of the wine to the pan and stir to combine. Add the crab, cooked fennel and asparagus and cooked spaghetti to the pan and bring to the boil. Season to taste and add a splash more wine if needed. Add the lemon zest and parsley and mix well. Remove the pan from the heat.", "To serve, add the spaghetti to a bowl and season with the lemon juice and remaining herbs."]}, {"isVegetarian": false, "title": "White currant and whisky semifreddo", "url": "www_bbc_co_uk_food_recipes_white_currant_and_whisky_86804", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150ml/5fl oz whisky", "75g/2¾oz white currants", "40g/1½oz sugar", "½ lemon, zest only", "½ tsp grated root ginger", "4 free-range eggs, yolks only", "60g/2¼oz caster sugar", "250ml/9fl oz double cream", "75g/2¾oz white currants"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Line six 125ml/4fl oz pudding moulds with clingfilm. To make the whisky cordial, place the whisky, white currants, sugar, lemon zest and ginger in a saucepan and heat gently. Do not allow the mixture to boil. Strain and push the pulp through a fine sieve to extract the juice then set aside to cool.", "For the semifreddo, place the egg yolks and sugar in a bowl set over a pan of barely simmering water and whisk until the mixture is pale and thick. Remove the pan from the heat and continue to whisk until the mixture is cool.", "Mix 125ml/4fl oz of the whisky cordial into the semifreddo mixture a tablespoon at a time. Whisk the cream until it forms thick ribbons then fold it into the semifreddo. Pour the mixture into the lined moulds and freeze overnight.", "For the garnish, prick the whitecurrants with a pin and place in a bowl with the remaining whisky cordial. Place in the fridge to macerate overnight.", "To serve, turn the semifreddos onto plates and scatter with the macerated white currants."]}, {"isVegetarian": false, "title": "White fish and bacon parcels", "url": "www_bbc_co_uk_food_recipes_white_fish_and_bacon_30891", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/white_fish_and_bacon_30891_16x9.jpg", "ingredients": ["1 small bunch flatleaf parsley, roughly chopped", "3-4 sun-dried tomatoes, to taste", "15g/½oz black or green pitted olives, roughly chopped", "1 tbsp capers, roughly chopped", "1-2 anchovies (optional)", "4 tbsp extra virgin olive oil", "freshly ground black pepper", "500g/1lb 2oz frozen white fish (cod, pollock and monkfish work best), defrosted", "200g/7oz unsmoked bacon medallions", "1 tbsp rapeseed oil", "steamed broccoli"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. ", "For the tapenade, mash the parsley, sun-dried tomatoes, olives, capers and anchovies in a bowl until just broken up. Add the olive oil and continue mashing until it becomes a thick, spreadable paste. Season with pepper then set aside while you prepare the fish.", "Cut the fish into thick fingers about 2cm/¾in wide and 8cm/3in long if possible. Cut the bacon medallions in half lengthways then, using the back of the knife, flatten the bacon out lengthways, stretching it as you go. This will make it thin and long enough to wrap around the fish.", "If you have made the tapenade, brush the fish with the tapenade all over, then wrap with the bacon. If not using the tapenade, simply wrap a strip of bacon around the fish to cover as much of the middle as possible", "Put the fish, join side down on an oven tray and bake for 10-15 minutes until the bacon is crispy and the fish has cooked through. Serve with the steamed broccoli."]}, {"isVegetarian": false, "title": "White fish poached in oil", "url": "www_bbc_co_uk_food_recipes_white_fish_poached_in_77936", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz watercress", "150ml/5fl oz rapeseed oil ", "sea salt", "4 x 110g/4oz turbot fillets", "300ml/10½fl oz rapeseed oil", "300ml/10½fl oz sunflower oil", "20ml/¾fl oz rapeseed oil", "40g/1½oz shallot, finely chopped", "50ml/2fl oz cider", "15g/½oz dried whitebait", "¼ garlic clove, chopped", "250ml/9fl oz double cream ", "4 stalks purple sprouting broccoli", "4 stalks kale", "vegetable oil, for deep frying"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the watercress oil, bring a large pan of water to the boil. Add the watercress for 15 seconds. Drain and refresh immediately in cold water.", "Put the watercress into a muslin cloth and squeeze out as much water as possible.", "Place in a blender with the rapeseed oil and a pinch of salt . Blend for five minutes, or until the colour of the oil changes to dark green.", "Put a sieve lined with muslin over a bowl. Add the oil and leave to stand for an hour, or overnight.", "For the fish, put the rapeseed oil in a pan and heat to 50C/120F.", "Poach the fish for 8-10 minutes then remove and place on a wire rack to drain.", "Leave the fish in a warm place for 5-10 minutes and finish by charring the skin with a chef’s blowtorch. ", "For the cider sauce, heat the oil in a saucepan and gently fry the shallot without browning it. ", "Add half the cider, the whitebait and garlic and heat until the volume of liquid has reduced by half.", "Add the double cream and bring to a simmer for five minutes.", "Let the sauce cool slightly then pulse in a blender and pass the sauce through a fine sieve.", "For the greens, steam the purple sprouting broccoli in a steamer for 4-5 minutes until tender.", "Trim the kale into large pieces.", "Fill a deep-fat fryer or a large, deep, heavy-bottomed pan two-thirds full with vegetable oil. Heat the oil to 160C/320F (use a probe thermometer to check the temperature if you're not using a deep-fat fryer). (CAUTION: Hot oil can be dangerous. Do not leave unattended)", "Add the kale to the fryer and fry until crisp (make sure you cover the fryer with lid when cooking the kale as it may spit).", "Drain the kale on a tray lined with kitchen paper and season with sea salt.", "Put the kale crisps in an oven set to the lowest possible temperature to keep warm until ready to serve.", "Just before serving, add the remaining cider to the sauce and season, to taste, with salt.", "Ladle the sauce into the middle of serving bowls. Drizzle with watercress oil. Place the fish in the centre. Finish with the purple sprouting broccoli and kale crisps."]}, {"isVegetarian": true, "title": "White bread", "url": "www_bbc_co_uk_food_recipes_whitebread_1291", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["15g/½oz fresh yeast or 2.5ml/½tbsp dried yeast ", "300ml/½ pint lukewarm milk", "450g/1lb strong white flour", "1 tsp salt", "25g/1oz butter"], "serves": "Makes 1 loaf", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Mix the yeast with a little of the milk to get a creamy liquid.", "Put the flour and the salt in a bowl and rub in the butter.", "Stir in the yeast liquid and the rest of the milk to get a soft dough. ", "Turn on to a lightly floured work surface and knead until the dough is smooth and elastic, about 10-15 minutes. Put in a clean bowl and cover with clingfilm. Stand in a warm place for 1 hour to rise.", "Heat the oven to 220C/425F/Gas 7. Lightly oil a 1kg/2¼lb bread tin.", "Turn the dough on to the work surface again and knead for 5-10 minutes. Shape the dough into a loaf shape to fit the tin and place in the tin. Cover with a clean tea towel and allow to rise back up again, about 15 minutes.", "Bake in the oven until golden and risen, about 30-40 minutes. The base of the loaf should sound hollow when you tap it. Turn on to a wire rack to cool."]}, {"isVegetarian": false, "title": "White radish salad (Sangchae)", "url": "www_bbc_co_uk_food_recipes_white_radish_salad_90778", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400g/14oz mouli (also known as white radish or daikon)", "¼ white onion", "flaked sea salt ", "1 tsp anchovy sauce", "½ tsp sesame oil", "½ tsp apple vinegar", "¼ tsp fermented shrimps", "1 tsp sugar", "1½ heaped tsp gochugaru (Korean red chilli powder) ", "2 spring onions", "½ tsp black sesame seeds (optional)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Thinly slice the mouli into julienne strips, thinly slice the onion and place both in a bowl. Sprinkle with sea salt and leave for ten minutes. ", "Add the anchovy sauce, sesame oil, apple vinegar, fermented shrimps, sugar and chilli powder to a small bowl. Add the mixture to the mouli and onion and mix thoroughly so that it is all coated.  ", "Chop the spring onions in half and then each half into quarters lengthways. Add to the mouli, sprinkle the sesame seeds over (if using) and serve."]}, {"isVegetarian": true, "title": "White bread plait", "url": "www_bbc_co_uk_food_recipes_whitebreadplait_90314", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/whitebreadplait_90314_16x9.jpg", "ingredients": ["675g/1½lb strong white flour, plus extra for flouring", "1½ tsp salt", "1½ tsp sugar", "3 tsp easy-blend yeast", "1½ tbsp virgin olive oil, plus extra for oiling", "450ml/1 pint warm water", "1 free-range egg, beaten", "poppy seeds, for sprinkling"], "serves": "Makes 1 loaf", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["In a large bowl, stir together the flour and salt. Sprinkle over the sugar and the easy-blend yeast.", "Add the olive oil to the water. Make a well in the centre of the flour and pour in most of the water and olive oil mixture. Retain a bit of the liquid; you may need to add more later to get the right consistency.", "Stir with a wooden spoon and bring together to form a soft dough.", "Turn the dough out onto a lightly floured surface and knead for ten minutes until smooth and elastic.", "Place the dough into a large, lightly oiled bowl. Cover and leave in a warm place for approximately one hour to rise, until doubled in size.", "When the dough has risen, place it on a clean work surface and, with floured hands, knead it again to 'knock it back'. Knead for about five minutes until smooth and elastic.", "Divide the dough into three equal pieces and roll to form three even 'sausage' shapes.", "Plait the three dough 'sausages' together to form a large loaf and place onto a lightly floured baking tray.", "Preheat the oven to 220C/400F/Gas 7.", "Cover the loaf and return to a warm place until it has risen to about one-and-a-half times its size. This will take between ten and 30 minutes.", "Glaze the loaf with the beaten egg and sprinkle the poppy seeds on top.", "Bake the loaf in the oven for 10-15 minutes.", "Reduce the heat to 190C/375F/Gas 5 and bake for a further 30 minutes.", "The loaf is cooked when it is risen and golden and sounds hollow when tapped underneath."]}, {"isVegetarian": true, "title": "White bread", "url": "www_bbc_co_uk_food_recipes_whitebread_66040", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz strong flour", "15g/½oz salt", "55ml/2fl oz olive oil", "20g/¾oz fresh yeast", "275ml/9fl oz water"], "serves": "Makes 1x1kg/2¼lb loaf", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Mix all the ingredients in a large bowl taking care not to put yeast on the top of the salt.", "Knead well with your hands and knuckles until the dough is elastic, smooth and shiny. Cover with a piece of cling film and leave to rise for 1 hour.", "Line a baking tin with baking parchment and mould the dough into a sausage and place in the tin.", "Preheat your oven to 220C/450F/Gas 6, then leave the dough to rise for a further 30 minutes to 1 hour. Place the tin in the oven for 35 minutes. Remove from the tin, tap the bottom with your knuckles - if it sounds hollow, it's ready. Cool on a wire rack."]}]