[{"ingredients": ["4 pimientos rojos, cortados en tiras finas", "1 cucharada de perejil, aproximadamente picado", "2 cucharadas de aceite de oliva virgen extra", "60 g / 2¼ oz de pan rallado fresco", "30 g / 1 g de queso parmesano", "Escalopes de cerdo 4 x 100 g / 3½ oz", "Harina normal de 25g / 1oz", "3 huevos de gallinas camperas, golpeados", "1 cucharada de aceite de oliva", "30 g / 1¼ oz de mantequilla", "50g / 1¾oz de alcaparras extra finas", "1 limón, segmentado", "4 papas para hornear grandes (peladas, cortadas en cubitos y hervidas)", "6 hojas de col savoy (blanqueada, refrescada y cortada en tiras)", "3 cebolletas, finamente picadas", "200ml / 7¼fl de onza de leche", "sal y pimienta negra recién molida"], "method": ["Para asar los pimientos rojos, precaliente el horno a 220C / 430F / Gas 7.", "Coloque los pimientos rojos en una sartén caliente con un poco de aceite de oliva y caliente a fuego lento.", "Una vez que estén calientes, colóquelos en el horno caliente y vuélvalos cada cinco minutos durante 15-20 minutos.", "Retire los pimientos, colóquelos en un recipiente y cúbralos con una película adhesiva durante aproximadamente 20 minutos. Esto hará que sean fáciles de pelar.", "Una vez que los pimientos estén frescos, quita la piel y las semillas y córtalas en tiras.", "Mezcle el aceite de oliva virgen extra y el perejil y caliente suavemente en la estufa mientras cocina los escalopes.", "Para las papas, coloque las papas, el repollo savoy y las cebolletas en una cacerola pequeña.", "Caliente suavemente y lentamente agregue leche según sea necesario.", "Sazonar y mantener caliente.", "Para el cerdo, mezcle las migas de pan y el parmesano en un tazón pequeño.", "Sumerja los escalopes de cerdo en harina, luego en el huevo batido y finalmente en el parmesano y pan rallado.", "En una sartén antiadherente grande, cocine los escalopes de cerdo a fuego medio en el aceite de oliva y la mantequilla, hasta que estén dorados.", "Gire escalopes de cerdo y cocine en el otro lado, volteándolo según sea necesario hasta que esté bien cocido.", "Transfiera la carne de cerdo al papel de cocina y escurra.", "Regrese a la sartén y agregue el aceite calentado y el perejil y los segmentos de limón y las alcaparras.", "Para servir, coloque una pila de pimientos en cada plato y coloque un escalope de cerdo encima de los pimientos.", "Rocíe un poco de las alcaparras, la mezcla de limón y mantequilla alrededor del plato para servir."], "url": "www_bbc_co_uk_food_recipes_parmesancrustedporkc_74758", "title": "Chuletas de cerdo a la parmesana con pimientos rojos asados", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["30g / 1¼ oz de pan rallado", "30 g / 1 g de queso parmesano", "puñado de perejil fresco, picado", "2 dientes de ajo, aplastados", "150 g / 5¼ oz de filete de salmón", "150g / 5¼oz de brócoli, cortado en florecillas"], "method": ["Coloque el pan rallado, el queso, el perejil y el ajo en un procesador de alimentos y mezcle hasta que se combinen. La mezcla debe formar migas finas.", "Cubra la parte superior del salmón con las migajas y hornee en el horno durante diez minutos o hasta que el salmón esté bien cocido y la miga esté dorada y crujiente.", "Mientras tanto, hierva una olla llena de agua con sal y agregue el brócoli.", "Cocine el brócoli durante cuatro minutos o hasta que esté tierno. Desagüe.", "Servir en un plato cubierto con el salmón."], "url": "www_bbc_co_uk_food_recipes_parmesancrustedsalmo_77131", "title": "Salmón cubierto de parmesano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva extra virgen", "1 cebolla, finamente picada", "2 dientes de ajo, finamente picados", "500g / 1lb 2oz de tomates frescos, toscamente picados", "400 g / 14 oz pueden tomates picados", "1 cucharada de pasta de tomate secada al sol", "12 hojas de albahaca", "sal y pimienta negra recién molida", "600g / 1lb 5oz papas King Edward, peladas y cortadas en trozos", "pizca de sal", "Harina común 110g / 4oz", "75g / 3oz de queso parmesano, finamente rallado", "3 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "2 filetes de lenguado de limón, pelado y dividido longitudinalmente en 2", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva"], "method": ["Para la salsa de tomate, caliente una sartén grande hasta que esté caliente y agregue el aceite de oliva, la cebolla y el ajo, y fría por 4-5 minutos hasta que se ablanden.", "Agregue los tomates frescos, los tomates enlatados y la pasta de tomate secada al sol y llévelos a ebullición.", "Reduzca el fuego y cocine a fuego lento durante 10-15 minutos.", "A la mitad del tiempo de cocción, agrega las hojas de albahaca.", "Sazonar con sal y pimienta negra recién molida al gusto. Deje que se enfríe un poco antes de transferirlo a un procesador de alimentos o licuadora. Mezcle hasta que quede suave y reserve.", "Para los gnocchi, coloca las papas en una sartén y cúbrelas con agua. Agregue una pizca de sal y deje que hierva.", "Cocine a fuego lento durante 10-15 minutos o hasta que las papas estén tiernas.", "Drene y regrese a la bandeja y vuelva a colocar a fuego lento durante unos segundos para eliminar el exceso de humedad.", "Pase la papa hervida a través de un ricer de patata o tamiz en un tazón para hacer un puré muy fino.", "Agregue la harina, el parmesano y una cucharada de aceite de oliva y bata hasta que quede suave. Sazonar con sal y pimienta negra recién molida.", "Coloque una boquilla grande en una manga pastelera y luego agregue la masa de papa a la bolsa.", "Ponga a hervir una olla grande de agua. Tome la bolsa de masa y sosténgala sobre el agua hirviendo. Mientras exprime la parte posterior de la bolsa con su mano derecha, sostenga un pequeño cuchillo afilado en su mano izquierda y corte 2,5 cm / 1 pulgada de masa, permitiendo que los ñoquis caigan en la olla. Pipe en aproximadamente 12 gnocchi por lote.", "Los gnocchi se hundirán cuando golpeen el agua. Tan pronto como flote hasta la parte superior, poche durante 1-2 minutos más.", "Retire los ñoquis del agua con una espumadera y escurra sobre papel de cocina. Repita el proceso con cualquier masa restante.", "Calentar una sartén hasta que esté caliente y luego agregar el aceite de oliva restante. Agregue los gnocchi y fría hasta que estén dorados. Coloque la sartén a un lado en un lugar cálido.", "Para la planta de limón, sazone la planta con sal y pimienta negra recién molida.", "Calentar una sartén hasta que esté caliente y agregar el aceite de oliva.", "Agregue la planta de limón a la sartén y cocine por 2-3 minutos hasta que se dore.", "Con cuidado, gire la planta de limón y cocine durante un minuto más en el otro lado.", "Para servir, agregue la salsa de tomate a la cacerola de gnocchi, lo suficiente como para cubrir los ñoquis y calentar ligeramente.", "Coloque los gnocchi en el centro de cada uno de los cuatro platos y cubra cada uno con medio filete de lenguado de limón. Servir a la vez"], "url": "www_bbc_co_uk_food_recipes_parmesangnocchiwitht_87581", "title": "Gnocchi de parmesano con salsa de tomate y albahaca y lenguado de limón frito", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["190g / 7oz de polenta de cocción rápida instantánea", "750 ml / 1 pinta 7fl oz de agua hirviendo mezclada con 3 cucharaditas de caldo de verduras en polvo", "75g / 3oz de parmesano (o un queso duro vegetariano similar), rallado", "sal y pimienta negra recién molida", "2 cebollas rojas grandes, peladas y en rodajas finas", "2 cucharadas de aceite de oliva", "2 cucharaditas de hojas frescas de tomillo, más extra para decorar", "2 cucharadas de vinagre balsámico", "1 cucharada de azúcar moreno", "160g / 5oz de queso Taleggio (o una alternativa vegetariana), cortado en cubos"], "method": ["Llevar el caldo a ebullición en una sartén grande. Poco a poco agregue la polenta en una corriente delgada, batiendo continuamente. Reduzca el fuego a medio y revuelva con una cuchara de madera hasta que la polenta esté muy espesa (esto tomará aproximadamente cuatro minutos).", "Retirar del fuego, agregar el parmesano y sazonar bien con sal y pimienta negra recién molida. Debes sazonar generosamente ya que el sabor tiende a volverse menos fuerte a medida que la polenta se enfría. Usando un cuchillo de paleta, esparza la polenta en una bandeja de horno engrasada hasta un grosor de aproximadamente 1 cm. Cuando esté frío, coloque la bandeja de hornear en la nevera durante aproximadamente una hora para que la polenta se endurezca. Puede colocar la bandeja de hornear en el congelador antes de extender la polenta para acelerar el proceso de enfriamiento. La base de polenta caseosa puede prepararse con hasta tres días de anticipación.", "Para el relleno de cebolla, saltee las cebollas en el aceite de oliva junto con las hojas frescas de tomillo en una sartén grande a fuego lento durante unos 30 minutos, o hasta que se ablanden.", "Agregue el vinagre balsámico y el azúcar moreno. Suba el fuego a medio y cocine durante unos cinco minutos o hasta que el vinagre se haya evaporado. Sazonar con sal y pimienta negra recién molida.", "Calienta la parrilla. Corta 20 círculos de la polenta con un cortador de pasta acanalado de 5 cm y colócalos en dos bandejas de horno engrasadas.", "Con una cuchara, coloque alrededor de una cucharadita de la mezcla de cebolla roja encima de cada base de polenta y coloque los cubos de Taleggio encima.", "Coloque debajo de la parrilla durante 3-4 minutos hasta que el queso se derrita y se ponga dorado. Transfiera a platos y decore con ramitas de tomillo."], "url": "www_bbc_co_uk_food_recipes_parmesanpolentacrost_82322", "title": "Crostini de polenta y parmesano con cebolla caramelizada", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Hace 20 canapés", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200g / 7¼ oz de harina de auto crianza, tamizada con 1 cucharadita de sal, más extra para espolvorear", "50 g / 1¾oz de queso parmesano, rallado", "50 g / 1 oz de azúcar en polvo", "2 cucharaditas de polvo de hornear", "50g / 1¾oz de mantequilla", "125ml / 4½fl oz de leche tibia, más extra para glaseado", "110g / 4oz de arándanos secos (reserva 24 arándanos para decorar)", "250g / 8oz el tubo de mascarpone", "24 hojas pequeñas de albahaca fresca"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para los bollos de parmesano, coloque todos los ingredientes del bollo, aparte de la leche y los arándanos, en un bol. Trabaje los ingredientes junto con los dedos hasta que la mezcla se asemeje a pan rallado.", "Agregue los arándanos secos y la leche, poco a poco (puede que no necesite toda la leche). Con las manos enharinadas, amase la mezcla en masa y colóquela en una superficie de trabajo enharinada. Estirar hasta un grosor de aproximadamente 1 cm / ½ pulg. Con un cortador, corte en rondas de 5cm / 2in y coloque en una bandeja para hornear forrada con papel resistente a la grasa. Cepille con un poco de leche (también puede usar el huevo batido).", "Transfiera al horno y hornee por 15 minutos, o hasta que se levante y dore. Transfiera a una rejilla y déjelo enfriar", "Para servir, extender una fina capa de mascarpone en la parte superior de cada bollo y cubrir con una hoja pequeña de albahaca. Usando una manga pastelera con una boquilla en forma de estrella, vierta un remolino de mascarpone en la parte superior de la hoja de albahaca. Decorar con un arándano."], "url": "www_bbc_co_uk_food_recipes_parmesansconeswithma_92587", "title": "Mini bollos de parmesano, mascarpone y arándano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 24", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/parmesansconeswithma_92587_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Jamón de cordero de 2 x 6 huesos, cada uno cortado en trozos de 3 huesos", "1 cucharadita de jengibre triturado", "1 cucharadita de ajo machacado", "1 cucharadita de comino molido", "1½ cucharadita de cilantro molido", "½ cucharadita de cúrcuma molida", "½ cucharadita de sal masala", "2 cucharadas de aceite de girasol o colza", "½ lima, solo jugo", "pizca de sal", "4-5 papas grandes Maris Piper, peladas y cortadas en cubos de 0.5cm / ¼ de grosor", "1 cucharadita de mantequilla", "1 cucharadita de semillas de comino", "2 dientes de ajo, finamente picados", "1 cucharada colmada de hojas de cilantro fresco picado", "Harina común 110g / 4oz", "3-4 huevos de gallinas camperas, golpeados", "200g / 7oz de pan rallado", "aceite vegetal, para freír", "500 g / 1 libra de tomates de 2 onzas, aproximadamente picados", "25g / 1oz de mantequilla", "1 cucharada de aceite de girasol o colza", "2-3 chiles rojos grandes, sin semillas, cortado en 2-3 piezas", "3 dientes de ajo picados", "Corteza de cassia de 7.5-10 cm / 3-4 pulgadas (o varilla de canela)", "Cebolla roja de 250g / 9oz, finamente picada", "2 cucharadas de vinagre de malta", "2 cucharadas de azúcar de caña en bruto o azúcar moreno", "1 cucharada de pasta de tamarindo", "pizca de sal", "2 cucharadas de salsa de mango de chutney con menta", "½ lima, solo jugo", "1 cucharada de aceite vegetal", "pizca de sal", "½ pepino, cortado en cubitos", "1 tomate de ternera, sin semillas, cortado en cubitos finos", "1 chile verde mediano, finamente picado", "1 chalote de plátano pequeño, finamente cortado", "1 lechuga, hojas finamente picadas", "1 cucharada de hojas de cilantro fresco picado"], "method": ["Para el cordero, retire los dos huesos externos de cada costillar de cordero de 3 huesos, dejando solo el hueso central en cada pedazo de carne.", "Aplane las chuletas de cordero entre dos hojas de película adhesiva con un mazo de carne o un rodillo.", "Raspe todos los pedazos de carne de la parte superior de los huesos con la parte posterior de su cuchillo.", "Mezcle el jengibre, el ajo, el comino molido, el cilantro, la cúrcuma, el garam masala, el aceite de girasol (o colza), el jugo de lima y la sal en un tazón, luego frote la mezcla por todas las chuletas.", "Cubra las chuletas y enfríe en el refrigerador durante la noche, o durante al menos algunas horas, para marinar.", "Cuando las chuletas se hayan marinado, sacuda el exceso de adobo.", "Caliente una sartén antiadherente de base pesada a fuego medio a alto. Cuando la sartén esté caliente, agregue las chuletas de cordero marinado y freír rápidamente hasta que se dore por todas partes. (Tenga cuidado de no quemar las especias en el adobo).", "Retire las chuletas de la sartén y coloque en un plato forrado con papel de cocina. Dejar de lado durante 30-40 minutos para enfriar.", "Mientras tanto, ponga a hervir un sartén de agua con sal y luego agregue las papas. Vuelva a hervir a fuego lento y cocine durante 5-8 minutos, o hasta que estén tiernos. Drene el agua y devuelva las papas a la sartén. Regrese al calor brevemente para eliminar el exceso de humedad. Mientras las papas se cuecen, tritúrelas ligeramente con una cuchara de madera. Mash las papas con un triturador o ricer hasta suave. Dejar de lado.", "Calentar una sartén a fuego medio, luego agregar la mantequilla, las semillas de comino y el ajo y freír durante 1-2 minutos, o hasta que el ajo se haya ablandado. Agregue la mezcla al puré de papas junto con las hojas de cilantro y mezcle bien. Dejar de lado.", "Para la salsa de tomate, mezcle los tomates con la pulpa en un procesador de alimentos.", "Calentar una sartén a fuego medio. Agregue la mantequilla y el aceite. Cuando la mantequilla esté espumosa, agregue los chiles, el ajo y la corteza de cassia (o la rama de canela) y fría durante 1-2 minutos, o hasta que el ajo esté dorado.", "Agregue las cebollas rojas y fría por otros 3-4 minutos, o hasta que estén suaves.", "Agregue la pulpa de tomate y lleve la mezcla a ebullición. Cocine a fuego lento durante 3-4 minutos, o hasta que la mezcla se haya espesado un poco, luego agregue el vinagre, el azúcar y la pasta de tamarindo y reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento. Cocine a fuego lento hasta que la mezcla se espese a una salsa rica.", "Retire la corteza de cassia (o la rama de canela), luego regrese la salsa al procesador de alimentos y mezcle hasta obtener un puré. Sazonar, al gusto, con sal y pimienta negra recién molida. Mantener caliente", "Cuando las chuletas de cordero se hayan enfriado, cubra cada una en una capa de 1,5 cm / ½ pulgada del puré de papas con especias.", "Espolvorea la harina en un plato. Batir los huevos en un tazón. Espolvoree las migas de pan en un plato aparte.", "Separe cada chuleta de cordero y de patata en la harina, desempolvando cualquier exceso. Luego sumérgelos en el huevo batido y finalmente arráncalos en el pan rallado.", "Caliente 5cm / 2in del aceite en una sartén de fondo grueso y de base pesada hasta que la miga de pan chisporrotee y se dore cuando la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso; no lo deje desatendido). Freír las chuletas cubiertas hasta que estén doradas por ambos lados y cocidas, aproximadamente 6-8 minutos en total. Retire de la sartén y déjela a un lado para escurrir sobre papel de cocina. Mantener caliente", "Para la ensalada, mezcle el chutney de mango, el jugo de lima, el aceite y la sal juntos hasta que estén bien combinados, luego mezcle con el resto de los ingredientes.", "Para servir, apila un poco de ensalada en cada uno de los cuatro platos para servir. Coloque una chuleta de cordero al lado de cada porción de ensalada, luego cubra con una cuchara la salsa de tomate."], "url": "www_bbc_co_uk_food_recipes_parsee-style_lamb_cutlet_13755", "title": "Chuleta de cordero al estilo Parsee servida con salsa de tomate y ensalada", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["300g / 10½ oz pastinacas, ralladas", "300g / 10½ oz de batatas, ralladas", "pizca de copos de chile seco", "1 cilantro fresco de racimo pequeño, hojas reservadas, tallos finamente picados", "1 diente de ajo, aplastado", "½ cucharadita de cilantro molido", "½ cucharadita de comino molido", "1 cucharadita de semillas de cebolla negra", "1-2 cucharadas de harina común", "1 huevo mediano de granja, golpeado", "4 cucharadas de aceite de oliva", "150 g / 5½ oz de yogur al estilo griego", "harissa paste, al gusto"], "method": ["Coloque todos los ingredientes, aparte del aceite, yogur y harissa, en un tazón grande y mezcle para combinar. La mezcla debe mantenerse unida. Si no es así, agregue una cucharada extra de harina. Usando sus manos, divida la mezcla en cuatro y déle forma en 8cm / 3¼ en rondas planas.", "Coloque una sartén grande a fuego medio, agregue el aceite y fría cada rosti en ambos lados hasta que estén dorados y crujientes. Los rostis probablemente necesitarán cocinarse en lotes. Si es así, coloque los rosti cocidos en un plato forrado con papel de cocina y manténgalos calientes en un horno a baja temperatura hasta que estén listos para servir.", "Mezcle el yogur y harissa en un tazón pequeño.", "Para servir, pon los rosti en platos para servir y coloca el yogur harissa encima."], "url": "www_bbc_co_uk_food_recipes_parnsip_rosti_83149", "title": "Dijo Parnsip", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/parnsip_rosti_83149_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharadita de sal", "½ cucharadita de cúrcuma molida", "4 salmonetes grises, cabeza y columna vertebral eliminados (pida a su pescadero que haga esto)", "1 coco fresco, carne rallada (o 200g / 7oz de coco desecado, empapado en agua y exprimido)", "2 racimos grandes de cilantro fresco, solo hojas", "4-5 chiles verdes largos", "6-8 dientes de ajo", "Jengibre fresco de 7.5cm / 3in en pieza, pelado y más o menos picado", "1 semillas de comino de cucharadita colmada, tostadas", "1 cucharada de azúcar en polvo", "1-2 limas, solo jugo", "1 manojo grande de menta fresca, solo hojas", "3-4 cucharadas de agua, según sea necesario", "4 hojas de banano, recortadas, cualquier tallo duro eliminado (disponible en algunas tiendas de comestibles asiáticas, a veces congeladas)", "4 cucharadas de vinagre de malta", "5 huevos de gallinas camperas, hervidos, enfriados, pelados", "6 cucharadas de coco recién rallado (o coco desecado, remojado en agua y exprimido)", "1-2 chiles verdes grandes, cortados, finamente picados", "2 cucharadas de cilantro fresco picado", "1 cucharada de pulpa de tamarindo (o 1½ cucharadita de concentrado de tamarindo, disponible en supermercados asiáticos)", "3-4 cucharadas de cacahuetes tostados picados", "1 cucharada de chalotes picados", "2 cucharadas de tomates frescos picados", "sal y pimienta negra recién molida"], "method": ["Para el pescado Parsee, precaliente el horno a 190 ° C / 375 ° F / Gas 5.", "En un tazón, mezcle la sal y la cúrcuma molida hasta que estén bien combinados, luego frote la mezcla de especias en el pescado.", "Mezcle el coco rallado, el cilantro, los chiles, el ajo, el jengibre, las semillas de comino, el azúcar, el jugo de lima y la menta en una pasta en un procesador de alimentos. Si es necesario, agregue gradualmente suficiente agua, una cucharada a la vez, para aflojar la mezcla.", "Frote la pasta sobre cada salmonete experimentado, tanto en la piel exterior del pez como dentro de las cavidades del abdomen.", "Pase un lado de cada una de las hojas de plátano sobre la llama de una cocina de gas (5-10 segundos es suficiente) para suavizar las hojas. Alternativamente, suaviza las hojas con un soplete de chefs.", "Coloque una pieza de pescado en el centro de cada hoja de plátano. Doble las hojas para hacer cuatro paquetes. Ate cada paquete de forma segura con una cuerda.", "Coloque los paquetes de hojas de plátano en una bandeja de asar. Espolvorea sobre el vinagre de malta y unas gotas de agua fría. Hornee en el horno por 15-20 minutos.", "Para la ensalada de huevo y maní, corte cada huevo duro por la mitad. Retire las yemas de los blancos. Desmenuce las yemas y luego pique finamente los blancos.", "En un tazón, mezcle las claras de huevo en cubitos, las yemas de huevo desmenuzadas y los ingredientes restantes de la ensalada de huevos y maní. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, coloque un paquete de hojas de plátano en el centro de cada una de las cuatro placas de servir. Retire la cadena de los paquetes de hojas de plátano y ábralas. Sirva una porción de la ensalada de huevo y maní junto a cada porción de pescado Parsee, dentro de la hoja de plátano."], "url": "www_bbc_co_uk_food_recipes_parseefishinbananale_90849", "title": "Parsee pescado en hoja de plátano con huevo y ensalada de maní", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50g / 2oz de mantequilla", "2 chalotes, picados", "2 ramitas de tomillo fresco", "600ml / 20fl oz de caldo de verduras", "Espárragos de 300 g / 10½ oz, tallos picados, consejos reservados", "115g / 4oz de flatleaf perejil, hojas recogidas", "50g / 2oz de berro", "1 cucharada de aceite de oliva", "115g / 4 oz de corteza de cerdo, palmaditas en seco y cortado en trozos pequeños", "Tocino rayado de 115 g / 4 oz, cortado en pequeños lardones", "1 cucharada de vinagre de vino blanco", "4 huevos de gallinas camperas", "2 cucharadas de berro de perejil", "2 cucharadas de berros"], "method": ["Para la sopa, freír la mantequilla, los chalotes y el tomillo en una cacerola mediana durante dos minutos.", "Agregue el caldo de verduras y deje que hierva.", "Agregue los tallos de espárrago, reserve las puntas y cocine por un minuto.", "Agregue el perejil y el berro y cocine a fuego lento durante dos minutos, hasta que los espárragos estén tiernos.", "Retirar del fuego y mezclar con una batidora manual, o dejar enfriar durante 3-4 minutos y colocar en una licuadora de alimentos. Mezcle la sopa hasta que quede suave.", "Regrese la sopa a la placa a fuego medio y sazone al gusto con sal y pimienta negra recién molida.", "Mientras tanto, ponga a hervir un sartén con agua con sal, agregue las puntas de espárragos y cocine a fuego lento durante 2-3 minutos hasta que estén tiernas.", "Escurrir las puntas de espárragos y mezclar con un poco de aceite de oliva, sal y pimienta negra.", "Para la guarnición, precaliente una freidora a 160C / 325F o, alternativamente, caliente el aceite vegetal en una sartén profunda de fondo grueso hasta que la miga de pan chisporrotee y se ponga dorada cuando se la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Con cuidado, coloque los trozos secos de corteza de cerdo en la freidora y cocine por 2-3 minutos hasta que estén dorados e hinchados. Levante con una espumadera y déjelo a un lado en un plato.", "Aumente la temperatura de la freidora a 190C / 375F.", "Regrese la cáscara de cerdo a la freidora y fríalos por otros 2-3 minutos hasta que estén crujientes. Levante con una espumadera y escurra sobre papel de cocina. Espolvorea con sal.", "En una sartén, fría el tocino hasta que esté dorado y crujiente, luego póngalo a un lado en papel de cocina para escurrirlo.", "Pon una olla pequeña a fuego lento y luego agrega el vinagre.", "Mezcle el agua hirviendo a fuego lento para crear un vórtice, luego cuidadosamente rompa dos de los huevos en el agua. Cueza durante 2-3 minutos, o hasta que los huevos estén cocidos a su gusto, luego retírelos cuidadosamente de la sartén con una espumadera y déjelos a un costado para escurrirlos sobre papel de cocina.", "Repita el proceso de caza furtiva con los dos huevos restantes.", "Alternativamente, si usa más adelante, ponga los huevos escalfados directamente en agua helada y enfríelos en la nevera hasta que estén listos para usar. Ponga a hervir una olla con agua, luego agregue los huevos escalfados y cocine durante un minuto para que se caliente. Escurrir sobre papel de cocina.", "Para servir, coloque las puntas de espárragos en el centro del plato de sopa y coloque el huevo escalfado en el centro de la pila. Vierte un cucharón en la sopa alrededor del borde y luego espárzalos sobre los restos de cerdo y el tocino. Termine esparciendo el perejil y el berro por la parte superior."], "url": "www_bbc_co_uk_food_recipes_parsley_and_asparagus_39884", "title": "Sopa de perejil y espárragos con huevo escalfado y rasguños de cerdo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6 - 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50g / 1¾oz de mantequilla", "1 chalote, picado", "2-3 dientes de ajo, finamente picados", "500g / 1lb 2oz de flatleaf perejil, aproximadamente picado", "Guisantes congelados de 400g / 14oz", "1 litro / 1¾ pintas de caldo de verduras calientes (o agua)", "Crema doble 50ml / 2fl oz", "25ml / 1fl oz de aceite de oliva", "puñado de brotes de guisantes, para servir", "aceite, para freír en grasa", "225g / 8oz de patatas harinas, peladas y cortadas en trozos", "40 g / 1½ oz de mantequilla", "6 cebollas de primavera, en rodajas finas", "1 cucharada de perejil de flatillo picado", "1 limón, ralladura y jugo", "sal y pimienta negra recién molida", "375g / 13oz de salmón ahumado, cortado en cubitos", "Harina común 110g / 4oz", "2 huevos de gallinas camperas, golpeados", "Pan rallado panko de 110 g / 4 oz"], "method": ["Para la sopa de perejil y guisantes, caliente la mantequilla en una sartén a fuego medio. Agregue la chalota y el ajo y freír suavemente durante aproximadamente 3-4 minutos, o hasta que estén blandos.", "Agregue el perejil, los guisantes y el caldo caliente (o agua), lleve la mezcla a ebullición, luego reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento y continúe cocinando a fuego lento durante tres minutos, o hasta que los guisantes estén verdes y tiernos.", "Coloque en una licuadora y mezcle hasta que quede suave.", "Para las tortas de salmón ahumado, caliente una freidora a 180 ° C / 350 ° F. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Hervir las papas en una olla con agua hirviendo durante 12-18 minutos, o hasta que estén tiernas. Drene y devuelva la sartén al fuego durante un minuto para eliminar el exceso de humedad. Mash las papas, o pasar a través de un ricer de patata en un recipiente. Dejar enfriar un poco.", "Derrita la mantequilla en una sartén y fría las cebolletas durante 2-3 minutos, o hasta que se ablanden.", "Mezcle las cebolletas, el perejil, la ralladura de limón y el jugo en las papas y revuelva hasta que se combinen bien.", "Sazonar con abundante sal y pimienta negra recién molida, luego agregar el salmón y doblar cuidadosamente.", "Divida la mezcla en 16 pasteles de pescado pequeños, cada uno del tamaño de una uña del pulgar.", "Ponga la harina, el huevo batido y las migas de pan en tres cuencos separados.", "Cubra las tortas de pescado en la harina, luego huevo batido y finalmente en las migas de pan. Fríelas en profundidad (en tandas si es necesario) durante 1-2 minutos o hasta que estén doradas.", "Retire de la freidora y colóquelo en papel de cocina para drenar el exceso de grasa.", "Para servir, vierta la sopa en tazones poco profundos y coloque las tortas de pescado en el centro. Adorne con los brotes de guisantes y rocíe con crema y aceite de oliva."], "url": "www_bbc_co_uk_food_recipes_parsley_and_pea_soup_58491", "title": "Sopa de perejil y guisantes con tortas de salmón ahumado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Hojas de perejil de hoja plana de 30g / 1 oz (sin tallos)", "1-2 dientes de ajo, aplastados", "40 g / 1½ oz de parmesano recién rallado", "30g / 1oz de piñones", "75ml / 2½fl oz de aceite de oliva virgen extra", "sal"], "method": ["Coloque todos los ingredientes excepto el aceite y la sal en el procesador de alimentos. Guste por un segundo o dos, agregue el aceite y un poco de sal. Pruebe y corrija el condimento."], "url": "www_bbc_co_uk_food_recipes_parsleypestowithpota_11633", "title": "Pesto de perejil", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Rinde 1 porción", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["25g / 1oz de mantequilla", "Harina normal de 25g / 1oz", "600 ml / 1 litro de leche", "sal y pimienta blanca", "2 cucharadas de perejil, recién picado"], "method": ["Derretir la mantequilla en una olla.", "Agregue la harina y cocine durante 1-2 minutos.", "Retire la sartén del fuego y mezcle gradualmente la leche para obtener una salsa suave. Regrese al fuego y, revolviendo todo el tiempo, lleve a ebullición.", "Cocine a fuego lento durante 8-10 minutos y sazone con sal y pimienta blanca.", "Agregue el perejil y sirva."], "url": "www_bbc_co_uk_food_recipes_parsleysauce_1300", "title": "Salsa de perejil", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["30g / 1¼ oz de trigo fino bulgur", "600g / 1lb 5¼oz de tomates firmes maduros, cortados en dados en cubos pequeños, 0.5cm / ¼ en cuadrado", "½ manojo de cebollas de primavera, cortadas y rebanadas muy finas", "2 manojos de perejil de flatleaf, (aproximadamente 400 g / 14lb¼oz en el tallo), muy finamente picado", "menta pequeña, (aproximadamente 70 g / 2½ oz en el tallo), solo hojas, muy finamente picado", "¼ cucharadita de canela molida", "½ cucharadita de pimienta de Jamaica molida", "½ cucharadita de pimienta negra finamente molida", "sal", "1 limón, solo jugo", "5 cucharadas de aceite de oliva virgen extra", "4 lechugas Little Gem, lavadas y descuartizadas (o frescas hojas tiernas de vid o hojas de col blanca, lavadas y secas)"], "method": ["Enjuague el trigo bulgar en varios cambios de agua fría, drene bien y ponga en una ensaladera grande. Extienda los tomates cortados en cubitos y su jugo sobre el bulgar y luego agregue las cebollas en rodajas. Coloque el perejil picado sobre las cebolletas, busque las piezas grandes, si hay alguna, sáquelas y córtelas finamente. Agregue la menta picada al perejil, cúbrala con una toalla de cocina limpia y déjela durante aproximadamente media hora para que el trigo bulgar absorba los jugos de tomate y se ablande.", "Sazonar con canela, pimienta de Jamaica, pimienta y sal al gusto. Agregue el jugo de limón y el aceite de oliva y mezcle bien. Pruebe, ajuste los condimentos si es necesario y sirva inmediatamente con lechuga Little Gem o con hojas frescas de vid."], "url": "www_bbc_co_uk_food_recipes_parsleytomatoandburg_73147", "title": "Ensalada de perejil, tomate y trigo bulgar", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/parsleytomatoandburg_73147_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["600 ml / 1 pinta de salsa bechamel", "5 cucharadas de perejil fresco tbsp, finamente picado", "1 cucharada de crema individual", "1 cucharadita de jugo de limón", "sal", "pimienta negra recién molida"], "method": ["Caliente la salsa bechamel, agregue el perejil picado, el jugo de crema y limón, el sabor y la temporada, luego sirva."], "url": "www_bbc_co_uk_food_recipes_parsleysauce_70894", "title": "Salsa de perejil", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal 130 g / 4½ oz", "130g / 4½oz de harina integral simple", "2 cucharaditas de polvo de hornear", "1 cucharadita de especias mixtas", "pizca de sal", "1 huevo de gallinas camperas, ligeramente golpeado", "70 g / 2½ oz de mantequilla, derretida y enfriada ligeramente", "1 chirivía (aproximadamente 125 g / 4½ oz de peso precocido), pelado y rallado", "1 manzana pequeña, rallada", "75 g / 2¾oz pasas", "5 cucharadas de miel clara", "100ml / 3½fl oz de jugo de manzana", "125g / 4½oz de mantequilla sin sal, ablandada", "125g / 4½oz de queso crema con toda su grasa", "2 cucharadas de miel clara", "1 cucharadita de extracto de vainilla"], "method": ["Caliente el horno a 180 ° C / 350 ° F / Gas 4. Coloque dos moldes para muffins pequeños con cuadrados de pergamino para hornear, empujándolos hacia abajo para hacer pequeños estuches (alternativamente, use estuches de mini muffins comprados en la tienda).", "Mezcle las harinas, el polvo de hornear, la mezcla de especias y la sal en un bol.", "Batir el huevo y la mantequilla en un recipiente aparte. Agregue las chirivías, la manzana, las pasas y la miel y luego agregue los ingredientes secos. Agregue el jugo de manzana y mezcle para combinar, pero tenga cuidado de no mezclar en exceso.", "Con una cuchara, coloque la mezcla en las latas del panecillo y hornee por 18-20 minutos, o hasta que se levante (revise después de 15 minutos).", "Para el aderezo, bata la mantequilla en un bol hasta que quede suave y cremosa.", "En otro tazón, bata el queso crema hasta que quede cremoso y luego agrega la miel y el extracto de vainilla. Agregue la crema de mantequilla y revuelva para combinar. Transfiera el relleno a una manga pastelera equipada con una punta de estrella grande. Refrigere la manga pastelera durante aproximadamente 30 minutos (dejando la manga pastelera en la nevera facilita la tubería).", "Pipe el topping en los muffins."], "url": "www_bbc_co_uk_food_recipes_parsnip_apple_and_raisin_68466", "title": "Mini muffins de chirivía, manzana y pasas de uva", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Hace 24 mini magdalenas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/parsnip_apple_and_raisin_68466_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100g / 3½oz de mantequilla sin sal", "600g / 1lb 5 pastillas de chorizo, cortadas en trozos", "1 puerro pequeño, cortado y picado", "150ml / 5fl oz de vino blanco", "200 g / 7 oz de castañas cocidas (se venden al vacío)", "1,5 litro / 2 pintas de caldo de verduras (de preferencia hecho en casa)", "sal y pimienta negra recién molida", "8 vieiras"], "method": ["Derrite la mitad de la mantequilla en una cacerola grande de base pesada con un calor suave pero no permita que se coloree. Agregue las chirivías y el puerro y déjelos freír suavemente durante aproximadamente 4-5 minutos, o hasta que la chirivía esté suave.", "Agregue el vino blanco y las castañas (reservando algunos para decorar) y freír suavemente durante 7-8 minutos más. Sazone la mezcla con sal y pimienta al gusto.", "Agregue el caldo a la cacerola y lleve a ebullición, luego cocine a fuego lento durante 5-6 minutos. Retire la sartén del fuego y mezcle con una licuadora de inmersión o en un procesador de alimentos hasta que esté suave y agradable. (Si usa un procesador de alimentos, deje que la sopa se enfríe un poco antes de mezclarla) Pase la sopa por un colador fino y déjela a un lado.", "Caliente una sartén grande y agregue la mantequilla. Una vez derretido, agregue las vieiras y cocine en cada lado durante 1-2 minutos.", "Divida las vieiras chamuscadas entre cuatro tazones poco hondos y vierta la sopa alrededor. Ralla las castañas reservadas en la parte superior."], "url": "www_bbc_co_uk_food_recipes_parsnip_and_chestnut_03556", "title": "Sopa de chirivía y castaña", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50 g / 1¾oz de mantequilla sin sal", "1 chalota, más o menos picada", "1 diente de ajo, aproximadamente picado", "500 g / 1 libra 2 pastillas de chirivía, peladas, cortadas en trozos medianos", "2 ramitas de tomillo fresco", "1 cucharada de miel", "2 cucharaditas de polvo de curry mediano", "400ml / 14fl oz de caldo de verduras", "100ml / 3½ fl oz crema doble", "1 cucharada de aceite de colza", "50 g / 1¾oz de espinaca", "2 cucharadas de aceite de colza", "4 vieiras zambullidas a mano en sus caparazones, carne retirada y limpiada", "4 cucharadas de berro de coriandro"], "method": ["Para la sopa, derrita la mantequilla en una olla grande. Agregue la chalota y el ajo y cocine por 2-3 minutos. Agregue la chirivía, el tomillo, la miel y el polvo de curry y cocine durante 2-3 minutos más. Vierta el caldo y cocine durante 8-10 minutos, o hasta que la pastinaca esté tierna.", "Transfiera a una licuadora y mezcle hasta que quede suave. Vierta nuevamente en la sartén, agregue la crema y cálida.", "Mientras tanto, caliente el aceite en una sartén grande. Agregue la espinaca y algunas cucharadas de agua, luego cocine hasta que se marchite. Mantener caliente", "Para las vieiras, caliente el aceite en una sartén grande. Una vez caliente, agregue las vieiras y cocine por 1 minuto en cada lado, o hasta que estén recién cocidas. Retire de la sartén y sazone con sal y pimienta. Reserve para descansar por unos minutos antes de servir.", "Para servir, divida la espinaca marchita entre los tazones poco profundos y vierta sobre la sopa caliente. Adorne con las vieiras y el berro de coriandro."], "url": "www_bbc_co_uk_food_recipes_parsnip_soup_with_10440", "title": "Sopa de chirivía con espinacas y vieiras", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Cebada perlada de 100 g / 3½ onzas o espelta perlada", "2 cucharadas de aceite de oliva o de colza", "Chalotes de 250g / 9oz o cebollas baby, peladas y cortadas por la mitad", "300 g / 10½oz de coles de Bruselas, cortadas y hojas externas retiradas", "400g / 14oz chirivías, peladas y cortadas en trozos de 2.5 cm / 1 in", "150 g / 5½ oz de castañas cocidas y peladas", "150ml / 5fl oz de sidra medianamente seca", "2 hojas de laurel, rasgado", "2 ramitas de tomillo", "750ml / 26fl oz de caldo de verduras calientes", "aceite de oliva virgen extra, para lloviznar", "sal marina y pimienta negra recién molida", "frondosas cimas de 1-2 tallos de brotes de Bruselas", "½ diente de ajo, finamente picado o rallado", "25 g / 1 oz de nueces o semillas de calabaza", "1 limón, jugo y ralladura", "2-3 cucharadas de aceite de oliva virgen extra o de colza", "sal y pimienta negra recién molida"], "method": ["Coloque la cebada perlada en un recipiente grande, cubra con agua fría y déjela remojar durante 15 minutos.", "Caliente el aceite en una cazuela a prueba de fuego a fuego medio. Agregue los chalotes, las coles de Bruselas, las chirivías, las castañas y sazone con sal y pimienta. Cocine por 15 minutos, revolviendo solo ocasionalmente, hasta que obtenga un color dorado en las verduras.", "Agregue la sidra y cocine a fuego lento durante unos minutos, revolviendo y raspando el fondo de la sartén para desglasarlo, hasta que el líquido se haya reducido a casi nada.", "Escurra la cebada perlada y enjuague bien. Agregue a la cazuela con hojas de laurel, tomillo y caldo. Revuelva bien, hierva a fuego lento, luego reduzca el fuego a bajo. Cubra y cocine a fuego lento durante 35-40 minutos, o hasta que la cebada esté tierna. Verifica el condimento.", "Mientras tanto, para hacer el pesto, quite cualquier tallo duro de las hojas de Bruselas. Basta con triturar o cortar las hojas y colocarlas en un procesador de alimentos. Agregue el ajo, las nueces o las semillas de calabaza y algo de sal y pimienta. Mezcle hasta que esté finamente picado, deteniéndose una o dos veces para raspar los lados.", "Agregue un chorrito de jugo de limón y lentamente gotee en el aceite, mientras el procesador está encendido. Deténgase cuando los ingredientes hayan formado un pesto grueso: es más agradable si todavía tiene un poco de hoja y textura, en lugar de un puré suave. Pruebe y agregue más sal, pimienta o jugo de limón según sea necesario. Coloque en un recipiente y termine con unas finas rejillas de ralladura de limón.", "Para servir, ponga el caldo caliente en recipientes calientes y cubra con el pesto del brote."], "url": "www_bbc_co_uk_food_recipes_parsnip_sprout_and_73857", "title": "Chupito de chirivía, brotes y castañas con sidra y brotes de pesto", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50g / 2oz de mantequilla", "500 g / 1 libra 2 pastillas de chirivía, peladas, más o menos picadas", "2 chalotes de plátano, toscamente picados", "2 dientes de ajo, finamente picados", "2 ramitas de tomillo frescas, solo hojas", "½ cucharadita de curry en polvo", "750ml / 1pt 7fl oz de caldo de pollo", "Crema doble de 75 ml / 3 fl oz, más extra para decorar", "sal y pimienta negra recién molida", "aceite vegetal, para freír", "125ml / 4½fl oz de agua", "50g / 2oz de mantequilla, cortada en cubitos", "Harina normal de 75g / 3oz", "½ cucharadita de pimienta de cayena", "2 huevos de gallinas camperas", "75g / 3oz de carne de cangrejo blanca", "25g / 1oz de carne de cangrejo marrón", "sal y pimienta negra recién molida", "2 cucharaditas de aceite de oliva extra virgen", "2 cucharadas de berro de coriandro fresco", "1 cucharada de almendras en copos, tostadas"], "method": ["Para la sopa, derrita la mitad de la mantequilla en una cacerola grande hasta que forme espuma. Agregue las chirivías y fría por 4-5 minutos, o hasta que estén pálidas doradas.", "Agregue los chalotes, el ajo y el tomillo y fría por 2-3 minutos, luego agregue el polvo de curry y fría por otro minuto.", "Vierta el caldo de pollo y cocine durante 8-10 minutos, o hasta que las chirivías estén tiernas.", "Agregue la crema doble, enfríe la sopa ligeramente y mezcle la sopa en una licuadora hasta que quede suave.", "Cuele la sopa a través de un colador en una cacerola limpia y condimente, al gusto, con sal y pimienta negra recién molida. Agregue la mantequilla restante.", "Para los mini beignets de cangrejo, caliente el aceite en una freidora a 180 ° C / 350 ° F. Alternativamente, caliente el aceite en una sartén profunda de base pesada hasta que la miga de pan chisporrotee y se ponga marrón cuando se deje caer en ella. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Caliente el agua y la mantequilla en una cacerola hasta que la mezcla hierva, luego hierva por otro minuto.", "Retire la sartén del fuego y bata la harina y la cayena con una cuchara de madera hasta que quede suave, o hasta que la mezcla se desprenda del costado de la sartén. Regrese la sartén al fuego y cocine por 1-2 minutos, revolviendo continuamente.", "Retire la sartén del fuego y bata en los huevos, uno a la vez, batiendo bien antes de agregar el otro huevo.", "Agregue la carne de cangrejo blanca y marrón hasta que esté bien combinada, luego sazone con sal y pimienta negra recién molida.", "Coloque la mezcla en una bolsa de plástico y pinte 1,5 cm / ½ en secciones largas en el aceite y fría por 1-2 minutos, o hasta que estén doradas y crujientes. Retire los beignets de la sartén con una espumadera, déjelos a un lado para escurrirlos sobre papel de cocina y sazone con sal.", "Para servir, poner la sopa en cuencos de sopa, esparcir sobre beignet de cangrejo y terminar con un remolino de crema doble. Rocíe la sopa con aceite de oliva y espolvoree sobre el berro de cilantro y las almendras en copos."], "url": "www_bbc_co_uk_food_recipes_parsnip_soup_with_mini_24382", "title": "Sopa de chirivía con mini beignets de cangrejo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["8 rebanadas de tocino rayado, más o menos picadas", "Almejas de 1.5kg / 3lb 4 oz, limpiadas (deseche cualquier almeja que permanezca abierta después del enjuague)", "175ml / 6fl oz de vino blanco", "sal y pimienta negra recién molida", "2 cucharadas de perejil de flatleaf fresco picado", "50g / 2oz de mantequilla", "1 cebolla, pelada, más o menos picada", "2 dientes de ajo, pelados, finamente picados", "500 g / 1 libra 2 pastillas de chirivía, peladas, más o menos picadas", "2 ramitas frescas de tomillo, solo hojas", "750ml / 1pint 7fl oz de caldo de pollo", "Crema doble 75ml / 3fl oz", "1 cucharada de aceite de oliva", "4 rebanadas finas de baguette, untadas con un poco de aceite y tostadas"], "method": ["Calentar una sartén a fuego medio y freír la mitad del tocino durante 1-2 minutos, o hasta que se dore. Retire de la sartén con una espumadera y déjelo a un lado para escurrir sobre papel de cocina.", "Mientras tanto, caliente una sartén tapada a fuego medio. Agregue las almejas y el vino blanco, cubra la olla con una tapa y cocine al vapor las almejas durante 2-3 minutos, o hasta que todas las almejas se hayan abierto. (Deseche cualquier almeja que no se haya abierto durante la cocción).", "Cuele las almejas a través de un colador y reserve el licor de cocción. Recoge la carne de almeja de las conchas, colócala en un cuenco, condimenta al gusto con pimienta negra recién molida. Agregue el perejil y el tocino cocinado y reserve.", "Caliente la mitad de la mantequilla en una cacerola hasta que forme espuma y fríe la cebolla, el ajo y la mitad restante del tocino por 2-3 minutos, o hasta que se ablanden. Agregue los parnsips y el tomillo y cocine durante 2-3 minutos más. Verter el licor de cocción reservado de las almejas, llevar la mezcla a ebullición y cocinar hasta que el volumen del líquido se haya reducido en un tercio.", "Vierta el caldo de pollo y devuelva la mezcla a ebullición. Reduzca el fuego y cocine a fuego lento durante 8-10 minutos, o hasta que la pastinaca esté tierna.", "Agregue la crema doble y mezcle la mezcla en una licuadora hasta que quede suave.", "Pase la sopa mezclada a través de un colador en la cacerola y vuelva al fuego. Sazonar, al gusto, con sal y pimienta negra recién molida y batir con la mantequilla restante de 25 g / 1 oz.", "Para servir, cuchara algunas de las almejas en el centro de cada uno de los 4 cuencos de servir. Sirva la sopa alrededor de las almejas y cubra con una rebanada de pan tostado."], "url": "www_bbc_co_uk_food_recipes_parsnipsoupwithsteam_93513", "title": "Sopa de chirivía con almejas al vapor", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]