[{"isVegetarian": false, "title": "Cordero de otoño con judías verdes", "url": "www_bbc_co_uk_food_recipes_autumnlambwithbutter_92715", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 x 175 g / 6 oz de filetes de pierna de cordero, corte de grasa a intervalos (esto evitará que los filetes de cordero se encrespen mientras cocinan)", "125ml / 4½fl oz de aceite de oliva virgen extra", "sal y pimienta negra recién molida", "1 cebolla roja, pelada, finamente picada", "4 filetes de anchoas saladas, picadas", "8 tomates maduros, picados", "Mantequilla en conserva de 450 g / 1 libra, escurrida, enjuagada", "450 g / 1 libra de alcachofas a la parrilla, conservadas en aceite (disponible en delicatessen)", "1 cucharada de hojas frescas de romero finamente picadas", "1 cucharada de vinagre de Jerez"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Caliente una sartén a fuego medio hasta que esté caliente. Frote un poco del aceite en los filetes de pierna de cordero, con las manos, luego sazone, al gusto, con sal y pimienta negra recién molida.", "Agregue los filetes de pierna de cordero a la sartén caliente y cocínelos durante 2-3 minutos por cada lado, o hasta que aparezcan marcas doradas en la plancha a ambos lados de los filetes. Retire de la sartén y reserve para descansar. Mantener caliente", "Mientras tanto, caliente 1-2 cucharadas de aceite restante en una sartén separada a fuego medio. Agregue la cebolla y fría por 4-5 minutos, o hasta que se ablanden.", "Agregue los filetes de anchoa picados y los tomates picados y revuelva para combinar.", "Aumente el fuego, luego agregue los frijoles y las alcachofas. Continúe cocinando durante 4-5 minutos, con cuidado, hasta que los frijoles de mantequilla se hayan suavizado y las alcachofas se hayan calentado.", "Agregue el aceite restante, el romero y el vinagre de jerez hasta que estén bien combinados.", "Para servir, divida la mezcla de frijoles en partes iguales entre cuatro platos para servir. Coloque un filete de pierna de cordero encima de cada porción."]}, {"isVegetarian": true, "title": "Postre de arroz otoñal con fruta escalfada", "url": "www_bbc_co_uk_food_recipes_autumn_rice_pudding_with_69714", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500ml / 18fl de leche en oz", "500ml / 18fl oz crema", "1 vaina de vainilla, dividida abierta", "200g / 7oz de arroz con leche", "1 x 397 g / 14 oz de leche condensada", "3 ciruelas en rodajas", "100g / 3½oz de azúcar moreno", "100 g / 3½ oz de mantequilla", "6 higos, cortados en trozos", "4 cucharadas de azúcar en polvo", "1 manzana", "1 pera", "1 anís estrellado entero", "1 pequeño palo de canela", "2 cucharadas de azúcar, para el higo coulis"], "serves": "Para 6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Agregue la leche, la crema y la vaina de vainilla a una sartén grande y deje que hierva.", "Agregue el arroz y mezcle bien.", "Reduzca el fuego y cocine a fuego lento durante unos 20 minutos, o hasta que el arroz esté recién hecho. Revuelva con frecuencia para evitar que el arroz pegue la base.", "Precalentar el horno a 190C / 375F / Gas 5.", "Coloque las ciruelas en rodajas en una bandeja para hornear y espolvoree generosamente con azúcar morena y salpique con mantequilla. Asar en un horno caliente durante unos 10 minutos, o hasta que esté suave y jugoso. Dejar de lado", "Una vez que el arroz se haya cocinado, con un poco de calor, mezcle la leche condensada.", "Coloque los higos en una sartén con tres cucharadas de agua y dos cucharadas de azúcar en polvo. Llevar a ebullición, luego retirar del fuego, transferir a una licuadora y licuar hasta que quede suave.", "Rebana las otras frutas. Colóquelos en una sartén y cúbralos con dos cucharadas más de azúcar en polvo y cuatro cucharadas de agua y llévelos a ebullición. Agregue un anís estrellado y una ramita pequeña de canela y cocine hasta que los frutos estén suaves.", "Retire la sartén del fuego y deje enfriar.", "Sirva el arroz con leche con las frutas en la parte superior y el coulis de higo con cuchara sobre el plato."]}, {"isVegetarian": false, "title": "Sopa de Avgolemono", "url": "www_bbc_co_uk_food_recipes_avgolemono_soup_55766", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["huesos de un pollo de 1.5 kg / 3 lb 5 oz, o alas y / o baquetas de 450 g / 1 lb, o huesos sobrantes de un pollo asado", "1 zanahoria grande, más o menos picada", "2 palitos de apio, más o menos picados", "2 puerros, lavados y rebanados", "2 hojas de laurel", "2 ramitas de tomillo", "8 huevos de gallinas camperas", "1.5 litros / 2½ pintas de caldo de pollo", "1 cucharadita de sal", "1 pechuga de pollo sin piel, con un peso aproximado de 170 g / 6 oz", "Pasta de cebada 100 g / 3½ oz", "3 cucharadas de jugo de limón", "30g / 1oz de mantequilla", "pequeño puñado de perejil picado", "pimienta de cayena"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Para el caldo de pollo, ponga todos los ingredientes y 2¼ litros / 3¾ pintas de agua en una sartén grande y deje que hierva, eliminando cualquier residuo de la superficie. Deja hervir a fuego lento muy suavemente durante 2 horas: es importante no dejar que hierva, ya que eso fuerza la grasa del pollo y hace que el producto se enturbie. Cuele el caldo a través de un colador, y cocine a fuego lento un poco más para concentrar el sabor si es necesario. Si no se usa inmediatamente, deje enfriar, luego enfríe o congele para un uso posterior.", "Cueza 4 de los huevos en agua hirviendo a fuego lento durante 3-4 minutos, luego mueva a un recipiente con agua fría para detener el proceso de cocción. Refresque en agua caliente justo antes de servir.", "Caliente el caldo a fuego lento y agregue la sal. Cueza la pechuga de pollo durante 20 minutos. Retirar del caldo y dejar enfriar.", "Ponga a hervir el caldo, agregue la pasta orzo. Reduzca a fuego lento y cocine durante 7-8 minutos.", "Cuando la pechuga de pollo esté lo suficientemente fría como para manipularla, córtela en 4 a lo largo, luego córtela en tiras y déjela a un lado.", "Batir los 4 huevos restantes con el jugo de limón en un tazón. Vierta la mitad del caldo caliente sobre la mezcla de huevo y limón, batiendo todo el tiempo. Vuelva a colocar el huevo, el limón y el caldo en la sartén, vuelva al fuego y revuelva hasta que los huevos se espesen (aproximadamente a 70-80 ° C). No cocinar más.", "Retire del fuego y mezcle la mantequilla y el perejil.", "Agregue las tiras de pollo a la sopa y la cuchara en cuencos individuales. Agregue un huevo escalfado recalentado a cada porción y espolvoree con una pizca de pimienta de cayena."]}, {"isVegetarian": false, "title": "Canelones de aguacate con cangrejo, vieiras y hierbas del mar", "url": "www_bbc_co_uk_food_recipes_avocado_cannelloni_with_35421", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g / 7oz de tomates cherry, cortados a la mitad", "2 ramitas de tomillo fresco, hojas recogidas", "sal y pimienta", "1 aguacate maduro sin pulir", "½ lima, solo jugo", "1 gallo de gallo cocinado, carne blanca y marrón separada", "1 cucharada de cilantro fresco picado", "1 cucharada de mayonesa", "sal marina y pimienta blanca", "2 pomelo rosado, solo jugo", "1 cucharada de jarabe de azúcar", "1 cucharadita de goma de xantano", "pizca de pimentón ahumado", "1 cucharada de crema", "2 cucharadas de aceite de oliva", "2 grandes vieiras, conchas y corales extraídos por buceadores", "selección de aster de mar, col rizada y verdolaga, blanqueado y mantenido caliente", "1 cucharada de berro de coriandro"], "serves": "Porciones 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Caliente un horno a 140C / 120C Ventilador / Gas 1. Línea de una bandeja de horno.", "Coloque los tomates en la bandeja preparada y espolvoree las hojas de tomillo sobre la parte superior, sazone con sal y pimienta. Coloque en el horno y cocine durante 2 horas hasta que se seque.", "Coloque una hoja de película adhesiva de unos 30 cm / 12 pulgadas cuadradas.", "Dividir a la mitad el aguacate, luego use una mandolina para cortar el aguacate finamente, colocando las rebanadas una al lado de la otra a lo largo de la película, dejando 5 cm en cada extremo. Ahora exprime el jugo de lima sobre el aguacate y condimenta con sal marina y pimienta blanca.", "Tome la carne de cangrejo blanca, revisando que no haya cáscara o cartílago en la carne y luego vierta en un bol, agregue ligeramente el cilantro y la mayonesa. Mezcle y cocine a lo largo del medio del aguacate. Gire firmemente el aguacate alrededor de la carne de cangrejo, atando la película adhesiva en cada extremo y luego colóquela en la nevera por al menos 1 hora.", "Suavemente caliente el jugo de toronja con el jarabe de azúcar a fuego lento y bata la goma de xantano hasta que se espese.", "Tome la carne de cangrejo marrón, pimentón ahumado y crema en una licuadora. Empuje la mezcla a través de un colador en una manga pastelera.", "Justo antes de servir, calentar una sartén hasta que esté muy caliente, freír las vieiras en un poco de aceite de oliva, durante aproximadamente 1 minuto a cada lado.", "Saque los canelones de la película adhesiva y colóquelos en el centro del plato, déjelos enteros. Luego vierta la carne de cangrejo marrón en pequeños parches alrededor, alternando con el gel de pomelo rosado. A continuación, coloque las vieiras y las hierbas del mar prolijamente alrededor del plato. Adorne con los tomates y el berro de berro y sirva."]}, {"isVegetarian": true, "title": "Cuenco con aguacate, tomate, queso feta y arroz integral", "url": "www_bbc_co_uk_food_recipes_avocado_tomato_feta_and_25906", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/avocado_tomato_feta_and_25906_16x9.jpg", "ingredients": ["50g / 1¾oz de arroz integral", "1 cebolleta, en rodajas", "1 tomate en rodajas", "½ aguacate, en rodajas", "30 g / 1 oz de queso feta, desmenuzado", "2 ramitas de cilantro, hojas recogidas", "1 cucharada de aceite de oliva extra virgen", "sal y pimienta negra recién molida"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 0, "cooking": "no se requiere cocinar", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Cocine el arroz de acuerdo con las instrucciones del paquete, luego escurra.", "Coloque el arroz en el recipiente que planea comer. Agregue la cebolla tierna, tomate, aguacate, queso feta y cilantro.", "Rocíe abundantemente con el aceite y sazone con sal y pimienta. Coma enseguida o prepare su fiambrera lista para llevar al trabajo."]}, {"isVegetarian": true, "title": "Hummus de aguacate", "url": "www_bbc_co_uk_food_recipes_avocadohummus_92444", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/avocadohummus_92444_16x9.jpg", "ingredients": ["1 aguacate maduro, cortado por la mitad, piel y piedra eliminados", "1 x 400 g / 14 oz pueden garbanzos, drenados y enjuagados", "1 diente de ajo, pelado, finamente picado", "1-2 limones, solo jugo", "½ cucharadita de Tabasco", "½ cucharadita de comino molido", "sal marina, al gusto", "6 panes pitta listos para servir"], "serves": "Para 6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 0, "cooking": "no se requiere cocinar", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Mezcle todos los ingredientes en un procesador de alimentos hasta que quede suave.", "Transfiera el hummus de aguacate a un recipiente y cubra con una película adhesiva. Enfriar en la nevera durante una hora.", "Sirva en tazones con panes pitta."]}, {"isVegetarian": true, "title": "Crostini de queso de aguacate y cabra", "url": "www_bbc_co_uk_food_recipes_avocadoandgoatschees_72332", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["18 barras finas de baguette (1 baguette cortado en rondas)", "1 diente de ajo, reducido a la mitad", "aceite de oliva virgen extra", "1 aguacate maduro, pelado y cortado en cubitos", "100g / 3½oz de queso de cabra suave", "1 cucharada de jugo de limón", "1 cucharada de albahaca picada", "1 cucharada de cebolla roja cortada en cubitos", "sal y pimienta negra recién molida"], "serves": "Cumple 18 años", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 180 ° C / 360 ° F / Gas 4.", "Cepille las rebanadas de pan con el ajo y un poco de aceite de oliva, y hornee en el horno hasta que estén doradas y crujientes (aproximadamente 10 minutos). Retirar del horno y dejar enfriar.", "Mientras tanto, prepara la mezcla de aguacate. Mash el aguacate con el queso de cabra.", "Agregue dos cucharadas de aceite de oliva, el jugo de limón, la albahaca y la cebolla. Sazone al gusto.", "Cubra cada crostini con un montículo de la mezcla de aguacate y sirva."]}, {"isVegetarian": true, "title": "Berenjena 'parmigiana' con tomate fresco (berenjena parmigiana en tomate fresco)", "url": "www_bbc_co_uk_food_recipes_aubergineparmigianaw_92785", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 tomates de bistec de tamaño grande, de igual tamaño, maduros pero firmes, tops cortados a un cuarto del camino por el tomate y reservados, semillas y pulpa recogidas con una cuchara y reservados, tomates ahuecados reservados", "sal y pimienta negra recién molida", "9 cucharadas de aceite de oliva virgen extra, más extra para lloviznar", "1 cebolla pequeña, pelada, finalmente picada", "2 puñados de hojas frescas de albahaca", "2-3 cucharadas de harina natural, para dragado", "400 g / 14 oz berenjenas pequeñas, cortadas, finamente cortadas en rodajas", "2 huevos de gallinas camperas, batidos con una pizca de sal", "200 g / 7oz de mozzarella ahumada"], "serves": "Para 6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Coloque los tomates ahuecados en un plato forrado con papel de cocina. Agregue una pizca de sal a la cavidad de cada uno, luego coloque los tomates al revés y déjelos a un lado durante 10-15 minutos para drenar el exceso de humedad.", "Mientras tanto, caliente cuatro cucharadas de aceite de oliva virgen extra en una sartén a fuego alto. Agregue la cebolla y fría por 3-4 minutos, o hasta que se ablanden, luego agregue la pulpa de tomate reservada y la mitad de las hojas de albahaca y sazone, al gusto, con sal y pimienta negra recién molida. Revuelva bien.", "Reduzca el fuego a medio, cubra a medias la sartén con una tapa y continúe cocinando los tomates durante 18-20 minutos, o hasta que la mayor parte de la humedad se haya evaporado y la mezcla se haya espesado (controle y mezcle la mezcla regularmente para evitarlo). de la quema).", "Caliente dos cucharadas más de aceite de oliva en una sartén separada a fuego medio a alto. Mientras el aceite se está calentando, espolvorea la harina en un plato y draga las rondas de berenjena en la harina, sacudiendo cualquier exceso.", "Cuando el aceite esté caliente, sumerja cada ronda de berenjena en el huevo batido. Agregue las rondas de berenjena cubiertas al aceite caliente, en tandas si es necesario, y fríe durante 3-4 minutos en cada lado, o hasta que estén crujientes y doradas en ambos lados. Retire de la sartén con una espumadera y déjela a un lado para escurrir sobre papel de cocina. Sazonar, al gusto, con sal. Repita el proceso con los lotes restantes de berenjenas, si es necesario.", "Agregue una rodaja de berenjena frita a la cavidad de cada tomate ahuecado, luego cubra con una cucharada de salsa de tomate. Coloque una hoja de albahaca encima de la salsa, luego cubra con una rebanada de mozzarella ahumada.", "Repita el proceso de estratificación hasta que las cavidades de tomate estén llenas y se hayan agotado todos los ingredientes (reserve cualquier exceso de hojas de albahaca para la guarnición). Vuelva a colocar la \\\"tapa\\\" de cada tomate y transfiera los tomates rellenos a un plato resistente al horno. Sazonar, al gusto, con sal y pimienta negra recién molida y rociar un poco del aceite de oliva restante.", "Hornee los tomates rellenos en el horno durante 20-25 minutos, o hasta que los tomates se hayan suavizado y el queso se haya derretido.", "Para servir, coloque un tomate relleno en el centro de cada uno de los seis platos para servir. Adorne con las hojas de albahaca restantes, luego rocíe sobre el aceite de oliva restante y sazone de nuevo con sal y pimienta negra recién molida. Sirve caliente o tibia"]}, {"isVegetarian": true, "title": "Avocado salsa", "url": "www_bbc_co_uk_food_recipes_avocadosalsa_79052", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["¼ de cebolla roja, pelada y finamente picada", "½ aguacate, pelado y cortado en cubitos", "1 cucharada de azúcar en polvo", "exprimir jugo de lima", "pizca de copos de chile", "sal y pimienta negra recién molida"], "serves": "Sirve 1-2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 0, "cooking": "", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Mezcle la cebolla, el aguacate y el azúcar impalpable en un tazón grande. Agregue el jugo de lima, los copos de chile y el condimento.", "Vierta la mezcla en un plato y sirva."]}, {"isVegetarian": true, "title": "Aguacate con huevo escalfado y holandesa", "url": "www_bbc_co_uk_food_recipes_avocadowithpoachedeg_80922", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500ml / 18fl oz de agua hirviendo", "50ml / 2fl oz de vinagre de vino blanco", "1 huevo", "50ml / 2fl oz de vinagre de vino blanco", "5 granos de pimienta", "½ chalota, finamente picada", "1 hoja de laurel", "1 yema de huevo", "150g / 5½fl oz de mantequilla derretida", "sal y pimienta negra recién molida", "½ aguacate maduro, piedra removida"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Para cocer el huevo, coloca el agua y el vinagre en una olla y lleva a ebullición. Reduzca el fuego a fuego lento y agite el agua con una cuchara para crear un efecto de hidromasaje.", "Con cuidado, agregue el huevo en el centro de la bañera de hidromasaje y cocine por tres minutos, o hasta que esté cocido a su gusto.", "Para hacer el holandés, coloque el vinagre, los granos de pimienta, el chalote y la hoja de laurel en una cacerola pequeña no reactiva a fuego alto. Hierva rápidamente reduciendo el volumen del líquido a aproximadamente una cucharada, luego retírelo del fuego y déjelo enfriar por un minuto.", "Coloque la yema de huevo en un recipiente grande de vidrio y bata la reducción enfriada de vinagre a través de un colador.", "Poco a poco agregue la mantequilla derretida, batiendo vigorosa y continuamente. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, coloca el aguacate en el centro de un plato. Coloque el huevo escalfado sobre el aguacate y vierta sobre el holandés."]}, {"isVegetarian": true, "title": "Aguacate con salsa de tomate", "url": "www_bbc_co_uk_food_recipes_avocadowithtomatosal_80921", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 cucharada de aceite de oliva", "1 cucharadita de vinagre de vino blanco", "1 cucharadita de miel", "1 cucharadita de chalote finamente picado", "100g / 3½oz de tomates cherry, picados", "1 cucharada de albahaca fresca finamente triturada", "sal y pimienta negra recién molida", "½ aguacate maduro, piedra removida"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 0, "cooking": "no se requiere cocinar", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Coloque el aceite, el vinagre, la miel y la chalota en un tazón grande y mezcle bien.", "Agregue el tomate y la albahaca, sazone al gusto, con sal y pimienta negra recién molida y mezcle.", "Para servir, coloque el aguacate en el centro de un plato y espolvoree parte de la mezcla de salsa."]}, {"isVegetarian": false, "title": "Una ensalada tibia de espárragos, setas de campo y guisantes frescos", "url": "www_bbc_co_uk_food_recipes_awarmsaladofasparagu_67967", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["20 espárragos medianos, cortados y pelados", "175g / 6oz sin cáscara de guisantes jóvenes", "4 cucharadas de aceite de oliva virgen extra", "1 diente de ajo, machacado hasta formar una pasta con un poco de sal", "8 hongos de campo pequeños, tallos eliminados y pelados", "sal y pimienta negra molida", "1 pan ciabatta, cortado en dos horizontalmente y luego en dos de arriba a abajo", "1 chalote, finamente picado", "3 cucharadas de vermut seco", "55 g / 2 oz de mantequilla sin sal, en cubos", "1 cucharada de perejil picado de hoja plana", "1 cucharada de cebollines cortados", "1 cucharadita de estragón picado", "1 cucharada de jugo de limón recién exprimido", "30 g / 1 oz cada cohete y hojas de berro"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cocine los espárragos en agua con sal hirviendo durante 1 minuto, retírelos y déjelos a un lado.", "Agregue los guisantes al agua de cocción de los espárragos y cocínelos durante 2-5 minutos, escurra y reserve.", "Prepare su barbie, plancha o parrilla.", "Combine el aceite de oliva y el ajo y cepille sobre los espárragos y ambos lados de los champiñones con sal y pimienta negra.", "Grill o barbacoa los champiñones durante 4 minutos en cada lado, y los espárragos durante 2 minutos a cada lado. Mantenga ambos calientes. Cepille las rebanadas de ciabatta en ambos lados con el aceite de ajo y la parrilla hasta que ambos lados estén tostados.", "En una cacerola, caliente la infusión de aceite restante, agregue la chalota y, a fuego medio, deje cocer sin color.", "Agregue el vermut, aumente el fuego y cocine durante un minuto más.", "Retire la sartén del fuego y mezcle la mantequilla un poco a la vez. Agregue los guisantes, el perejil, el cebollín, el estragón y el jugo de limón. Sazone al gusto.", "Regrese a un calor suave para calentarlo.", "Combine el cohete y el berro y divídalo entre cuatro platos. Cubra las hojas con una rebanada de pan a la parrilla.", "Divida los espárragos y los champiñones entre las rebanadas de pan, organizándolos atractivamente en la parte superior de cada rebanada. Coloque los guisantes y los jugos mantecosos sobre las hojas de la ensalada."]}, {"isVegetarian": false, "title": "Ayam golek (pollo con especias con crema de coco y ensalada Rojak)", "url": "www_bbc_co_uk_food_recipes_ayamgolekspicedchick_86656", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 cm / 1 en pieza de jengibre fresco", "Galangal de 2 cm / 1 in (si galangal no está disponible, use el doble de la cantidad de jengibre fresco)", "1 cucharadita de sal", "4 chiles secos, empapados en agua caliente para ablandar", "5 chalotes, toscamente picados", "2 dientes de ajo", "4 tallos de limoncillo, hojas externas resistentes eliminadas", "4 poussin o pollos bebés", "300ml / 10½ fl oz crema de coco", "2 cucharaditas de azúcar", "2 limas, solo jugo", "2 cucharadas de pasta de camarones", "3 chiles rojos frescos, sin semillas, finamente picados", "4cm / 1½ en pieza de jengibre fresco de raíz, rallado", "1 cucharada de pulpa de tamarindo, puré (disponible en supermercados asiáticos e indios)", "1 lima, solo jugo", "5 cucharadas de agua hirviendo", "2 cucharadas de salsa de pescado (nam pla)", "3 cucharadas de azúcar en polvo", "½ pepino pequeño, cortado en trozos triangulares", "¼ de piña fresca, pelada, sin núcleo, cortada en cubos", "1 mango firme verde, pelado, sin piedra, cortado en cuñas delgadas", "1 papaya inmadura firme, pelada, sin semillas, cortada en tiras", "1 manzana Granny Smith, sin núcleo, cortada en cuñas delgadas", "2 cebollas tiernas, finamente cortadas", "½ manojo de menta fresca, solo hojas, rasgado (más extra para decorar)", "Cacahuetes escaldados asados ​​100g / 3½oz, aplastados"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precalienta el horno a 200C / 400F / Gas 6 y precalienta una sartén grande hasta que esté caliente.", "Para los poussins, coloque los ajíes, chalotes, ajo, jengibre, galanga y sal en un procesador de alimentos y mezcle. Agregue un poco de agua si es necesario para formar una pasta suave. (Mezcle los ingredientes más duros primero, luego agregue los más blandos al procesador para asegurarse de que la pasta esté muy suave).", "Frote el limoncillo con un rodillo, luego coloque un tallo dentro de la cavidad del cuerpo de cada poussin.", "Frote la mitad de la pasta de especias tanto en el interior como en el exterior de los poussins.", "Coloque la pasta de especias restante en una sartén. Agregue la crema de coco y el azúcar y coloque a fuego medio. Llevar a ebullición, luego reduzca el fuego a fuego lento, hasta que el líquido se haya reducido a la mitad.", "Coloque los poussins en la sartén y la plancha de la plancha caliente durante 3-4 minutos en todos los lados para obtener marcas doradas de la plancha por todas partes.", "Transfiera los poussins a una bandeja de asar y coloque en el horno para asar durante 15-20 minutos, o hasta que estén completamente cocidos. Durante la cocción, hilvane los poussins con la crema de coco reducida y la mezcla de especias cada cinco minutos.", "Retire los poussins y déjelos reposar durante 4-5 minutos en un lugar cálido. Antes de servir, vierta todos los jugos de la bandeja de tostado sobre los poussins y rocíe con el jugo de limón.", "Para el aderezo, reduzca la temperatura del horno a 180 ° C / 365 ° F / Gas 4.", "Coloque la pasta de camarones en papel de cocina y envuelva para sellar. Hornee en el horno durante diez minutos, o hasta que se vuelva nuez y seco (debe oler aromático en lugar de picante).", "Moler los chiles y el jengibre en una maja y mortero.", "Agregue la pasta de langostinos asados ​​y vuelva a moler con la mano y el mortero para combinar bien.", "Agregue la pulpa de tamarindo, el jugo de lima, el agua, la salsa de pescado y el azúcar y mezcle bien.", "Para la ensalada Rojak, coloque el pepino, la piña, el mango, la papaya y la manzana en un bol y mezcle bien.", "Agregue la cebolla tierna y la menta y mezcle suavemente.", "Agregue la mitad de los cacahuetes y revuelva suavemente.", "Vierta sobre el aderezo y mezcle nuevamente para cubrir bien.", "Para servir, coloca un poussin en cada plato. Agregue un par de cucharadas de ensalada y decore con los cacahuetes restantes y algunas hojas de menta."]}, {"isVegetarian": false, "title": "Molcajete azteca", "url": "www_bbc_co_uk_food_recipes_aztecmolcajete_87914", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 dientes grandes de ajo", "1 chipotle chilli (disponible en algunos supermercados o mercados de alimentos especializados)", "½ cebolla española, más o menos picada", "1 manojo de cilantro", "1 tomate, pelado, descuartizado y sin semillas", "50ml / 2fl oz de cerveza mexicana", "300g / 11oz de tomates pelados en conserva, picados", "sal y pimienta negra recién molida", "1 pechuga de pollo orgánica de corral, cortada en tiras", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "Filete de solomillo de 200g / 7oz", "150g / 5oz de chorizo ​​para cocinar, rebanado longitudinalmente", "1 manojo de cebollas de primavera, recortadas", "4 cucharadas de aceite de girasol", "½ cebolla, más o menos picada", "2 x 400 g / 14 oz latas de frijoles rojos en agua (escurrir y desechar el agua de una de las latas)", "75ml / 3fl oz de caldo de pollo", "sal y pimienta negra recién molida", "8 tortillas de harina o maíz", "½ racimo de cilantro, toscamente picado", "1 aguacate grande, pelado y cortado longitudinalmente", "1 lima"], "serves": "Para 4 personas", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Para la salsa, coloque el ajo, el chile, la cebolla y el cilantro en un mortero y mortero grande y aplaste hasta formar una pasta.", "Agregue el tomate y aplaste juntos, antes de agregar la cerveza y los tomates enlatados. Mezcle para combinar.", "Sazone al gusto con sal y pimienta negra recién molida.", "Transfiera esta mezcla a una sartén (o una maja de piedra de lava mexicana tradicional), colóquela a fuego alto y llévela a ebullición; tenga cuidado si está usando una mano de mortero de piedra, ya que hará mucho calor.", "Reduzca el fuego y cocine a fuego lento durante 20 minutos. Agregue más sal y pimienta negra recién molida, al gusto, y mantenga caliente.", "Para la base de molcajete, caliente una sartén hasta que esté caliente. Mezcle las tiras de pollo con aceite de oliva y sal y pimienta negra recién molida en un tazón pequeño. Coloque el pollo en la sartén de la plancha para comenzar a cocinar mientras sazona el bistec.", "Sazone el filete con sal y pimienta negra recién molida, al gusto, y agregue el bistec y el chorizo ​​a la sartén.", "Cocine la carne durante 2-3 minutos, luego voltee y cocine durante otros 2-3 minutos, o hasta que se cocine completamente. Retire la carne de la plancha y déjela en un lugar cálido para descansar.", "Agregue las cebolletas enteras a la sartén y a la plancha durante 1-2 minutos. Retire y reserve en un lugar cálido.", "Para los frijoles refritos, caliente una olla hasta que esté caliente y agregue el aceite de girasol y las cebollas y fría hasta que estén doradas.", "Agregue los frijoles, junto con el agua de una de las latas. Agitar, agregar el caldo de pollo y llevar a ebullición.", "Reduzca el fuego y cocine a fuego lento durante 5-8 minutos.", "Retire los frijoles del fuego y deje que se enfríen un poco. Licúe con una licuadora de mano y sazone con sal y pimienta negra recién molida. Recalentar los frijoles si es necesario.", "Para servir, tueste las tortillas debajo de la parrilla.", "La salsa debe servirse caliente en la maja de piedra de lava, o, si se usa una cacerola, verter en una mano de mortero de cocina normal y servir desde allí.", "Cortar el bistec y colocar en la salsa en la mano, junto con el chorizo ​​y el pollo. Adorne la parte superior con cebollas de primavera asadas, aguacate y cilantro picado. Sirva los frijoles refritos y las tortillas tostadas al costado."]}, {"isVegetarian": true, "title": "Baba Ghannouch", "url": "www_bbc_co_uk_food_recipes_baba_ghanoush_81714", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 berenjenas grandes", "2 tomates grandes de vid, toscamente picados", "1 pimiento rojo asado, aproximadamente picado (de una jarra está bien)", "1 manojo pequeño de perejil fresco de hojaldre, picado, reservando algunas hojas enteras para decorar", "1 diente de ajo, aplastado", "1 cucharada de melaza de granada", "2 cucharadas de aceite de oliva virgen extra", "1 granada, solo semillas", "sal y pimienta negra recién molida"], "serves": "Sirve 4-6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Perfore las berenjenas con un cuchillo y tueste en el horno por 45-50 minutos, o hasta que esté realmente suave y tierno. Dejar de lado para enfriar.", "Una vez que esté lo suficientemente frío para manipular, pele las berenjenas y coloque la carne en un tazón grande.", "Agregue los tomates, los pimientos y el perejil y mezcle bien. Agregue el ajo, la melaza de granada, el aceite de oliva virgen extra y sazone con sal y pimienta, revolviendo para combinar.", "Arregle en un plato para servir, rocíe con aceite de oliva. Adornar con las hojas de perejil reservadas y algunas semillas de granada."]}, {"isVegetarian": true, "title": "Baba ganoush, berenjena a la plancha con lentejas y buñuelos de berenjena", "url": "www_bbc_co_uk_food_recipes_baba_ganoush_grilled_50988", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 berenjenas", "2 dientes de ajo picados", "1 limón", "1 cucharada de tahini", "2 cucharadas de aceite de oliva", "1 cucharada de perejil fresco picado", "1 cucharada de menta fresca picada", "1 berenjena, en rodajas", "2 cucharadas de aceite de oliva", "1 diente de ajo, picado", "150 g / 5½ oz cocidas lentejas Puy", "1 cucharada de cilantro fresco picado", "1 cucharada de perejil fresco picado", "2 cucharadas de aceite de oliva", "1 cucharada de vinagre de vino blanco", "2 chalotes, picados", "aceite vegetal, para freír", "Harina de garbanzo 300 g / 10½ oz", "2 berenjenas cortadas en longitudes de dedos", "1 limón, ralladura rallada solamente", "2 cucharadas de perejil fresco picado", "1 chile rojo, finamente picado", "100g / 3½oz de ricot salado"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Para los baba ganoush, sostenga las berenjenas sobre una llama de gas hasta que se ennegrezca por completo (o córtelas bajo una parrilla caliente). Póngalos en un tazón grande y cubra con una película adhesiva. Reserve por unos minutos, luego lave la piel ennegrecida y saque la carne.", "Coloque en un procesador de alimentos con los demás ingredientes, aparte de las hierbas. Mezcle hasta que quede suave pero con un poco de textura. Retire del procesador y sazone al gusto con sal y pimienta. Espolvorea sobre las hierbas frescas y sirve.", "Para las lentejas y la berenjena a la parrilla, caliente una sartén grande con rejilla. Coloque la berenjena en un recipiente y agregue el aceite, el ajo y el perejil. Mezcle para cubrir la berenjena.", "Coloque las rodajas de berenjena en la bandeja de la plancha caliente y cocine durante 1-2 minutos en cada lado.", "Mezcle las lentejas con los ingredientes restantes y sazone con sal y pimienta.", "Coloque las berenjenas a la plancha en un plato para servir y apile la mezcla de lentejas encima.", "Para los buñuelos de berenjena, llene una freidora o una sartén grande, profunda y de fondo grueso, dos tercios llena con el aceite. Caliente a 180 ° C (un cubo de pan debe dorarse en un minuto cuando lo deje caer). PRECAUCIÓN: El aceite caliente puede ser peligroso. No dejes desatendido", "Mezcle la harina con un poco de agua para hacer una mezcla suave. Sumerja las piezas de berenjena en la mezcla para cubrir. Freír en lotes durante 3-4 minutos o hasta que estén dorados. Deja escurrir sobre papel de cocina.", "Mezcle la ralladura de limón, el perejil y el chile juntos. Espolvorear sobre las berenjenas fritas y rallar sobre la ricota salada."]}, {"isVegetarian": true, "title": "Baba ganoush", "url": "www_bbc_co_uk_food_recipes_baba_ganoush_44415", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/baba_ganoush_44415_16x9.jpg", "ingredients": ["3 berenjenas", "3 dientes de ajo, triturados con una cucharadita de sal", "1 limón, solo jugo", "2 cucharadas de tahini", "3 cucharadas de aceite de oliva", "pimienta negra, al gusto", "1 cucharada de perejil plano de hojas picadas"], "serves": "Sirve 6-8", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Pinche las berenjenas con un tenedor. Ase las berenjenas hasta que la piel esté carbonizada y ennegrezca y la carne se sienta suave al presionarlo (esto tomará aproximadamente 15-20 minutos, volteando hasta la mitad de la cocción).", "En una maja y mortero, triture el ajo con el jugo de limón, el tahini, el aceite de oliva y la pimienta.", "Cuando esté lo suficientemente frío como para manejarlo, corte las berenjenas por la mitad y saque la carne. Mezcle la carne suave con los ingredientes restantes.", "Coloque en un plato para servir y termine con un chorrito de aceite de oliva y espolvoree el perejil sobre la parte superior."]}, {"isVegetarian": true, "title": "Baba ganoush", "url": "www_bbc_co_uk_food_recipes_babaganoush_78707", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/babaganoush_78707_16x9.jpg", "ingredients": ["2 berenjenas, peladas y picadas", "6 cucharadas de aceite de oliva", "½ cebolla roja, finamente picada", "2 dientes de ajo, aplastados", "1 albahaca fresca de manojo grande", "salpicar aceite de oliva", "1 pan ciabatta", "aceite de oliva extra, cepillar"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Caliente el aceite en una sartén a prueba de horno a fuego medio. Agregue la berenjena y la cebolla y freír durante quince minutos para ablandar. Agregue el ajo y fría por dos minutos", "Mientras tanto, caliente una sartén de plancha. Cepille la chapata con aceite y ase el pan a cada lado durante 1-2 minutos, o hasta que aparezcan rayas marrones.", "Coloque la mezcla de berenjena en un procesador de alimentos con la albahaca y un chorrito de aceite. Mezclar hasta obtener una pasta áspera y verter en un bol.", "Sirva la mezcla de berenjena con el pan a la plancha."]}, {"isVegetarian": true, "title": "Berenjenas con orégano y cebollas rojas", "url": "www_bbc_co_uk_food_recipes_baby_aubergines_with_49593", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/baby_aubergines_with_49593_16x9.jpg", "ingredients": ["Berenjenas para bebés de 500 g / 1 lb 2 onzas", "3 cucharadas de aceite de oliva", "2 cucharaditas de orégano seco", "1 cebolla roja pequeña, cortada en finas medias lunas", "3 cucharadas de vinagre de vino tinto", "1 cucharadita de copos de sal marina o ½ cucharadita de sal", "4 cucharadas de aceite de oliva extra virgen", "1 diente de ajo, pelado", "1½ cucharadas de agua fría", "algunas ramitas de orégano fresco (opcional)"], "serves": "Para 6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 250C / 475F / Gas 9.", "Cortar las berenjenas a la mitad por la mitad, manteniendo los tallos puestos: esta es una consideración estética, nada que ver con el sabor, pero déjame un comentario.", "Vierta el aceite de oliva normal en una lata de horno muy poco profunda, espolvoree el orégano seco, agregue las berenjenas, con la parte del corte hacia abajo, y agítelas suavemente alrededor. Luego gírelos de modo que queden cortados y coloque la bandeja en el horno caliente durante 15 minutos, momento en el que deben estar tiernos y dorados en partes.", "Tan pronto como las berenjenas estén en el horno, coloca las finas medias lunas de cebolla roja en un bol y cúbrelas con el vinagre de vino tinto y la sal.", "Retire las berenjenas cocidas en un plato, y ahora mezcle en las cebollas vinagre el aceite de oliva virgen extra, luego el ajo rallado o picado y, finalmente, el agua fría.", "Vierta esto sobre las berenjenas calientes, usando sus manos para acomodar la cebolla rosada sobre ellas uniformemente, luego déjelas durante aproximadamente media hora para que se enfríen a temperatura ambiente antes de comer, esparciendo con orégano fresco, si tiene alguna, al servir ."]}, {"isVegetarian": false, "title": "Calamar relleno de morcilla con tomate y almejas", "url": "www_bbc_co_uk_food_recipes_baby_squid_stuffed_with_21407", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 cucharada de aceite de oliva", "1 chalote, finamente picado", "1 diente de ajo, finamente picado", "250 g / 9 oz morcilla morcilla", "3 calamares pequeños, limpios", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "1 cebolla, finamente picada", "1 diente de ajo, finamente picado", "1 x 227g de tomates picados en lata", "1 hoja de laurel", "1 cucharadita de pimentón dulce ahumado", "225ml / 8fl oz de vino blanco", "2 puñados de almejas crudas, restregadas", "1 manojo de perejil, finamente picado"], "serves": "Porciones 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Para hacer el calamar, caliente el aceite en una sartén a fuego medio. Sudor los chalotes y el ajo durante 5 minutos, o hasta que comience a ablandarse. Agregue el budín negro, rompiéndolo con una cuchara y revuelva todo junto. Cocine por unos minutos hasta que la morcilla esté cocida.", "Permita que la mezcla se enfríe y rellene los cuerpos del calamar bebé. Seguro con un palito de cóctel.", "Para hacer los tomates y las almejas, caliente el aceite en una sartén y sude la cebolla y el ajo durante 5 minutos. Agregue los tomates y la hoja de laurel y cocine a fuego lento hasta que se reduzca. Agregue el vino, lleve a ebullición y cocine a fuego lento hasta obtener una pasta espesa.", "Caliente el resto del vino en una cacerola. Agregue las almejas a la sartén, descartando las almejas abiertas que no se cierren cuando se da un golpecito fuerte. Cocine por 5 minutos, o hasta que las almejas estén abiertas. (Deseche cualquier que no se abra.) Retire las almejas y saque la carne. Colar el licor de cocción en la salsa de tomate, llevar a fuego lento y reducir. Agregue la carne de almeja y el perejil a la salsa y mezcle bien. Mantener caliente", "Mientras tanto, precalentar una sartén a fuego alto. Ase el calamar relleno en ambos lados hasta que esté cocido a la parrilla. Cortar en trozos gruesos.", "Coloque la salsa en un plato para servir y cubra con el calamar."]}]