[{"isVegetarian": false, "title": "Sweet and spicy duck with potato galette and orange vinaigrette", "url": "www_bbc_co_uk_food_recipes_sweetandspicyduckwit_87237", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["¼ tsp salt", "½ tsp coriander seeds", "½ tsp chilli flakes", "1 cardamom pod", "1 tsp olive oil", "½ duck breast, skin on", "½ large potato, peeled and sliced into 3 rounds", "1 tbsp olive oil", "salt and freshly ground black pepper", "1 orange, zest and juice", "2 tsp red wine vinegar", "¼ tsp ground turmeric", "1 tsp caster sugar", "2 tbsp olive oil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the duck, place the salt, coriander seeds, chilli flakes and cardamom pod into a mortar and pestle and pound together. Stir in the oil to make a paste. Rub the spice paste all over the duck.", "Heat a frying pan and fry the duck breast skin-side down for 8-10 minutes, or until a lot of the fat has been released and the skin is golden-brown and crisp.  Drain off any excess fat into a bowl.", "Turn over and fry for a further 3-4 minutes, or until completely cooked through. Remove from the pan and leave to rest for five minutes in a warm place.", "For the potato galette, boil the potatoes in a saucepan of salted water for five minutes, then drain.", "Heat the oil in a frying pan and fry the potato slices until golden-brown.  Season, to taste, with salt and freshly ground black pepper.", "For the vinaigrette, heat the orange zest and juice, vinegar, turmeric and sugar in a small pan and simmer until reduced by half and syrupy. Remove from the heat and whisk in the olive oil.", "To serve, arrange the potato slices on a serving plate, top with the duck and drizzle over the vinaigrette."]}, {"isVegetarian": false, "title": "Sweet and spicy sausages", "url": "www_bbc_co_uk_food_recipes_sweetandspicysausage_68086", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["12 large good quality pork or venison sausages", "3 tbsp grain mustard", "3 tbsp clear honey", "1 lemon, zest and juice", "2 tsp paprika"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oven to 200C/400F/Gas 6. ", "Mix together the honey, mustard, paprika, lemon juice and zest. Prick the sausages and toss in the mustard mixture. Put in a roasting tin and bake in the oven until brown all over and cooked right through. Turn the sausages from time to time whilst they are cooking.", "Serve with baked potatoes."]}, {"isVegetarian": false, "title": "Sweet and sticky ribs", "url": "www_bbc_co_uk_food_recipes_sweetandstickyribs_75147", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300ml/10fl oz tomato ketchup", "300ml/10fl oz dark soy sauce", "125g/4oz runny honey", "5cm/2in piece fresh ginger, peeled and minced ", "4 garlic cloves, minced ", "5 tbsp Amontillado sherry", "1 tsp ground star anise (optional)", "1 tbsp ketjap manis (sweet chilli sauce)", "1 tbsp fresh rosemary, chopped", "1.8-2.2kg/4-5lb pork spare ribs (baby back ribs, if possible)", "water", "2 spring onions, finely chopped", "6 large potatoes, each about 100g/4oz", "3 tbsp/2fl oz olive oil", "75g/2oz polenta", "30g /1oz parmesan, finely grated", "2 tbsp fresh rosemary, finely chopped", "salt and freshly ground black pepper", "soured cream ", "buttered mini sweetcorn"], "serves": "Serves 4 - 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["For the ribs, place the tomato ketchup in a large shallow dish with the soy sauce, honey, ginger, garlic, sherry, star anise (if using), ketjap manis and rosemary. Mix thoroughly to combine. ", "Add the ribs. If time allows, cover and chill for up to 24 hours.", "Place ribs in a large, deep pan. You may have to cut the ribs in half to get them to fit. Pour over the tomato ketchup mixture and then add enough water to completely cover the ribs. ", "Bring to a simmer, then cook over a medium heat for 45 minutes to one hour until completely tender.", "Preheat the grill. Remove ribs from the sauce and arrange ribs on a grill rack. Place the sauce on the hob over medium heat and reduce down until it has a sticky coating consistency. ", "Place the ribs under the preheated grill for about eight minutes on each side, basting or painting the ribs with the reduced marinade occasionally. Alternatively cook on a barbecue. ", "For the potato wedges, preheat the oven to 200C/400F/Gas 6. Prick each potato all over with a fork and rub with a little of the oil. Place potatoes directly on the oven shelf and bake for 40-45 minutes or until slightly softened when squeezed, then leave to cool. ", "When cool, cut each potato in half lengthways and then into quarters. Slice away a bit of the flesh, leaving a layer of potato at least 5mm/1/4in thick on the skin. Brush all over with the remaining oil.", "Place the polenta, parmesan, rosemary, salt and a generous grinding of black pepper in a bowl and mix together. Add the oiled potatoes and toss with the polenta mixture. Shake off any excess, then arrange in a single layer, skin-side down, on a wire rack set on a roasting tray.", "Place in the oven and bake for 30 minutes, turning halfway through, until crisp and golden-brown.", "To serve, cut the ribs into single-rib portions and arrange on a large platter. Scatter over the spring onions. Serve the potato skins and mini sweetcorn on the side or in separate bowls with plenty of napkins and finger bowls on hand for sticky fingers."]}, {"isVegetarian": false, "title": "Sweet and tangy chilli beef", "url": "www_bbc_co_uk_food_recipes_sweetandtangychillib_89294", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/sweetandtangychillib_89294_16x9.jpg", "ingredients": ["1 tbsp light soy sauce ", "4 tbsp lemon juice", "2 tbsp orange juice", "1 tsp groundnut oil ", "1-2 tsp caster sugar (or to taste)", "1-2 tbsp honey (to taste)", "½ small cucumber, halved lengthways, de-seeded and finely chopped ", "1 green chilli, de-seeded, finely chopped ", "1 tbsp groundnut oil", "250g/9oz beef fillet, cut into 5mm/¼in strips ", "1 tsp Shaoxing rice wine or dry sherry", "pinch crushed dried chilli flakes", "1 tsp light soy sauce", "pinch ground white pepper ", "1 large handful baby spinach leaves, washed", "2 heads pak choi, green stem variety, washed and sliced", "1 small mango, peeled, stone removed, flesh finely diced"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the sweet and tangy dressing, mix together the light soy sauce, lemon juice, orange juice, groundnut oil, caster sugar and honey in a small bowl. Whisk well to combine, then add the cucumber and chilli. Stir and set aside.", "For the beef, heat a wok until smoking and add the groundnut oil, then add the beef and stir fry for a few seconds. Add the rice wine or sherry and cook for one minute. ", "Add the crushed dried chilli flakes, light soy sauce and pinch of ground white pepper. Cook for 1-2 minutes, or until the beef is cooked to your liking. ", "To serve, scatter the spinach and sliced pak choi over a serving plate and spoon the chilli beef into the middle. Drizzle over the sweet and tangy dressing, sprinkle over the finely diced mangoes and serve immediately."]}, {"isVegetarian": true, "title": "Sweet baked mango and lime 'bruschetta'", "url": "www_bbc_co_uk_food_recipes_sweetbakedmangoandli_88336", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 slice crusty white bread", "25g/1oz butter, melted", "½ mango, peeled and sliced", "1 tsp caster sugar", "1 lime, zest and juice", "1 tbsp double cream", "icing sugar, to dust", "lime wedges"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Dip the slice of bread into the melted butter to coat and place onto a baking sheet. Top with the sliced mango and sprinkle with caster sugar, lime zest and juice. Place into the oven and bake for five minutes.", "Remove from the oven and place onto a serving plate. Drizzle with cream, dust with icing sugar and garnish with lime wedges. Serve immediately."]}, {"isVegetarian": true, "title": "Sweet blueberry omelette", "url": "www_bbc_co_uk_food_recipes_sweetblueberryomelet_84806", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz blueberries", "1 tbsp caster sugar", "4 free-range eggs, separated", "3 tbsp caster sugar", "25g/1oz unsalted butter", "1 tbsp olive oil", "icing sugar, to dust"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat a small ovenproof frying pan in the oven to 200C/400F/Gas 6.", "For the filling, place the blueberries and sugar into a small saucepan and cook gently for 3-4 minutes.", "For the omelette, place the egg whites into a large bowl and whisk until stiff.", "Place the egg yolks and sugar into a separate bowl and whisk until frothy.", "Pour the egg whites into the yolk mixture and fold in gently.", "Remove the frying pan from the oven and place the butter and oil into the pan to melt, then pour the egg mixture into the pan.", "Pour the blueberry mixture onto the middle of the egg mixture, transfer to the oven and bake for 4-5 minutes, or until set.", "To serve, remove the pan from the oven and dust with icing sugar."]}, {"isVegetarian": true, "title": "Sweet cherry tomatoes with melting mozzarella", "url": "www_bbc_co_uk_food_recipes_sweetcherrytomatoesw_73831", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["350-450g/12oz-1lb cherry tomatoes", "2-3oz buffalo mozzarella cheese", "olive oil, for dressing", "coarse sea salt and freshly ground black pepper", "demerara sugar, for sprinkling", "4 lemon wedges", "50g/2oz basil leaves", "100ml/3½fl oz olive oil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill. Halve the cherry tomatoes horizontally, placing them on a very shallow large serving dish or plate. ", "Slice the mozzarella reasonably thinly.", "To make the basil oil, place the basil leaves in a small processor. Warm the olive oil and pour over the leaves.", "Season with salt and pepper and blend the basil to a purée. Strain through a sieve and set aside. ", "Drizzle olive oil over the tomatoes, placing a nugget of sea salt on each half. Grind some pepper on the top and sprinkle with sugar. Place under a hot grill.", "Once they begin to sizzle, remove from grill and place mozzarella on top of the tomatoes.", "Replace dish under the grill, until cheese has melted. ", "Serve with basil oil and bread."]}, {"isVegetarian": true, "title": "Sweet citrus pancake soufflé", "url": "www_bbc_co_uk_food_recipes_sweetcitruspancakeso_84813", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75g/2¾oz plain flour", "3 free-range egg yolks", "50ml/2fl oz whole milk", "1 orange, juice and zest", "3 free-range egg whites", "1 tbsp caster sugar", "25g/1oz unsalted butter", "1 tbsp icing sugar, to dust"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Place the flour, egg yolks, milk and orange juice and zest into a clean bowl and whisk until the ingredients have combined and the mixture has a smooth texture.", "Place the egg whites into a separate clean bowl whisk them until stiff peaks are formed when the whisk is removed.", "Add the caster sugar to the egg whites and continue to whisk the mixture until it has a glossy texture.", "Fold the egg white mixture into the egg yolk mixture and stir until the two mixtures have combined.", "Melt the butter in a large frying pan.", "Add a large ladleful of the mixture to the pan and fry for two minutes on each side, until the pancake is golden.  Remove from the pan. Repeat this process with the remaining batter until all the mixture has been used.", "To serve, place the pancakes in a pile on a clean plate and dust with icing sugar."]}, {"isVegetarian": true, "title": "Sweet chilli, garlic, orange and coriander tofu on a soya bean, watercress and mint mash", "url": "www_bbc_co_uk_food_recipes_sweetchilligarlicora_88593", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz tofu", "1 garlic clove, finely chopped", "½ tsp dried chilli flakes", "1 tbsp sugar", "1 orange, juice only", "1 tbsp soy sauce", "1 tsp honey", "1 tbsp vegetable oil", "2 tbsp chopped fresh coriander", "200g/7oz soya beans", "½ bunch watercress, leaves only", "2 tbsp chopped fresh mint", "2 tbsp boiling water", "8 cherry tomatoes", "2 tbsp olive oil", "2 tbsp balsamic vinegar", "salt, to taste", "1 tbsp chopped fresh coriander, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the tofu, dry the tofu on kitchen paper and chop into cubes. Place the tofu into a non-reactive bowl with the rest of the tofu ingredients, except the oil and coriander, and stir well. Leave to marinate for at least ten minutes.", "Heat the oil in a wok and fry the tofu until golden-brown and crisp, about 5-7 minutes. Stir in the coriander.", "For the soya bean mash, blanch the beans in boiling water until tender, about 3-4 minutes. Drain the beans and transfer to a food processor. Add the watercress, mint and boiling water and pulse until the beans are mashed but not entirely smooth.", "For the balsamic tomatoes, place the tomatoes on a baking sheet and drizzle over the olive oil and balsamic vinegar. Sprinkle with salt and place in the oven to roast for 10-15 minutes.", "To serve, place a bed of the soya bean mash on a serving plate and spoon the marinated fried tofu over the top. Serve the roasted balsamic tomatoes to the side and sprinkle over the chopped coriander."]}, {"isVegetarian": true, "title": "Sweetcorn fritters", "url": "www_bbc_co_uk_food_recipes_sweetcorn_fritters_46558", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz sweetcorn", "3 spring onions, very finely chopped", "3 free-range eggs", "30ml/1fl oz milk", "75g/2½oz plain flour", "½ tsp cayenne pepper", "vegetable oil, for frying", "salt and freshly ground black pepper"], "serves": "Makes 10 fritters", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the fritters, put the sweetcorn and spring onions into a bowl. Beat the eggs with the milk. Pour this mixture over the sweetcorn and mix well. Season with salt and pepper. Sieve the flour with the cayenne pepper and then stir into the sweetcorn.", "Add the oil to a large frying pan – you need to shallow fry these, so make sure the base of the pan is well covered. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Heat the oil then test by adding a tiny bit of the batter – it should immediately start bubbling around the edges when it hits the oil. Using a small ladle, drop batter onto the oil – you need around 2 tbsp of mixture per fritter. You should be able to fry 4-5 at any one time. Fry for a couple of minutes on one side until a light brown then turn over and cook for a further minute.", "Turn out onto kitchen towel to blot off any excess oil and keep warm. Continue until you have used up all the batter."]}, {"isVegetarian": false, "title": "Sweetcorn fritters with crispy bacon and tomatoes", "url": "www_bbc_co_uk_food_recipes_sweetcorn_fritters_with_42524", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz frozen sweetcorn, defrosted ", "½ tsp chilli flakes ", "200g/7oz plain flour ", "1 tsp baking powder ", "2 eggs, beaten ", "150ml/5fl oz milk ", "salt and pepper ", "125g/4½oz bacon, chopped ", "2 tbsp olive oil ", "200g/7oz tomatoes, finely diced "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put the sweetcorn and chilli flakes into a mixing bowl. Sift in the flour and baking powder and mix. ", "In a separate small bowl or jug, combine the eggs and milk and season with a pinch of salt and pepper.  Pour over the sweetcorn and flour, and mix well so that everything is evenly distributed. ", "Preheat the oven to 160C/325F/Gas 3.", "Fry the bacon in a large dry frying pan over a medium heat until crisp and coloured. Once cooked remove and set to one side.", "If there are any burnt bits in the frying pan remove these.  Add some olive oil to the pan and then add tablespoon sized dollops of the sweetcorn batter to the pan (you will need to fry these in batches). Fry over a medium heat for 1-2 minutes, or until coloured, then turn and repeat on the other side. Keep warm in the preheated oven while you cook the remaining batter. Add a little more oil to the pan as you go to prevent the fritters sticking and to help them colour nicely.", "Meanwhile season the finely diced tomato with salt and pepper.", "Serve the crisp sweetcorn fritters with the bacon and the chopped tomato sprinkled over the top."]}, {"isVegetarian": true, "title": "Sweetcorn fritters with sweet chilli dip", "url": "www_bbc_co_uk_food_recipes_sweetcorn_fritters_with_76583", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/sweetcorn_fritters_with_76583_16x9.jpg", "ingredients": ["1 large free-range egg", "75g/2¾oz self-raising flour", "198g tin sweetcorn, undrained", "2 spring onions, trimmed and finely sliced", "1 long green or red chilli, finely chopped and seeds removed, if preferred", "25g/1oz fresh coriander leaves, finely chopped", "½ tsp flaked sea salt or ¼ tsp fine salt", "freshly ground black pepper", "1 tbsp extra virgin olive oil", "4 tbsp natural yoghurt", "2 tsp sweet chilli dipping sauce ", "2 vines cherry tomatoes, to serve", "mixed leaves, to serve", "lime wedges, for squeezing", "75g/2¾oz red cabbage, very finely shredded", "1 carrot, peeled and roughly grated", "2 spring onions, trimmed and finely sliced", "½ lime, juice only"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Break the egg into a bowl and add the flour and 2 tablespoons of water. Beat with a wooden spoon until smooth and thick. Stir in the sweetcorn with the liquid contents of its tin and add the spring onions, chilli, coriander, salt and lots of pepper. Mix well.", "Heat half of the oil in a large, non-stick frying pan. Gently drop 3 large spoonfuls of sweetcorn batter into the pan, keeping the fritters about 2–3cm/¾–1¼in apart. Flatten slightly with the back of a spoon. Cook over a medium–high heat for 3–4 minutes, or until the surface of each fritter looks dry and set and the base is lightly browned. ", "Turn over with a spatula and cook on the other side for a further 2–3 minutes, or until lightly browned and cooked through. Transfer to a warmed plate, lined with kitchen paper. Add the remaining oil to the pan and cook the remaining 3 fritters in the same way.", "While the fritters are cooking, mix the yoghurt with the chilli sauce. For the slaw, mix together the cabbage, carrot, spring onions and lime juice in a small bowl. Serve the fritters with the chilli-yogurt dip, slaw, tomatoes, mixed leaves and lime wedges for squeezing over the top. "]}, {"isVegetarian": false, "title": "Sweetcorn purée and roasted salmon with chargrilled corn, baby corn and sobrasada", "url": "www_bbc_co_uk_food_recipes_sweetcorn_pure_and_95179", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 baby sweetcorn", "3 corncobs", "1–2 tsp white wine vinegar", "2 tsp extra virgin olive oil", "300g/10½oz salmon fillets, cut into biggish cubes", "4–5 olive oil", "100g/3½oz sobrasada, cut into small pieces", "1 green chilli, thinly sliced", "2 spring onions, shredded", "2 tbsp finely chopped fresh coriander ", "1 lime, juice only", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. ", "Chargrill the baby sweetcorn in a griddle pan to soften. Slice into strips and set aside.", "Cut the corn off the cobs and place on a baking tray. Toast in the oven for 20 minutes, or until cooked through and tender. Set aside a small amount for the garnish and add the rest to a food processor. Add the vinegar and olive oil and blend to a paste. Season with salt and pepper.", "For the salmon, season with salt and pepper and toss in olive oil. ", "Add a little olive oil to a frying pan placed over a high heat. Fry the salmon on all sides for a few minutes, or until cooked on the outside but still pink in the middle. Set aside. Add the sobrasada to the pan and fry until crisp. Add the reserved sweetcorn kernels, remove from the heat and set aside.", "To serve, spoon some of the corn purée into serving dishes. Add the salmon, then spoon over the sweetcorn and sobrisada. ", "In a bowl, mix the sliced baby corn, chilli, spring onions and coriander. Add lime juice and olive oil to taste. Sprinkle over the salmon and serve."]}, {"isVegetarian": true, "title": "Sweetcorn relish", "url": "www_bbc_co_uk_food_recipes_sweetcorn_relish_14809", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["dash oil", "1 onion, chopped", "1 garlic clove", "2 tsp grated ginger", "1-2 chillies, chopped", "½ red pepper, chopped", "½ green pepper, chopped", "2 cobs of sweetcorns, kernels removed", "1 large tomato, seeds removed, skinned", "2 tbsp dark brown sugar", "2 tbsp cider vinegar", "½ tsp salt", "pepper, to taste", "3 tbsp chopped coriander"], "serves": "Makes 1 jar", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a pan and cook the onion, garlic and ginger until soft.", "Add the other vegetables to the pan and cook, allowing any liquid to evaporate.", "Add the remaining ingredients, except the coriander. Cook for five minutes.", "Add the coriander and cook for another minute. Transfer to a sterilised jar and leave to cool."]}, {"isVegetarian": false, "title": "Sweetcorn soup with crab and soured cream", "url": "www_bbc_co_uk_food_recipes_sweetcorn_soup_with_crab_97376", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz butter", "1 banana shallot, sliced", "1 tsp medium curry powder", "340g/12oz tin sweetcorn", "75ml/3fl oz white wine", "200ml/7fl oz double cream", "salt and freshly ground black pepper", "2 tsp lemon juice only", "100g/3½oz picked white crabmeat", "drizzle rapeseed oil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a large frying pan until medium hot. Add the butter, shallot and curry powder and fry for 2-3 minutes, or until just softened.", "Add the sweetcorn and all the liquid from the tin and then pour in the wine and enough water to just cover.", "Bring to a simmer, add half of the cream and then season with salt and black pepper.", "Bring the mixture back to the boil, remove from the heat to cool slightly and then transfer to a blender. Bend until smooth and return the soup to the pan to heat though. ", "Make some soured cream by whisking the remaining cream with the lemon juice until thickened.", "Ladle the soup into a serving bowl and then top with a little of the crab, a spoonful of the soured cream and a drizzle of rapeseed oil."]}, {"isVegetarian": false, "title": "Sweetcorn and bacon chowder", "url": "www_bbc_co_uk_food_recipes_sweetcornandbaconcho_82153", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 slices streaky bacon, chopped", "1 tsp butter, melted", "1 garlic clove, chopped", "1 tsp plain flour", "150ml/¼ pint whole milk", "50ml/2fl oz double cream", "50g/1¾oz uncooked sweetcorn", "6 clams, steamed for 5 minutes (discard anyt hat don't open)", "salt and freshly ground black pepper", "fresh chives, to garnish", "thick crusty white bread, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Fry the bacon for 2-3 minutes, add the butter and garlic and cook for 1 minute. Add the flour and stir well. ", "Gradually add the milk and cream and stir well. Add the sweetcorn and simmer until thick. ", "Add the clams and pour into a bowl. Garnish with chives and serve with crusty white bread."]}, {"isVegetarian": false, "title": "Sweetcorn and crab soup with sweetcorn beignets", "url": "www_bbc_co_uk_food_recipes_sweetcornandcrabsoup_91553", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/2oz butter", "1 onion, peeled, chopped", "1 garlic clove, peeled, crushed", "½ tsp curry powder", "450g/14oz tinned sweetcorn, drained", "600ml/1 pint 1½fl oz chicken stock", "200g/7oz white crabmeat", "250ml/7fl oz double cream", "½ lemon, juice only", "½ lime, juice only", "2 tbsp fresh coriander leaves, to garnish", "125ml/4½fl oz water", "50g/2oz butter, diced", "75g/3oz plain flour", "2 free-range eggs", "175g/6oz tinned sweetcorn, drained", "3 tbsp chopped fresh coriander leaves ", "1 lime, juice only", "vegetable oil, for deep-frying"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the soup, heat the butter in a large pan until foaming, then fry the onion and garlic together with the curry powder for 2-3 minutes, or until softened. Add the sweetcorn and fry for a further minute, then pour in the chicken stock and bring to a simmer. Cook for 2-3 minutes. ", "Add the crabmeat to the pan and bring to the boil. Take off the heat immediately, then transfer to a food processor and blend to a smooth purée.", "Return the soup to a clean pan set over a medium-low heat. Stir in the cream, lemon and lime juice, then season with salt and freshly ground black pepper. Keep warm. ", "For the beignets, place the water and butter into a pan and bring to the boil for one minute. Remove from the heat and stir in the flour immediately, beating continuously with a wooden spoon until the mixture is smooth and comes away easily from the side of the pan. ", "Return the pan to the heat for 1-2 minutes to heat through. Remove from the heat and add the eggs one at a time, beating well between each addition. Stir in the sweetcorn, coriander and lime juice, mixing until well combined. Season with salt and freshly ground black pepper. ", "Half-fill a deep, heavy-based pan with vegetable oil and heat to 180C/355F (check using a digital thermometer. CAUTION: hot oil can be dangerous. Do not leave unattended.) Drop teaspoonfuls of the beignet batter in batches into the hot oil and fry for 2-3 minutes, or until golden-brown and crisp. Remove with a slotted spoon and drain on kitchen paper. Repeat with the remaining beignet mixture.", "To serve, ladle the soup into serving bowls and place a few beignets on top. Garnish with a few coriander leaves."]}, {"isVegetarian": true, "title": "Sweetcorn and red peppers", "url": "www_bbc_co_uk_food_recipes_sweetcornandredpeppe_8824", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2¼lb sweetcorn kernels", "2 red peppers, deseeded and cubed", "1 red onion, peeled and sliced finely", "4 tbsp fresh parsley, chopped", "2 tbsp olive oil", "salt and pepper"], "serves": "Serves 8-10", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a large pan and add the onion and peppers. sauté for 2-3 minutes until starting to soften.", "Add the sweetcorn, season well and mix together. Turn down the heat, cover and cook gently until the vegetables are tender.", "Stir in the chopped parsley and serve at once."]}, {"isVegetarian": true, "title": "Sweetcorn chowder", "url": "www_bbc_co_uk_food_recipes_sweetcornchowder_78954", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp oil", "¼ onion, finely chopped", "200ml/7fl oz chicken stock (vegetarians may substitute with vegetable stock)", "¼ red pepper, diced", "½ red chilli, diced", "½ tin of sweetcorn", "salt and freshly ground black pepper", "25g/1oz mangetout, chopped", "1½ tbsp flatleaf parsley, chopped", "140ml/5oz double cream"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a saucepan. Add the onion and cook for five minutes, until softened.", "Add remaining ingredients, except for the parsley and cream, bring to the boil, reduce the heat and simmer for a further five minutes.", "Add the parsley and cream and heat through before serving."]}, {"isVegetarian": true, "title": "Sweetcorn fritters with salsa", "url": "www_bbc_co_uk_food_recipes_sweetcornfritters_90748", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 ear sweetcorn, kernels removed with a sharp knife", "2 free-range eggs, beaten", "2 tbsp plain flour", "2 tbsp milk", "salt and freshly ground black pepper, to taste", "2 tbsp olive oil", "1 ear sweetcorn, kernels removed with a sharp knife", "1 tomato, deseeded and chopped", "¼ red onion, finely chopped", "1 lime, juice only", "3 tbsp chopped fresh coriander"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the fritters, place all of the fritter ingredients except the oil in a bowl and mix well. ", "Heat the olive oil in a frying pan and fry spoonfuls of the batter for 2-3 minutes on both sides, or until golden-brown and crisp. Drain on kitchen paper. ", "For the salsa, mix together all of the salsa ingredients in a small bowl.", "To serve, place the bowl of salsa in the middle of a serving plate and arrange the fritters around."]}, {"isVegetarian": true, "title": "Sweetcorn fritters with salsa", "url": "www_bbc_co_uk_food_recipes_sweetcornfritterswit_78327", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz leeks, chopped ", "50g/1¾oz sweetcorn", "2 free-range eggs", "100g/3½oz self-raising flour", "milk, to mix ", "25g/1oz butter", "½ red pepper", "1 garlic clove, chopped", "3 tbsp coriander, chopped ", "1 tsp white wine vinegar", "40ml/1½fl oz olive oil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the fritters, in a bowl mix the chopped leeks with the sweetcorn.  Add the self-raising flour, eggs and milk to form a thick batter.", "In a large frying pan melt the butter.   Add spoonfuls of the batter and cook for one minute on each side until golden.", "For the salsa, in a bowl mix the red pepper with the garlic, coriander, white wine vinegar and olive oil.", "Serve the fritters with the salsa on the side."]}, {"isVegetarian": true, "title": "Sweetcorn fritters with chilli yoghurt", "url": "www_bbc_co_uk_food_recipes_sweetcornfritterswit_84031", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 free-range egg", "140g/5oz self-raising flour", "100ml/3½ fl oz whole milk", "sea salt and freshly ground black pepper", "1 corn on the cob, cooked and kernels cut off the cob", "25g/1oz butter", "100g/3½oz Greek yoghurt", "½ tsp dried chilli flakes"], "serves": "Makes 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the egg and flour in a bowl and mix together. Add th milk add whisk to make a thick pancake batter. Season with salt and freshly ground black pepper and add the sweetcorn, mixing throughly.", "Heat the butter in a frying pan on a medium to high heat. Carefully spoon four dollops of the sweetcorn mixture into the frying pan.", "Fry the fritters for three minutes on each side, or until golden on each side.", "Place the yoghurt and chilli flakes into a clean bowl and stir through.", "To serve, place the fritters onto a serving plate and spoon a dollop of the yoghurt mixture on the side of the plate."]}, {"isVegetarian": true, "title": "Sweetcorn fritters with salsa", "url": "www_bbc_co_uk_food_recipes_sweetcornfritterswit_85967", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz self-raising flour", "3 free-range eggs", "1 tsp baking powder", "100g/3½oz canned sweetcorn, rinsed and drained", "1 tsp chilli flakes", "salt and freshly ground black pepper", "1 tbsp olive oil", "25g/1oz butter", "1 beef tomato, seeds removed, chopped", "1 lime, juice and zest", "1 tbsp olive oil", "2 tbsp chopped fresh coriander", "salt and freshly ground black pepper"], "serves": "Serves 1-2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the fritters, place the flour, eggs and baking powder into a bowl and mix well.", "Add the sweetcorn and chilli flakes, season well with salt and freshly ground black pepper and stir.", "Heat the oil and butter in a pan and place spoonfuls of the sweetcorn mixture into the pan. Fry the fritters for 2-3 minutes on each side, or until golden-brown. Remove from the pan and keep warm. Repeat with the remaining batter.", "For the tomato salsa, place all of the salsa ingredients into a bowl and stir to combine.", "To serve, place the fritters onto a serving plate and spoon over the salsa."]}, {"isVegetarian": false, "title": "Sweetcorn fritters with bacon and honey", "url": "www_bbc_co_uk_food_recipes_sweetcornfritterswit_86101", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz self-raising flour", "1 tsp salt", "5 tbsp milk", "100g/3½oz canned sweetcorn, rinsed and drained ", "1 tbsp vegetable oil", "4 slices bacon, fried until crisp", "2 tbsp honey, for drizzling"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the flour, salt and milk into a large bowl and whisk together to make a smooth batter. Stir in the sweetcorn.", "Heat the vegetable oil in a frying pan and pour spoonfuls of the batter into the pan. Fry the fritters until golden-brown underneath, then turn over with a fish slice and fry until golden-brown on the other side. Remove from the pan and set aside to keep warm. Repeat the process with the remaining batter.", "To serve, place the fritters onto serving plates, top with the bacon and drizzle over the honey."]}, {"isVegetarian": true, "title": "Sweetcorn fritter with mango and sweetcorn salsa", "url": "www_bbc_co_uk_food_recipes_sweetcornfritterwith_78951", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz flour", "1tsp baking powder", "2 free-range egg yolks", "2-3 tbsp milk", "salt and freshly ground black pepper", "2 free-range egg whites", "½ tin sweetcorn", "1 tbsp butter", "3 tbsp sweetcorn", "¼ red chilli, diced", "½ mango, diced", "3 tbsp coriander"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220F/425F/Gas 7.", "Whisk the flour, baking powder and egg yolks in a bowl. Then add enough milk to make a stiff batter and season, to taste, with salt and freshly ground black pepper.", "In a separate bowl, whisk the egg whites until stiff and then fold into the batter.", "Add the sweetcorn and fold through the batter mixture.", "Onto a baking sheet pour out portions of the sweetcorn batter. Place into the oven and bake for 5-10 minutes, or until puffed up and set.", "Meanwhile, in a saucepan, add all of the salsa ingredients except for the coriander. Add a splash of water, bring to the boil, reduce the heat and simmer for five minutes.", "Add the coriander and stir through. ", "Serve the fritters on a warm plate with the salsa beside."]}]