[{"isVegetarian": true, "title": "Cranberry sauce", "url": "www_bbc_co_uk_food_recipes_cranberry_sauce_77431", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cranberry_sauce_77431_16x9.jpg", "ingredients": ["100g/3½oz light brown sugar", "100ml/3½fl oz fresh orange juice", "250g/9oz fresh or frozen cranberries", "1 clementine, finely grated zest only (optional)"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Combine the sugar and orange juice in a large saucepan and bring to the boil. ", "Stir in the cranberries and clementine zest (if using), then simmer until the cranberries are tender but still holding their shape – this will take about 5 minutes if using frozen cranberries and a little longer if using fresh. ", "Refrigerate until needed, the sauce will thicken as it cools.", "Remove from the fridge an hour before serving."]}, {"isVegetarian": false, "title": "Cranberry and apple jelly with roast pork loin", "url": "www_bbc_co_uk_food_recipes_cranberryandapplejel_86607", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2lb 2oz Bramley apples, peeled, cored and chopped", "1kg/2lb 2oz cranberries", "1 tsp ground cinnamon", "water, to cover", "1-1.5kg/2lb 2oz-3lb 4oz granulated sugar ", "2 tbsp olive oil", "1kg/2lb 2oz pork loin, skin on", "salt and freshly ground black pepper"], "serves": "Serves 6-8", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the jelly, place the apples, cranberries and cinnamon into a large saucepan and pour over enough water to just cover. Bring to the boil, then reduce the heat and simmer for 10-15 minutes until the apples and cranberries are broken down.", "Pass the mixture through a sieve lined with a clean kitchen cloth or muslin into a large jug. Discard the pulp left in the sieve.", "For every 600ml/1 pint of liquid you have, add 500g/1lb 2oz of granulated sugar.", "Pour the mixture back into a clean pan with a sugar thermometer and cook slowly until it reaches 220C/105F - alternatively, place a spoonful of the jelly onto a cold plate and check if it sets.", "Pour the jelly into warm sterilised jars while still hot and allow to cool and set.", "For the roast pork, preheat the oven to 180C/350F/Gas 4.", "Heat the olive oil in a large frying pan. Season the pork with salt and freshly ground black pepper and place into the frying pan. Cook briefly on all sides until lightly browned all over.", "Transfer to a roasting tin and place in the oven for 40-60 minutes, or until the crackling is golden and the pork is completely cooked through.", "To serve, carve the pork into portions and place onto serving plates with a spoonful of the cranberry and apple jelly."]}, {"isVegetarian": true, "title": "Cranberry and Cumberland sauce", "url": "www_bbc_co_uk_food_recipes_cranberryandcumberla_70984", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cranberryandcumberla_70984_16x9.jpg", "ingredients": ["450g/1lb fresh cranberries", "300ml/10fl oz ruby port", "115g/4oz caster sugar", "125ml/4fl oz fresh orange juice", "1 tsp cornflour", "1 tsp English mustard powder", "1 tsp lemon juice", "pinch of ground cloves", "75g/3oz sultanas", "55g/2oz flaked almonds", "1 tbsp grated orange rind", "1 tsp grated lemon rind", "salt"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Combine the cranberries, port, sugar and orange juice in a pan over a medium heat, for ten minutes, until the fruit bursts.", "Combine the corn flour, mustard, lemon juice and cloves with a little water to make a paste and stir into the berry mixture. ", "Next, add the sultanas, almonds, orange and lemon rind, simmer for five minutes, season and then chill. Serve with your Christmas turkey."]}, {"isVegetarian": true, "title": "Cranberry and orange trifle", "url": "www_bbc_co_uk_food_recipes_cranberryandorangetr_84811", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100ml/3½fl oz double cream", "50ml/2fl oz milk", "1 vanilla pod, split in half, seeds scraped out", "4 free-range egg yolks", "50g/1¾oz caster sugar ", "50ml/2fl oz double cream, whipped", "50g/1½oz mascarpone", "2 tbsp runny honey", "50g/1¾oz cranberries", "1 tsp water", "50g/1¾oz caster sugar", "50g/1½oz ready-made sponge fingers", "1 orange, juice only", "icing sugar, to dust"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the custard, place the cream, milk and vanilla pod and seeds into a small saucepan. Heat the mixture until it begins to simmer.  Then remove the pan from the heat and set aside to infuse.", "Place the egg yolks and the sugar into a large bowl and whisk together until they have combined and formed a smooth texture.", "Remove the vanilla pod from the cream and milk mixture and set aside (the pod can be used again, for another dish). ", "Gradually add the warm milk and cream mixture into the egg bowl, whilst whisking vigorously.  Once the mixtures have combined, pour the liquid back into the saucepan and return to the heat.  Stir the mixture continually until the mixture becomes thick enough to coat the back of the spoon.", "Remove the pan from the heat, cover with cling film and transfer to the fridge to cool for five minutes.", "For the topping, place all the ingredients into a clean bowl and mix well, until the ingredients have combined.", "For the cranberries, place the cranberries along with a tsp water into a small saucepan over a low heat and cook for 6-8 minutes, or until the cranberries have burst. Stir in the sugar, then remove the pan from the heat and leave to cool slightly. ", "To serve, place the sponge fingers into a tall, clean dessert glass and pour the orange juice over the sponge fingers.  Pour the cranberry mixture, followed by the custard over the sponge fingers. Spoon the cream mixture on top of the custard.  Dust the cream with icing sugar."]}, {"isVegetarian": true, "title": "Cranberry mincemeat", "url": "www_bbc_co_uk_food_recipes_cranberrymincemeat_73340", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz butter", "200g/7oz soft dark brown sugar e.g. unrefined muscovado", "250ml/9fl oz orange juice", "2 tsp ground mixed spice", "½ tsp ground cinnamon", "½ tsp ginger", "pinch of grated nutmeg", "250g/9oz Bramley apples", "200g/7oz sultanas", "200g/7oz currants", "100g/3½oz dried cranberries or raisins", "200g/7oz mixed candied peel, finely chopped", "1 tbsp grated orange zest", "150ml brandy, cognac, rum or whisky"], "serves": "Makes 1.2kg -enough for 24 pies", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Combine the butter, sugar, orange juice and all the spices in a saucepan, and leave on a gentle heat, stirring occasionally, until the butter has melted and the mixture is smooth. ", "Peel, quarter, core and finely chop the apples. Add the chopped apples to the pan, along with the sultanas, currants, cranberries or raisins, candied peel and orange zest, stirring well.", "Bring to the boil, and simmer gently for 10 minutes or until the apples have softened, then set aside.", "Add the brandy or other alcohol and allow to cool. ", "When cold, spoon into clean, dry jars, and seal tightly and refrigerate for up to a month until required. ", "To keep for up to six months, double the amount of alcohol."]}, {"isVegetarian": true, "title": "Cranberry-studded mincemeat", "url": "www_bbc_co_uk_food_recipes_cranberrystuddedminc_90619", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cranberrystuddedminc_90619_16x9.jpg", "ingredients": ["75g/2½oz soft dark brown sugar", "60ml/2fl oz ruby port", "300g/10½oz cranberries", "1 tsp ground cinnamon", "1 tsp ground ginger", "½ tsp ground cloves", "75g/2½oz currants", "75g/2½oz raisins", "30g/1oz dried cranberries", "1 clementine, zest and juice only", "25ml/1fl oz brandy", "few drops almond extract", "½ tsp vanilla extract", "2 tbsp honey"], "serves": "Makes 600ml/1 pint", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["In a large pan, dissolve the sugar in the ruby port over a gentle heat.", "Add the cranberries and stir.", "Add the cinnamon, ginger and cloves, currants, raisins, dried cranberries and the zest and juice of the clementine.", "Bring to a gentle simmer and cook for 20 minutes, or until the fruit has broken down and has absorbed most of the liquid in the pan. (You may need to squish the cranberries a little with the back of a wooden spoon to incorporate them fully.)", "Remove from the heat and allow to cool a little.", "Add the brandy, almond extract, vanilla extract and honey and stir well with a wooden spoon to mash the mixture down into a paste.", "Spoon the mincemeat into sterilised jars and, once cool, store in the fridge for up to two weeks."]}, {"isVegetarian": false, "title": "Crayfish with truffle butter", "url": "www_bbc_co_uk_food_recipes_crayfish_with_truffle_85043", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2-3 kg/4lb 8oz- 6lb 8oz crayfish", "500ml/18fl oz bottle stout", "100g/3½oz salt", "2 tsp sugar", "bunch of dill crowns or dill leaves", "1 tsp anise seeds or fennel seeds", "150g/5½oz butter", "1-2 tbsp truffle oil ", "salt"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the crayfish, bring 4 litres/7 pints water to the boil. Add the stout, salt, sugar, dill crowns and anise seeds. Add all the crayfish, bring back to the boil and boil for between 8-10 minutes. Strain and allow to cool before eating. ", "For the truffle butter, melt the butter and whisk in the truffle oil. Season with a little salt.  Taste to make sure the truffle flavour is pronounced enough, adjust as necessary. ", "Serve the crayfish with the melted truffle butter alongside. "]}, {"isVegetarian": false, "title": "Crayfish lettuce baskets", "url": "www_bbc_co_uk_food_recipes_crayfishlettucebaske_85021", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz crayfish, cooked", "¼ onion, finely chopped", "1 tbsp soy sauce", "1 tbsp honey", "1 tsp sesame oil", "1 spring onion, chopped", "6 Little Gem lettuce leaves", "3 lime wedges, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the crayfish, onion, soy sauce, honey, sesame oil and spring onion into a pan and heat gently for 4-5 minutes.", "To serve, place the lettuce leaves onto a plate, pour over the crayfish mixture and garnish with lime wedges."]}, {"isVegetarian": false, "title": "Crayfish chowder", "url": "www_bbc_co_uk_food_recipes_crayfish_chowder_28530", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 onion, sliced", "1 carrot, diced", "1 celery stick, diced", "2kg/4lb 8oz crayfish (around 20 medium crayfish), shelled, tail meat reserved for soup", "250ml/9fl oz white wine", "2 bay leaves", "bunch of dill, stems only", "few sprigs parsley", "3 garlic cloves, peeled, left whole", "½ lemon, zest only", "1 tsp black peppercorns", "1 star anise", "30g/1oz butter", "1 onion, finely chopped", "750g/1lb 10oz potatoes, cut into 2cm/¾in cubes ", "4 leeks, washed, sliced into rounds", "dill leaves", "salt and freshly ground black pepper", "4 tsp crème fraîche "], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["First make the stock.  Put the olive oil in a large, heavy-based saucepan.  Add the vegetables and sauté briskly until starting to caramelise.  Add the crayfish shells and stir until any liquid evaporates off and they turn a deep red.", "Pour over the white wine and leave to bubble for a couple of minutes. Pour in 1½ litres/2½ pints water and the remaining stock ingredients. Bring to the boil then turn the heat down and simmer for 40 minutes. Strain and set aside. ", "For the chowder, melt half of the butter in a large saucepan.  Add the onion and sauté until translucent.  Add the potatoes and leeks and stir to mix.  Add the stock and season with salt and pepper. ", "Bring to the boil, turn down the heat and simmer, uncovered, for about 15 minutes.  At this point the vegetables should be tender.  Stir in the dill leaves.", "Melt the remaining butter in a frying pan. Season the reserved crayfish tails with salt and pepper and add to the pan.  Fry for a couple of minutes and add to the chowder. Divide the chowder between 4 bowls and top with a teaspoon of crème fraîche, serve immediatedly. "]}, {"isVegetarian": false, "title": "Crayfish cocktail with melba toast", "url": "www_bbc_co_uk_food_recipes_crayfish_cocktail_with_95972", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["32 raw crayfish ", "2 Little Gem lettuces, leaves separated", "½ tsp cayenne pepper", "2 free-range egg yolks", "2 tsp white wine vinegar", "1 tsp Dijon mustard", "300ml/10fl oz rapeseed oil ", "2 tbsp tomato ketchup", "1 tbsp Worcestershire sauce", "2 dashes Tabasco sauce", "1 tbsp brandy", "½ lemon, juice only", "8 slices white bread, crusts removed"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Steam the crayfish for 4-5 minutes, or until pink. Remove from the pan, set aside to cool and peel. (Keep four crayfish whole for the garnish.)", "For the cocktail sauce, whisk the eggs, white wine vinegar and mustard into a food processor until pale and creamy. With the motor running, pour in the oil in a steady stream, until the mixture thickens into a mayonnaise.", "Spoon the mayonnaise into a bowl, then stir in the tomato ketchup, Worcestershire sauce, Tabasco, brandy and lemon juice until well combined. Season with salt and freshly ground black pepper. Stir in the crayfish tails.", "For the melba toast, grill both sides of the bread until golden-brown, then cut the toast slices in half horizontally. Grill the soft inner sides until golden-brown, then cut the toast slices into quarters diagonally.", "To serve, arrange the lettuce leaves into the bottom of a glass and top with the crayfish cocktail.", "Dust with cayenne pepper and garnish with the reserved crayfish. Serve the melba toast alongside."]}, {"isVegetarian": false, "title": "Crayfish risotto with crayfish bisque", "url": "www_bbc_co_uk_food_recipes_crayfishrisottowithc_87481", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "50g/2oz butter", "2 shallots, peeled and chopped", "1 fennel bulb, finely chopped", "1 tbsp plain flour", "1 tbsp tomato purée", "500g/1lb 2oz cooked crayfish shells", "2 tbsp brandy", "1 litre/1¾ pints fish stock ", "2 bay leaves", "2 sprigs fresh flatleaf parsley", "salt and freshly ground black pepper ", "1 litre/1¾ pints fish stock", "25g/1oz butter", "1 small onion, finely chopped", "150g/5oz leeks, cut into thick slices", "250g/9oz arborio risotto rice", "75ml/3fl oz dry white wine", "250g/9oz cooked crayfish tails", "50g/2oz mascarpone", "50g/2oz parmesan, grated", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the bisque, heat the oil and butter in a wide frying pan and sauté the shallots and fennel for 2-3 minutes.", "Add the flour and tomato purée and cook, stirring, for a further minute.", "Add the crayfish shells and brandy and cook for another minute.", "Add the fish stock, bay leaves and parsley and bring to a simmer. Cook for 20-25 minutes, or until the liquid has reduced by a third. Remove from the heat and allow to cool slightly.", "Pour the mixture into a food processor and blend to a fine purée.", "Pass the purée through a sieve into a clean saucepan and season, to taste, with salt and freshly ground black pepper.", "For the risotto, place the fish stock into a saucepan and bring to a gentle simmer.", "Meanwhile, heat the butter in a saucepan, add the onion and leeks and cook gently for a few minutes, until softened but not coloured.", "Add the rice and cook for a minute, stirring to coat the rice in the butter.", "Add the wine and simmer until reduced by half.", "Add the warm stock a ladleful at a time, stirring well between each addition until nearly all the stock is absorbed and the rice is just tender.", "Add two thirds of the crayfish tails and 200ml/7fl oz of the bisque and stir to combine. Stir in the mascarpone, parmesan and salt and freshly ground black pepper, to taste.", "To serve, spoon the risotto into the centre of a large soup plate. Place the remaining crayfish tails around the edge of the risotto.", "Using a hand blender, blend the remaining bisque until frothy. Spoon the foam over the crayfish tails."]}, {"isVegetarian": false, "title": "Crayfish with hazelnut and pastis butter", "url": "www_bbc_co_uk_food_recipes_crayfishwithhazelnut_89777", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 large handful slightly stale, rustic-style bread, torn into pieces", "large handful hazelnuts", "1 lemon, zest and juice", "125g/4oz butter, cut into small cubes", "2 garlic cloves, chopped", "splash pastis", "sea salt and freshly ground black pepper", "large handful fresh parsley leaves, chopped", "30 raw signal crayfish (substitute with langoustines if unavailable)", "lemon wedges, to serve"], "serves": "Serves 2-4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to its highest setting. ", "Place the bread into a food processor and blend into medium-sized breadcrumbs.", "Add the remaining stuffing ingredients, except for the parsley, to the breadcrumbs and blend until thoroughly combined. (If it becomes a lump, remove the lid and break it up a little with a spoon.) Stir in the chopped parsely.", "For the crayfish, using a sharp knife, cut all of the crayfish lengthways from tip to tail. Remove any waste sacs from the crayfish.", "Arrange the crayfish, side-by-side, on a roasting tray. Smear up a generous amount of the stuffing onto the flesh side of each crayfish half.", "Sprinkle the crayfish with salt and place under the grill. Grill for 4-5 minutes, or until completely cooked through. The shells will turn completely red when cooked. If there are any remaining signs of dark brown or blue colouring, they are not ready and require a few minutes more. ", "To serve, transfer the cooked crayfish to a plate, and arrange in rows. Serve with lemon wedges."]}, {"isVegetarian": false, "title": "Cream of celeriac soup", "url": "www_bbc_co_uk_food_recipes_cream_of_celeriac_soup_59784", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cream_of_celeriac_soup_59784_16x9.jpg", "ingredients": ["75g/3oz butter", "1 onion, finely chopped", "50g/2oz streaky bacon, cut into small pieces", "2 garlic cloves, finely chopped", "1 leek, white only, finely chopped", "1 stick celery, finely chopped", "2 thyme sprigs, leaves picked", "700g/1lb 8oz celeriac, peeled and cut into small cubes", "1 litre/1¾ pint chicken stock", "200ml/7floz double cream", "salt and white pepper", "4 rashers pancetta ", "25g/1oz butter", "1 tbsp olive oil", "50g/2oz celeriac, peeled and finely julienned", "1 slice white bread, cut into 1cm/¼ dice", "salt and freshly ground black pepper", "2 tbsp extra virgin olive oil", "2 tbsp double cream"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the soup, heat a large frying pan or saucepan until medium hot, add 25g/1oz of the butter, the onion and bacon and fry for a couple of minutes to just soften. Add the garlic, leek, celery and thyme sprigs and fry for another minute; then add the chopped celeriac. Pour in the stock and bring to the boil, then reduce the heat to a simmer and cook for 10-15 minutes, or until the celeriac is just tender.", "Blend the soup to a fine purée using a stick blender or a blender. Return to the heat in a pan. Add the cream and whisk in the remaining 50g/2oz of butter. ", "Season with salt and white pepper. Serve the hot soup in bowls, or keep it warm in the pan if making the garnish.", "For the optional garnish, fry the pancetta until crisp then set aside. Return the frying pan to the heat, add half the butter and the olive oil and heat until foaming. Add the celeriac and stir fry for 1-2 minutes, or until just softened, then remove from the pan and drain on kitchen paper. Add the rest of the butter and the bread to the pan and cook until golden-brown and crisp, tossing to cook on each side. Drain on a plate lined with kitchen paper and season with salt and freshly ground black pepper. To serve, pile the julienned celeriac into the centre of each of four soup plates. Ladle the soup around. Crumble the crispy bacon over the top and then scatter over the croutons. Finish with swirls of extra virgin olive oil and cream. "]}, {"isVegetarian": true, "title": "Cream of celery soup with poached egg and soda bread", "url": "www_bbc_co_uk_food_recipes_cream_of_celery_soup_56670", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["45g/1¾oz butter, softened, plus extra for greasing and to serve", "340g/12oz wholemeal flour ", "340g/12oz strong white bread flour, plus extra for dusting ", "2 tsp bicarbonate of soda ", "1½ tsp salt ", "1 tsp cracked black peppercorns ", "625ml/1 pint 1fl oz buttermilk ", "1 tbsp rapeseed oil", "1 onion, sliced", "2 garlic cloves, grated", "1 floury potato, such as Maris Piper, peeled and diced", "1 litre/1¾ pints hot chicken stock", "1kg/2lb 4oz celery, stalks trimmed and finely sliced, leaves reserved", "1 bunch fresh flatleaf parsley, leaves only", "200ml/7fl oz double cream", "splash white wine vinegar", "6 free-range eggs", "drizzle rapeseed oil", "celery salt, to taste"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/170C Fan/Gas 5. ", "For the soda bread, grease a baking tray with a little butter.", "Place both of the flours, the butter, bicarbonate of soda, salt and peppercorns into a large mixing bowl. Gradually stir in the buttermilk, using your hands to bring the mixture together to form a soft dough. ", "Shape the dough into a rough loaf and transfer to the prepared baking tray. Dust the top with strong white bread flour. Bake in the oven for 45-50 minutes, or until golden-brown all over and cooked through. (The soda bread is cooked when it sounds hollow when tapped firmly on the base.) Transfer the loaf to a wire rack and set aside to cool completely. ", "Meanwhile, for the celery soup, heat the rapeseed oil in a large, heavy-based pan over a medium heat. Add the onions and garlic and fry gently for 4-5 minutes, or until softened. ", "Add the potato and fry for a further 5-6 minutes, stirring regularly. ", "Pour in the chicken stock and bring to the boil, then reduce the heat until the mixture is simmering and simmer for 4-5 minutes, or until the potatoes are beginning to soften. ", "Add the sliced celery to the pan and return the mixture to the boil. Reduce the heat until the mixture is simmering and simmer for a further 5-8 minutes, or until the celery is just tender. ", "Stir in the parsley leaves and simmer for a further 2-3 minutes. Stir in the double cream and heat through. Remove the pan from the heat and set aside to cool slightly.", "When the soup has cooled slightly, blend it in a food processor until smooth, then strain through a fine sieve and season, to taste, with salt and freshly ground black pepper.", "For the poached eggs, bring a pan of salted water to the boil and add the large splash of white wine vinegar. Reduce the heat until the water is just simmering.", "Stir the water to create a vortex, then crack the eggs into the centre of the vortex one by one (or one at a time if you prefer). Poach the eggs for 3-5 minutes, or until the whites have just set. Carefully remove from the water using a slotted spoon and set aside to drain on kitchen paper. ", "Just before serving, finely chop the reserved celery leaves. Drizzle the eggs with a little rapeseed oil, sprinkle over the celery salt, then garnish with the chopped celery leaves.", "To serve, divide the celery soup among four serving bowls and float one poached egg on top of each portion. Serve with slices of buttered soda bread."]}, {"isVegetarian": true, "title": "Cream cheese and beetroot stack with beetroot salsa", "url": "www_bbc_co_uk_food_recipes_creamcheeseandbeetro_80191", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz cream cheese", "½ lemon, juice only", "1 tbsp finely chopped red onion ", "25g/1oz fresh dill, finely chopped", "salt and freshly ground black pepper", "2 cooked beetroots sliced into five ½cm-thick rounds", "½ lemon, juice only", "1 tbsp olive oil", "1 cooked beetroot, finely chopped", "1 tbsp red onion, finely chopped", "1 tbsp finely chopped fresh chervil ", "1 tbsp finely chopped fresh dill ", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["To make the cream cheese and beetroot stack, place the cream cheese, lemon juice, red onion, dill and salt and freshly ground black pepper into a large bowl and mix together well.", "Place 1 beetroot round in the centre of a plate, place 2 tbsp of the cream cheese mixture on top, then place another beetroot round on top.", "Repeat this layering process three more times to create a stack.", "To make the salsa, place the lemon juice and olive oil into a bowl and whisk together. Add the beetroot, onion and herbs, season, to taste with salt and freshly ground black pepper and mix together.", "To serve, spoon the salsa around the stack."]}, {"isVegetarian": true, "title": "Cream cheese dip with toast", "url": "www_bbc_co_uk_food_recipes_creamcheesedipwithto_78295", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz cream cheese ", "½ tsp Dijon mustard", "2tbsp olive oil", "30ml/1fl oz tomato passata", "1 tsp white wine vinegar", "2 spring onions, sliced", "2 slices bread, toasted"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["In a bowl, mix the cream cheese with the Dijon mustard, olive oil, white wine vinegar and tomato passata to form a thick paste.", "Serve in a dish with the toast, sprinkled with the spring onions."]}, {"isVegetarian": false, "title": "Creamed Brussels sprouts", "url": "www_bbc_co_uk_food_recipes_creamedbrusselssprou_84835", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/creamedbrusselssprou_84835_16x9.jpg", "ingredients": ["1 kg/2lb 3¼oz Brussels sprouts, trimmed", "8 rashers cured bacon, cut into lardons", "250ml/8¾fl oz double cream ", "2 garlic cloves, crushed ", "salt and freshly ground black pepper"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the Brussels sprouts in a saucepan of boiling salted water for 8-10 minutes. Drain and refresh in a bowl of ice and water. Drain again when the sprouts have cooled.", "Add the bacon lardons to a non-stick frying pan, and fry over a medium heat until crisp. ", "Add the cream and crushed garlic to a small pan and bring to the boil. ", "Stir the sprouts into the crisp bacon; then stir in the hot cream. ", "Season with salt and pepper and serve straightaway."]}, {"isVegetarian": false, "title": "Creamed cauliflower and Stilton soup", "url": "www_bbc_co_uk_food_recipes_creamedcaulifloweran_73306", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 shallot ", "knob of butter", "1 head of cauliflower", "1 litre/35fl oz chicken stock", "300g/10½oz Stilton", "300g/10½fl oz double cream", "crusty bread"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Sweat the shallots in butter until soft.", "Add the cauliflower florets and the chicken stock.", "Cook until cauliflower is soft.", "Add the Stilton and the cream and bring nearly to the boil", "Season and remove to a food processor.", "Strain the soup, garnish with parsley leaves and serve in a warmed bowl with crusty bread."]}, {"isVegetarian": true, "title": "Creamed flageolet bruschetta", "url": "www_bbc_co_uk_food_recipes_creamedflageoletbrus_88402", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz butter", "1 garlic clove, finely chopped", "100g/3½oz canned flageolet beans, rinsed and drained", "salt and freshly ground black pepper", "2 tbsp chopped fresh parsley", "3 slices crusty white bread, toasted", "dash olive oil, for drizzling", "fresh chervil, to garnish"], "serves": "Serves 1-2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the butter in a frying pan, add the garlic and fry over a gentle heat for one minute.", "Add the flageolet beans, season, to taste, with salt and freshly ground black pepper and warm through over a gentle heat.", "Mash with a potato masher and stir in the parsley.", "To serve, spread the flageolet bean paste onto the toasted bread and place onto a serving plate. Drizzle with olive oil and garnish with fresh chervil."]}, {"isVegetarian": false, "title": "Creamed leek crostini with bacon and poached eggs", "url": "www_bbc_co_uk_food_recipes_creamedleekcrostiniw_84524", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "½ leek, finely chopped", "1 garlic clove, chopped", "2 tbsp double cream", "salt and freshly ground black pepper", "2 slices ciabatta, drizzled with olive oil", "2 rashers streaky bacon", "2 free-range eggs", "55g/2oz broccoli, cut into florets and cooked until tender"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a frying pan, add the leek and garlic and fry for 3-4 minutes, or until softened. ", "Add the cream and season well with salt and freshly ground black pepper and simmer for one minute.", "Heat a griddle pan until smoking. Add the ciabatta and griddle for two minutes each side, or until nicely toasted.", "Add the bacon to the griddle pan and cook for two minutes on each side, or until golden-brown and cooked through.", "Crack two eggs into a pan of simmering water. Poach the eggs for 3-4 minutes, or until cooked to your liking, then scoop out with a slotted spoon and set aside.", "To serve, place the chargrilled ciabatta onto a plate, top with leek mixture, then place the poached eggs on top. Garnish with the bacon and cooked broccoli."]}, {"isVegetarian": false, "title": "Creamed leeks with pork and new potatoes", "url": "www_bbc_co_uk_food_recipes_creamedleekswithpork_79328", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75g/2¾oz pork loin", "1 tbsp olive oil", "50g/1¾oz butter", "4 leeks, chopped and blanched", "3 chard stalks, cut from the leaves, finely chopped", "250ml/9fl oz double cream", "1 tbsp fresh sage, chopped", "new potatoes, boiled until soft"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the pork, heat the oil in a frying pan. Add the pork and cook for five minutes on each side, until cooked through.", "For the creamed leeks, melt the butter in a hot pan. Add the leeks and chard and sauté for three minutes.", "Add the double cream and sage, warm through and season to taste with salt and freshly ground black pepper.", "To serve, place the creamed leeks onto the centre of a warmed plate and top with the pork. Arrange the new potatoes around the plate."]}, {"isVegetarian": true, "title": "Creamed spinach soup with nutmeg", "url": "www_bbc_co_uk_food_recipes_creamedspinachsoupwi_87756", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["55g/2oz baby spinach leaves", "1 vegetable stock cube", "3 tbsp double cream", "pinch freshly grated nutmeg", "salt and freshly ground black pepper", "crusty bread, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the spinach, the stock cube and 300ml/½ pint of water into a pan over a medium heat. Bring to the boil, then reduce the heat and cook gently for 2-3 minutes, until the spinach is tender. ", "Season, to taste, with salt and freshly ground black pepper and stir in the cream and nutmeg.", "Blend the soup with a hand blender until smooth.", "To serve, ladle the soup into a warmed bowl and serve with crusty bread."]}, {"isVegetarian": true, "title": "Creamed spinach with nutmeg and garlic", "url": "www_bbc_co_uk_food_recipes_creamedspinachwithnu_92846", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 garlic clove, peeled", "125g spinach, washed", "200ml/7¼fl oz double cream", "ground nutmeg, to taste", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a frying pan over a medium heat and fry the garlic for 1-2 minutes. Add the spinach and continue to fry until the spinach has wilted. Pour in the cream and season, to taste, with nutmeg, salt and freshly ground black pepper.", "Continue to heat for 2-3 minutes, or until the volume of the liquid has reduced slightly.", "Blend the mixture together with a stick blender. Spoon into a bowl and garnish with extra grated nutmeg, to taste."]}, {"isVegetarian": true, "title": "Creamed sprouts with Stilton and penne pasta", "url": "www_bbc_co_uk_food_recipes_creamed_sprouts_with_92621", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz unsalted butter", "3–4 sage leaves", "150g/5½ oz raw Brussels sprouts, sliced very thinly on a mandoline ", "1 small garlic clove, crushed", "125ml/4fl oz white wine", "50g/1¾ oz double cream", "100g/3½ oz Parmesan cheese (or vegetarian alternative), plus extra for serving", "75g/2½oz crumbled Stilton", "350g/12oz cooked penne pasta"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Put the butter and sage in a pan, bring to the boil allowing the butter to turn nut brown and the sage to crisp.", "Add the sprouts and fry for a few minutes, then add the garlic. Pour in the wine and cook until the volume of liquid has reduced by half.", "Pour in the cream and bring to the boil, stir in the Parmesan cheese and half of the Stilton. Add the cooked pasta, stir together and add the rest of the Stilton and a sprinkle more Parmesan. Serve."]}, {"isVegetarian": true, "title": "Creamed sweet potato with Wensleydale and chives", "url": "www_bbc_co_uk_food_recipes_creamedsweetpotatowi_85705", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 sweet potato", "50g/1¾oz Wensleydale, crumbled", "1 tbsp double cream", "15g/½oz butter", "salt and freshly ground black pepper", "1 tbsp chopped fresh flatleaf parsley, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Wrap the sweet potato in wet baking paper and microwave on high for 6-7 minutes, or until softened.", "Remove the paper, scoop out the potato flesh and mash with the Wensleydale, cream and butter. Season with salt and freshly ground black pepper and spoon back into the potato skin.", "To serve, place onto a serving plate and sprinkle over the parsley."]}]