[{"isVegetarian": true, "title": "Blackberry charlotte with custard", "url": "www_bbc_co_uk_food_recipes_blackberry_charlotte_82346", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400g/14oz blackberries", "110g/4oz caster sugar ", "3 tbsp water", "75g/3oz melted butter", "10 slices white bread, crusts removed", "200ml/7fl oz vanilla ice cream, to serve", "200ml/7fl oz clotted cream, to serve", "200ml/7fl oz milk", "200ml/7floz double cream", "1 vanilla pod, split and seeds scraped", "4 free-range egg yolks", "75g/3oz caster sugar"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "For the charlotte, heat a frying pan until hot. Add the blackberries, sugar and dash of water and fry until the sugar has melted and the blackberries are tender. Set this blackberry compote aside.", "Cut the bread slices in half, and then each half into four slices to get small fingers. Dip each piece of bread in to the melted butter and line the mould, reserving some for the lid. ", "Once the mould is lined, spoon in the blackberry compote and cover with more bread that has been dipped in melted butter. Place onto a baking tray and bake for 25-30 minutes, or until golden-brown on top.", "For the custard, place the milk, cream and vanilla pod into a saucepan and simmer gently for five minutes.", "Pour the hot milk onto the eggs and stir until well combined. Pour the custard into a hot saucepan and heat, stirring constantly, until the custard has thickened slightly. Strain to through a fine sieve.", "Remove the charlottes from the oven and set aside to cool slightly. Carefully turn the charlottes out of the mould. ", "Serve the charlottes in a pool of custard, alongside a spoonful of clotted cream and a dollop of vanilla ice cream."]}, {"isVegetarian": true, "title": "Blackberry fool with hazelnut biscuits", "url": "www_bbc_co_uk_food_recipes_blackberry_fool_with_11859", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz blanched hazelnuts ", "125g/4½oz butter, softened ", "150g/5½oz caster sugar", "½ unwaxed lemon, finely grated zest only", "150g/5½oz plain flour", "½ tsp baking powder", "600g/1lb 5oz fresh blackberries, hulled", "75g/2½oz preserving sugar", "2-3 tbsp caster sugar, to sweeten ", "1 tbsp fresh lemon juice", "300ml/10fl oz double cream, well chilled", "100ml/3½fl oz plain natural yoghurt", "fresh mint leaves, to decorate"], "serves": "Serves 6 (makes 24 biscuits)", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the biscuits, preheat the oven to 200C/180C (fan)/Gas 6 and line two large baking trays with baking parchment. Scatter the nuts over a baking tray and roast in the oven for 6-8 minutes, or until golden-brown. Watch them carefully so that they don’t have a chance to burn. Remove from the oven, tip onto a board and leave to cool.", "Put the butter and sugar in a large bowl and beat with a wooden spoon until light and creamy. Roughly chop the cooled nuts and add to the creamed butter and sugar, along with the lemon zest, flour and baking powder. Stir well until the mixture comes together and forms a ball – you may need to use your hands.", "Divide the biscuit dough into 24 even pieces and roll into small balls. Place the balls the prepared baking trays, spaced well apart to allow for spreading. ", "Press the biscuits to flatten to around 1cm/½in thick. Bake the biscuits, one tray at a time, for 12 minutes or until very pale golden-brown. Leave to cool on the trays. They will be very soft when you take them out of the oven, but will crisp as they cool.", "Store in an airtight tin and eat within five days.", "For the fool, rinse the blackberries in a colander to wash away any dust or dirt. Put the blackberries in a non-stick saucepan and sprinkle over the caster sugar. ", "Stir in the lemon juice and heat gently for two minutes, or until the blackberries begin to soften and release their juices. Remove and reserve 12 blackberries for decoration and continue cooking the rest.", "Simmer the blackberries very gently for 15 minutes, stirring regularly until very soft and squidgy. Remove from the heat and press the berries and juice through a sieve over a bowl, using the bottom of a ladle to help you extract as much of the purée as possible. Leave the purée to cool and discard the seeds. You should end up with around 325ml/11fl oz of purée. ", "Put the cream and yoghurt in a large bowl and whip with an electric whisk until soft peaks form when the whisk is removed from the bowl – the acidity of the fruit will thicken the cream further, so don’t take it too far. ", "When the purée is completely cold, adjust the sweetness to taste by adding more sugar if needed. Pour it into the bowl with the whipped cream and yoghurt and stir just once or twice until very lightly combined. ", "Spoon the blackberry fool into individual wide, glass dishes – or one large, single bowl. It should look quite marbled, so don’t over-stir it. Scatter a few tiny mint leaves on top and decorate with the reserved blackberries. Sprinkle with a little sugar if you like and serve with the hazelnut biscuits."]}, {"isVegetarian": true, "title": "Blackberry fool with mace biscuits", "url": "www_bbc_co_uk_food_recipes_blackberry_fool_with_70910", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz butter", "50g/1¾oz caster sugar", "500g/1lb 2oz blackberries, plus 50g/1¾oz extra for garnish", "½ lemon, juice only", "300ml/10½fl oz double cream", "300ml/10½fl oz milk", "6 egg yolks", "50g/1¾oz caster sugar", "175g/6oz self-raising flour", "110g/4oz light muscovado sugar", "1 tsp ground mace", "1 tsp bicarbonate of soda", "60g/2¼oz butter, diced", "1 egg, lightly beaten", "1 tbsp golden syrup ", "1 ball vanilla ice cream per person", "1 tsp ground mace"], "serves": "Serves 6", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["For the blackberry fool, melt the butter in a saucepan and add the sugar. Pour the blackberries on top and add the lemon juice. Cook on a low heat until it becomes a purée. Blend until smooth, then pass through a fine sieve into a bowl and cover with cling film. Set aside until needed.", "For the custard, bring the cream and milk to the boil in a large saucepan. In a heatproof bowl, whisk together the egg yolks and caster sugar. Pour the cream and milk onto the eggs, whisking continuously. Place the pan back on the heat and gently cook until the custard coats the back of a spoon or reaches 82C/180F on a cooking thermometer. Pass through a fine sieve into a bowl, cover with cling film and chill in the fridge.", "Mix 400g/14oz blackberry purée with the custard. Pass through a fine sieve and pour into an espuma gun. Charge with two chargers and give it a good shake. Leave to settle for 10-15 minutes.", "For the mace biscuits, place all the dry ingredients in a large mixing bowl and add the butter, rubbing it together until the mixture resembles coarse crumbs. Add the egg and syrup and bring together to form a stiff paste. Wrap in cling film and chill in the fridge for at least one hour.", "When you are ready to cook reheat the oven to 180C/350F/Gas mark 4. Line two baking sheets with baking parchment. ", "Roll the mixture into 16-20 walnut-sized balls and place them 5cm/2in apart on the baking sheets so they have room to spread out. Bake for 12-15 minutes, until just cooked. Remove from the oven, leave on the sheets to firm up for a couple of minutes, then place on a wire rack to cool completely.", "To serve, mix some blackberries with some purée and place in the bottom of six serving glasses. Crumble on some mace biscuits. Add a ball of vanilla ice cream to each glass. Add more blackberries and purée, then some more crumbled biscuit. Spray on the fool. Dust with mace and serve."]}, {"isVegetarian": true, "title": "Blackberry and pear crumble with custard", "url": "www_bbc_co_uk_food_recipes_blackberryandpearcru_90060", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["110g/4oz butter, cubed, plus extra for greasing", "180g/6½oz plain flour", "110g/4oz demerara sugar", "5 pears, peeled and left whole", "150g/5½oz caster sugar", "300g/10½oz blackberries", "4 free-range egg yolks", "40g/1½oz caster sugar", "150ml/5½fl oz milk", "150ml/5½fl oz double cream"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the crumble, preheat the oven to 180C/350F/Gas 4. Grease an ovenproof dish with butter.", "In a large bowl, mix together the butter and the flour, using your fingertips, until the mixture resembles breadcrumbs.", "Add the sugar, mix until well combined, then set aside.", "For the filling, place the whole pears into a pan, cover them with water and add 50g/1¾oz of the sugar. Bring the mixture to the boil, then reduce the heat to a simmer and cook for 10-12 minutes, or until the pears are tender. Drain well and set the pears aside to cool.", "When the pears have cooled, remove the cores and finely chop the flesh. ", "Spoon one-quarter of the pears in an even layer on the bottom of the prepared ovenproof dish. Scatter one-quarter of the blackberries over the layer of pears and then sprinkle over two tablespoons of the remaining caster sugar. Repeat the layering process until all of the chopped pears, blackberries and sugar have been used up.", "Sprinkle over the crumble topping and bake the crumble in the oven for 20-25 minutes, or until the crumble is golden-brown and the filling is bubbling.", "Meanwhile, make the custard. Place the egg yolks and sugar in a bowl and whisk until thick and pale.", "Place the milk and cream into a saucepan and bring to the boil. Pour onto the egg mixture, whisk well, then return the mixture to the pan. Heat gently, until the custard is thick enough to coat the back of the spoon.", "To serve, divide the crumble between serving bowls and pour the custard over."]}, {"isVegetarian": true, "title": "Blackberry and ricotta cheesecake in a tart case", "url": "www_bbc_co_uk_food_recipes_blackberryandricotta_13771", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz plain flour", "100g/4oz sugar", "pinch salt", "200g/7oz unsalted butter, at room temperature", "1 egg", "1 yolk", "1 tsp vanilla extract", "1 tsp fresh lemon, juice and grated zest only", "flour for dusting", "450g/1lb ricotta (preferably whole milk)", "100g/4oz caster sugar", "25g/1oz unbleached all purpose flour", "4 eggs separated, at room temperature", "¼ cup whipping cream", "¼ cup sour cream", "1 tsp vanilla extract", "¼tsp salt", "200g/7oz blackberry jam", "250g/9oz fresh blackberries, to serve at the end"], "serves": "Serves 8-10", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["For the sweet short pastry, cream the butter and sugar in a mixing bowl with a wooden spoon until pale and creamy. ", "Add the egg, egg yolk, vanilla extract, lemon juice and grated zest one at a time, mixing thoroughly after each addition. ", "Add the flour and salt and mix until the dough comes together and is consistent but still soft. Be careful not to over-mix or the pastry will be tough. Set aside in the fridge to chill.", "For the cheesecake filling, press the ricotta through a wire mesh sieve into a mixing bowl, or process with several pulses in a food processor fitted with the steel blade until smooth and transfer to a mixing bowl. ", "Add the sugar and flour and beat with a wooden spoon until creamy. ", "Add the egg yolks, whipping cream, sour cream and vanilla. Stir until thoroughly blended. ", "Beat the egg white and salt until the peaks are stiff, then fold into the ricotta mixture. ", "Pour one-third of the mixture into the pastry shell, then put in some jam, then more mixture. Continue with these layers until you reach the top of the shell. Smooth out the top.", "Heat the oven to 150C/300F/Gas 2. Bake until the filling is set and the pastry is golden brown, 50-75 minutes. Cover the cake with foil if it is beginning to brown too much before the full cooking time is up. Turn off the oven and let the cake cool with the oven door open for 30 minutes before serving with the fresh blackberries."]}, {"isVegetarian": true, "title": "Blackberry-filled brandy snaps", "url": "www_bbc_co_uk_food_recipes_blackberryfilledbran_86809", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp golden syrup", "50g/2oz molasses sugar", "50g/2oz butter, plus a little extra for greasing", "40g/1½oz plain flour, sifted", "¾ tsp ground ginger", "1 tsp brandy", "200ml/7fl oz double cream", "1 vanilla pod, split, seeds scraped out", "75g/3oz icing sugar ", "25ml/1fl oz Kirsch", "200g/7oz blackberries"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/365F/Gas 4.", "Place the golden syrup, molasses sugar and butter into a heavy-based pan over a medium heat and bring to the boil. Reduce the heat and simmer gently for 5-6 minutes, or until the sugar has completely dissolved.", "Remove the pan from the heat, add the flour and ground ginger and mix well. ", "Add the brandy and stir to combine.", "Divide the mixture into four equal portions and place onto a greased and lined baking tray (leave enough space between the portions on the tray to account for spreading as they cook).", "Transfer to the oven to bake for six minutes, then remove and allow to cool slightly, until just setting but still pliable.", "Place two tins a little distance apart and balance (bridge) a wooden spoon across the tins. Gently wrap the pliable brandy snap around the spoon to make a hollow cigar shape and set onto a cool plate. Repeat with the remaining brandy snaps. ", "For the filling, place the double cream, vanilla seeds, icing sugar, kirsch and 50g/2oz of the blackberries into a large bowl and whip together until thickened and purple from the blackberry juice. ", "Spoon the blackberry cream into a piping bag, then pipe into each brandy snap to fill up.", "Place a blackberry at the end of each brandy snap opening and serve on plates with a spoonful of blackberries alongside."]}, {"isVegetarian": true, "title": "Blackberry meringue parfait", "url": "www_bbc_co_uk_food_recipes_blackberrymeringuepa_93398", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 free-range egg whites", "225g/8oz caster sugar", "1½ tsp cornflour", "1 tsp white wine vinegar", "450g/1lb blackberries", "150ml/5fl oz ready-made vanilla custard", "½ lemon, juice only", "350ml/13fl oz double cream, whipped until firm peaks form when the whisk is removed", "3 free-range egg whites", "225g/8oz caster sugar", "175g/6oz caster sugar", "75ml/3fl oz cold water", "3 free-range egg whites", "1 tsp lemon juice", "25g/1oz butter", "200g/7oz blackberries", "3 tbsp blackberry liqueur"], "serves": "Serves 8", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["For the meringue base, preheat the oven to 140C/275F/Gas 1. Line a baking tray with baking parchment.", "Whisk the egg whites in a clean glass or metal bowl until soft peaks form when the whisk is removed. Add the sugar, a spoonful at a time, and continue to whisk until firm peaks form when the whisk is removed and the mixture is glossy. Whisk in the cornflour and vinegar.", "Place tablespoonfuls of the mixture onto the lined baking tray and bake in the oven for 10 minutes. Turn the oven off and leave the meringues in the oven with the door closed for 2-3 hours, or preferably overnight, until crisp but uncoloured.", "Meanwhile, for the blackberry parfait, blend the blackberries, custard and lemon juice to a purée in a food processor. Gently fold the purée into the whipped cream until well combined.", "In a separate bowl, whisk the egg whites until soft peaks form when the whisk is removed, then gradually add in the caster sugar, whisking continuously until glossy, stiff peaks form. Fold half of the egg whites into the blackberry mixture until well combined, then carefully fold in the remaining egg whites until just combined.", "Spoon the parfait into a 25cm/10in diameter x 5cm/2in high springform cake tin lined with cling film and tap the side lightly with a spoon to release any large air pockets.", "Freeze the parfait for at least 4 hours, but preferably overnight, until solid.", "For the Italian meringue topping, heat the sugar and water in a saucepan until the mixture reaches 110C/230F on a sugar thermometer. (CAUTION: Boiling sugar syrup can be dangerous. Do not leave unattended.)", "Meanwhile, using an electric whisk, whisk the egg whites and lemon juice in a clean glass or metal bowl until firm peaks form when the whisk is removed.", "As soon as the sugar syrup reaches 121C/250F, remove the pan from the heat. ", "Immediately resume whisking the egg whites. With the whisk set to its lowest speed, pour in the sugar syrup in a steady stream. (CAUTION: Keep the syrup clear of the beaters as hot syrup could splash back onto your hands.) Continue whisking for 4-5 minutes, until the mixture is slightly cooled. Spoon the meringue into a piping bag fitted with a teardrop-shaped nozzle.", "For the blackberries, fry the butter and blackberries in a non-reactive frying pan over a high heat for 1-2 minutes, or until just softened. Add the blackberry liqueur. Carefully set the liqueur alight with a kitchen match. Allow the flames to flare up and die down, then continue to cook for a further minute.", "To serve, crumble some of the crisp meringue base into the centre of each of eight plates. Using a hot knife, cut eight slices of blackberry parfait and place one on top of each serving of meringue. Pipe some Italian meringue onto the top of the parfait. Using a cooks' blow torch, brown the tops of the meringue. Spoon some warm blackberries alongside and serve immediately."]}, {"isVegetarian": true, "title": "Black cherry mousse", "url": "www_bbc_co_uk_food_recipes_blackcherrymousse_79391", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz cherries from a jar or tin, strained with juice retained", "30g/1oz caster sugar", "splash red wine", "1 orange, juice only", "100ml/3½fl oz double cream, whipped"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the strained cherry juice in a small pan over a medium heat.", "Add the sugar, red wine and orange juice, bring to the boil and reduce by half.", "Add the cherries and cream and pour into a tall glass, to serve."]}, {"isVegetarian": true, "title": "Black cherry tiramisu", "url": "www_bbc_co_uk_food_recipes_blackcherrytiramisu_85856", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["5 free-range egg yolks", "100g/3½oz sugar", "1 vanilla pod, split, seeds scraped out", "500g/1lb 1½oz mascarpone", "200ml/7fl oz espresso-strength coffee", "100ml/3½fl oz Marsala wine", "24 ready-made sponge finger biscuits", "225g/8oz black cherries from a can or jar, drained slightly", "cocoa powder, to dust"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the eggs yolks, sugar and vanilla seeds into a bowl and whisk together until pale and light.", "Add the mascarpone and whisk to combine well.", "Place the coffee and Marsala into a clean bowl.", "Dip a sponge finger into the coffee mixture and press into the bottom of a tumbler or sundae glass. Repeat this process, using four sponge fingers in total, to line the bottom of the glass.", "Spoon some black cherries into the glass over the sponge fingers.", "Add a layer of the mascarpone mixture to cover the cherries.", "Repeat with a layer of black cherries and a layer of mascarpone mixture to fill the glass.", "Repeat this process to make five more desserts.", "To serve, smooth over the top of each tiramisu and dust each with cocoa powder."]}, {"isVegetarian": true, "title": "Blackcurrant and peppermint macaroons", "url": "www_bbc_co_uk_food_recipes_blackcurrant_and_58462", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["110g/4oz icing sugar", "60g/2¼oz ground almonds", "60g/2¼oz free-range egg whites (2 medium eggs), plus 1 free-range egg, white only, lightly whisked for slackening the mixture", "pinch cream of tartar", "40g/1½oz caster sugar ", "grape violet gel food colouring", "mint leaves, finely chopped to decorate", "200g/7oz white chocolate ", "300g/10½oz blackcurrants, to yield 100g/3½oz blackcurrant juice", "½ tsp peppermint essence", "5 drops raspberry extract ", "1 tbsp black raspberry liqueur  "], "serves": "Makes 12", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven 150C/300F/Gas 2. Blend the icing sugar and almonds in a food processor to a fine powder. ", "Whisk the egg whites, cream of tartar and caster sugar in a stand mixer, gently at first and gradually increasing the speed, add a drop of the food colouring just before the soft peak stage is reached, and continue until the egg whites reach the soft peak stage (the soft peak stage is when the peaks drop slightly when you lift the whisk out of the bowl).", "Sift the flour and almond powder into a separate bowl, then fold in a third of the meringue. Continue to add until all the meringue is incorporated and looks smooth and glossy. It should behave like it is flowing ‘magma’ when a spoon drags it to the sides of the bowl. Slacken with a teaspoon or two of lightly whipped egg white if this stage is not reached.", "Fill a piping bag with a 2-3mm/1/8in nozzle with the macaroon mixture. Line a baking tray with parchment paper.", "Pipe 3cm/1¼in wide circles of mixture onto the parchment, set 3cm/1¼in apart. ", "Tap the tray underneath two or three times to release trapped air in the macaroons and set aside until they are dry to the touch (at least 15 minutes).", "Bake for 13-15 minutes, until the macaroons can be easily lifted off the parchment with a palate knife. Remove from the oven and set the macaroons to cool on a wire rack.", "To make the ganache, melt the chocolate in a bowl set over a pan of simmering water, and heat to no more than 45C/113F (use a thermometer to measure this).", "Blend the blackcurrants in a food processor and sieve them. Measure out 100g/3½oz of the juice and bring it to the boil in a small pan. Add the peppermint essence and raspberry extract to the juice. ", "Pour the hot juice over the chocolate and stir rapidly until well combined.", "Transfer the ganache to a bowl, cover with cling film and put in the fridge to cool and thicken.", "Once cooled a little, transfer the ganache to a piping bag, and pipe a small amount of ganache, from the centre outwards, on one half of the macaroon shells.", "Sandwich the macaroon shell with another to form a pair. ", "Chill the macaroons in the fridge to firm up."]}, {"isVegetarian": true, "title": "Blackcurrant and liquorice Swiss roll", "url": "www_bbc_co_uk_food_recipes_blackcurrant_and_96079", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/blackcurrant_and_96079_16x9.jpg", "ingredients": ["70g/2½oz unsalted butter, softened", "70g/2½oz icing sugar", "2 free-range egg whites", "80g/3oz plain flour, sifted", "1 tsp liquorice essence", "½-1 tsp black food colouring paste", "3 large free-range eggs, at room temperature", "75g/2½oz caster sugar, plus extra for sprinkling", "75g/2½oz self-raising flour", "75g/2½oz butter, softened", "225g/8oz icing sugar", "1 tbsp milk", "½ tsp liquorice essence", "200g/7oz blackcurrant jam"], "serves": "Serves 8-10", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C (180C fan)/400F/Gas 6.  Grease and line a Swiss roll tin with baking parchment.", "For the decorative sponge paste, cream the butter and icing sugar together until light and fluffy and then gradually add the egg whites, beating continuously.  Fold in the flour then add the liquorice essence and food colouring paste and beat until the mixture is black.  Spoon into a piping bag fitted with a plain piping nozzle and pipe six diagonal lines across the tin. Refrigerate the tin while you make the plain cake batter.", "For the sponge, put the eggs and caster sugar into a large bowl and whisk with a hand-held electric mixer until the mixture is light and frothy and leaves a trail when the whisk is removed.  Sift the flour over the mixture and carefully fold in using a large metal spoon or rubber spatula. ", "Gently pour the mixture into the tin, giving the tin a little shake so the mixture finds its own level; gently push the mixture into the corners if necessary. Bake for 10-12 minutes, or until the sponge is golden-brown and starting to shrink away from the sides of the tin.", "Lay two sheets of parchment paper (cut a little larger than the size of the tin) on a work surface and sprinkle one with caster sugar. As soon as the sponge is cooked, turn it out onto the sheet of sugared paper and carefully peel off the lining paper.  Lay the other sheet of paper over the striped top and flip over, so that the black lines are underneath.  Set aside to cool.", "For the filling, beat the butter, icing sugar, milk and liquorice essence in a bowl until smooth. ", "Once cooled, discard the sugared paper, trim the edges of the sponge with a sharp knife and score a line across the sponge 2cm/1in in from one of the short edges. Spread an even layer of the buttercream over the sponge.", "Spread an even layer of jam over the buttercream. Roll up the Swiss roll firmly starting at the scored end and using the paper to help you. "]}, {"isVegetarian": false, "title": "Blackcurrant cream", "url": "www_bbc_co_uk_food_recipes_blackcurrantcream_91972", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz fresh blackcurrants, stalks removed, plus extra to serve", "100g/3½oz caster sugar", "3 tbsp water", "3 tbsp crème de cassis", "6 sheets gelatine ", "350ml/12fl oz double cream, plus extra to serve", "350ml/12fl oz whole milk"], "serves": "Makes 1 x 1 litre/1.75 pints", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Place the blackcurrants, sugar and water into a pan over a medium heat and cook gently for ten minutes, stirring regularly, or until the berries are beginning to break down. ", "Strain the pan contents through a sieve into a clean pan, squeezing the berries through the sieve using the back of a wooden spoon to form a purée. This should yield approximately 300ml/10½fl oz of juice. ", "Add the crème de cassis, stir well and set aside.", "Meanwhile, in a bowl, cover the gelatine sheets with cold water. Set aside for five minutes to soften. ", "Meanwhile, heat the cream and milk in a pan until it is almost simmering, then remove from the heat. Squeeze any excess water from the soaked gelatine sheets, then add them to the hot cream mixture, stirring until they dissolve.", "Stir the cream mixture into the blackcurrant mixture until smooth and well combined (taste, then stir in a little extra sugar if necessary). ", "Rinse a 1 litre/1¾ pint jelly mould or pudding basin with cold water. Pour the blackcurrant cream mixture into the prepared mould and cover with cling film. Chill in the fridge for 7-8 hours, or until set.", "Remove the cling film and dip the mould into a large bowl of just-boiled water until the water reaches nearly all the way up the sides. Suspend the bowl in the hot water for five seconds (no longer), then, using your fingertips, press around the edge of the blackcurrant cream to break the seal. Invert the pudding basin or jelly mould onto a serving plate and tap the top of the mould. (NB: The blackcurrant cream should be released onto the plate - if not, repeat the process.)", "To serve, cut the blackcurrant cream into slices. Garnish with the remainins blackcurrants and drizzle over the cream."]}, {"isVegetarian": true, "title": "Blackcurrant meringue", "url": "www_bbc_co_uk_food_recipes_blackcurrantmeringue_87044", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz fresh blackcurrants", "55g/2oz caster sugar", "2 tbsp cassis liqueur", "½ tsp grated fresh ginger", "4 free-range egg whites", "225g/8oz caster sugar", "1 vanilla pod, seeds only"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the blackcurrants, sugar, cassis liqueur and grated ginger in a small saucepan and simmer over a moderate heat until thick and syrupy. Spoon the blackcurrant mixture into a gratin dish.", "In a clean, grease-free bowl, whisk the egg whites until stiff peaks are formed when the whisk is removed.", "Gradually add the caster sugar to the egg whites, one tablespoon at a time, whisking continuously until the mixture is thick and glossy.", "Fold the vanilla seeds into the egg whites and mix well to combine.", "Place the egg white mixture on top of the blackcurrants to cover completely.", "Brown the meringue with a mini-blowtorch until it is golden-brown all over. Serve immediately."]}, {"isVegetarian": true, "title": "Black dal", "url": "www_bbc_co_uk_food_recipes_blackdal_89042", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/blackdal_89042_16x9.jpg", "ingredients": ["150g/5oz black lentils (urad dal)", "50g/2oz green lentils (moong dal)", "480ml/17fl oz water", "3 tbsp olive oil", "1 large onion, finely chopped", "4 cloves garlic, finely chopped", "2 green chillies, finely chopped", "¼ tsp ground turmeric ", "½ tsp ground cumin", "½ cinnamon stick, broken into pieces", "4 cloves", "salt and freshly ground black pepper ", "1 large tomato, chopped", "1 tsp caster sugar", "squeeze lemon juice", "small handful fresh chopped coriander"], "serves": "Serves 2-3", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Place the black and green lentils into a medium saucepan, add the water and bring to the boil. Reduce the heat and simmer for 20 minutes, or until tender. Drain, then mash the lentils and set aside.", "Heat the olive oil in a frying pan, add the onion and fry until it starts to colour. Add the garlic and fry for a few seconds.", "Stir in the finely chopped chillies, turmeric, cumin, cinnamon, cloves, salt and freshly ground black pepper and cook for one minute, stirring constantly.", "Stir in the chopped tomato, the sugar and a squeeze of lemon juice and cook for 2-3 minutes.", "Add the mashed lentils and bring to the boil.", "Stir in a large handful of chopped coriander and serve."]}, {"isVegetarian": false, "title": "Blackened Norfolk duckling crown", "url": "www_bbc_co_uk_food_recipes_blackened_norfolk_05776", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 tbsp honey", "pinch of salt", "1 duck crown (about 2 kg/4lb 8oz)", "2 large King Edward potatoes, peeled and cubed then drained, spread on a tray and frozen", "150g/5½oz fresh petit pois peas", "1 sprig mint", "small bunch young spring carrots and turnips ", "knob of butter", "1 quantity duck stock, reduced to sauce consistency and then finished with a dash of mead, to taste"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the duck, preheat the oven to 200C/180C Fan/Gas 6.", "Put the honey and a good pinch of salt in a saucepan with 4 tablespoons water. Bring to the boil and then turn off the heat (don’t reduce the liquid otherwise the glaze will become too syrupy and might burn). Brush the glaze over the duck crowns.", "Put the duck crowns breast-side up on a rack sat in a roasting tin. Roast for 10 minutes, then lower the temperature to 180C/160C Fan/Gas 4 and roast for a further 20 minutes, or until the skin is crisp and deeply golden-brown. Remove from the oven and leave somewhere warm to rest for 10 minutes.", "For the vegetables, preheat a deep-fat fryer to 180C, or alternatively half fill a deep heavy pan with oil and heat until a breadcrumb sizzles and turns brown when dropped in. (Caution: Hot oil can be dangerous. Do not leave unattended.)", "Take the breasts off the bone, place on a tray and finish under a medium-high grill.", "Meanwhile, deep fry the potatoes for 3-4 minutes until golden-brown and crisp. Remove using a slotted spoon and drain on kitchen paper.", "Cook the peas in boiling salted water with a sprig of mint for 1-2 minutes. Cook the carrots and baby turnips in boiling salted water for 3 minutes, then transfer to a frying pan with a knob of butter and fry gently until tender.", "Serve the duck and potatoes with carrots, peas and turnips. Finish with the reduced duck stock. "]}, {"isVegetarian": false, "title": "Blackened salmon with miso aubergine purée", "url": "www_bbc_co_uk_food_recipes_blackened_salmon_with_04412", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["60ml/2¼fl oz sake", "60ml/2¼fl oz mirin", "4 tbsp white miso paste", "3 tbsp caster sugar", "4 x 150g/5¼oz salmon fillets", "1 aubergine", "8 baby aubergine", "2cm/1in root ginger, peeled, thinly sliced", "4 tbsp miso paste", "2 tbsp caster sugar", "2 tbsp mirin", "1 tbsp soy sauce", "corinader cress", "red amaranth cress"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["For the blackened salmon, stir together the sake, mirin, white miso paste and caster sugar in a shallow dish. Add the salmon to the mixture, cover and marinade in the fridge for 24 hours.", "Heat a medium griddle pan, wipe any excess marinade from the salmon and place on the griddle. Cook for three minutes on each side, or until cooked to your liking. ", "For the miso aubergine, preheat the oven to 200C/400F/Gas 6.", "Bake the aubergine for 20 minutes, or until soft. Remove the aubergines and set aside. Cut the baby aubergines in half and place onto a baking tray. Using a sharp knife, score a criss cross pattern on the baby aubergines, place onto the baking tray and cook for 10 minutes.", "Meanwhile, warm the miso paste, sugar, mirin, soy sauce and ginger in a small pan over a low heat.", "Scoop out the aubergine flesh and place in a small food processor with two tablespoons of the miso mixture. Blend to a purée and set aside.", "Preheat the grill to hot.  Spoon the leftover miso mixture over the baby aubergines and place under the grill for twominutes.", "Serve the aubergine purée topped with the griddled salmon and the baby aubergines on the side. Garnish with the coriander cress and red amaranth."]}, {"isVegetarian": false, "title": "Blackened salmon with salsa", "url": "www_bbc_co_uk_food_recipes_blackened_salmon_with_67385", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/blackened_salmon_with_67385_16x9.jpg", "ingredients": ["3 tbsp Cajun seasoning", "1 tsp dried oregano", "4 salmon fillets, about 75g/3oz each", "sunflower oil, to brush", "lime wedges, to garnish", "400g tin black-eyed beans, rinsed and drained", "2 tbsp olive oil", "1 avocado, peeled, stoned and chopped", "2 plum tomatoes, finely chopped", "1 yellow pepper, deseeded and finely chopped", "2 tbsp lime juice", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Mix together the Cajun seasoning and oregano in a shallow bowl.", "Brush the salmon on both sides with a little oil and coat with the spice mix, making sure the fish is completely covered. Set aside.", "Meanwhile, for the salsa mix together all the ingredients in a bowl. Season to taste and set aside.", "Heat a frying pan over medium heat, dry fry the salmon for 4 minutes on each side.", "Slice the salmon and spoon the salsa over, garnish with lime wedges and serve."]}, {"isVegetarian": true, "title": "Black-eyed bean stew with soured cream dip", "url": "www_bbc_co_uk_food_recipes_blackeyebeanstewwith_85933", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 onion, chopped", "1 garlic clove, chopped", "½ yellow pepper, chopped", "1-2 smoked chipotle chillies, or to taste (available at some supermarkets and from online suppliers)", "100g/3½oz canned black-eye beans, rinsed and drained", "2 tbsp tomato ketchup", "1 red onion, cut into 8 wedges", "1 tbsp olive oil", "1 tbsp balsamic vinegar", "1 tbsp caster sugar", "1 lime, juice only", "100ml/3½fl oz soured cream", "½ avocado, peeled, stone removed, chopped", "small handful fresh coriander, chopped", "salt and freshly ground black pepper", "4 slices ciabatta, toasted, to serve"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the stew, heat the oil in a frying pan and sauté the onion and garlic until softened.", "Add the remaining stew ingredients and simmer for 6-8 minutes, or until the vegetables are tender and the stew has thickened.", "For the chargrilled red onion, place the onion wedges into a bowl with the oil, vinegar and sugar and stir well.", "Heat a griddle pan until smoking hot, then chargrill the red onion wedges for 1-2 minutes on each side, or until lightly charred and softened.", "For the soured cream dip, place all the soured cream dip ingredients into a bowl and mix well until combined.", "To serve, place the stew into two bowls and top with the onion wedges and a dollop of the soured cream dip. Serve with the toasted ciabatta."]}, {"isVegetarian": true, "title": "Black-eyed bean dip with garlic toasts", "url": "www_bbc_co_uk_food_recipes_blackeyedbeandipwith_80911", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tsp sesame seeds, toasted", "¼ red onion, finely chopped", "1 clove garlic, finely chopped", "½ tin black-eyed beans, rinsed and drained", "½ lime, juice only", "1 tbsp olive oil", "1 tbsp chopped fresh coriander", "100g/3½oz plain yoghurt", "2 slices bread", "1 clove garlic, finely chopped", "3 tbsp chopped parsley", "35g/1½oz butter"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the dip, whiz the sesame seeds in a blender until finely ground. Mix with the remaining dip ingredients and set aside.", "For the garlic toasts, toast the bread in a pan with the garlic, butter and parsley for 2 minutes until golden. Serve with the dip."]}, {"isVegetarian": true, "title": "Black fig and chilli tagliatelli", "url": "www_bbc_co_uk_food_recipes_blackfigandchillitag_83976", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["320g/11½oz fresh egg tagliatelli pasta", "6 over-ripe black figs", "2-3 tbsp extra virgin olive oil", "1 clove garlic, finely sliced", "pinch dried chilli", "125ml/4½fl oz double cream", "sea salt and freshly ground black ", "½ lemon, juice only", "½ bunch purple basil", "½ bunch green sweet basil", "4 long red chillies grilled, peeled and de-seeded", "200g/7oz parmesan cheese, shaved with a vegetable peeler", "extra basil leaves"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Bring a large saucepan of salted water to the boil and drop in the pasta. Cook for two to three minutes.", "Meanwhile, remove the stems from the figs and chop into quarters and then into eighths.", "Gently heat the oil in a heavy bottomed pan, then add the garlic and lightly fry until sticky and just golden. ", "Add a pinch of dried chilli and the chopped figs. Gently fry for about one to two minutes.", "Add the cream and lower the heat, bringing the sauce to a simmer. ", "Season with salt, pepper and a squeeze of lemon. ", "Add a few of each of the different basil leaves and stir to combine.", "Drain the pasta and add to the sauce, tossing to combine and coat the pasta. ", "Correct the seasoning, if needed, and divide among four serving bowls.", "Garnish with strips of the grilled chilli, a few more basil leaves and shavings of parmesan cheese."]}, {"isVegetarian": true, "title": "Black Forest gâteau with chocolate peppermint shards", "url": "www_bbc_co_uk_food_recipes_blackforestgateau_86364", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["butter, for greasing ", "9 free-range eggs", "255g/9oz caster sugar", "200g/7½oz self-raising flour, sifted", "40g/1½oz cocoa powder", "1 x 340g/12oz (drained weight) jar cherries, drained, juice reserved", "good dash of Kirsch", "2 tbsp arrowroot", "750ml/1¼ pint double cream, whipped", "300g/10½oz dark chocolate", "½ tsp peppermint essence", "110g/4oz demerara sugar", "50g/2oz toasted flaked almonds, to serve"], "serves": "Serves 8-10", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Grease and line a deep 26cm/10½in springform cake tin.", "For the sponge, crack the eggs into a mixing bowl, add the sugar and whisk well until light and fluffy and a ribbon-like trail forms when the whisk is removed. Gently fold in the sifted flour and the cocoa powder. Pour the mixture into the prepared tin, transfer to the oven and bake for about 55 minutes, or until risen and cooked through. Turn out onto a wire rack and leave to cool.", "For the filling, place the cherries into a bowl with the Kirsch. Place the cherry juice from the jar into a pan and bring to the boil. While the juice is heating, mix the arrowroot with a little water in a small bowl to make a paste. When the cherry juice is boiling, mix the arrowroot paste into it, then strain through a sieve into the bowl with the cherries and leave to cool.", "Cut the cooled sponge into three layers using a sharp bread knife. Sandwich the three layers together using the whipped cream (reserve a little for attaching the chocolate shards) and half of the cherries in their syrup.", "For the chocolate shards, place the chocolate into a heatproof bowl set over a pan of gently simmering water and heat, stirring occasionally, until melted and smooth. Stir in the peppermint essence and sugar, then spread the mixture onto a tray lined with cling film and allow to cool. Place into the fridge to set.", "When the chocolate is set, break it into large shards and stick around the edge of the cake, using a little whipped cream on the back to hold the shards in place.", "To serve, top with the remaining cherries and the almonds."]}, {"isVegetarian": true, "title": "Black Forest gâteau with rum", "url": "www_bbc_co_uk_food_recipes_blackforestgateau_89161", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz unsalted butter, plus extra for greasing", "225g/8oz caster sugar", "225g/8oz plain flour", "1½ tsp baking powder", "3 tbsp cocoa powder", "4 large eggs", "2 tsp arrowroot", "450g/1lb canned morello cherries", "275ml/10fl oz double cream", "1 tbsp caster sugar", "2-3 tbsp rum ", "50g/2oz dark chocolate"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat oven to 190C/380F/Gas 5.", "Butter two 20cm/8in round baking tins then line with buttered baking parchment.", "Beat the butter and sugar together until they are light and fluffy.", "Sieve the flour, baking powder and cocoa together into a clean bowl.", "Beat the eggs into the butter and sugar mixture, one at a time.", "Gently fold in the sieved flour with a metal spoon.", "Divide the mixture between the two prepared cake tins and place into the oven to bake for 20-25 minutes, or until the cake tops spring back when lightly pressed with your finger.", "Remove from the oven and leave the cakes to cool in their tins for five minutes, then turn out onto a wire rack, remove the baking parchment and leave until they are completely cool.", "Meanwhile, for the filling, drain the cherries, reserving six tablespoons of the syrup. Place the reserved syrup into a small pan and heat gently.", "Mix the arrowroot with two tablespoons of water and add to the heated syrup, stirring constantly until the sauce has thickened.", "Add one tablespoon of the rum, then remove from the heat and leave to cool.", "Slice the sponge cakes in half and sprinkle each half with the remaining rum.", "Cut the drained morello cherries in half, (removing their stones if necessary). Leave 10-12 cherries whole for decoration.", "Whip the cream and the sugar together in a bowl until soft peaks form when the whisk is removed.", "Reserve half of the cream mixture to cover the top of the cake. Stir the halved cherries and the heated syrup.to the remaining half of the cream.", "Spread a third of the cream and cherry mixture onto one side of one layer of the cake. Add a second layer and spread with more of the cherry cream. Add a third layer of cake and spread the remaining cherry cream over the top.", "Top with the final piece of cake and top with the reserved whipped cream.", "Grate the dark chocolate over the top and decorate with the reserved whole cherries."]}, {"isVegetarian": true, "title": "Classic Black Forest gâteau", "url": "www_bbc_co_uk_food_recipes_blackforestgateaux_74843", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["340g/12oz golden caster sugar ", "340g/12oz unsalted butter ", "6 eggs ", "240g/8½oz self-raising flour, sifted ", "100g/3½oz cocoa ", "2 cans black cherries in syrup ", "2 tbsp kirsch ", "600ml/21 fl oz double cream ", "200g/7oz good quality dark chocolate, broken into small pieces ", "50g/2oz dark chocolate, for shaving"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 170C/325F/Gas 3.", "Lightly butter a 20cm (8in) loose-bottomed cake tin then dust with a little plain flour and shake off any excess. Line the tin with greaseproof paper. ", "For the cake, place butter and sugar in a bowl and whisk until light and fluffy. Beat in the eggs one at a time then fold in the flour and the cocoa powder.  ", "Spoon the mixture into the prepared cake tin, smooth the surface with a knife and bake in the pre-heated oven for 1 hour -1 hour 45 minutes until firm and springy. To test if the cake is done, insert a clean skewer into the middle of the cake - if it comes out clean then the cake is ready. ", "Remove from the oven and leave to cool in the tin for five minutes before turning out onto a wire rack.", "Drain the cherries, reserving 200ml (7 fl oz) of the cherry syrup. Add the kirsch to the reserved syrup. ", "Use a large serrated knife to slice the cake horizontally into three equally sized rounds.", "Place each round on a chopping board and spoon the cherry syrup evenly over each disc and leave to soak in. ", "For the icing, heat 200ml (7 fl oz) of the double cream to scalding point then add the chocolate pieces. Remove from the heat and stir gently until the chocolate is melted and smooth. Pour into a bowl and allow to cool in the refrigerator, to thicken slightly. ", "Whip the remaining double cream until thick. Spread one of the cake discs with half of the cream then cover with half of the cherries, pressing them in lightly. Top with the second disc of sponge and repeat this process, finishing with the third disc left plain on top. Gently press the whole cake together with the palms of your hands. ", "Remove the chocolate icing from the fridge and give it a quick stir. Use a palette knife to thickly spread the top and sides of the cake with the icing, starting with the top first. This way, if the chocolate oozes down the sides of the cake, it won't matter. (If preferred you can leave the sides of the cake without icing to show off the layers.)", "Leave the cake to set in a cool place then slice into large wedges and serve."]}, {"isVegetarian": false, "title": "Blackened halibut with mango chutney", "url": "www_bbc_co_uk_food_recipes_blackenedhalibutwith_86253", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "2.5cm/1in piece ginger, peeled, finely chopped", "1 small red chilli, deseeded, chopped", "1 lime, zest and juice only", "1 garlic clove, crushed", "pinch ground cinnamon ", "pinch ground coriander seeds", "225g/7½oz soft light brown sugar", "225ml/7½fl oz cider vinegar", "3 mangoes, peeled, cut into cubes", "3 tbsp cayenne ", "2 tsp mustard powder", "2 tsp dried oregano", "4 tsp garlic powder", "3 tsp onion powder", "1 tsp celery salt", "pinch dried thyme", "2 tsp white pepper", "4 x 150g/5oz halibut steaks", "salt and freshly ground black pepper", "4 lime wedges", "handful fresh coriander", "basmati rice, cooked according to packet instructions"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the chutney, heat the olive oil in a large frying pan over a low heat and gently fry the ginger, chilli, lime zest, lime juice and garlic until softened, but not coloured.", "Add the cinnamon, coriander, sugar, vinegar and mango. Increase the heat and bring to the boil.", "Reduce the heat and simmer for at least 40 minutes, until reduced to a sticky jam consistency.", "Meanwhile, for the blackening mixture, place all of the blackening ingredients into a bowl and mix well.", "For the halibut, season the fish steaks with salt and freshly ground black pepper.", "Press each side of the fish into the blackening mixture and shake off any excess.", "Dry fry the coated steaks in a hot frying pan for 2-3 minutes on each side, or until just cooked through.", "To serve, place the cooked halibut steaks onto plates and garnish with the lime wedges, fresh coriander and serve with rice."]}, {"isVegetarian": false, "title": "Black pepper beef stir fry with egg fried rice", "url": "www_bbc_co_uk_food_recipes_blackpepperbeefstirf_92254", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp light soy sauce", "2 tbsp dry sherry", "2 garlic cloves, peeled, finely chopped", "1 tbsp freshly cracked black pepper", "1 tbsp cornflour", "500g/1lb 2oz beef fillet, finely sliced", "2 tbsp vegetable oil", "2 red peppers, seeds removed, finely sliced", "2 tbsp oyster sauce", "1 tbsp dark soy sauce", "1 tbsp sesame oil", "50-75ml/2-3fl oz water", "2 tbsp groundnut oil", "200g/7oz basmati rice, cooked according to packet instructions, drained and cooled completely", "2 large free-range eggs, lightly beaten", "2 tsp sesame oil", "4 spring onions, finely sliced", "3 tbsp finely chopped fresh coriander leaves"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the black pepper beef, whisk together the light soy sauce, dry sherry, garlic, cracked black pepper and cornflour in a bowl. Add the beef slices and stir well to coat the beef in the marinade. Cover and set aside in the fridge to marinate for at least 30 minutes. ", "At the end of the marinating time, remove the beef from the marinade (discard the marinade). Heat a wok until nearly smoking, then add the vegetable oil and beef. Stir fry for 1-2 minutes, or until just browned all over. Remove the beef from the wok and set aside. ", "Add the peppers to the wok and stir fry for 1-2 minutes, then add the oyster sauce, dark soy sauce, sesame oil and water. Cook for one minute, then return the beef to the wok and stir fry for a further minute.  Keep warm. ", "For the egg fried rice, heat a clean wok until hot and add the oil. Add the cooked, cooled rice and stir fry for 2-3 minutes to heat through.", "Lightly mix the beaten eggs and sesame oil together, then pour over the rice. Continue to stir fry for 2-3 minutes, breaking up any large lumps of egg and rice with a wooden spoon, until the egg is set.  Season, to taste, with salt and freshly ground black pepper, then stir in the spring onions and coriander.", "To serve, spoon the black pepper beef onto serving plates and pile the egg fried rice alongside."]}, {"isVegetarian": true, "title": "Black olive polenta with field mushrooms", "url": "www_bbc_co_uk_food_recipes_blackolivepolentawit_92626", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["750ml/1 pint 7fl oz boiling water", "pinch salt", "200g/7oz fine quick-cook polenta", "100g/3½oz black olives, finely chopped ", "salt and freshly ground black pepper", "1-2 tbsp olive oil", "150g/5½oz unsalted butter ", "1 garlic clove, crushed to a paste with the edge of a knife", "450g/1lb assorted wild and field mushrooms, brushed clean, rinsed well, roughly chopped", "½ lemon, zest and juice", "1 tbsp chopped fresh thyme leaves", "parmesan shavings, to serve"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Bring the water to the boil and add a pinch of salt. Pour in the polenta, stirring well. Reduce the heat until the water is just bubbling and continue to cook, stirring well, for 4-5 minutes, or until the polenta has absorbed all of the water and is smooth and thick.", "Stir in the chopped olives and season, to taste, with salt and freshly ground black pepper.", "Line a baking tray with a sheet of baking paper and spread the polenta mixture onto it in an even layer. Set aside until the polenta has set and is completely cool.", "When the polenta has cooled and set, cut it into 10cm/4in squares. Brush each square on both sides with a little of the olive oil.", "Heat a griddle pan over a medium heat. When the pan is hot, add the polenta squares, in batches if necessary, and cook for 2-3 minutes on each side, or until golden-brown griddle marks have appeared on both sides and the polenta is warmed through. Remove the griddled polenta squares from the pan and keep warm. Repeat the process with the remaining polenta squares.", "Meanwhile, heat the remaining oil and the butter in a frying pan over a medium heat. Add the garlic and mixed mushrooms and fry for 3-4 minutes, or until browned. ", "Add the lemon juice, lemon zest and thyme and stir well to combine.", "To serve, place one square of griddled polenta into the centre of each of six serving plates. Spoon the field mushrooms and pan juices over the polenta square. Garnish each serving with a few parmesan shavings."]}, {"isVegetarian": false, "title": "Black pepper chicken (Murgh kali mirch) with seasoned potato and cauliflower (Aloo gobhi)", "url": "www_bbc_co_uk_food_recipes_blackpepperchickenmu_74040", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp vegetable oil", "1 tsp peeled and finely grated root ginger", "2 garlic cloves, crushed", "¼ tsp salt", "1 tsp coarsely ground black pepper", "1 tsp ground white pepper", "6 chicken breasts, boneless and skinless, cut into bite-sized pieces", "1 medium onion, finely chopped", "2 fresh green chillies, slit lengthways", "1 tsp lemon juice", "30g/1oz coriander leaves, chopped", "2 tbsp vegetable or groundnut oil", "1 large Spanish onion, finely chopped", "2 green finger chillies, finely chopped", "2 garlic cloves, finely chopped", "300g/10½oz white potatoes, peeled and cut into 2cm (¾in) cubes", "200g/7oz cauliflower florets, cut into 4cm (1¾in) pieces", "1 tsp turmeric", "¼ tsp ground cumin", "¼ tsp ground coriander", "½ tsp salt", "¼ tsp garam masala", "1 tbsp butter or ghee", "1 tsp peeled and finely grated root ginger"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["To make the chicken, mix together one tablespoon of oil, the ginger, garlic, salt and black and white peppers, and rub the mixture into the chicken pieces. ", "Cover and refrigerate for 30 minutes.", "Heat the remaining oil in a wok and fry the onion for two minutes. ", "Add the marinated chicken pieces and gently stir-fry for 10 minutes. ", "Add the chillies and 200ml (7fl oz) boiling water, cover and simmer for 10 minutes, until chicken is cooked. ", "Stir in the lemon juice and sprinkle over the coriander leaves. ", "To make the potato and cauliflower, heat the oil in a frying pan and add onions, chillies, garlic and potatoes. Fry for seven minutes or until the onion is deep yellow and translucent.", "Add the cauliflower and fry for a further three minutes until brown.", "Add the turmeric, cumin, coriander, and salt and garam masala. Stir and fry for five minutes.", "Add butter and mix, then add five tablespoons of cold water, cover and simmer for five minutes. Stir in ginger. ", "Serve with the chicken."]}, {"isVegetarian": false, "title": "Black pudding and mash cakes", "url": "www_bbc_co_uk_food_recipes_blackpuddingandmashc_83005", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz potatoes, peeled and roughly chopped", "1 cooking apple such as Bramley or Granny Smith, peeled, quartered and cored", "1 tbsp butter ", "salt and freshly ground black pepper", "500g/1lb 2oz black pudding, skin removed", "1 tbsp grated cheddar ", "4 tbsp tiny salad greens, tossed in olive oil", "80ml/3fl oz double cream", "2 tbsp grain mustard", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the potatoes and the apple in boiling salted water for 20 minutes. Drain well and mash with the butter, salt and freshly ground black pepper.", "Preheat the oven to 200C/400F/Gas 6. ", "Mash the black pudding with a fork and gently fry in a hot pan for two minutes, turning, until crisp.", "Place an oiled ring mould measuring 8cm/3¼in wide by 6cm/2½in high on a baking tray lined with greaseproof paper, and arrange a layer of black pudding at the base, pressing down gently. ", "Top with a layer of mash, then repeat, finishing with a layer of potato. ", "Gently remove the mould and repeat until you have four cakes.", "Scatter with cheese and bake for 15 minutes to heat through. Finish under a hot grill if not golden brown. ", "For the sauce, gently heat the cream, mustard, salt and freshly ground black pepper, stirring frequently.", "Transfer the cakes to warm plates, top with the salad greens, and serve with the mustard sauce."]}, {"isVegetarian": false, "title": "Black pudding with scallops and shrimp butter, with pea and radish shoot salad", "url": "www_bbc_co_uk_food_recipes_blackpuddingwithscal_89483", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 oranges, juice only", "muscle trimmings from 3 scallops (see below)", "15g/½oz caster sugar", "3 tbsp shrimps", "salt and freshly ground black pepper", "25g/1oz butter", "¼ tsp ground mace", "¼ tsp ground paprika", "2 tbsp plain flour", "salt and freshly ground black pepper", "3 thick slices ready-made black pudding", "1 tbsp olive oil", "3 scallops, coral and muscle removed", "salt and freshly ground black pepper", "1 tbsp olive oil", "15g/½oz butter", "½ orange, juice only", "½ lemon, juice only", "2 tbsp olive oil", "salt and freshly ground black pepper", "1 small handful fresh pea shoots ", "1 small handful fresh purple radish sprouts", "3 fresh chives, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the shrimp butter, place the orange juice and scallop muscles in a small saucepan and bring to the boil. Skim off any foam, then stir in the sugar. ", "Blend two tablespoons of the shrimps in a food processor to form a paste, then add this to the pan with the orange juice, and continue to heat for a further 2-3 minutes. Pass the sauce through a sieve to remove the scallop muscles, return the liquid to the pan, and season to taste with salt and freshly ground black pepper. ", "Stir in the butter and the remaining tablespoon of shrimps and continue cooking for 1-2 minutes until the butter has melted and the shrimps have warmed through.", "For the black pudding, combine the mace, paprika, flour and seasoning in a bowl and press the black pudding slices into this mixture to coat, shaking off any excess. Heat the oil in a frying pan over a medium heat and fry the coated black pudding for 2-3 minutes on each side. ", "For the scallops, season the scallops with salt and freshly ground black pepper. Heat the oil and butter in a separate frying pan over a high heat. When the butter is foaming, add the scallops and cook for 1-2 minutes on each side, or until they are golden brown and crisp.", "For the pea and radish shoot salad, mix the orange and lemon juice, olive oil and seasoning in a bowl until well combined. Add the pea shoots and radish sprouts and toss them in the vinaigrette to coat. ", "To serve, pile the shoot salad onto a serving plate and alternate the scallops and black pudding slices around the edge of the plate. Drizzle the shrimp butter over the scallops and black pudding, then garnish with fresh chives."]}, {"isVegetarian": false, "title": "Black pudding-stuffed lamb with minted broad beans", "url": "www_bbc_co_uk_food_recipes_blackpuddingstuffedl_89938", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 7-bone rack of lamb, bones removed, but flap of skin reserved (ask your butcher to prepare the lamb)", "350g/12oz piece black pudding", "2 tbsp olive oil", "150g/5oz mini black puddings", "75g/3oz butter", "400g/14oz broad beans (shelled weight)", "175ml/6fl oz double cream", "4 sprigs fresh mint, leaves only", "salt and freshly ground black pepper ", "150ml/5fl oz red wine", "150ml/5fl oz beef stock", "25g/1oz butter"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the lamb, place the lamb onto a board, skin-side down. Place the black pudding along the length of the lamb fillet, then wrap the skin over the top, to form a roll. Secure the stuffed lamb at intervals with kitchen string.", "Heat an ovenproof frying pan until hot, then add half of the olive oil and the stuffed lamb. Fry for one minute on all sides, until browned all over.", "Turn the lamb skin-side up and roast in the oven for 18-20 minutes, or until cooked to your liking. Remove from the oven and rest for 5-10 minutes.", "Meanwhile, heat a frying pan until hot. Add the remaining olive oil and the mini black puddings and fry for 2-3 minutes, or until browned all over and completely cooked through. Remove from the pan and set aside.", "For the broad beans, heat a separate pan until hot, then add the butter and the broad beans and fry for two minutes, stirring regularly.", "Add the cream and mint and bring to the boil, then reduce the heat to a simmer for 2-3 minutes. Season, to taste, with salt and freshly ground black pepper and mash lightly with a fork.", "For the sauce, place the red wine into a separate pan over a medium heat and bring to the boil. Reduce the heat and simmer until the liquid is reduced by half.", "Add the stock and continue to simmer until the liquid is reduced by half.", "Add the butter and season, to taste, with salt and freshly ground black pepper.", "To serve, slice the stuffed lamb into 12 slices of equal thickness. Spoon the minted broad bean mixture into the centre of each plate and top each portion with three slices of the stuffed lamb.", "Crumble the mini black puddings, then sprinkle around the edge of each plate. Spoon the red wine sauce over the stuffed lamb and around the plate."]}, {"isVegetarian": false, "title": "Black sea bass fillet with spicy broccoli rice", "url": "www_bbc_co_uk_food_recipes_blackseabassfilletwi_87434", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz basmati rice", "1 tbsp vegetable oil", "1 fresh red chilli, finely chopped", "100g/3½oz broccoli florets", "2 tbsp chopped fresh parsley", "1 tbsp soy sauce", "1 tbsp vegetable oil", "1 sea bass fillet", "2 tbsp balsamic vinegar", "1 tsp sesame seeds", "1 tsp clear honey", "1 tbsp chopped fresh chives, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the spicy broccoli rice, cook the rice in boiling salted water, according to packet instructions. Drain. ", "Heat the vegetable oil in a frying pan. Add the chilli and broccoli and stir-fry for 2-3 minutes. Add the cooked rice, parsley and soy sauce and stir together. Spoon the rice onto a serving plate and keep warm.", "For the sea bass, heat the oil in another frying pan. Place the sea bass fillet into the pan, skin-side down, and fry for three minutes. Add the balsamic vinegar, sesame seeds and honey. Turn the fish over and cook for another 2-3 minutes, or until the fish is completely cooked through.", "To serve, place the sea bass on the plate next to the rice and sprinkle over the chopped fresh chives."]}, {"isVegetarian": false, "title": "Black spaghetti with white wine, crayfish and tomato sauce", "url": "www_bbc_co_uk_food_recipes_blackspaghettiwithwh_85271", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 garlic clove, peeled", "2 spring onions, finely chopped", "5 prawn heads and shells", "75ml/2½fl oz white wine", "1 tsp tomato purée", "1 tsp tomato ketchup", "100ml/3½fl oz boiling water", "125ml/4fl oz double cream", "1 spring onion, chopped", "1 tomato, chopped", "300g/10½oz black (squid ink) spaghetti, cooked according to packet instructions"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the crayfish stock, put the garlic, spring onions, prawn heads and shells, white wine, tomato purée, ketchup and water into a medium saucepan; place on the heat and boil for eight minutes. Strain over a bowl, reserving the stock and discarding the shells and vegetables.", "For the pasta sauce, pour the strained stock back into the pan, add the cream and spring onion and cook over a medium heat for two minutes. Stir in the tomato.", "To serve, put the spaghetti into two pasta bowls and top with the sauce."]}, {"isVegetarian": true, "title": "Blinis", "url": "www_bbc_co_uk_food_recipes_blinis_9139", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["5g/1/8oz yeast", "125ml/4fl oz warm milk", "75g/2¾oz buckwheat flour ", "1 egg, separated", "Pinch of salt", "oil, to cook"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["Dissolve the yeast in half the milk. Put the flour in a bowl and make an indentation in the centre. Whisk in the yeast and milk mixture and leave to stand somewhere warm for 45 minutes.", "After this time slightly warm the remaining milk and whisk in the egg yolk. Add to the previous mixture and mix in well, then leave to rest for another 45 minutes.", "Beat the egg white until stiff and fold into mixture.", "Very lightly oil a large frying pan and heat gently. Add small spoonfuls of the blini mixture and cook gently for about 1-2 minutes on each side, until lightly golden."]}, {"isVegetarian": true, "title": "Blinis", "url": "www_bbc_co_uk_food_recipes_blinis_76", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["280g/10oz strong white flour", "180ml/6fl oz milk", "1 tbsp dried yeast", "2 eggs, separated", "300ml/10fl oz double cream", "1 tsp salt", "30g/1oz butter for frying"], "serves": "Makes 8-10 blinis", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the milk in a saucepan until lukewarm. Pour on to the yeast and leave for 10 minutes until the mixture is frothy.", "Sift the flour and salt into a large bowl. Mix the eggs yolks, cream and yeast mixture into the flour.  Set the batter aside for approximately 1 hour, until it has doubled in size.", "Whisk the egg whites until they form soft peaks and fold into the batter.  Add a little more milk, if necessary, so that the batter is of a thick pouring consistency.", "Heat the butter in a frying pan over a medium heat.  When it is hot, spoon small amounts of batter into the pan.", "Fry the blinis until they are golden brown on both sides and serve at once."]}, {"isVegetarian": true, "title": "Blinis", "url": "www_bbc_co_uk_food_recipes_blinis_3759", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/blinis_3759_16x9.jpg", "ingredients": ["12.5g/½oz yeast", "350g/12oz plain flour, sifted", "285ml/½ pint milk, lukewarm", "2 free-range egg yolks", "a pinch of salt", "145ml/¼ pint milk, tepid", "2 free-range egg whites, whisked"], "serves": "Makes approx 32", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 70, "preparationMins": 60}, "recommendations": 0, "method": ["Make a thin paste out of the yeast and 225g/8oz of the sifted flour diluted with the lukewarm milk.", "Leave this paste to ferment for two hours in a warm room atmosphere, and then add the rest of the flour (115g/4oz), the egg yolks, a pinch of salt, the tepid milk and mix together without letting it acquire any body. Finally add the whisked egg whites.", "Let the preparation ferment for half an hour, and when about to serve, cook the blinis quickly in the same way as pancakes, in special little omelette pans. Dish them up very hot on a napkin."]}, {"isVegetarian": false, "title": "Black treacle brushed pork, crushed butterbeans and Devon cider apple sauce", "url": "www_bbc_co_uk_food_recipes_blacktreaclebrushedp_93568", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz dried butterbeans", "2 tbsp white wine vinegar", "35g/1¼oz cold diced butter", "salt and freshly ground black pepper", "400g/14oz pork tenderloin fillet, fully trimmed ", "2 tbsp olive oil", "1 garlic clove, peeled, lightly crushed", "knob of butter", "3 tbsp black treacle", "150ml/5floz dry Devon cider, such as Ashridge", "275ml/10fl oz beef stock", "2 tbsp apple sauce or apple purée", "1 Braeburn apple, peeled, core removed, chopped", "35g/1¼oz butter"], "serves": "Serves 2", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["For the beans, place the butterbeans into a stainless steel bowl, cover with plenty of water and leave to soak overnight.", "Preheat the oven to 200C/400F/Gas 6.", "Drain the soaked beans, and rinse with fresh water then place into a large saucepan and add enough fresh water to just cover the beans. Place on the heat, bring to the boil then reduce the heat and cook for 20-25 minutes, or until just softened (do not add any salt at this stage as this well make the beans tough).", "Drain the beans and blend in a food processor with the vinegar and butter to form a firm paste (alternatively crush with a fork and mix well with a wooden spoon.) Season to taste with salt and freshly ground black pepper, and place in a saucepan ready to be warmed up just before serving.", "For the pork, season the pork fillet with salt and black pepper then lightly cover in half the olive oil. Heat a large non-stick ovenproof pan on the hob until hot, then add the pork fillet and sear for a few minutes, turning every so often until the fillet is coloured on each side.", "Add the crushed garlic and a knob of the butter to the pan and baste the fillet, then place into the oven for 8-10 minutes, turning half way through cooking, until the pork is cooked through. The pork is cooked if the juices run clear when a skewer inserted into the thickest part of the fillet.", "Meanwhile, for the apple sauce, put the cider into a saucepan and bring to the boil. Cook for 3-4 minutes, or until the volume of liquid is reduced by half.", "Add the stock, bring to the boil and cook for 5 minutes, or  until the volume of liquid has reduced by half again. Add the apple sauce, chopped apple and butter and stir to combine. Season, to taste, with salt and freshly ground black pepper.", "Place the treacle into a small saucepan and warm through over a low heat.", "Remove the pork from the oven, discard the garlic and pour over the warm treacle. Set the pork aside to rest for a few minutes.", "To serve, warm the butterbeans through and divide between 2 plates. Slice the pork and fan half the slices over each serving of beans, then drizzle over the apple and cider sauce."]}, {"isVegetarian": false, "title": "Blinis with smoked salmon pâté, mackerel and a beetroot and shallot pickle", "url": "www_bbc_co_uk_food_recipes_blinis_with_smoked_06083", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz plain flour", "7g instant yeast (one sachet)", "250ml/9 fl oz milk", "1 tsp salt", "1 tsp sugar", "2 free-range egg whites", "50g/1¾ oz butter", "175g/6 oz smoked salmon, roughly chopped", "75ml/2½ fl oz double cream", "50g/1¾ oz crème fraiche", "1 lemon, juice only", "salt and freshly ground black pepper", "½ bunch baby heritage beetroots, cleaned, small stalk left on", "75g/2¾oz unsalted butter", "200 ml white wine vinegar", "75g/2¾oz caster sugar", "1 tsp salt", "½ tsp black peppercorns", "2 banana shallots, thinly sliced", "4 mackerel fillets, filleted, pin boned, skin on", "250g/9oz crème fraîche", "2 tbsp chopped fresh chives/chervil", "4 tsp caviar (optional)"], "serves": "", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the blinis, whisk together the flour, yeast, milk, salt and sugar. Set aside in a warm place to prove for an hour.", "Whisk the egg whites in a separate bowl until stiff peaks form when the whisk is removed. When the batter has proved fold in the egg whites.", "To cook the blinis, melt the butter in a large frying pan. Add a tablespoon of batter to the pan per blini and cook until golden-brown on the underside. Flip over and cook the other side. Remove the blini and place onto kitchen paper. Repeat until you have used all the batter. Keep the blinis warm until ready to serve.", "For the smoked salmon pâté, blend the smoked salmon, double cream and crème fraiche in a food processor to a fine purée.", "Season with salt, pepper and lemon juice then place in a bowl in the fridge until ready to serve. ", "For the beetroot and shallot pickle, put the baby beetroot in a large saucepan of boiling water and cook for 15-20 minutes. Drain and leave to cool slightly. Carefully peel the beetroots and cut in half. Melt the butter in a medium frying pan and add the beetroots. Cook for 2-3 minutes, or until slightly golden-brown.", "For the pickled shallots, heat the white wine vinegar, sugar, salt and peppercorns in a pan over a medium heat until the sugar has dissolved. Put the shallots in a bowl and pour over the hot vinegar mixture. Mix together, coating the shallots. Set aside to pickle for at least an hour, but preferably 24 hours.", "To serve, put the mackerel skin-side up on a heavy baking tray and use a chef's blow torch to char the skin. Season with salt and pepper.", "Place the blinis on the plate alongside the mackerel. Place the smoked salmon pâté on top of the blinis and the pickled beetroot and shallots on the side. Garnish with fresh chives/chervil, crème fraiche and caviar (if using)."]}, {"isVegetarian": true, "title": "Blinis with horseradish cream and roasted peppers", "url": "www_bbc_co_uk_food_recipes_bliniswithhorseradis_85969", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/4oz buckwheat/wholewheat flour", "225g/4oz plain flour", "pinch salt", "2 free-range eggs, plus 2 free-range egg whites", "45g/1½oz fresh yeast", "2 tsp caster sugar", "700ml/1 pint 5fl oz warm milk", "1 tbsp melted butter", "vegetable oil, for frying", "4 red peppers, roasted, peeled, seeds removed", "225g/4oz soured cream", "1 tbsp creamed horseradish from a jar", "1 tbsp chopped fresh tarragon", "½ lemon, juice only", "12 black olives", "freshly ground black pepper"], "serves": "Serves 6", "time": {"preparation": "1-2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["For the blinis, sift the buckwheat (or wholewheat) flour and plain flour into a bowl and mix with a pinch of salt.", "Make a well in the centre of the flour mixture and add the two whole eggs and one of the egg whites. Whisk from the centre outwards to create a thick paste.", "In a separate bowl, combine the yeast, sugar and milk and leave to stand for a couple of minutes.", "Gradually pour the yeast mixture into the flour and egg mixture, whisking constantly, to make a smooth batter.", "Add the melted butter and stir well.", "Cover the bowl with clingfilm and leave in a warm place for one hour.", "Just before cooking the blinis, whisk the remaining egg white in a clean bowl until light, then fold into the batter.", "Heat a little oil in a frying pan over a medium heat. Pour enough batter into the pan to make a 10cm/4in diameter blini.", "When bubbles start to appear on the surface of the batter, turn the blini over and cook the other side. ", "Remove the blini from the pan and keep warm while you make the rest of the blinis in the same way.", "For the topping, slice the roasted red peppers into strips.", "Spoon the soured cream, horseradish, tarragon and lemon into a bowl and mix well.", "Spoon one tablespoon of the cream mixture onto each blini and top with some of the red pepper pieces.", "Top each blini with an olive and season with freshly ground black pepper."]}, {"isVegetarian": true, "title": "Blinis with poached egg and hollandaise", "url": "www_bbc_co_uk_food_recipes_bliniswithpoachedegg_83370", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 ready-made blinis", "2 free-range egg yolks", "½ lemon, juice only", "½ tsp white wine vinegar", "salt and freshly ground black pepper", "250g/9oz butter, melted in a pan", "50ml/2fl oz double cream", "50ml/2fl oz hot water", "500ml/18fl oz boiling water", "50ml/2fl oz white wine vinegar", "2 free-range eggs at room temperature", "1 tbsp finely chopped radish, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Place the blinis on a baking tray and bake for eight minutes in the oven.", "To make the hollandaise, place the egg yolks, lemon juice and vinegar in a food processor. Season with salt and freshly ground black pepper and blend together.", "Very slowly add the melted butter while blending.", "Slowly add the cream then the hot water in the same way.", "To make the poached eggs, simmer the water and vinegar in a saucepan. Swirl the water to create a whirlpool, then gently add the eggs and poach for three minutes. Remove with a slotted spoon.", "Serve two piles of blinis with a poached egg on each and some of the hollandaise spooned over. Garnish with chopped radish."]}, {"isVegetarian": true, "title": "Blood orange Halloween pumpkin pie", "url": "www_bbc_co_uk_food_recipes_blood_orange_halloween_70269", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/blood_orange_halloween_70269_16x9.jpg", "ingredients": ["15g/½oz pecan nuts ", "170g/5¾oz plain flour, plus extra for dusting", "pinch salt", "75g/2½oz chilled unsalted butter, cut into cubes, plus extra for greasing", "3 large free-range eggs", "300g/10½oz pumpkin purée (available online and in the baking section of some large supermarkets)", "85g/3oz soft dark brown sugar", "1½ tsp ground cinnamon", "1½ blood oranges, zest of both and juice of one", "125g/4½oz evaporated milk", "2 pasteurised egg whites ", "115g/4oz caster sugar", "25g/1oz pecan nuts", "50ml/2fl oz blood orange juice (available in large supermarkets)", "100g/3½fl oz granulated sugar"], "serves": "Makes 1 20cm/8in pie", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Put all the pecan nuts for the pastry and the meringue in a food processor and blend until fine. Weigh out 15g/½oz for the pastry and set aside the remainder.", "For the pastry, add the flour, salt and butter to the food processor. Tip in the pecan nuts and pulse until the ingredients are combined and resemble breadcrumbs. Add a tablespoon of cold water and pulse again. Keep adding more water a tablespoon at a time until the mixture comes together as a dough. ", "Tip out the dough onto a lightly floured work surface and knead lightly until smooth. Wrap in cling film and refrigerate for 10–15 minutes.", "Preheat the oven to 180C/160C Fan/Gas 4. Grease a 20cm/8in pie dish.", "For the filling, lightly beat the eggs in a large mixing bowl. Add the pumpkin purée, sugar, cinnamon, orange zest and juice. Beat until combined. Pour in the evaporated milk and then blend everything together using a handheld blender. Set aside.", "Roll out the dough on a lightly floured work surface until 5mm/¼in thick. Line the pie dish with the pastry, taking care to push the pastry into the edges. Leave any excess overhanging and lightly prick the base using a fork (do not go through to the tin). Place on a baking tray.", "Cover the pastry with baking paper and fill with ceramic baking beads or uncooked rice. Bake on the middle shelf for 10 minutes or until the pastry is dry. Remove from the oven and trim any excess pastry so that they are no higher than the pie tin.", "Pour in the filling so that only 5mm/¼in of the pastry can be seen at the top.", "Increase the oven temperature to 200C/180C Fan/Gas 6. Bake the pie in the centre of the oven for 15 minutes. Turn the oven down to 160C/140C Fan/Gas 3 and bake for a further 30 minutes or until the filling is firm (a slight wobble in the centre is fine).", "For the meringue, put the egg whites in the bowl of a large freestanding mixer fitted with a whisk attachment (you can also use a mixing bowl and a hand mixer, but it is much easier and safer to add the syrup when you have both hands free). Place the sugar and 100ml/3½fl oz water in a saucepan. Place over a low heat and use a sugar thermometer to measure the temperature of the syrup. When the syrup mixture reaches 100C, begin whisking the egg whites.", "When the syrup reaches 116C, remove it from the heat. With the motor running, slowly pour the syrup down the side of the bowl into the mixer, taking care not to touch the whisk as it may splash.  Continue to whisk until shiny and stiff peaks form when the whisk is removed.", "Fold the reserved ground pecans into the meringue using a large metal spoon. ", "After baking, leave the pie to cool in the tin for 5 minutes. Spoon the meringue onto the pie and use a palette knife to smooth into a dome. Use a chef’s blowtorch to brown the top of the meringue.", "For the syrup, combine the orange juice and sugar in a saucepan and bring to the boil. Measure the temperature using a sugar thermometer and when it reaches 114C remove it from the heat. To decorate the pie, dip a fork into the caramel and carefully drizzle over the pie in a cross-hatch pattern (melted sugar is very hot – take care not to burn yourself).  Serve the pie warm."]}, {"isVegetarian": false, "title": "Steamed orange and cranberry pudding", "url": "www_bbc_co_uk_food_recipes_bloodorangeandcranbe_85041", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5oz self-raising flour", "pinch baking powder", "150g/5oz butter, softened, plus extra for greasing ", "150g/5oz soft light brown sugar", "1 tbsp golden syrup", "3 free-range eggs", "1 tbsp dried cranberries", "1 orange, peeled and sliced into rounds", "100g/3½oz caster sugar", "175ml/6fl oz water", "1 tbsp orange marmalade", "1 tbsp cranberry jelly from a jar", "2 oranges, juice only", "double cream, whipped until stiff peaks form when the whisk is removed"], "serves": "Makes 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Sift the flour and baking powder together into a bowl.", "In a separate bowl, beat the butter, sugar and syrup together. Add the eggs, one at a time, beating to incorporate well before adding the next egg. ", "Add the egg mixture to the bowl of flour and whisk well for two minutes, or until pale and light.", "Add the dried cranberries and fold in gently.", "For the sauce, place the sugar, water, marmalade, cranberry jelly and orange juice into a saucepan and heat gently to dissolve the sugar and marmalade. Bring to the boil and simmer gently for 5-10 minutes to form a thick syrup.", "Grease four ramekins and place a disk of greaseproof paper, cut to fit the ramekins, in the base of each. Spoon a little of the sauce into each ramekin, then sit a round of orange on top.", "Add the pudding mixture to almost fill the ramekins. Cover each ramekin with aluminium foil and transfer to a deep roasting tray. Half fill the tray with boiling water to create a bain-marie and transfer to the oven to bake for 20 minutes, or until the puddings have set.", "To serve, turn out the puddings onto plates and serve with a dollop of whipped cream."]}, {"isVegetarian": false, "title": "Bloody Mary", "url": "www_bbc_co_uk_food_recipes_bloodymary_84135", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bloodymary_84135_16x9.jpg", "ingredients": ["2 ice cubes", "vodka, double shot", "½ lemon, juice only ", "6 dashes Worcestershire sauce", "3 dashes Tabasco sauce", "150ml/5fl oz tomato juice", "pinch salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the ice into a tall glass and add the vodka.", "Add the lemon juice, Worcestershire sauce, Tabasco sauce and tomato juice. Stir well. ", "Adjust the seasoning, to taste, with salt and pepper and serve straightaway."]}, {"isVegetarian": false, "title": "Bloody Mary", "url": "www_bbc_co_uk_food_recipes_bloodymary_88974", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["40ml/1½fl oz vodka", "75ml/3fl oz tomato juice", "dash lemon juice", "½ tsp Worcestershire sauce", "2-3 drops Tabasco sauce", "salt and freshly ground black pepper", "handful ice cubes", "lime wedges, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Pour all the ingredients, except for the lime wedges, into a cocktail shaker and shake well to mix. ", "Strain into a tall glass over ice cubes and garnish with lime wedges."]}, {"isVegetarian": false, "title": "Bloody Mary shots", "url": "www_bbc_co_uk_food_recipes_bloodymaryshots_68098", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150ml/¼ pint vodka, chilled", "250ml/9fl oz thin tomato juice, chilled", "1 lime, juice only", "2 tsp freshly grated horseradish", "1 tsp celery salt ", "a good shake of Tabasco ", "1 tbsp Worcestershire sauce ", "1 cucumber, peeled, sliced and very finely julienned", "1 tsp cracked black pepper", "10 shot glasses, chilled"], "serves": "Makes 20", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Mix all the ingredients for the shots together.  Keep refrigerated in a jug until ready to serve.", "To serve, place the glasses on a plate or tray pour some bloody mary mix into each one.  Finish with a little cucumber and a pinch of black pepper."]}, {"isVegetarian": false, "title": "Blow-torched mackerel with blini, warm pickled beetroot and chive crème fraîche", "url": "www_bbc_co_uk_food_recipes_blow_torched_mackerel_34721", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["10g/¼oz yeast", "10g/¼oz sugar", "300ml/10fl oz warm milk", "150g/5½oz flour", "75g/2¾oz buckwheat flour", "1 free-range egg, separated, plus 2 extra egg whites", "vegetable oil, for frying", "250g/9oz redcurrant jelly", "250ml/9floz red wine vinegar", "4 cloves", "75g/2¾oz Dijon mustard", "2 large cooked beetroot, peeled and diced", "200g/7oz crème fraîche", "1 bunch chives, finely chopped", "4 mackerel, filleted and pin boned", "rapeseed oil, for drizzling", "4 shallots, finely chopped", "1 tin Avruga caviar"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["To make the blini, mix the yeast, sugar, milk, flours and egg yolk together in a bowl to make a paste.", "Whisk the egg whites in a separate bowl until they form stiff peaks, then fold them into the yeast mixture. Cover the bowl and set aside at room temperature for 20 minutes. ", "Heat a frying pan until medium hot, add a little vegetable oil and small spoonfuls of the blini mixture.", "Cook the blini on each side until golden-brown then remove and drain onto kitchen paper. Repeat with the remaining batter and keep the blini warm until ready to serve.", "For the beetroot, place the redcurrant jelly, vinegar and cloves into a saucepan and cook until reduced down to a glaze thick enough to coat the back of a spoon.", "Pass the mixture through a sieve into a clean bowl, whisk in the mustard then fold the beetroot into the pickle mix and keep warm.", "Whisk the crème fraîche until thickened, add the chives and season with salt and freshly ground black pepper.", "Cut the mackerel fillets in half lengthways. Drizzle with rapeseed oil, gently blow torch on both sides until cooked through then season with salt and freshly ground black pepper.", "To serve, place the mackerel onto the serving plates with a little of the chopped shallots, the warm beetroot pickle, blini, crème fraîche and some Avruga caviar."]}, {"isVegetarian": true, "title": "Blue cheese and fig tarts", "url": "www_bbc_co_uk_food_recipes_blue_cheese_and_fig_34219", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/blue_cheese_and_fig_34219_16x9.jpg", "ingredients": ["2 sheets filo pastry (measuring 25x25cm/10x10in square)", "a little melted butter ", "3 ripe figs", "100g/3½oz creamy blue cheese such as dolcelatte or roquefort", "1 tsp lemon juice ", "3 sage leaves, chopped ", "sprinkling of ground paprika "], "serves": "Makes 24 tarts", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Brush two sheets of filo with butter and place on top of each other. Cut into 24 equal squares. Put the squares together in pairs on top of each other at a 45 degree angle to make a star shape. Press into the holes of a 12 mini-muffin tin. Repeat with the remaining pastry to make 24 mini tartlets. ", "Bake in the oven for about 5-10 minutes, or until golden-brown and crisp. Transfer to a baking tray. ", "Chop the figs into small pieces, and divide between the filo cases. Put the cheese, lemon juice and sage into a bowl. Mash down with a fork, season with pepper, then spoon blobs of cheese mixture on top of the fig. Sprinkle lightly with paprika.", "Bake in the oven for five minutes, or until the cheese has just melted."]}, {"isVegetarian": true, "title": "Blood orange tart", "url": "www_bbc_co_uk_food_recipes_bloodorangetart_93766", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bloodorangetart_93766_16x9.jpg", "ingredients": ["200g/7oz sugar, plus extra for dusting", "3 blood oranges, juice and zest ", "1 tsp orange blossom water", "2 free-range eggs, plus 6 yolks", "200g/7oz butter, cubed", "25cm/10in sweetened shortcrust pastry tart shell, blind baked (you can use ready-made)", "3 blood oranges, peeled, sliced into rounds", "1 tbsp demerara sugar", "double cream or custard, to serve"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Whisk the sugar, orange juice and zest, orange blossom water, eggs and egg yolks together in a bowl until well combined.", "Add the butter and set over a pan over simmering water. (Do not let the base of the bowl touch the water.)", "Cook for 15-20 minutes, stirring regularly, until the butter has melted and the mixture has thickened.", "Pour the mixture into the cooked pastry case , cover with clingfilm (to prevent a skin forming) and set aside to cool.", "Arrange the orange slices on the cooled tart and sprinkle over the demerara sugar.", "Using a cooks' blowtorch, heat the sugar until caramelised.", "To serve, slice the tart and serve with double cream or custard."]}, {"isVegetarian": true, "title": "Blue cheese and pancetta tray loaf", "url": "www_bbc_co_uk_food_recipes_blue_cheese_and_pancetta_85716", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["600g/1lb 5oz strong white flour, plus extra for flouring", "1 tsp sea salt, plus extra for the topping", "1 tbsp caster sugar, plus 1 tsp for cooking the onions", "1 tbsp dried instant yeast", "100ml/3½fl oz olive oil", "50g/1¾oz pancetta, sliced", "2-3 tsbp rosemary leaves, plus extra for serving", "extra virgin olive oil, to drizzle", "125g/4½oz blue cheese, such as Stilton, crumbled", "2 tbsp olive oil", "3 large onions, sliced", "1 tbsp thyme leaves", "1 tsp caster sugar", "1 tbsp balsamic vinegar", "salt and pepper"], "serves": "Serves 4-6", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "Place the flour, salt, caster sugar and yeast in a bowl and mix.", "Create a well in the middle and add 300ml/10fl oz warm water and 100ml/3½fl oz olive oil. Bring the mixture together to a soft dough and turn out on a floured surface.", "Knead for 10 minutes, or until smooth and elastic. Place in a lightly oiled bowl, cover and leave to rise for one hour.", "For the caramelised onions, heat the olive oil in a frying pan and add the onions and thyme. Cook for 25 minutes, or until soft and golden-brown.", "Add the caster sugar and vinegar and cook for a further three minutes. Season with salt and pepper, set aside and clean the pan.", "Return the pan to the heat, add the pancetta and rosemary and cook until crisp. Remove and set aside in a separate bowl.", "Knock back the dough and then stretch out into a long oval shape.", "Place on an oiled baking tray and cover for 30 minutes.", "Make random dimples in the surface of the dough with your fingers. Top with the caramelised onions, a good drizzle of extra virgin olive oil and salt. Bake in the oven for 20 minutes, or until golden-brown.", "Remove the tray and sprinkle with blue cheese, pancetta and rosemary. Bake for an extra two minutes or until the cheese begins to melt.", "Dress with extra rosemary and serve immediately."]}, {"isVegetarian": false, "title": "Blue cheesecakes", "url": "www_bbc_co_uk_food_recipes_blue_cheese_cake_41569", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 large beetroot, skin on and scrubbed ", "2 garlic cloves, crushed", "1 bay leaf", "10g/½oz sprigs of thyme", "½ tsp black peppercorns", "50g/1¾oz caster sugar", "500ml/18fl oz red wine vinegar ", "1 tbsp coarse sea salt", "40g/1½oz unsalted butter, fridge-cold and cut into 2cm/¾in cubes, plus extra, melted, for greasing", "50g/1¾oz pumpkin seeds, toasted", "5 digestive biscuits, roughly crumbled", "40g/1½oz Parmesan, coarsely grated", "½ tsp salt", "20g/¾oz unsalted butter", "1 leek, thinly sliced ", "360g/12oz cream cheese", "170g/6oz crème fraîche", "80g/3fl oz double cream", "2 garlic cloves, crushed", "20g/¾oz chives, finely snipped", "1 tbsp chopped basil", "½ tsp salt", "100g/3½oz Stilton, roughly crumbled", "4 free-range eggs, lightly beaten", "40g/1½oz runny honey (mixed, optionally, with a few drops of truffle oil)", "30g/1oz hazelnuts, toasted and lightly crushed", "15g/½oz baby basil "], "serves": "Serves 8", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Put all the ingredients for the pickled beetroot in a medium, lidded saucepan. Pour over 800ml/1 pint 8fl oz  water. The beetroots should be submerged, so add a little more water if you need to. Bring to the boil, then reduce the heat to medium and cook, covered, for 35–40 minutes, or until the beetroot is soft. Leave to cool completely.", "Lift the beetroots out of the liquid, then peel and cut them into 1cm/½in dice. Put it in the bowl. Strain the pickling liquid, and return it to the pan. Cook over a medium heat for 25 minutes, or until reduced by half to about 600ml/1 pint 2fl oz. Set aside to cool, then pour the liquid over the beetroots. Cover and chill in the fridge for 24 hours.", "For the bases, lightly grease eight 12cm/6in diameter ramekins or soufflé tins with melted butter and place a circle of baking paper in the base of each.", "Put all the ingredients for the cheesecake base in a food processor. Pulse to form fine crumbs, then divide between the ramekins, pressing down evenly and firmly.", "For the cheesecake toppings, preheat the oven to 200C/180C Fan/Gas 6. Melt the butter in a small saucepan over a medium heat for 7 minutes, stirring from time to time, until soft. Leave the leeks to cool, then transfer them to a large mixing bowl.", "Add the cream cheese, crème fraîche, cream, garlic, chives, basil, salt and a good grind of black pepper to the leeks. Mix well to form a smooth paste. Gently fold in the blue cheese and eggs, then pour the mixture into the ramekins. ", "Bake for 25–30 minutes, until a skewer inserted into the middle comes out clean. ", "Serve immediately, in the ramekins or soufflé tins, garnished with a drizzle of honey, the hazelnuts and basil. The beetroot, strained, can be spooned on top of the cheesecakes before the garnishes, or served alongside."]}, {"isVegetarian": false, "title": "Blood orange pork belly with pickled vegetables", "url": "www_bbc_co_uk_food_recipes_blood_orange_pork_belly_88752", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 blood oranges, juice only", "300ml/10fl oz balsamic vinegar", "2 onions, finely chopped", "100g/3½oz fresh galangal, peeled and finely chopped", "3 red chillies, deseeded and finely chopped", "4 bay leaves ", "10 garlic cloves, chopped", "2kg/4lb 8oz pork belly ", "1 x 500ml/18fl oz bottle sake ", "100g/3½oz butter, diced", "125ml/4fl oz rice vinegar", "1 red onion, peeled and quartered", "1 bunch pink radishes, stalks removed", "1 small mooli, ends removed", "10g mustard seeds ", "25g/1oz sugar ", "5g ground black cardamom ", "5g red pepper flakes"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["For the pork belly, place the orange juice and balsamic vinegar in a sterilized, sealable, airtight container. Leave to infuse in the fridge for at least a week.", "Preheat the oven to 160C/140C/Gas 3. Place the onions, galangal, chillies and bay leaves on the bottom of a heavy roasting tin. Rub the chopped garlic all over the pork belly and place the meat on top of the vegetables in the tin. Pour the sake into the tin, add 200ml/7fl oz cold water, cover with kitchen foil and roast for 45 minutes.  ", "Remove the pork belly from the oven and reserve the stock. Press the pork belly by covering with kitchen foil and laying a heavy weight on top. Leave for 12 hours, or longer if you have the time. ", "For the pickled vegetables, pour the vinegar and 125ml/4fl oz of water into a saucepan. Add the rest of the ingredients to the pan, place over a low heat and cook gently, stirring until the sugar has dissolved. Set aside to cool.", "Finely grate the cooled onion, radishes and mooli on a mandoline. Place in a bowl and stir in some of the pickling liquor. ", "Place 150ml/5fl oz of the orange-infused balsamic and the reserved stock in a saucepan and reduce down over a high heat. Whisk in the butter and simmer until it thickens. ", "Cut the pork belly into slices. Fry the pork in a hot frying pan or griddle, until golden on all sides. Coat the pork on both sides with the orange sauce. ", "Serve the pork belly slices with the pickled vegetables and leafy greens alongside. "]}]