[{"ingredients": ["2 puerros medianos, en rodajas", "gruesa rebanada de mantequilla", "3-4 tallos de estragón, solo hojas", "2 buenos puñados derramados de arroz arborio (aproximadamente 200 g / 7 oz)", "Vino blanco seco 175ml / 6 fl oz wine glass", "1 litro / 1 pinta 15fl oz de caldo de pollo casero hecho en casa (el caldo se puede hacer con pollo asado sobrante)", "sal y pimienta negra recién molida", "2 cucharadas colmadas de queso parmesano finamente rallado"], "method": ["Esparza los puerros picados en una sartén grande y poco profunda, agregue la mantequilla y algunas hojas de estragón y cocine a fuego lento, revolviendo de vez en cuando, hasta que los puerros se ablanden y se vuelvan translúcidos, pero sin color, alrededor de 12-15 minutos.", "Agregue el arroz para cubrir la mantequilla, luego agregue el vino y déjelo burbujear hasta que el líquido haya desaparecido. Poco a poco agregue el caldo caliente, un par de cucharadas a la vez como máximo. Cuando el arroz absorbe el líquido y comienza a disminuir en la sartén, puede agregar otro cucharón más o menos, revolviendo el arroz a menudo. Continúe cocinando hasta que el arroz se haya vuelto rollizo y cremoso, pero todavía le queda un poco de mordiente, aproximadamente 20 minutos. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Las patatas fritas de parmesano se pueden preparar unos diez minutos antes de servir el risotto. Coloque cada cucharada de parmesano finamente rallado en una sartén antiadherente a fuego lento y aplaste ligeramente con el dorso de una cuchara para que parezca una galleta. Deje que se cocine suavemente, para que el parmesano se derrita y forme un poco de costra. Una vez que esté crujiente en la parte inferior, con mucho cuidado voltéelo con una espátula. Cocine por un minuto o dos en el otro lado y luego retírelo de la sartén. Sirve el risotto en dos tazones, ambos cubiertos con un parmesano crujiente."], "url": "www_bbc_co_uk_food_recipes_leekrisottowithparme_92285", "title": "Risotto de puerros con patatas fritas parmesano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/leekrisottowithparme_92285_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["dash aceite de oliva", "½ cebolla, picada", "1 diente de ajo, pelado y finamente picado", "½ puerro grande, picado", "150ml / 5¼fl oz de caldo de verduras calientes", "150ml / 5¼fl oz de leche entera", "sal y pimienta negra recién molida", "1 cucharada de crema doble, para servir", "1 cucharadita de cebolletas frescas picadas, para servir"], "method": ["Caliente el aceite de oliva en una olla pequeña, agregue la cebolla, el ajo y el puerro y saltee durante 4-5 minutos, o hasta que estén suaves pero no coloreados.", "Agregue el caldo de verduras, la leche y el condimento y deje que hierva. Cocine a fuego lento durante seis minutos, luego retire del fuego y deje que se enfríe un poco. Vierta en un procesador de alimentos y mezcle hasta que quede suave.", "Para servir, vierta en un tazón y adorne con un remolino de crema doble y cebollino picado."], "url": "www_bbc_co_uk_food_recipes_leeksoup_87413", "title": "Sopa de puerro", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "½ cebolla, picada", "1 diente de ajo, finamente picado", "½ puerro, solo parte verde, picado", "400ml / 14fl oz de caldo de verduras", "3 cucharadas de crema doble", "sal y pimienta negra recién molida", "3 rebanadas de palo francés", "85g / 3oz de queso cheddar maduro, rallado", "1 chile rojo, sin semillas y finamente picado"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para la sopa, caliente el aceite en una sartén y fríe con cuidado la cebolla, el ajo y el puerro durante aproximadamente 3-4 minutos, o hasta que se ablanden. Agregue el caldo y cocine a fuego lento durante 4-5 minutos, luego agregue la crema. Sazonar, al gusto, con sal y pimienta negra recién molida, luego licuar hasta que quede suave con una batidora.", "Para los croûtes, coloque las rebanadas de pan en una bandeja y hornee en el horno durante 2-3 minutos, o hasta que estén crujientes. Retire del horno, espolvoree sobre el queso y el chile y vuelva al horno por otros 3-4 minutos, o hasta que el queso se derrita.", "Sirva la sopa en un tazón con los croûtes en un lado."], "url": "www_bbc_co_uk_food_recipes_leeksoupwithchillian_90087", "title": "Sopa de puerros con chile y queso", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3lb (1kg 350g) puerros pequeños, cortados y lavados y cortados por la mitad", "sal y pimienta", "2oz (50 g) de mantequilla", "Harina simple de 3oz (50g)", "¾ pinta (425 ml) de leche", "Queso cheddar de 6 oz (175 g), rallado", "1 onza (25 g) de queso parmesano, o queso duro vegetariano similar, rallado", "1 cucharada (15 g) de mostaza integral", "1 cucharada (15 g) de mostaza Dijon", "1 cucharadita (5 g) de mostaza inglesa", "2 cucharadas de pan rallado blanco fresco", "1 oz (25 g) de queso cheddar rallado"], "method": ["Precaliente el horno a 200C / 400F / Gas 6 / 180C.", "Coloque los puerros en una sartén con agua fría con sal, deje hervir y cocine a fuego lento durante 3 minutos hasta que estén tiernos. Escurra y ponga en agua fría inmediatamente para refrescar y detener el proceso de cocción.", "Coloque la mantequilla, la harina y la leche en una cacerola y lentamente hierva y bata todo el tiempo. Una vez que esté a punto de ebullición, reduzca el fuego y deje que hierva a fuego lento durante 2 minutos.", "Agregue el cheddar rallado y el parmesano y luego las mostazas. Condimentar con sal y pimienta.", "Pon tus puerros en un plato para servir poco profundo y vierte sobre la salsa.", "Mezcle las migas de pan y el queso juntos y esparza sobre la parte superior de los puerros.", "Hornee en el horno durante 20 minutos hasta que la parte superior esté dorada."], "url": "www_bbc_co_uk_food_recipes_leekswiththreemustar_8917", "title": "Puerros con tres salsa de mostaza y queso", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite", "1 cebolla, finamente rebanada", "6 dientes de ajo, aplastados", "4cm / 1½ en pieza de jengibre fresco, aplastado", "2 chiles verdes calientes, sin semillas, finamente picados", "½ cucharadita de cúrcuma molida", "450 ml / 14 fl oz puede leche de coco", "4 vainas de cardamomo verde, ligeramente trituradas", "4 dientes", "5-6 hojas de curry (disponibles en supermercados asiáticos)", "2cm / ¾in pieza canela en rama", "2 cucharadas de cilantro fresco picado", "500g / 1lb 2 oz de gambas tigre, limpiadas y sin nervaduras, conchas eliminadas pero con la cola intacta"], "method": ["Caliente el aceite en una sartén grande de base pesada con tapa. Agregue la cebolla y cocine hasta que esté transparente.", "Agregue el ajo, el jengibre y los chiles verdes y cocine por dos minutos, teniendo cuidado de no dorarlos.", "Agregue la cúrcuma y cocine por unos segundos, luego vierta la leche de coco. Llevar a ebullición lentamente, revolviendo desde el fondo de la mezcla.", "Sazonar con sal, luego agregar el cardamomo, clavo de olor, hojas de curry y canela. Cocine a fuego lento durante unos minutos, hasta que la mezcla se haya espesado un poco, luego agregue el cilantro y cocine durante uno o dos minutos más.", "Agregue las gambas y cocine por 2-4 minutos, dependiendo de su tamaño. Cubra la sartén, retírela del fuego y déjela a un lado durante unos cinco minutos. Las gambas continuarán cocinando con el calor residual del curry (más cocción en la estufa echará a perder las gambas por sobrecocción).", "Sirva con arroz jazmín al vapor y una ensalada de cebolla fresca."], "url": "www_bbc_co_uk_food_recipes_leelikolminicurrygre_12734", "title": "Curry de gambas verde tailandés", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/leelikolminicurrygre_12734_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 pechugas de pollo (con el ala adjunto), piel sobre, cortada en dos diagonalmente", "2 patas de pollo, con la piel puesta", "2 muslos de pollo, piel sobre", "1 litro / 1¾ pintas de aceite de girasol, para freír", "7 cucharadas de harina blanca lisa", "1 cucharada de orégano seco, desmenuzado", "1 cucharada de hojas secas de tomillo", "1 cucharada de hojas secas de romero, desmenuzado", "2 cucharaditas de pimienta de cayena", "2 cucharaditas de pimienta blanca molida", "1 cucharada de escamas de sal marina", "100ml / 3½fl oz de leche evaporada", "2 huevos de gallinas camperas, golpeados", "papas fritas", "salsa de tomate, mayonesa o barbacoa preparada (opcional)"], "method": ["Enjuague las piezas de pollo en agua fría, luego seque con papel de cocina.", "Para el recubrimiento, incline la harina, las hierbas secas, la pimienta de cayena, la pimienta blanca y una pizca de sal en una bolsa de polietileno grande y fuerte. Agite hasta que esté bien combinado.", "En un tazón, bata la leche evaporada y los huevos hasta que estén bien combinados. Dejar de lado.", "Llene a la mitad una sartén grande de base pesada con aceite y calor a 180 ° C / 350 ° F (use un termómetro de cocina para verificar la temperatura).", "Sumerja un trozo de pollo en la mezcla de leche y huevo hasta que esté completamente cubierto, luego colóquelo en la bolsa de polietileno que contiene la harina y la mezcla de hierbas. Gire la bolsa cerrada, atrapando el aire para que se asemeje a un globo, y agite vigorosamente hasta que la pieza de pollo esté completamente cubierta. Retire la pieza de pollo de la bolsa y déjela a un lado en un plato. Repita el proceso con las piezas de pollo restantes.", "Con cuidado, baje las piezas de pollo recubiertas en el aceite caliente, una a la vez, con pinzas. Cuando se hayan agregado todas las piezas de pollo, el aceite debería estar burbujeando. Cocine el pollo en el aceite durante 18-20 minutos, volteándolo regularmente, hasta que esté crujiente y profundo dorado y completamente cocido. Retire el pollo cocido de la sartén con una espumadera y déjelo a un lado para escurrirlo sobre papel de cocina.", "Para servir, divida las piezas de pollo por igual entre cuatro platos para servir. Sirva con papas fritas y porciones de ketchup de tomate, mayonesa o salsa de barbacoa, si se usa."], "url": "www_bbc_co_uk_food_recipes_leesbrownbagfriedchi_91744", "title": "El pollo frito marrón de Lee", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/leesbrownbagfriedchi_91744_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina simple de 400g / 14oz, más extra para quitar el polvo", "pizca de sal", "65g / 2¼ oz de mantequilla fría", "160g / 5¾oz de mantequilla congelada", "45 g / 1½ oz de mantequilla", "2 puerros grandes, lavados y rebanados aproximadamente", "1 naranja, jugo y ralladura fina solamente", "50ml / 2fl oz de jerez medio", "3 cucharadas de harina común", "Caldo de pollo 500ml / 18fl oz (o 250ml / 9fl oz salsa sobrante y 250ml / 9fl oz stock)", "1 mostaza integral colmada de cucharadita", "600g / 1lb 5oz de carne de pavo sobrante, cortada en piezas del tamaño de un bocado", "250 g / 9 oz de jamón cocido, cortado en trozos del tamaño de un bocado", "2 cucharadas de estragón picado", "200 ml / 7 fl oz crema individual", "1 huevo de gallinas camperas, batido para lavar huevos", "sal y pimienta blanca"], "method": ["Para la masa, mezcle la harina y la sal en un tazón. Frota la mantequilla fría con las yemas de los dedos. Poco a poco agregue suficiente agua fría para formar una masa (aproximadamente 150-180 ml / 5-6 fl oz).", "Polvore ligeramente la superficie de trabajo con harina y enrolle la masa en un rectángulo. Rallar 60g / 2¼ oz de la mantequilla congelada sobre los dos tercios inferiores de la masa. Dobla hacia abajo el tercio superior y dobla el tercio superior como si doblaras una letra. Gire 90 grados y despliegue nuevamente. Repita, agregue la mantequilla congelada restante y doble como antes. Descanse en la nevera durante 30 minutos antes de usar.", "Para el relleno, derrita la mantequilla en una sartén grande a fuego medio y agregue los puerros a la sartén con el jugo de naranja, la ralladura y el jerez. Cubra y cocine suavemente durante 6 minutos, revolviendo ocasionalmente hasta que los puerros estén tiernos. Retire la tapa y aumente el calor, reduzca el volumen del líquido hasta que le queden unas cucharadas de líquido mantecoso. Espolvorea la harina sobre los puerros y revuelve para mezclar uniformemente. Poco a poco revuelva en el caldo y cocine a fuego lento durante 5 minutos hasta que la salsa se haya espesado ligeramente. Agregue la mostaza, el pavo y el jamón y revuelva. Finalmente agregue el estragón y la crema. Sazone al gusto con un poco de pimienta blanca y sal.", "Precalentar el horno a 200C / 180C Fan / Gas 6.", "Vierta el relleno de pastel y la salsa en un plato de tarta de 1,2-1,5 litros / 2-2½ pinta y deje que se enfríe. Si tiene un embudo de tarta, póngalo en el medio del relleno.", "Estirar la masa sobre una superficie de trabajo ligeramente enharinada de aproximadamente 5 mm de grosor. Corta una tira de hojaldre de 2cm / ¾in. Cepille el borde del plato de tarta con huevo lavado, luego coloque la tira de pastelería en el borde y cepíllela con más huevo lavado.", "Para hacer la tapa del pastel, corte la masa restante un poco más grande que el plato y levántela en su lugar (use el rodillo para ayudarlo). Haga un agujero de vapor para exponer el embudo (si está usando). Presione los bordes para sellar y recortar cualquier exceso. Vuelva a enrollar los adornos y utilícelos para hacer decoraciones. Cepille la masa con la colada de huevo, coloque las decoraciones encima de la tarta y cepíllelas con huevo.", "Hornee durante 35-40 minutos hasta que la masa esté dorada. Deje que se enfríe un poco antes de servir."], "url": "www_bbc_co_uk_food_recipes_leftover_turkey_and_ham_95969", "title": "Pastel de pavo y jamón sobrantes", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/leftover_turkey_and_ham_95969_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["260g / 9½oz de harina natural", "1 cucharada de levadura en polvo", "1 cucharadita de copos de sal marina", "1 cucharada de azúcar granulada", "3 huevos grandes de gallinas camperas, ligeramente golpeados", "425ml / 15fl oz de leche entera", "110 g / 3¾oz de mantequilla sin sal, derretida", "150 g / 5½ oz de salmón ahumado sobrante, desgarrado en trozos pequeños", "2 cucharadas de cebollines finamente picados", "12 rebanadas finas pancetta", "jarabe de arce, al gusto", "helado de vainilla, al gusto"], "method": ["Precaliente el generador de gofres y precaliente el horno a 140C / 120C Ventilador / Gas 1. Coloque una rejilla de alambre grande en una bandeja de horno y manténgala caliente en el horno.", "En un tazón grande, combine la harina, el polvo de hornear, la sal y el azúcar. Agregue los huevos, la leche y la mantequilla y mezcle bien. Mezcle el salmón ahumado y el cebollín.", "Vierte la mezcla en cada pocillo de la máquina para hacer gofres y cierra la tapa. Cocine los waffles por 5 minutos, luego levante la tapa y revise el waffle, debe ser dorado y crujiente. Transfiera a la rejilla en el horno y repita el proceso con la rebozada restante.", "Para la panceta, precaliente la parrilla en alto. Coloque la panceta en una bandeja revestida y ase a la parrilla durante 6-7 minutos hasta que esté crujiente, volteándola una vez.", "Sirva los gofres con la panceta, el jarabe de arce y el helado."], "url": "www_bbc_co_uk_food_recipes_leftover_waffles_with_59419", "title": "Gofres sobrantes con panceta, jarabe de arce y helado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["pollo asado sobrante", "verduras, como cebollas, zanahorias y apio"], "method": ["Coloque los huesos del pollo asado sobrante en una olla grande o olla con cualquier verdura que tenga, como cebollas, zanahorias y apio, y cubra con agua fría. Deje que hierva a fuego lento y cocine suavemente durante 2-6 horas, dependiendo de lo que el tiempo lo permita, pero como regla general, cuanto más tiempo pueda hervir, mejor será el sabor. Cuele y almacene por 3-4 días en el refrigerador o congele y use congelado cuando sea necesario."], "url": "www_bbc_co_uk_food_recipes_leftoverroastchicken_92286", "title": "Sobrantes de pollo asado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Rinde 1-2 litros", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pierna de cordero de 2.7kg / 5lb10oz", "1 lavanda pequeña, preferiblemente recién cortada", "½ bag hay", "50g / 2oz de mantequilla, ablandada, más una perilla adicional para el brócoli", "10 patatas King Edward, peladas y cortadas en 2 o 3 piezas", "75 g / 2¾oz de goteo de carne o aceite vegetal", "75ml / 2¾fl oz de vinagre de malta", "25 g / 1 oz de azúcar en polvo", "1 manojo grande de hojas de menta fresca, finamente picada", "Brócoli brotación brote 400g / 14oz", "sal marina y pimienta negra recién molida"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Pierce la pierna de cordero 10-12 veces con la punta de un cuchillo afilado, luego inserta las ramitas de lavanda en los agujeros.", "Use el heno para rellenar una bandeja de tostado grande y profunda, una que sea lo suficientemente grande para toda la pierna de cordero. Espolvorea sobre las hojas de lavanda restantes.", "Coloque la pierna de cordero en el heno, luego frótelo todo con la mantequilla ablandada, y sazone, al gusto, con sal y pimienta negra recién molida. Cubra la bandeja de tostado con papel de aluminio.", "Ase el cordero en el horno durante 2-3 horas (para carne tierna con un toque de rosa), o hasta que esté cocido a su gusto, luego retírelo del horno y déjelo reposar durante al menos 30 minutos.", "Mientras tanto, ponga las papas a hervir en una sartén grande con agua con sal y continúe hirviendo durante 2 minutos. Drene en un colador y agítelos para suavizar los bordes.", "Cuando el cordero tenga alrededor de una hora para cocinar, raspe la carne goteando en una bandeja grande para asar, agregue las papas y sazone con copos de sal. Añádalos al horno y tápelos durante 25-30 minutos, o hasta que estén dorados y crujientes en la parte inferior, luego gírelos para cubrirlos con la grasa y continúe asándolos durante 20-30 minutos más, o hasta que estén doraditos. y crujiente por todas partes.", "Deje hervir a fuego lento el vinagre y el azúcar en una olla no reactiva, luego retire la sartén del fuego y agregue la menta picada. Sazonar con una pizca de sal.", "Justo antes de servir, cocine el brócoli hasta que esté tierno en una sartén con agua salada y hirviendo (aproximadamente de 2 a 3 minutos). Escurrir y sazonar, al gusto, con sal y pimienta negra recién molida y un poco de mantequilla.", "Para servir, transfiera el cordero a un plato de servir y talle en rodajas. Sirva con las papas asadas y brócoli brotación púrpura junto, y rocíe sobre la salsa de menta."], "url": "www_bbc_co_uk_food_recipes_leg_of_lamb_in_hay_with_43057", "title": "Pierna de cordero en heno con lavanda", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["35g / 1¼ oz de harina común", "25 g / 1 oz de mantequilla, cortada en trozos pequeños", "1 huevo grande de gallinas camperas, golpeado", "azúcar pizca", "pizca de sal", "5 hojas de gelatina", "150g / 5½oz de salsa de tomate", "Trucha ahumada de 120 g / 4½ oz", "100g / 3½oz de mantequilla sin sal, ablandada", "½ cucharada de rábano picante a la crema", "Crema agria de 40 g / 1½ oz", "puñado de perejil fresco, picado", "puñado de eneldo fresco, picado", "jugo de limón fresco, al gusto", "sal y pimienta negra recién molida", "manojo de albahaca fresca, para decorar", "Harina normal de 250g / 9oz", "2 cucharaditas de pimentón ahumado", "¼ de cucharadita de azúcar", "1 cucharadita de sal", "125g / 4½oz de mantequilla sin sal, cortada en trozos pequeños", "1 huevo de gallinas camperas", "1 yema de huevo de gallinas camperas", "pizca de pimentón ahumado", "pizca de cúrcuma molida", "coloque colorante de comida naranja", "1 x 400 g / 14 oz pueden garbanzos", "50 ml / 2 fl oz de luz tahini", "1 limón, solo jugo", "2 dientes de ajo, aplastados", "1 cucharadita de comino molido", "puñado de cilantro fresco, picado", "sal y pimienta negra recién molida", "pizca de pimentón ahumado", "eneldo fresco, para adornar", "pimienta negra recién molida", "algunos pellizcos rallados de nuez moscada", "puñado de cebolletas", "puñado de eneldo", "Coliflor 400 g / 14 oz", "100g / 3½oz de ajo y queso crema de hierbas", "1½ cucharadita de sal", "½ cucharadita de mostaza Dijon", "Harina de 300g / 10½oz de levante, más extra para enharinar", "½ cucharadita de sal", "½ cucharadita de pimienta", "100 g / 3½ oz de mantequilla sin sal, cortada en trozos pequeños", "puñado de cebolletas, finamente picado", "Condado de 100g / 3½oz, rallado (alternativamente use Gruyère)", "150ml / 5fl oz de leche entera", "4 pequeñas lechugas gema", "pizca de nuez moscada rallada"], "method": ["Para los 'tomates' de pastelería choux, precaliente el horno a 190 ° C / 375 ° F / Gas 5 y forre una bandeja para hornear con papel para hornear antiadherente. Use un cortador de pastelería para marcar 12 círculos de 3.5 cm / 1½ pulgadas de diámetro, con espacio entre ellos del mismo ancho.", "Toma una hoja de pergamino para hornear y arréglalo en el medio y luego ábrelo. Tamiza la harina en el centro del pliegue y reserva. (Esto es para que sea fácil de agregar a la bandeja en el próximo paso).", "Ponga 60ml / 2fl oz de agua fría y la mantequilla en una cacerola pequeña y caliente suavemente, revolviendo hasta que la mantequilla se haya derretido. Lentamente lleve a ebullición y luego retire inmediatamente la sartén del fuego. Incline la harina tamizada en la sartén de una sola vez y golpee vigorosamente con una cuchara de madera hasta que la mezcla forme una bola de pasta. Deje que se enfríe un poco, luego bata en el huevo batido para formar una pasta suave y brillante.", "Coloque una manga pastelera con una boquilla redonda en el cuello de un vaso alto y coloque la pasta en ella. Rocíe ligeramente la bandeja de horneado preparada con agua y pise las bolas de tamaño uniforme (3,5 cm / 1½ pulg.) En los círculos marcados en el pergamino de horneado preparado.", "Hornee en el horno por aproximadamente 10 minutos, o hasta que la pasta choux esté dorada, crujiente y crecida. Retire del horno. Reduzca la temperatura a 160 ° C / 325 ° F / Gas 3 y atraviese la base de cada panecillo con un palillo de cóctel. Vuelva al horno para que se seque por unos minutos y luego transfiéralo a una rejilla para que se enfríe completamente.", "Para el glaseado de tomate, suavizar las hojas de gelatina en un recipiente de agua fría durante unos cinco minutos. Mida el ketchup de tomate en una cacerola pequeña y, una vez que las hojas de gelatina se hayan suavizado, exprima el exceso de agua y agregue a la sartén.", "Revuelva a fuego lento hasta que se forme una mezcla suave, luego cuele en un recipiente a través de un colador fino y déjelo a un lado.", "Para el paté de trucha ahumada, coloque la trucha ahumada y la mantequilla en un procesador de alimentos y mezcle hasta que quede suave. Agregue la crema de rábano picante, la crema agria y las hierbas picadas y mezcle de nuevo. Agregue el jugo de limón y sazone al gusto con sal y pimienta. Coloque el paté en una bolsa de plástico con una pequeña boquilla y llene cada bollo de choux con el paté, insertando la boquilla en los orificios de las bases.", "Cubra cada bollo de choux con glaseado de tomate espolándolo cuidadosamente sobre la parte superior. Coloque una ramita pequeña de albahaca encima de cada una (para parecerse a una hoja de tomate) y déjela reposar.", "Para las zanahorias Chantenay, coloque la harina, el pimentón, el azúcar y la sal en un tazón. Con las yemas de los dedos, frote la mantequilla hasta que la mezcla se asemeje a migas de pan finas. Haga un pozo en el centro de la mezcla, agregue el huevo y junte la masa. Poco a poco agregue una cucharada de agua fría mientras trabaja la masa con las manos.", "Transfiera a una superficie de trabajo ligeramente enharinada y amase suavemente para formar una bola. Envuelva la película adherida y colóquela en la nevera para que descanse durante al menos 45 minutos o, idealmente, entre 1 y 2 horas.", "Para el glaseado, bata juntos todos los ingredientes en un tazón.", "Precaliente el horno a 190 ° C / 375 ° F / Gas 5 y alinee una bandeja para hornear con papel para hornear antiadherente.", "Tome la masa helada del refrigerador, retire la película adhesiva y divida la masa en tres. Sobre una superficie de trabajo ligeramente enharinada, enrolle cada pieza en un círculo, luego divida cada círculo en cuatro cuartos. Cuidadosamente envuelva cada cuarto alrededor de un molde de cuerno de pastelería y cepille con el glaseado preparado. Use un tenedor para crear una textura de zanahoria sobre la masa y coloque cada \"zanahoria\" en la bandeja de horno revestida. Hornee durante aproximadamente ocho minutos, o hasta que estén ligeramente dorados y crujientes. Cuando esté lo suficientemente frío como para manipularlo, quite los moldes de la boquilla de la masa, cepille con el esmalte y déjelos a un lado para que se enfríen completamente.", "Para el humus de comino y cilantro, escurra y enjuague los garbanzos. Coloque el tahini y el jugo de limón en un procesador de alimentos y mezcle por un minuto. Raspe los lados y mezcle nuevamente durante medio minuto. Agregue el ajo y el comino y mezcle de nuevo. Agregue los garbanzos escurridos y mezcle de nuevo. Agregue el cilantro picado y mezcle una vez más. Sazone al gusto con sal y pimienta y transfiera la mezcla a un tazón. Enfriar en la nevera durante 10-15 minutos.", "Para hacer el puré de coliflor, precalentar el horno a 110C / 225F / Gas ¼.", "Coloque un poco de agua en una olla grande con un poco de pimienta negra, una pizca de nuez moscada rallada y cebollino y eneldo. Cueza al vapor la coliflor sobre el agua con sabor hasta que esté cocida. Coloque la coliflor cocida en una bandeja de asar y hornéela en el horno precalentado hasta que se seque. Transfiera a un recipiente y déjelo enfriar.", "Para los bollos de queso, precaliente el horno a 190 ° C / 375 ° F / Gas 5 y forre una bandeja para hornear con papel para hornear antiadherente.", "Tamiza la harina, la sal y la pimienta en un tazón grande. Use las puntas de los dedos para frotar la mantequilla hasta que la mezcla se asemeje a migas de pan finas. Mezcle el cebollino picado y el queso rallado. Poco a poco agregue la leche hasta que la mezcla se una para formar una masa. Dale la vuelta a una superficie de trabajo ligeramente enharinada y amasa suavemente para crear una masa suave y suave. Suavemente extienda la masa y corte en rondas con un cortador redondo para pasteles de 3.5cm / 1½ pulgadas.", "Coloque los bollos en la bandeja de horneado preparada y hornee durante aproximadamente 10 minutos, o hasta que se levanten, ligeramente dorados y crujientes. Sacar del horno y dejar enfriar. Una vez que esté frío, corte la parte superior de cada bollo.", "Para el puré de coliflor, mezcle la coliflor cocida con una batidora o un procesador de alimentos. Agregue el queso crema con ajo y hierbas, sal, mostaza Dijon y una pizca de nuez moscada rallada y pimienta negra. Vierta el puré en otra manga pastelera equipada con una boquilla estrella y pinte un poco de la mezcla en la parte superior de cada bollo.", "Retire algunas hojas de las lechugas Little Gem y, usando un cortador de hojaldre estriado, corte las hojas para crear círculos que representarán las hojas de una coliflor. Coloque un círculo de lechuga encima de cada bollo y presione suavemente para que se adhiera al puré. Pase más puré sobre la lechuga (para parecerse a los flósculos de una coliflor) y termine con una ralladura fina de nuez moscada.", "Justo antes de servir, vierta el hummus en una manga pastelera y pellizque las zanahorias fritas. Espolvoree con el pimentón ahumado y coloque un poco de eneldo fresco en la parte superior para que parezca una zanahoria."], "url": "www_bbc_co_uk_food_recipes_legume_canaps_26578", "title": "Legumbres de Canape", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Sirve 36 sofás", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500g / 1lb 2oz de huesos de cordero reservados (ver a continuación)", "salpicar aceite de oliva", "½ cebolla mediana, pelada, cortada en cuartos", "2 palitos de apio, cortados, cortados en longitudes cortas", "1 zanahoria mediana, pelada, cortada en longitudes cortas", "4 ramitas de tomillo fresco", "1 hoja de laurel fresca", "1 litro / 1¾ pintas de agua fría", "1 cucharadita de sal marina fina", "1 cucharada de harina normal", "1 cucharada de jalea de grosella", "algunas ramitas de menta fresca", "3 cucharadas de aceite de oliva virgen extra", "75-100g / 2½-3½oz pan blanco ligeramente rancio, cortezas eliminadas, pan cortado en cubos de 1cm", "1 puerro mediano, lavado, cortado, finamente cortado", "½ cebolla mediana, pelada, finamente rebanada", "4 dientes de ajo, pelados, triturados para pegar", "2 cucharadas de alcaparras para bebés, escurridas", "1 limón pequeño (preferiblemente no encerado), ralladura finamente rallada solamente", "5 cucharadas colmadas de menta fresca picada", "3 cucharadas colmadas de perejil fresco picado", "1 cucharadita de copos de sal marina", "pimienta negra recién molida", "3 cucharadas de hojas de menta fresca finamente picadas, más hojas de menta entera extra pequeñas, para servir", "2 cucharaditas de azúcar en polvo", "2 cucharadas de vinagre de vino blanco", "salpicar el aceite de oliva virgen extra", "2kg / 4lb 8oz hueso de cordero deshuesado (pregunte a su carnicero por el hueso), grasa y tendones recortados", "copos de sal marina", "pimienta negra recién molida", "2 cucharaditas de aceite de oliva virgen extra", "2 cucharadas de aceite de oliva, más extra para engrasar", "1 cebolla grande, pelada, finamente cortada", "3-4 ramitas de tomillo fresco, más extra para decorar", "3 dientes de ajo, pelados, finamente cortados", "1,2 kg / 2lb 4 oz de patatas harinas, como Maris Piper, peladas, finamente cortadas al grosor de una moneda de 1 £", "400ml / 14fl oz de caldo de pollo o vegetal", "copos de sal marina", "pimienta negra recién molida"], "method": ["Para el jus de cordero, primero haz algo de cordero. Coloque los huesos de cordero en una olla grande con un poco de aceite y fría a fuego medio a alto durante 8-10 minutos, hasta que se doren ligeramente por todas partes. Agregue la cebolla, el apio, la zanahoria, el tomillo y la hoja de laurel a la sartén.", "Verter sobre el agua y llevar la mezcla a ebullición. Reduzca el fuego hasta que el caldo esté hirviendo a fuego lento, luego continúe cocinando a fuego lento por 45 minutos, rozando la espuma de la superficie del líquido a intervalos regulares.", "Retire el caldo del fuego y cuele a través de un tamiz fino en una jarra o recipiente limpio; apartar para enfriar. Una vez que se haya enfriado, saque la grasa que haya subido a la superficie del líquido.", "Mientras el caldo está hirviendo a fuego lento, haga el relleno. Caliente dos cucharadas de aceite en una sartén antiadherente grande a fuego medio o bajo. Agregue los cubos de pan, en tandas si es necesario, y fría durante 3-4 minutos, o hasta que se doren. Transfiera los cubos de pan frito a un tazón grande.", "Agregue el aceite restante a la sartén y agregue el puerro, la cebolla y el ajo. Freír por 2-3 minutos, revolviendo regularmente, hasta que estén suaves pero no dorados. Transfiera las verduras al recipiente que contiene el pan.", "Mezcle las alcaparras, la ralladura de limón, la menta y el perejil en el pan y las verduras hasta que estén bien combinadas, luego sazone al gusto con sal y pimienta negra recién molida. Dejar de lado para enfriar.", "Para la salsa de menta, mezcle las hojas de menta picada y el azúcar en un tazón pequeño, luego aplaste con la parte posterior de una cuchara durante 1-2 minutos para extraer el sabor de la menta. Agregue el vinagre de vino blanco y una pizca de aceite de oliva hasta que estén bien combinados. Dejar de lado.", "Para el cordero, coloque el cordero en un bardo cortante, con la piel hacia abajo. Cubra el cordero con una hoja grande de película adhesiva, luego aplanar la carne en forma de rectángulo grande y ordenado, de aproximadamente 3 cm / 1½ pulgadas de grosor, utilizando un rodillo o mazo de carne. Sazonar todo con sal y pimienta negra recién molida.", "Con los lados más largos del rectángulo de cordero hacia usted, espolvoree la mezcla de relleno horizontalmente en el centro del rectángulo de cordero (de un lado corto al otro). Envuelva los dos lados largos del rectángulo de cordero alrededor del relleno para encerrarlo completamente. Truss el cordero de forma segura a intervalos de 3 cm / 1½ in en varios lugares con cuerda de cocina. (Atar los dos extremos primero, luego el medio, luego rellenar los espacios. De esta forma, el relleno no se estrujará).", "Pese la juntura de cordero atada y tome nota del peso, luego coloque el cordero en una lata para asar. (En esta etapa, el cordero se puede enfriar durante varias horas, retírelo del refrigerador y vuelva a la temperatura ambiente antes de asarlo).", "Para las papas Boulangère, caliente el aceite en una sartén grande y antiadherente a fuego medio. Agregue las ramitas de cebolla y tomillo y fría, revolviendo ocasionalmente, durante 8-10 minutos, hasta que la cebolla se haya suavizado y dorado ligeramente. Agregue el ajo y continúe freír durante 2-3 minutos, luego sazone, al gusto, con sal y pimienta negra recién molida.", "Engrase una lata para asar de 20cm x 30cm / 8in x 12in o un plato resistente al horno con un poco de aceite.", "Coloque una capa de rodajas de papa para cubrir la base del plato. Espolvorea más de un tercio de las cebollas fritas. Continúe colocando capas de las rodajas de patata y la mezcla de cebolla, terminando con una capa de patatas.", "Vierta sobre el caldo hasta que llegue a la capa superior de papas. Sazonar de nuevo con pimienta negra recién molida y decorar con unas ramitas de tomillo.", "Para cocinar el cordero y las papas, precaliente el horno a 200C / 400F / Gas 6. Frote la corilla atada por todas partes con el aceite y sazone bien con sal y pimienta negra recién molida. Ase el cordero en el centro del horno y las papas en el fondo del horno. Para el cordero, deje 20 minutos de tiempo de cocción por cada 500 g / 1lb 2oz de peso. (El tiempo de cocción completo debe ser de aproximadamente 1 hora y 20 minutos).", "Cuando el cordero haya cocinado a su gusto, retírelo del horno y póngalo a un lado en una tabla de cortar. Cubra con un trozo de papel de aluminio y un par de toallas de té limpias para mantener el calor, luego déjelo a un lado para que descanse. Reserve la bandeja de tostado.", "Mientras tanto, continúe cocinando las papas en la parte superior del horno por otros 10-15 minutos, o hasta que se doren por la parte superior.", "Para hacer el jus de cordero, cuchara tanta grasa como sea posible de la parte superior de los jugos que quedan en la bandeja de asar, a continuación, coloque la bandeja a fuego medio y bata la harina en los jugos. Cocine por 10-15 segundos.", "Agregue gradualmente 300 ml / 10½ fl oz de la reserva de cordero reservada a la mezcla de harina, batiendo después de cada adición hasta que la mezcla esté suave y bien combinada.", "Agregue la mermelada de grosella y la ramita de menta y deje que la mezcla hierva a fuego lento. Continúe cocinando a fuego lento durante 10 minutos, revolviendo de vez en cuando, luego sazone, al gusto. Agregue los jugos liberados de la carne en reposo, luego cuele el jugo en una jarra calentada.", "Para servir, recorte los extremos del paquete de cordero asado, luego retire la cuerda. Tallar el hombro de cordero relleno en rodajas gruesas. Coloque una porción de papas boulangère en el centro de cada una de las seis placas calentadas. Coloque unas rodajas de cordero relleno a cada lado y rocíe sobre el jus de cordero y un poco de salsa de menta. Adorne con unas hojas pequeñas de menta entera."], "url": "www_bbc_co_uk_food_recipes_lemon-and-herb_stuffed_91538", "title": "Paletilla de cordero rellena de limón y hierbas", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon-and-herb_stuffed_91538_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50g / 1¾oz de mantequilla, cortada en cubos, más extra para engrasar", "Harina normal de 65 g / 2¼ oz", "2 huevos grandes de gallinas camperas, golpeados", "600 ml / 1 pinta de crema doble", "6 cucharadas de cuajada de limón", "2 cucharadas de polvo de frambuesa liofilizado", "400g / 14oz de azúcar glasé", "½ limón, solo jugo", "pasta rosada para colorear alimentos", "pasta amarilla para colorear alimentos", "100g / 3½oz de gotas de chocolate blanco, derretidas", "100g / 3½oz de gotas de chocolate negro, derretidas"], "method": ["Precaliente el horno a 220C / 200C (ventilador) / Gas 7. Engrase dos bandejas grandes para hornear con mantequilla.", "Para la pasta choux, ponga la mantequilla y 150ml / 5½ fl oz de agua en una sartén pequeña a fuego lento. Llevar a ebullición lentamente, verter la harina y luego retirar del fuego. Revuelva vigorosamente.", "Cuando la mezcla se vuelva una pasta suave, devuelva la sartén al fuego, revolviendo constantemente. La mezcla se secará un poco y formará una bola suave que se desprenderá de los lados de la sartén.", "Retire la sartén del fuego de nuevo, deje que la mezcla se enfríe un poco, luego agregue gradualmente los huevos, batiendo muy bien entre cada adición hasta que la mezcla esté suave y brillante. (Es posible que no necesite todos los huevos, la mezcla debe ser una consistencia de tubería).", "Espolvoree la bandeja de hornear con agua (un chorro de agua con una boquilla fina es buena para esto).", "Coloque la mezcla éclair en una bolsa grande con una boquilla simple de 1 cm / ½ in. Pipe la mezcla en las bandejas para hornear en 7.5cm / 3in longitudes, dejando espacio entre cada éclair para que se extienda un poco.", "Hornee durante 10 minutos, luego reduzca el calor a 190 ° C / 170 ° C (ventilador) / Gas 5 y hornee por otros 20 minutos. Separe cada éclair por la mitad a lo largo y transfiéralo a una rejilla para que se enfríe por completo.", "Para el relleno, bate la crema a los picos suaves. Divida la crema en tazones separados y doble la crema de limón en un tazón de crema y el polvo de frambuesa en el otro.", "Una vez que los éclairs se hayan enfriado, coloque la crema de limón en una manga con una boquilla lisa de 1 cm / ½ pulgadas y vierta la crema de limón en la mitad inferior de seis éclairs, luego coloque la crema de frambuesa en la manga y póngala en la mitad inferior de los restantes éclairs.", "Para la formación de hielo, coloque la mitad del azúcar glas en un tazón y mezcle con suficiente jugo de limón para formar una capa de hielo muy rígida. Coloree con el colorante de comida amarillo y la cuchara en una manga pastelera desechable.", "Incline el azúcar glas restante en un tazón y agregue suficiente agua para formar una capa de hielo muy rígida.", "Coloree con el colorante de comida rosa y la cuchara en una manga pastelera desechable. Recorta los extremos de las bolsas de tubería y pipa encima de los éclairs de frambuesa. Extienda la formación de hielo con una espátula humedecida en agua hirviendo, para que la parte superior quede lisa.", "Repita con la formación de hielo amarilla en los seis canutillos restantes. Coloca encima los canutillos rellenos de crema de limón.", "Rocíe el chocolate blanco derretido sobre los éclairs de frambuesa en un patrón de zig zag. Rocíe remolinos de chocolate negro derretido sobre los éclairs de limón. Servir."], "url": "www_bbc_co_uk_food_recipes_lemon__raspberry_clairs_98706", "title": "Eclairs de limón y frambuesa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 12 relámpagos", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon__raspberry_clairs_98706_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100 g / 4 oz de mantequilla", "Harina de auto aumento 250g / 9 oz", "1 cucharadita de bicarbonato de soda", "100g / 3½oz de azúcar en polvo de oro, más 2 cucharaditas de agua para rociar", "100 g / 3½ oz de arándanos", "1 limón, ralladura solamente", "2 huevos de gallinas camperas", "150ml / 5fl oz yogurt natural bajo en grasa", "2 cucharadas de leche", "12 cucharaditas de cuajada de limón"], "method": ["Precaliente el horno a 200C / 400F / Gas 6. Cubra una lata de muffin profunda de 12 agujeros con cajas de papel.", "Derrita la mantequilla en una sartén pequeña a fuego lento y luego déjela enfriar por unos minutos.", "Tamiza la harina y el bicarbonato de soda en un tazón grande y agrega el azúcar, los arándanos y la ralladura de limón. Haz un bien en el centro.", "Batir los huevos con un batidor grande hasta que quede suave y luego batir en el yogur, la leche y la mantequilla derretida hasta que estén bien combinados. Mezcle la mezcla de harina con una cuchara grande de metal hasta que se mezcle muy bien.", "Divida la mezcla entre las cajas de muffins. Coloque una cucharadita de la cuajada de limón encima de cada una y espolvoree con el azúcar restante. Hornee por 20 minutos o hasta que esté bien dorado. Servir caliente o dejar enfriar en una rejilla de alambre. (La cuajada de limón estará muy caliente, así que no coma tan pronto como salga del horno)."], "url": "www_bbc_co_uk_food_recipes_lemon_and_blueberry_11428", "title": "Magdalenas de limón y arándano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_and_blueberry_11428_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["85g / 3oz de almendras molidas", "Azúcar de formación de hielo 120g / 4oz", "2 claras de huevo de gallinas camperas", "pizca de sal", "50 g / 1 oz de azúcar en polvo", "gel colorante para alimentos morados", "50 g / 1¾oz de mantequilla derretida, más extra para engrasar", "50g / 1¾oz de harina natural, más extra para espolvorear", "1 huevo de gallinas camperas", "50 g / 1 oz de azúcar en polvo", "½ limón, ralladura y jugo", "⅓ cucharadita de polvo de hornear", "Licor de limoncello 100ml / 3½fl oz", "75ml / 2½fl oz de jugo de limón", "75 g / 2½ oz de azúcar en polvo", "250 g / 9 oz de arándanos", "1 copo de agar agar tsp colmado", "algunas gotas de jugo de limón", "5-7 cucharaditas de azúcar granulada", "1 cucharadita de ácido cítrico", "algunas gotas de colorante de comida púrpura", "Crema doble de 100 ml / 3½ fl oz, batida a picos suaves"], "method": ["Para hacer las conchas de macarrón, precaliente el horno a 150 ° C / 300 ° F / Gas 2 y alinee una bandeja de horno con una hoja de papel de silicona. Marque rondas de 4 cm / 1,5 pulgadas de diámetro en el reverso del papel con un lápiz y colóquelas a un lado.", "Pulse las almendras con el azúcar glas en un procesador de alimentos y luego pase a través de un colador para eliminar cualquier trozo más grande de almendra. Ponga las claras de huevo con una pizca de sal en una batidora eléctrica con un batidor de varillas y bata hasta que estén espumosas, luego agregue gradualmente el azúcar en polvo un poco, batiendo entre cada adición, hasta que los blancos estén brillantes y firmes. picos cuando se quita la batidora.", "Hacia el final de la batida, agregue unas gotas de color de los alimentos y luego agregue las claras de huevo al azúcar glas y las almendras. Mezcle hasta que esté combinado y para que la mezcla se desprenda de una espátula en cintas. Coloque la mezcla en una manga pastelera que tenga una boquilla pequeña y redonda, no más grande que 1 cm / ½ pulgada de diámetro. Pipe la mezcla en la bandeja en los círculos y déjela reposar por alrededor de 15 minutos.", "Hornee las cáscaras de los macarrones durante 12-15 minutos, hasta que las cáscaras se desprendan fácilmente del papel. Déjalos enfriar en una rejilla de alambre.", "Para las esponjas de limón, aumente la temperatura del horno a 200 ° C / 180 ° C (ventilador) / Gas 6. Engrase los moldes de silicona con mantequilla derretida, luego espolvoréelos con harina y déjelos a un lado.", "Batir el huevo con el azúcar en un bol hasta que esté pálido y espumoso. Agregue la mantequilla, la harina, la ralladura de limón y el jugo y el polvo de hornear y mezcle bien hasta que se combinen. Descanse la mezcla durante 20-30 minutos antes de verter en los moldes y hornear durante 12-15 minutos.", "Retire de los moldes y deje enfriar sobre una rejilla de alambre durante 10 minutos. Sumerja cada esponja en el limoncello y colóquela a un lado.", "Para el jarabe de azúcar de limón, coloque el jugo de limón y el azúcar en una olla pequeña y déjela hervir durante 4-5 minutos, o hasta que esté espeso y almibarado. Retirar del fuego y poner a un lado hasta que se enfríe.", "Para hacer el gel de arándano, coloque los arándanos en un procesador de alimentos y mezcle con un puré. Tamiza el puré en una cacerola para quitar los hollejos y las pepitas. Espolvoree los copos de agar-agar sobre el puré y coloque sobre el fuego sin remover.", "Una vez que la mezcla se haya calentado, revuelva y mantenga en el fuego durante 3-5 minutos. Viértalo en una lata de pastel llena de película y colóquelo en la nevera hasta que esté listo - alrededor de 30 minutos. Una vez establecido, romper la gelatina en trozos y poner en el procesador de alimentos con unas gotas de jugo de limón y mezclar hasta que quede suave y tenga una consistencia de gel. Transfiera a una manga pastelera y manténgalo fresco hasta que lo necesite.", "Para el sorbete, mezcle cinco cucharaditas de azúcar, el ácido cítrico y el colorante de alimentos hasta que el color esté uniforme. Pruebe para asegurarse de que el sorbete no esté demasiado agrio y agregue más azúcar al gusto.", "Para ensamblar, cepille un poco del jarabe de azúcar de limón en los bordes solamente de las esponjas y luego enrolle los bordes en el sorbete. Saque un pequeño agujero en la parte superior de la esponja, asegurándose de no ir demasiado profundo y cortar a través de la parte inferior de la esponja. Pipe una pequeña mancha de gel de arándano en el agujero. Coloque la crema batida en otra manga pastelera y vierta un poco de crema en cada esponja, asegurándose de ocultar el orificio y su contenido.", "Empareje los macarrones con el gel restante y coloque un macarrón, de lado, encima de cada bizcocho sobre la masa de crema batida."], "url": "www_bbc_co_uk_food_recipes_lemon_and_blueberry_74594", "title": "Estallidos de limón y arándanos", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Hace 12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Azúcar granulada 400g / 14oz", "100ml / 3½ fl oz de miel clara", "50ml / 2fl oz de glucosa líquida", "2 claras de huevo grandes, a temperatura ambiente", "pizca de sal", "50g / 1¾oz de cáscara de limón confitada, picada", "75g / 2½oz de almendras en copos, tostadas", "75 g / 2½ oz de arándanos secos", "40 g / 1½ oz de chips de chocolate blanco", "puñado de arándanos frescos, para dispersar en la parte superior"], "method": ["Cubra una lata cuadrada de 17 cm con papel de hornear y forre la base con papel de arroz.", "Coloque el azúcar, la miel y la glucosa líquida en una sartén grande y profunda de fondo grueso con 125 ml / 4½ fl oz de agua fría. Caliente suavemente para disolver el azúcar (aproximadamente 15 minutos). Pon un termómetro de azúcar en la sartén y lleva la mezcla a ebullición. Permita que burbujee hasta que la temperatura alcance los 125 ° C / 257 ° F. (PRECAUCIÓN: el azúcar hirviendo es extremadamente caliente. Manipúlelo con cuidado y no lo deje desatendido).", "En este punto, coloque las claras de huevo en el tazón de un mezclador independiente y bata hasta formar picos fuertes, teniendo cuidado de no sobrepasar. Llene su fregadero con 10 cm / 4 in de agua fría.", "Continúe cocinando el jarabe hasta que el termómetro alcance 149C / 300F - debe ser de color caramelo oscuro. Sumerja la base de la sartén en el agua fría para detener la cocción del caramelo.", "Vierta lentamente la mezcla de caramelo en el mezclador de alimentos teniendo cuidado de no tocar los batidores ya que podría salpicarlo. Se espuma hasta la parte superior del tazón de mezcla. Agregue una pizca de sal y mezcle a una velocidad moderada durante 5-8 minutos para incorporar todo el jarabe. El turrón está listo cuando es ligero, esponjoso y de color grisáceo.", "Trabajando rápidamente, doble la cáscara confitada, la mayoría de las almendras y los arándanos secos, luego vierta la mezcla en la lata preparada y extiéndala uniformemente en la lata con un cuchillo húmedo. Espolvorear sobre las virutas de chocolate blanco con las almendras restantes y los arándanos frescos y dejar enfriar. Dejar reposar por unas horas antes de cortar en cuadrados."], "url": "www_bbc_co_uk_food_recipes_lemon_and_blueberry_82699", "title": "Turrón de limón y arándanos", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Hace 25 piezas de turrón", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_and_blueberry_82699_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["750g / 1lb 10oz de harina blanca fuerte", "pizca de sal", "250g / 9oz de mantequilla sin sal, cortada en cubitos", "250 g / 9 oz de manteca de cerdo, cortada en cubitos", "1 cucharada de jugo de limón", "aproximadamente 450ml / 16fl oz de agua helada", "3 huevos de gallinas camperas, más 4 yemas de huevo de gallinas camperas", "6 limones, jugo y ralladura de 3 limones", "115g / 4oz de mantequilla sin sal, cortada en cubitos", "115 g / 4 oz de azúcar en polvo", "1 frasco de 250 g / 9 oz conserva el jengibre en almíbar", "300 ml / 10 fl oz doble crema", "300 ml / 10 fl oz crema fresca", "300 g / 10 oz de queso crema", "1 limón, ralladura solamente", "2 cucharaditas de jengibre molido", "250ml / 9fl oz de azúcar", "125ml / 4¼fl oz de agua", "500g / 1lb 2oz glaseado fondant", "colorante de comida amarilla"], "method": ["Precaliente el horno a 220C / 425F / Gas 7. Coloque dos bandejas grandes para hornear con papel resistente a la grasa. También necesitarás dos bandejas de cocción más grandes.", "Para la masa, tamice la harina y la sal en un tazón grande. Agregue la mantequilla y la manteca de cerdo, luego agregue el jugo de limón y suficiente agua helada para unir la masa. Forme la masa en un bloque y enfríe en el congelador durante 10 minutos.", "Ruede los pasteles en un rectángulo de 5 mm / ¼ de grosor y dóblelos en tercios. Selle los bordes presionándolos, gire la masa 90 grados y vuelva a desplegar. Envuelva la película adhesiva y déjela enfriar en el congelador durante cinco minutos.", "Repita el paso 3 dos veces y relájese en la nevera durante al menos 20 minutos, o hasta que esté listo para usar.", "Extienda un cuarto de la masa sobre una superficie de trabajo enharinada a un grosor de 3 mm / ⅛i y colóquelo con cuidado en una de las bandejas forradas. Repita con otro cuarto de la masa. Regrese los pasteles restantes a la nevera.", "Pincha cada hoja de hojaldre con un tenedor, espolvorea con azúcar glas y vuelve a la nevera durante cinco minutos. Coloque un trozo de papel antigrasa sobre cada hoja de masa, cúbralo con una bandeja para hornear vacía y hornéelo en el horno durante 10 minutos. Retire la bandeja superior para hornear y el pergamino, espolvoree la masa con azúcar glas y vuelva al horno por 10 minutos.", "Repita los pasos 5 y 6 con los pasteles restantes.", "Cuando las hojas de la pastelería estén frías, córtelas con una cortadora de pizza o un cuchillo afilado en rectángulos de 10 cm x 5 cm / 4 pulgadas x 2 pulgadas. Necesitarás 36 rectángulos para las milhojas de mil hojas terminadas (esta receta hace muchos pasteles, así que no te preocupes si hay algunas roturas al cortarla).", "Mientras tanto, haz la cuajada de limón. Batir las yemas de huevo y los huevos en un tazón grande. Coloque el jugo de limón, la ralladura, la mantequilla y el azúcar en un tazón grande de metal, póngalo sobre una olla de agua hirviendo a fuego lento y bata hasta que la mantequilla se derrita y el azúcar se disuelva.", "Poco a poco mezcle la mezcla de mantequilla caliente en los huevos y luego vierta la mezcla en el recipiente de metal sobre el agua hirviendo a fuego lento. Batir constantemente durante 4-5 minutos, o hasta que la cuajada espese. Vierta la cuajada de limón en un tazón limpio y coloque película transparente directamente sobre la superficie para evitar que se forme la piel. Enfríe hasta que se requiera.", "Para el relleno de jengibre, mezcle la mitad del jengibre y todo el jarabe en una licuadora para obtener un puré suave. Corta finamente el jengibre restante y déjalo a un lado.", "Con una batidora eléctrica, bata la crema, la crema fresca y el queso crema hasta que quede suave, luego vierta la ralladura de limón, el jengibre molido y aproximadamente cuatro cucharadas de puré de jengibre.", "Doble suavemente 125ml / 4fl oz de la cuajada de limón en la mezcla de crema y la cuchara en una manga pastelera con una boquilla plana de 1cm / ½in. Enfríe hasta que se requiera.", "Para la formación de hielo, coloque el azúcar y el agua en una sartén pequeña, y caliente hasta que el azúcar se disuelva. Agregue el glaseado fondant y caliente hasta que la mezcla tenga una consistencia espesa. Retire alrededor de 125ml / 4fl oz de la mezcla y agregue unas gotas de colorante amarillo; mézclelo en una manga pastelera con una boquilla pequeña. Dejar de lado para enfriar por completo.", "Para armar las millefeuilles, toma 12 rectángulos de la masa y colócalos uno al lado del otro en dos filas de seis. Vierta el glaseado blanco sobre ellos, extendiéndolo con cuidado con una espátula. Pase por las líneas de hielo amarillo y arrastre un palillo en la dirección opuesta para hacer el patrón de plumas tradicional. Deje que la formación de hielo se establezca durante cinco minutos y luego separe cuidadosamente los trozos de masa.", "Esparce un poco de jengibre picado sobre 12 bases de pasta lisa y vierte un poco de crema de jengibre. Cubra con las bases de repostería llanas restantes y agregue otra capa de jengibre picado y crema. Cubra con un rectángulo de repostería helado."], "url": "www_bbc_co_uk_food_recipes_lemon_and_ginger_mille_19111", "title": "Millefeuilles de limón y jengibre", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Hace 12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["6 limones pequeños preservados", "Jengibre fresco de la raíz de 7½cm / 3in, pelado y rallado", "1 cucharada de cúrcuma fresca rallada", "2 cucharadas de aceite de oliva", "1 diente de ajo graso, pelado", "5 cucharadas de miel clara", "pimienta negra", "2 cucharadas de aceite de oliva", "4 gambas extra grandes (aproximadamente 100 g / 3½ oz cada uno, si es posible)"], "method": ["En una licuadora, combine todos los ingredientes excepto los langostinos y mezcle hasta obtener un puré.", "Pele las gambas, pero deje la cola puesta. Vierta el adobo en un recipiente poco profundo o en una bolsa grande para alimentos, agregue las gambas y asegúrese de que estén bien cubiertas. Refrigere durante al menos 20 minutos, pero más tiempo si lo desea.", "Calentar una sartén grande. Cuando esté caliente, agregue las gambas y cocine en cada lado durante 1-2 minutos, o hasta que estén cocidos. Mientras están cocinando, hágalo todo el tiempo. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_lemon_and_ginger_prawns_60081", "title": "Gambas de limón y jengibre", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Crema doble 600ml / 20fl oz", "150 g / 5½ oz de azúcar en polvo", "1 cucharada de lavanda comestible", "2 limones, jugo solo, colado", "100g / 3½oz de mantequilla suave sin sal", "2 cucharaditas de lavanda (brotes y hojas frescos o lavanda seca comestible)", "50 g / 1 oz de azúcar en polvo", "Harina normal 175g / 6oz"], "method": ["Para hacer el posset, coloque la crema, el azúcar y la lavanda en una sartén. Poco a poco llevar a ebullición, revolviendo todo el tiempo para disolver el azúcar. Reduzca el fuego un poco y cocine a fuego lento durante 2-3 minutos, revolviendo con frecuencia para que la crema no se pegue y se queme.", "Retire la sartén del fuego y agregue el jugo de limón. Dejar enfriar durante cinco minutos, luego verter en cuatro vasos de vidrio o platos pequeños, o seis tazas de café expreso. Deje que se enfríe por completo, cubra con una película adhesiva y deje enfriar en la nevera durante al menos tres horas o hasta que se endurezca.", "Retire de la nevera 20 minutos antes de servir.", "Para hacer los bizcochos, coloca la mantequilla y la lavanda en un bol y bate juntos. Esto ayuda a liberar el sabor de la lavanda. Agregue el azúcar impalpable y bata hasta que esté pálido y esponjoso. Trabaja en la harina con un tenedor o cuchara de madera. No se preocupe si parece que hay demasiada harina en este punto; se supone que es una mezcla bastante seca. Use sus manos para unir la mezcla en una masa suave.", "Forme la mezcla en forma de cilindro, aproximadamente 4 cm / 1½ pulgadas de diámetro y 18 cm / 7 pulgadas de largo, y envuelva en papel a prueba de grasa o película adhesiva. Ponlo en la nevera durante al menos un par de horas, hasta que esté firme.", "Cuando esté listo para hornear los bizcochos, precaliente el horno a 160 ° C / 325 ° F / Gas 3 y forre una bandeja grande para hornear con un pergamino.", "Desenvuelva la masa y use un cuchillo afilado de sierra para cortar discos de 5 mm de grosor del cilindro. Colóquelos en la bandeja revestida, dejando espacio para que los bizcochos se extiendan un poco cuando horneen. (Necesitará hornearlos en lotes.) Hornee por unos 15 minutos o hasta que los bordes de los bizcochos comiencen a dorarse. Transfiera a una rejilla para enfriar.", "Sirva el posset de limón con los bizcochos de lavanda. Cualquier bizcocho sobrante se mantendrá en un recipiente hermético durante unos días."], "url": "www_bbc_co_uk_food_recipes_lemon_and_lavender_79937", "title": "Posset de limón y lavanda con galletas de lavanda", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_and_lavender_79937_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 250g / 9oz", "½ cucharadita de polvo de hornear", "½ cucharadita de bicarbonato de soda", "125 g / 4½ oz de azúcar en polvo", "1½ cucharada de lavanda comestible", "2 limones no encerados, ralladura fina solamente", "2 huevos grandes de gallinas camperas", "200g / 7oz de yogur natural sin grasa", "100 g / 3½ oz de mantequilla sin sal, derretida", "jugo de 2 limones, colado", "2 cucharadas de azúcar glas", "1 cucharada de azúcar granulada", "2 cucharaditas de lavanda comestible"], "method": ["Caliente el horno a 180 ° C / 350 ° F / Gas 4. Cubra una lata de pan de 1 kg / 2 lb y 4 onzas (alrededor de 10x20 cm / 4 x 8 pulgadas de medida base) con papel para hornear.", "En un recipiente, combine la harina, los agentes de levante, el azúcar, la lavanda y la ralladura de limón.", "En una jarra, bata los huevos con el yogur y la mantequilla derretida. Vierta esto sobre los ingredientes secos y, con una espátula, revuelva hasta que se combinen.", "Vierta en la lata preparada y hornee durante 40 minutos, o hasta que un pincho insertado en el centro de la torta salga limpio.", "Retire la torta del horno y pinche profundamente todo con un palillo de cóctel.", "Mezcle los ingredientes para la llovizna y vierta sobre la torta caliente. Espolvorea sobre el azúcar granulada y luego la lavanda. Deje que se enfríe completamente en la lata antes de cortar."], "url": "www_bbc_co_uk_food_recipes_lemon_and_lavender_loaf_90853", "title": "Tarta de pan de limón y lavanda", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_and_lavender_loaf_90853_16x9.jpg", "isVegetarian": true, "recommendations": 0}]