[{"ingredients": ["Galletas digestivas 250g / 8oz", "150g / 5oz de chocolate con leche", "150g / 5oz de chocolate negro", "100g / 3½oz de mantequilla sin sal", "150g / 5oz de jarabe dorado", "100 g / 3½ oz de albaricoques secos, picados", "75 g / 2½ oz pasas", "Pacanas de 60 g / 2 oz, picadas (opcional)"], "method": ["Use película adhesiva para revestir una lata de 20 cm (8 pulgadas) de forma cuadrada y poco profunda. Deje una película adhesiva adicional colgando sobre los lados.", "Bash las galletas en pedazos usando un rodillo. (¡Póngalos en una bolsa de plástico primero para que no vayan a todas partes!)", "Derrita el chocolate, la mantequilla y el sirope dorado en un tazón resistente al calor colocado sobre una fuente de agua hirviendo a fuego lento. Revuelva de vez en cuando.", "Retire el tazón del fuego y agregue los bizcochos, albaricoques, pasas y nueces rotas (opcional).", "Vierta la mezcla en la lata. Nivele la superficie presionándola hacia abajo con un triturador de papas.", "Deje que se enfríe, luego ponga la mezcla de chocolate en la nevera durante 1-2 horas para que se asiente.", "Saca la tarta y quita la película adhesiva. Corta el pastel en 12 cuadrados y ¡disfruta!"], "url": "www_bbc_co_uk_food_recipes_chocolatefridgecake_74814", "title": "Pastel de chocolate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Hace 12 cuadrados", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolatefridgecake_74814_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Galletas de nueces ginger o digestivas de 225g / 8oz, rotas en trozos pequeños", "25 g / 1 oz de cerezas secas", "25 g / 1 oz de cerezas glace, picadas", "Albaricoques secos de 25 g / 1 oz, picados", "25 g / 1 oz de arándanos secos", "Sultanas de 25g / 1oz", "25g / 1oz de cáscara mixta", "Almendras en copos de 25g / 1oz", "175g / 6oz% 20dark% 20Belgian% 20chocolate% 20 (70 %% 20cocoa% 20solids)% 20broken% 20into% 20small% 20pieces", "140g / 5oz de mantequilla sin sal", "3 cucharadas de crema doble", "un poco de aceite vegetal", "helado"], "method": ["Mezcle en un bol todos los ingredientes excepto el chocolate, la mantequilla y la crema.", "Coloque el chocolate, la mantequilla y la crema en una cacerola a fuego lento y permita que el chocolate se derrita, revolviendo para combinar.", "Vierta el chocolate sobre la mezcla de galletas y mezcle bien todo hasta que se combinen.", "Mientras tanto, forrar una lata de pastel de 20 cm / 8 pulgadas con una hoja grande de papel de aluminio presionándola cuidadosamente en la lata. Cepille la lámina con una capa escasa de aceite vegetal.", "Con una cuchara, coloque la mezcla de chocolate en la bandeja de aluminio forrada con papel aluminio y empuje hacia abajo. Cubra el pastel con más papel de aluminio y colóquelo en el refrigerador. Enfriar durante aproximadamente dos horas. Retire de la lata y levante la lámina. Cortar en trozos y servir con helado de vainilla."], "url": "www_bbc_co_uk_food_recipes_chocolatefruitandnut_74454", "title": "Tarta de helado de frutas y nueces de chocolate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["350g / 12oz de ciruelas pasas secas, picadas", "250g / 9oz de uva", "125g / 4oz pasas de Corinto", "175g / 6oz de mantequilla sin sal ablandada", "175g / 6oz de azúcar moreno oscuro", "175ml / 6fl oz de miel", "Licor de café 125ml / 4fl oz", "2 naranjas, jugo y ralladura solamente", "1 cucharadita de especias mixtas", "2 cucharadas de cacao de buena calidad", "3 huevos de gallinas camperas, golpeados", "150g / 5¼ oz de harina común", "75g / 2½ oz de almendras molidas", "½ cucharadita de polvo de hornear", "½ cucharadita de bicarbonato de soda", "Para decoración", "25g / 1oz de granos de café cubiertos de chocolate negro", "Brillo de holograma Disco Gold", "Mini bolas de oro de 2 mm", "aproximadamente 10 estrellas doradas"], "method": ["Precalentar el horno a 150C / 300F / Gas mark 2.", "Alinee los lados y el fondo de una lata de pastel de fondo suelto de 20cm / 8in, 9cm / 3½ pulgadas de profundidad con una capa de bake-o-glide u otro pergamino de cocción de silicio reutilizable. Cuando forre la lata con la cocción-o-glide, corte el material en tiras que sean dos veces más altas que la lata misma (es más fácil usar dos tiras más cortas de hornear-o-deslizar, que una tira larga); la altura de las tiras protege la torta de atrapar en el exterior de la lata de la torta.", "Coloque la fruta, la mantequilla, el azúcar, la miel, el licor de café, el jugo y la ralladura de naranja, la mezcla de especias y el cacao en una cacerola grande y ancha. Caliente la mezcla hasta que alcance un hervor suave, revolviendo la mezcla a medida que la mantequilla se derrita. Deje que la mezcla hierva a fuego lento durante diez minutos. Luego retire la cacerola del fuego y déjela reposar durante 30 minutos.", "Después de 30 minutos, la mezcla se habrá enfriado un poco. Agregue los huevos, la harina, las almendras molidas, el polvo de hornear y la soda de bicarbonato, y mezcle bien con una cuchara de madera o una espátula hasta que los ingredientes se hayan combinado.", "Con cuidado, vierta la mezcla de torta de fruta en la lata de torta forrada bake-o-glide. Transfiera la lata de la torta al horno y hornee de 1 a 2 horas, o hasta que la parte superior del pastel esté firme, pero tendrá un aspecto brillante y pegajoso. En este punto, si inserta un probador de torta en el medio del pastel, el pastel todavía debe estar un poco crujiente en el medio.", "Coloque la torta en una rejilla para enfriar. Una vez que el pastel se haya enfriado, quítelo de la lata.", "Para decorar, coloque los granos de café cubiertos de chocolate en el centro del pastel y coloque el dorado alrededor del perímetro de la parte superior del pastel. Luego espolvorea unas minibotas doradas sobre toda la tarta. Espolvorea el Disco Gold Hologram Glitter sobre la parte superior del pastel."], "url": "www_bbc_co_uk_food_recipes_chocolatefruitcake_84675", "title": "Pastel de frutas de chocolate", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Sirve 12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolatefruitcake_84675_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Margarina de soja 55 g / 2 oz", "3 cucharadas de leche de soja", "200g / 7oz de azúcar glasé", "30g / 1 oz de cacao en polvo"], "method": ["Coloque la margarina de soja, la leche de soja, el azúcar glas y el cacao en un tazón sobre una cacerola de agua hirviendo a fuego lento.", "Revuelva bien hasta que el glaseado esté suave y brillante.", "Retírelo del fuego y déjelo enfriar completamente, luego use para enfriar el pastel."], "url": "www_bbc_co_uk_food_recipes_chocolatefudgeicing_83804", "title": "Glaseado de dulce de chocolate vegano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Hace suficiente para un pastel de 9 pulgadas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolatefudgeicing_83804_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina de 85g / 3oz de levante", "30g / 1 oz de cacao en polvo", "pizca de sal", "115g / 4oz de azúcar mascabado ligero", "115g / 4oz de mantequilla sin sal ablandada", "1 cucharadita de esencia de vainilla", "2 huevos de gallinas camperas, ligeramente golpeados", "2-3 cucharadas de leche", "85g / 3oz de azúcar mascabado ligero", "30g / 1 oz de cacao en polvo", "225ml / 8 fl oz de leche"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Unte con mantequilla un plato a prueba de horno de 1 litro (2 ptos.).", "Para hacer la esponja, tamiza la harina en un bol con el cacao en polvo y la sal.", "En un tazón aparte, unte el azúcar y la mantequilla hasta que estén suaves y esponjosos.", "Batir la esencia de vainilla y los huevos, luego doblar esta mezcla en la mezcla de harina.", "Mezcle solo la leche suficiente para obtener una consistencia suave.", "Cuchara en el plato a prueba de horno con mantequilla.", "Para la salsa, mezcle el azúcar y el cacao en polvo y gradualmente batir en la leche.", "Vierta uniformemente sobre la mezcla de pastel sin cocer.", "Coloque en el horno y hornee durante aproximadamente 40-60 minutos hasta que esté firme y esponjoso al tacto.", "Servir caliente, tibio o frío, con o sin crema."], "url": "www_bbc_co_uk_food_recipes_chocolatefudgecake_77526", "title": "Pastel de chocolate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["150 g / 5 oz de chocolate negro sin gluten de mejor calidad (70 por ciento de sólidos de cacao)", "150g / 5oz de mantequilla", "1 cucharadita de extracto puro de vainilla", "150ml / ¼ pinta de agua tibia", "Azúcar en polvo de 110 g / 4 oz", "4 huevos, preferiblemente de campo abierto, separados", "Harina de arroz de 25g / 1oz, tamizada", "1 cucharadita de polvo de hornear sin gluten", "azúcar glas sin gluten, para quitar el polvo", "Plato para tarta de 1.2 litros / 2 pinta o 8 moldes individuales, bien engrasados ​​con mantequilla"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Cortar el chocolate en trozos pequeños y derretir con la mantequilla en un recipiente a prueba de calor sobre una olla de agua hirviendo a fuego lento. Tan pronto como el chocolate se haya derretido, retíralo del fuego y agrega el extracto de vainilla, luego agrega el agua tibia y el azúcar. Continúa mezclando hasta que quede suave. Batir ligeramente las yemas de huevo y batirlas en la mezcla de chocolate. Doble la harina de arroz tamizada y el polvo de hornear sin gluten, asegurándose de que no queden grumos.", "Batir las claras de huevo en un tazón grande, escrupulosamente limpio hasta que se formen picos fuertes. Doble suavemente en la mezcla de chocolate y vierta en el plato de pastel engrasado o moldes.", "Coloque el plato de tarta en un recipiente de agua caliente y hornee durante 10 minutos (para el plato individual), luego reduzca la temperatura a 160 ° C / 325 ° F / Gas 3 por otros 20-30 minutos. Si está preparando platos individuales, se cocinarán en aproximadamente 15 minutos a 200 ° C / 400 ° F / Gas 6. El budín debe ser firme en la parte superior, pero aún suave y esponjoso por debajo. Polvo con azúcar glas sin gluten y sirva caliente, tibia o fría con crema batida."], "url": "www_bbc_co_uk_food_recipes_chocolatefudgepuddin_74774", "title": "Fudge de chocolate con leche", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["5 huevos", "5 yemas de huevo", "125g / 4oz de azúcar en polvo", "250g / 9oz de chocolate oscuro para cocinar, picado", "250g / 9oz de mantequilla sin sal, cortada en cubos", "40g / 1½oz de comida harinosa o harina de maíz", "20g / ¾oz de harina", "cacao en polvo, para quitar el polvo", "mantequilla ablandada, para engrasar"], "method": ["Engrasar abundantemente los moldes de dariole con mantequilla ablandada y polvo con cacao en polvo. Ponlo en la nevera para enfriar.", "Derretir el chocolate y la mantequilla sobre un baño maría.", "Permita mezclar completamente.", "Batir los huevos, las yemas de huevo y el azúcar impalpable.", "Cuando el chocolate y la mantequilla se hayan derretido, mezcle lentamente en la mezcla de huevo.", "Doble la comida harinosa o la harina de maíz en la mezcla de chocolate gradualmente.", "Llene los moldes 3/4 con la mezcla de chocolate y hornee a 200C / 400F / Gas 6 hasta que esté firme en la parte superior aprox. 7 min.", "El centro del pudin debe ser líquido. Servir con un helado con sabor ver recetas por separado)."], "url": "www_bbc_co_uk_food_recipes_chocolatemealiemealp_10895", "title": "Pudín de harina de chocolate mealie", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["225 g / 8 oz de chocolate negro", "5 huevos medianos de granja", "100 g / 3½ oz de azúcar en polvo", "170g / 6oz de mantequilla sin sal", "200 ml / 7 fl oz crema fresca", "12-16 cerezas frescas", "cacao en polvo, para quitar el polvo"], "method": ["Coloque un recipiente sobre una fuente de agua hirviendo (el agua no debe tocar el fondo del recipiente) y derrita suavemente el chocolate en el recipiente. Retire del fuego una vez derretido y deje que se enfríe un poco.", "Separar las yemas de huevo de las claras de huevo. Batir las yemas de huevo y la mayor parte del azúcar hasta que estén cremosos y de color pálido (mantenga dos cucharaditas de azúcar a un lado para las claras de huevo).", "Cuando se haya enfriado un poco, bata el chocolate en la yema de huevo y la mezcla de azúcar.", "Derrita la mantequilla en una sartén a fuego lento.", "Batir la mantequilla derretida en la mezcla de chocolate. Si se vuelve demasiado espeso, agregue un par de cucharadas de agua.", "En un tazón limpio, bata las claras de huevo y las dos cucharaditas restantes de azúcar con un batidor eléctrico hasta que queden livianas y esponjosas y mantengan un pico suave. No te sobrepases El azúcar les dará un suave brillo.", "Con cuidado, dobla las claras de huevo en la mezcla de chocolate con una cuchara de metal.", "Coloque la mezcla de chocolate en pequeñas tazas de té o moldes y refrigere durante aproximadamente dos horas.", "Justo antes de servir, cubrir cada marquesa con una cucharada de crème fraîche y dos cerezas frescas, luego espolvorear con cacao en polvo."], "url": "www_bbc_co_uk_food_recipes_chocolatemarquisepot_90201", "title": "Cómo hacer mousse de chocolate", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolatemarquisepot_90201_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 claras de huevo", "150 g / 5½ oz de azúcar en polvo de oro", "50g / 2oz de chocolate negro de buena calidad, rallado o finamente picado", "2 cucharaditas de cacao, tamizado", "100g/3½oz chocolate", "Crema doble 50ml / 2fl oz"], "method": ["Precalentar el horno a 140C / 275F / Gas 1.", "Línea dos bandejas para hornear con papel antigrasa.", "En un tazón limpio y seco, bata las claras de huevo hasta que se formen picos suaves.", "Poco a poco bata el azúcar hasta que se formen picos fuertes.", "Mezcle el chocolate y el cacao y dóblelos suavemente en el merengue.", "Vierta cucharadas de la mezcla en las bandejas preparadas y póngalas rápidamente en el horno antes de que la mezcla pierda volumen.", "Cocine por 40 minutos.", "Para hacer la crema, derrita suavemente el chocolate con la crema en una olla pequeña de fondo grueso.", "Vierta en un recipiente y deje enfriar.", "Para servir, haga un 'sándwich' usando dos merengues y la crema de chocolate como relleno."], "url": "www_bbc_co_uk_food_recipes_chocolatemeringueswi_74755", "title": "Merengues de chocolate con crema de chocolate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 16-20 merengues", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["175g / 6oz de chocolate negro (70 por ciento de sólidos de cacao), picado", "110 g / 4 oz de mantequilla, cortada en cubos", "3 huevos grandes de gallinas camperas, separados", "2 cucharadas de ron, aguardiente o café expreso (según preferencia)"], "method": ["Derretir el chocolate lentamente en un recipiente a prueba de calor sobre una olla de agua a fuego lento.", "Retire el recipiente del fuego y agregue la mantequilla. Revuelva hasta que se derrita y combine.", "Agregue las yemas de huevo una por una, revolviendo constantemente.", "Agregue el ron, el brandy o el café exprés (según su preferencia).", "Batir las claras de huevo hasta que se formen picos suaves cuando se quite la batidora, luego doblarlas suavemente en la mezcla de chocolate.", "Transfiera la mousse a tazas o moldes pequeños y refrigere durante la noche o hasta que esté listo para servir."], "url": "www_bbc_co_uk_food_recipes_chocolatemousse_85881", "title": "Mousse de chocolate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50 g / 1¾oz de cacao en polvo, más extra para quitar el polvo", "2 cucharadas de agua", "3 cucharadas de leche entera", "1 cucharada de azúcar glas", "15g / ½ oz de mantequilla", "75ml / 2½ fl oz crema doble"], "method": ["Caliente el cacao en polvo, el agua, la leche, el azúcar glas y la mantequilla en una cacerola y revuelva hasta que quede suave y combinado.", "En un tazón grande, bata la crema hasta que se formen picos suaves cuando se quite el batidor. Doble suavemente la mezcla de cacao.", "Servir en un vaso de vino, espolvoreado con polvo de cacao en polvo."], "url": "www_bbc_co_uk_food_recipes_chocolatemousse_88183", "title": "Mousse de chocolate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["250g / 8oz% 20good% 20quality% 20dark% 20chocolate,% 20minimum% 2070 %% 20cocoa% 20solids", "4 cucharadas de agua", "30ml / 1fl oz de ron o licor de naranja o café", "25 g / 1 oz de mantequilla, cortada en trozos pequeños", "4 huevos de gallinas camperas, separados", "90ml / 3½ fl oz crema doble", "¼ cucharadita de crema de tártaro", "40 g / 1½ oz de azúcar en polvo", "chocolate rallado, para decorar"], "method": ["Derrita el chocolate con el agua en un recipiente colocado sobre una fuente de agua hirviendo, revolviendo ocasionalmente, teniendo cuidado de no permitir que el recipiente toque el agua. Caliente, revuelva, hasta que todo el chocolate se derrita.", "Retire la sartén del fuego y mezcle el ron o el licor junto con los trozos de mantequilla, hasta que estén suaves y cremosos.", "En un recipiente aparte, bata las yemas de huevo hasta que estén espesas y cremosas y luego bate en el chocolate derretido.", "En un recipiente aparte, bate la crema doble hasta que el batidor deje un rastro en la superficie de la crema cuando la batidora se levante. Agregue una cucharada de la crema batida en la mezcla de chocolate, luego doble la mezcla de chocolate en la crema restante.", "En un recipiente aparte, bata las claras de huevo hasta que estén espumosas, agregue la crema de tártaro y bata hasta que se formen picos suaves cuando se quite el batidor del tazón. Tenga cuidado de no batir demasiado las claras de huevo.", "Doble una cuarta parte de las claras de huevo suavemente en la mezcla de chocolate con una cuchara de metal, luego doble suavemente las claras de huevo restantes.", "Vierta la mezcla en un tazón grande de vidrio o en ocho tazones individuales para servir y enfríe en la nevera durante una hora, o hasta que esté listo.", "Espolvorea la mousse de chocolate con chocolate rallado y sirve."], "url": "www_bbc_co_uk_food_recipes_chocolatemousse_88976", "title": "Mousse de chocolate con ron", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200g / 7oz de chocolate negro (mínimo 70 por ciento de sólidos de cacao), roto en pedazos", "125ml / 4½fl oz de agua tibia", "3 huevos grandes de gallinas camperas, separados", "40g / 1½ oz de azúcar en polvo de oro", "1 cucharada de cacao en polvo, tamizado", "4 cucharaditas de agua tibia", "Mantequilla sin sal 110g / 4oz, ablandada", "Azúcar glas de 140g / 5oz, tamizada", "3 claras de huevo de gallinas camperas", "Harina común 110g / 4oz", "Crema doble 110ml / 4fl oz", "2 cucharadas de azúcar glas", "½ vaina de vainilla, partido y semillas raspadas", "Frambuesas 150g / 5oz"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para la mousse, coloque los trozos de chocolate y el agua tibia en un tazón grande y resistente al calor y siéntelo sobre una fuente de agua apenas hirviendo, asegurándose de que el recipiente no toque el agua a continuación.", "Mantenga el calor en su punto más bajo y permita que el chocolate se derrita lentamente.", "Retire del fuego y revuelva bien hasta que el chocolate esté suave y brillante.", "Deje que la mezcla se enfríe; luego mezcle bien las yemas de huevo con una cuchara de madera.", "En un tazón limpio, bata las claras de huevo hasta que se formen picos suaves cuando se quite el batidor del tazón. Poco a poco, bata el azúcar y continúa batiendo hasta que los blancos estén brillantes.", "Con una cuchara de metal, doble las claras de huevo en la mezcla de chocolate, teniendo cuidado de no expulsar el aire de las claras de huevo. Dejar de lado en un lugar fresco.", "Para tuile, necesitarás seis pequeños cortadores de galletas redondos. Haga rodar una de las cuchillas a lo largo de su lado sobre una pieza de tarjeta gruesa, una vuelta completa, para medir su circunferencia.", "Corta un rectángulo largo y delgado del tamaño del cortador de la tarjeta para dejar un agujero de forma rectangular. Ahora corte un orificio en forma de círculo de la tarjeta (del mismo tamaño que el cortador) desde el centro del cortador.", "Batir el polvo de cacao y el agua juntos para hacer una pasta suelta en un tazón pequeño. Dejar de lado.", "Coloque la mantequilla y el azúcar glas en un recipiente aparte y bata hasta que quede suave, liviano y esponjoso. Poco a poco agrega las claras de huevo a la mezcla, y luego dobla la harina.", "Alinee una bandeja para hornear con una esterilla para hornear antiadherente. Cepille la pasta de cacao sobre la alfombra para dar una capa ligera. Coloque la pasta de cacao restante a un lado.", "Coloque la plantilla encima de esta y extienda la mezcla tuile muy delgada sobre los agujeros con una espátula, luego levante la plantilla, dejando dos formas perfectas. Repita para hacer seis juegos (o más si tiene suficiente de la mezcla).", "Hornee en el horno durante 4-5 minutos hasta que se coloreen ligeramente alrededor de los bordes. Retire del horno y deje enfriar por un minuto.", "Para armar las cajas de tuile, voltee el borde de uno de los tuules rectangulares hacia arriba, y usando uno de los cortadores, enrolle el tuile alrededor de la cortadora para crear un cilindro. Repita con los cortadores restantes y las piezas de tuile. Dejar enfriar un poco; luego quite los cortadores para que se enfríen por completo. Permita que las tapas redondas se enfríen completamente.", "Para la crema de vainilla, coloque la crema, el azúcar glasé y las semillas de vainilla en un tazón y bata hasta que se formen picos suaves cuando retire el batidor del tazón.", "Para servir, cepille una tira en el centro de cada plato con la pasta de cacao. Coloque el cilindro tuile en el centro de cada uno y llénelo con la mousse de chocolate reservada. Cubra con algunas frambuesas y coloque la tapa tuile en ángulo para cubrirla. Vierta la crema de vainilla al lado."], "url": "www_bbc_co_uk_food_recipes_chocolatemousseinatu_91174", "title": "Mousse de chocolate en una caja tuile con frambuesas frescas y crema de vainilla", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["75g / 2¾oz de chocolate, derretido", "200ml / 7fl oz de crema doble, batida", "2 cucharadas de mantequilla", "3 cucharadas de azúcar en polvo", "2 naranjas, peladas y segmentadas"], "method": ["Para hacer la mousse de chocolate, derrita el chocolate en un recipiente de vidrio sobre el agua hirviendo a fuego lento.", "Batir la crema hasta que se formen picos suaves.", "Mezcla los dos juntos para formar un efecto de mármol. Tenga cuidado de no mezclarlos en exceso.", "Ponlo en un vaso alto.", "Para las naranjas, en una cacerola mediana caliente la mantequilla y el azúcar para formar un caramelo.", "Agregue las naranjas y continúe cocinando durante dos minutos.", "Coloque en un plato de vidrio pequeño y sirva con la mousse de chocolate."], "url": "www_bbc_co_uk_food_recipes_chocolatemoussewithc_76056", "title": "Mousse de chocolate con naranjas caramelizadas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["85-110ml / 3-4 fl oz crema doble", "1 cucharada de cacao en polvo", "1 cucharada de azúcar glas", "1 naranja, solo jugo", "1 naranja, segmentado", "1 higo, cortado en rondas", "1 cucharada de yogur al estilo griego"], "method": ["Batir la crema hasta que solo mantenga su forma.", "Agregue el cacao, el azúcar y el jugo de naranja.", "En un vaso, cubra los segmentos de mousse y naranja.", "Cubra con rondas de higos y una cucharada de yogurt griego."], "url": "www_bbc_co_uk_food_recipes_chocolateorangeandfi_78066", "title": "Mousse de chocolate, naranja e higo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["30g / 1¼ oz de mantequilla sin sal, picada", "100 g / 3½ oz de chocolate negro, roto en pedazos", "3 huevos de gallinas camperas, separados", "25 g / 1 oz de azúcar en polvo", "1 tiro espresso", "100g / 3½oz de mantequilla sin sal, suavizada hasta muy suave, más extra para engrasar", "Harina normal de 80g / 2¾oz", "30g / 1¼ oz de azúcar glas", "30g / 1¼ oz de harina de maíz", "gota de esencia de vainilla", "50g / 1¾oz de raíz de jengibre fresco, lavado, sin pelar, finamente rallado", "2-3 piezas de jengibre cristalizado, en rodajas", "1 naranja grande, solo cáscara, médula blanca eliminada, cortada en tiras de 0.5cm / ¼ in", "80g / 2¾oz de azúcar en polvo", "150g / 5oz demerara azúcar"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4.", "Para la mousse de chocolate, hierva un poco de agua en una sartén, luego reduzca el fuego hasta que el agua esté hirviendo a fuego lento. Suspenda un recipiente resistente al calor sobre el agua (no permita que la base del recipiente toque el agua). Agregue la mantequilla y el chocolate negro y revuelva hasta que se derrita, suave y bien combinado. Retirar del fuego y reservar para enfriar un poco.", "Batir las yemas de huevo y el azúcar en un bol hasta que estén casi blancos y de consistencia espesa.", "Agite suavemente las yemas batidas en la mantequilla y el chocolate, luego agregue el café.", "Batir las claras de huevo hasta que se formen picos rígidos cuando se quite el batidor, luego doblarlos suavemente en la mezcla de chocolate, hasta que se combinen.", "Transfiera la mousse a tazas pequeñas o moldes y enfríe en la nevera durante 1-2 horas, o durante la noche.", "Para el shortbread de jengibre, bata la mantequilla hasta que esté pálida y esponjosa en un tazón. Tamice la harina, el azúcar glas y la harina de maíz y bata hasta que esté completamente incorporado. Agregue la esencia de vainilla y el jengibre rallado.", "Coloque bolas del tamaño de una nuez de la mezcla en una bandeja para hornear engrasada, a aproximadamente 2 cm de separación (debe obtener aproximadamente 18 de esta mezcla). Extienda cada bola de la mezcla de galletas ligeramente con el dorso de una cuchara, hasta que se aplaste en forma de galletas. Cubra cada bola con una rodaja de jengibre cristalizado, luego transfiérala al horno y hornee durante 12-15 minutos, o hasta que los bizcochos de mantequilla sean de color marrón dorado pálido. Retire del horno y deje enfriar por unos minutos, luego con cuidado levante la bandeja y sobre una rejilla de alambre, con una espátula, y deje a un lado para que se enfríe por completo.", "Para la cáscara de naranja confitada, llena una pequeña olla con agua y llévala a ebullición. Agregue la cáscara de naranja y vuelva a hervir, luego escurra bien.", "Vuelva a llenar la sartén con agua, deje que hierva, devuelva la cáscara de naranja a la sartén, vuelva a hervir el agua y vuelva a vaciar.", "Vuelva a llenar la sartén con 150 ml / 5 fl oz de agua, agregue el azúcar en polvo y deje que hierva, revolviendo bien. Agregue la cáscara de naranja, reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento y cocine a fuego lento durante 15-20 minutos, o hasta que el líquido se asemeje a jarabe, revolviendo ocasionalmente.", "Incline el azúcar demerara en un recipiente poco profundo.", "Una vez que la mezcla de jarabe se haya espesado, retire la cáscara de naranja y cubra cada pieza con el azúcar demerara. Agite la cáscara en el azúcar hasta que esté completamente cubierto. (NB: una vez frío, mantenga la cáscara de naranja confitada destapada hasta que se la necesite).", "Para servir, coloca los moldes de mousse de chocolate en platos para servir. Coloque una o dos tortas junto a cada una. Espolvorea la mousse con la cáscara de naranja confitada."], "url": "www_bbc_co_uk_food_recipes_chocolatemoussewithf_92666", "title": "Mousse de chocolate con shortbread de jengibre y cáscara de naranja confitada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolatemoussewithf_92666_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["55 g / 2 oz de chocolate negro, derretido", "1 yema de huevo de gallinas camperas", "3 claras de huevo de gallinas camperas, batidas hasta que se forman picos rígidos cuando se retira el batidor", "1 limón, ralladura", "Harina común 110g / 4oz", "75g / 3oz de azúcar en polvo", "2 huevos de gallinas camperas", "1 cucharada de aceite", "50ml / 2fl de leche en oz", "mantequilla, para engrasar"], "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "En un tazón limpio, bata el chocolate y las yemas de huevo juntas. A continuación, doble las claras de huevo y la ralladura de limón en la mezcla.", "Para los crêpes, en un recipiente aparte, mezcle la harina, el azúcar, los huevos, el aceite y la leche para crear una pasta ligera.", "Caliente una bandeja para crepes y unte ligeramente con mantequilla. Agregue la mitad de la mezcla, agite la mezcla alrededor de la sartén, cubra y cocine durante 1-2 minutos en cada lado a fuego medio. Retire la crepe y coloque en un papel de cocina, luego repita con la otra mitad de la mezcla.", "Coloque las dos crepes en una bandeja para hornear y llene la mitad de cada crêpe con la mitad de la mezcla de chocolate.", "Doble las otras mitades de las creppes para hacer dos formas de media luna. Coloque en el horno, hornee, por cinco minutos, o hasta que se levanten.", "Para servir, coloca los crêpes en un plato."], "url": "www_bbc_co_uk_food_recipes_chocolatepancakesouf_84244", "title": "Soufflé de panqueques de chocolate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100g / 3½oz de avellanas peladas", "125 g / 4½ oz de almendras", "225 g / 8oz de cáscara confitada mixta o fruta seca mixta", "1 limón, ralladura solamente", "Harina simple de 75g / 2¾oz", "1 cucharadita de canela molida", "½ cucharadita de clavo de olor molido", "1-2 pellizcos de nuez moscada recién rallada, al gusto", "pizca de pimienta blanca recién molida", "1 cucharada de cacao en polvo", "150 g / 5 oz de azúcar en polvo de oro", "3-4 cucharadas de miel clara", "50 g / 1¾oz de mantequilla sin sal, más extra para engrasar", "salsa de chocolate caliente y crema fresca, para servir (opcional)"], "method": ["Precalentar el horno a 150C / 300F / Gas 2.", "Engrase una lata para pasteles con forma de resorte de 20 cm / 8 pulg con mantequilla, luego cúbrala con una hoja grande de papel de arroz (o papel resistente a las grasas), dejando suficiente exceso para poder envolver la parte superior de la torta.", "Espolvoree las nueces en una bandeja para hornear y tueste en el horno durante 4-5 minutos, controlando regularmente, hasta que estén tostadas y doradas.", "Transfiera las nueces tostadas a un tazón y agregue la cáscara confitada mixta o la fruta seca, la ralladura de limón, la harina, la canela molida, los clavos molidos, la nuez moscada rallada, la pimienta blanca y el cacao en polvo. Mezcle hasta que esté bien combinado.", "Caliente el azúcar, la miel y la mantequilla en una sartén hasta que burbujee, luego continúe cocinando, revolviendo bien, durante 4-5 minutos, o hasta que estén bien combinados.", "Vierta la mezcla derretida de miel y azúcar sobre la mezcla de nueces y mezcle rápidamente hasta que esté bien combinado. Coloque la lata de pastel preparada inmediatamente, luego doble el forro sobrante sobre la parte superior del pastel.", "Transfiera la torta al horno y cocine durante 35-40 minutos, o hasta que un pincho insertado en el centro del pastel salga limpio. Dejar de lado para enfriar antes de servir. Sirva rebanadas del pastel con salsa de chocolate caliente o crema fresca."], "url": "www_bbc_co_uk_food_recipes_chocolatepanforte_92986", "title": "Panforte de chocolate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["350 g / 12 oz de chocolate negro, al menos un 70 por ciento de sólidos de cacao, picados", "1 x 397g / 14oz puede leche condensada", "30g / 1oz de mantequilla", "pizca de sal", "150 g / 5¼ oz de pistachos sin sal, conchas eliminadas"], "method": ["Coloque el chocolate picado, la leche condensada, la mantequilla y la sal en una sartén de base pesada a fuego lento y revuelva hasta que se derrita y se combine bien.", "Coloque las nueces en una bolsa de congelador y golpee con un rodillo, hasta que se rompa en algunas piezas grandes y pequeñas.", "Agregue las nueces a la mezcla derretida de chocolate y mezcle bien.", "Vierta la mezcla en una bandeja cuadrada de 23 cm / 9 pulgadas, alisando la parte superior con una espátula húmeda.", "Deje que el dulce de azúcar se enfríe, luego refrigere hasta que se solidifique.", "Cortar en trozos pequeños de aproximadamente 3 cm x 2 cm / 1¼ pulgadas x pulgadas. Cortar 7 x 7 líneas en la lata para obtener 64 piezas es lo que mejor logra.", "Una vez cortado, el dulce de azúcar se puede guardar en el congelador; no hay necesidad de descongelarlo, simplemente coma de inmediato."], "url": "www_bbc_co_uk_food_recipes_chocolatepistachiofu_87639", "title": "Fudge de pistacho y chocolate", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 70}, "serves": "Hace 64 cuadrados de dulce de azúcar", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolatepistachiofu_87639_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200ml / 7fl oz de agua fría", "4 cucharaditas de azúcar en polvo", "85g / 3oz de mantequilla sin sal, más extra para engrasar", "Harina común 115g / 4oz", "pizca de sal", "3 huevos medianos de granja, golpeados", "600 ml / 1 pinta de crema doble", "1 naranja, solo ralladura", "100 ml / 3½ fl oz de agua", "Azúcar en polvo 80g / 3oz", "200 g / 7 oz de chocolate negro de buena calidad, roto en pedazos"], "method": ["Precaliente el horno a 200C / 400F / Gas 6. Coloque una lata pequeña para asar en el fondo del horno para calentar.", "Para la pastelería choux, coloca el agua, el azúcar y la mantequilla en una olla grande. Calienta suavemente hasta que la mantequilla se derrita.", "Suba el fuego, luego vierta rápidamente la harina y la sal, todo de una vez.", "Retirar del fuego y batir la mezcla vigorosamente hasta que se forme una pasta homogénea. Una vez que la mezcla se separa del costado de la sartén, transfiérala a un tazón grande y déjela enfriar durante 10-15 minutos.", "Batir los huevos, poco a poco, hasta que la mezcla esté suave y brillante y tenga una consistencia suave, ya que es posible que no lo necesite todo.", "Engrase ligeramente una bandeja grande para hornear. Usando una manga pastelera y una boquilla plana de 1 cm / ½ pulgadas, vierta la mezcla en bolitas en líneas a lo largo de la bandeja para hornear. Frote suavemente la parte superior de cada bola con un dedo mojado, esto ayuda a hacer una parte superior más fresca.", "Coloque la bandeja para hornear en el horno. Antes de cerrar la puerta del horno, vierta media taza de agua en la lata de asar en el fondo del horno, luego cierre rápidamente la puerta. Esto ayuda a crear más vapor en el horno y hacer que la masa crezca mejor. Hornee por 25-30 minutos, o hasta que estén doradas, si los profiteroles están demasiado pálidos se mojarán cuando estén fríos.", "Retire del horno y apague el horno. Pinche la base de cada profiterola con un pincho. Vuelva a colocar en la bandeja para hornear con el orificio en la base hacia arriba y vuelva al horno durante cinco minutos. El aire caliente del horno ayuda a secar el medio de los profiteroles.", "Para el relleno, azote ligeramente la crema con la ralladura de naranja hasta que se formen picos suaves. Cuando los profiteroles estén fríos, use una manga pastelera para verter la crema en los profiteroles.", "Para la salsa de chocolate, coloca el agua y el azúcar en una olla pequeña y lleva a ebullición para hacer un jarabe. Reduzca el fuego a fuego lento y coloque el chocolate en un tazón resistente al calor colocado sobre la sartén. Caliente, revolviendo de vez en cuando, hasta que se derrita. Retire la sartén del fuego, vierta la mezcla de jarabe en el chocolate y revuelva hasta que quede suave y bien combinado.", "Para servir, coloque los profiteroles rellenos en un plato de servir grande y vierta sobre la salsa de chocolate. Servir caliente o frío."], "url": "www_bbc_co_uk_food_recipes_chocolateprofiterole_86196", "title": "Profiteroles de chocolate", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Hace unos 20 profiteroles", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolateprofiterole_86196_16x9.jpg", "isVegetarian": true, "recommendations": 0}]