[{"isVegetarian": false, "title": "Halibut with samphire and barbecued new potatoes", "url": "www_bbc_co_uk_food_recipes_halibut_with_samphire_26810", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 x 250g/9oz boneless halibut fillets", "500g/1lb 2oz unsalted butter", "250g/9oz samphire", "500g/1lb 2oz new potatoes, peeled and halved", "2 lavender sprigs ", "12 wet garlic cloves, peeled", "olive oil", "knob of butter", "sea salt and freshly ground black pepper", "200g/7oz salted butter", "1 large shallot, peeled, finely sliced", "1 medium carrot, peeled, finely sliced", "6 button mushrooms, sliced", "200ml/7fl oz champagne", "300ml/10fl oz white fish stock", "300ml/10fl oz double cream", "1 tbsp Sevruga caviar", "sea salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the halibut, heat a frying pan until hot, add the butter and heat until it turns a nut-brown colour. When the beurre noisette reaches 50C, lower the halibut into the butter and poach for 5 minutes.", "Preheat the barbecue. Oil a double layer of kitchen foil and put the potatoes in the centre of the foil with the lavender and the garlic. Season with salt and pepper and seal the potatoes in a parcel by crimping the long edges together and folding the edges in to create a solid seal. Cook on the barbecue for 30-40 minutes. ", "Blanch the samphire in boiling water for 30 seconds. Drain and stir through a knob of butter.", "Melt a knob of butter in a large saucepan. Add the shallot and carrot and cook for 1–2 minutes. Add the mushrooms and cook for a further 2 minutes.", "Add the champagne and reduce by half. Add the stock and bubble away until the volume has reduced by half. Add the cream and reduce again. Stir through the caviar and check the seasoning", "Serve the halibut with the samphire and the barbecued new potatoes with the champagne caviar sauce poured over."]}, {"isVegetarian": false, "title": "Halibut with spicy kimchi", "url": "www_bbc_co_uk_food_recipes_halibut_with_spicy_37680", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200ml/7fl oz rice wine vinegar", "50ml/2fl oz fish sauce", "50g/1¾oz palm sugar", "2 tsp Korean chilli powder", "50ml/2fl oz lemon juice", "1 Chinese leaf cabbage, core removed, leaves thinly sliced", "2-4 red chillies (to taste), finely diced", "2 carrots, thinly sliced using a vegetable peeler", "5cm/2in fresh root ginger, peeled, finely chopped", "2 garlic cloves, finely chopped", "15g/½oz dried seaweed, rehydrated in water, drained and finely chopped", "4 scallops, preferably hand-dived, cleaned, roe trimmed", "1 lime, zest and juice", "pinch salt", "2 tbsp rapeseed oil", "25g/1oz butter", "4 x 200g/7oz halibut steaks, pin bones removed", "2 tbsp coriander cress, to garnish"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 10, "preparationMins": 0}, "recommendations": 0, "method": ["Put the rice wine vinegar, fish sauce, palm sugar and Korean chilli powder into a small saucepan and bring the mixture to a gentle simmer, stirring until the sugar dissolves. Stir through the lemon juice.", "Mix together the cabbage, chillies, carrots, ginger, garlic and seaweed in a large bowl. Transfer to an airtight container.", "Pour the hot lemon mixture over the vegetables, seal the container, then shake to coat the vegetables in the marinade. Set the container aside to cool, then leave for 1 week at room temperature to ferment.", "When the kimchi has fermented, slice the scallops very thinly and arrange them on a serving platter. Sprinkle over the lime zest, then squeeze over the lime juice. Season, to taste, with salt. ", "Heat the rapeseed oil in a frying pan over a medium to high heat. Add the halibut steaks, presentation side down, and fry for 1-2 minutes, then add the butter and fry for a further minute. Turn over and fry the halibut on the other side for a further 2 minutes, basting continuously with the pan juices.", "To serve, spoon a portion of the kimchi onto each plate. Top with some of the sliced scallops, then lay one halibut steak on top. Garnish with a little coriander cress."]}, {"isVegetarian": false, "title": "Halibut and spinach en papillote", "url": "www_bbc_co_uk_food_recipes_halibutandspinachenp_83506", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ lemon, cut into thin slices", "100g/3½oz halibut", "salt and freshly ground black pepper ", "75g/2¾oz spinach", "50ml/2fl oz white wine"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Cut a 30cm/12in circle out of baking paper and another the same of tin foil. Lay the baking paper circle on top of the foil and fold in half (so that the baking paper is in the middle).", "Open the paper back up and lay the lemon slices in the middle of one half.", "Place the halibut on top of the lemon slices and season with salt and freshly ground black pepper.", "Place the spinach on top, and pour over the wine.", "Fold the clear half of paper and foil back over the ingredients and seal the edges by scrunching the foil tight.", "Place onto a baking sheet and cook for 12-14 minutes in the oven, until the halibut is cooked through.", "To serve, place the parcel onto a plate and slash the top open with a knife to let the aroma escape."]}, {"isVegetarian": false, "title": "Halibut and tomato skewers", "url": "www_bbc_co_uk_food_recipes_halibutandtomatoskew_84436", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 cherry tomatoes", "100g/3½oz halibut, cut into cubes", "1 tbsp olive oil, plus extran for drizzling", "4-5 basil leaves, chopped, to serve", "1 tsp balsamic vinegar, to serve"], "serves": "Serves 1-2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Thread the halibut cubes and cherry tomatoes onto bamboo skewers.", "Heat a griddle pan over a high heat. Drizzle the halibut skewers with the olive oil and griddle for 3-5 minutes, or until cooked through.", "Transfer the skewers onto a serving plate, scatter over the chopped basil and drizzle with the vinegar."]}, {"isVegetarian": false, "title": "Halibut ceviche", "url": "www_bbc_co_uk_food_recipes_halibutceviche_83505", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz halibut, thinly sliced", "½ lime, juice only", "½ lemon, juice only", "salt and freshly ground black pepper", "½ lime, cut into wedges to garnish", "fresh flatleaf parsley leaf, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the halibut slices in the centre of a plate and pour over the lemon and lime juice. Season well with salt and freshly ground black pepper, then leave to 'cure' for 15-20 minutes.", "To serve, garnish the plate with lime wedges and the fresh parsley leaf."]}, {"isVegetarian": false, "title": "Halibut tikka masala with basmati rice", "url": "www_bbc_co_uk_food_recipes_halibuttikkamasalawi_84406", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100ml/3½fl oz natural yoghurt", "1 lime, juice only", "2 garlic cloves, crushed", "thumb-sized piece fresh ginger, peeled, finely chopped", "1 tbsp ground coriander seeds", "1 tbsp ground cumin", "1 tbsp garam masala", "1 tbsp paprika", "pinch salt ", "4 x 150g/5oz halibut steaks, cut into chunks ", "50ml/2oz butter, melted ", "1 lemon, juice only", "1 onion, chopped", "5 garlic cloves", "3-5 red chillies, seeds removed", "3 tbsp peanut oil", "1 bunch fresh coriander leaves, chopped", "thumb-sized piece fresh ginger, chopped", "5 plum tomatoes, chopped", "1 tsp ground coriander", "2 tsp ground cumin", "1 tsp paprika", "2 tsp ground fenugreek", "1 tsp garam masala", "salt", "50ml/2fl oz natural yoghurt ", "150ml/5fl oz milk", "fresh coriander leaves, to garnish", "basmati rice, cooked", "naan bread"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Combine all the marinade ingredients in a bowl. Add the halibut pieces and turn to coat completely. Thread onto wooden skewers, place onto a baking tray, cover and chill in the fridge for at least two hours.", "Preheat the grill to its highest setting.", "Place the halibut skewers under the grill and cook, basting every two minutes with the butter and lemon juice, turning the skewers until golden on all sides and cooked through, about ten minutes.", "Meanwhile, for the sauce, place the onion, garlic and chillies into a food processor and blend until smooth.", "Heat the peanut oil in a pan over low heat. Add the onion mixture and fry for 6-7 minutes, or until golden brown.", "Place the coriander leaves, ginger and tomatoes into a food processor and blend until smooth.", "Add the tomato mixture into the pan and cook for 15-20 minutes, until most of the liquid has evaporated.", "Add the ground coriander, cumin, paprika, fenugreek and garam masala and season, to taste, with salt. Stir and cook for 1-2 minutes, then gradually stir in the yoghurt.", "Add the milk and increase the heat to bring the mixture to the boil. Reduce the heat and simmer for five minutes.", "To serve, place two halibut skewers onto a plate, spoon over some sauce and garnish with the coriander leaves. Serve with basmati rice and naan."]}, {"isVegetarian": false, "title": "Halibut with lemon butter", "url": "www_bbc_co_uk_food_recipes_halibutwithlemonbutt_73188", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 halibut chunks, weighing approx. 200g/7¼oz each", "2 lemons, juice only", "110g/4 oz butter", "salt"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Score the fish with a sharp knife and marinate in the lemon juice for about 15 minutes.", "Drain, reserving the lemon juice, and dry with kitchen towels.", "Melt 75g/3oz butter in a large frying pan, making sure the heat is gentle and the butter doesn't burn.", "Cook the fish in the butter for approximately 3-4 minutes on each side.", "Increase the heat and pour in the lemon juice from the marinade; allow to bubble and evaporate slightly.", "Add the remaining butter to thicken the sauce.", "Serve immediately."]}, {"isVegetarian": false, "title": "Halibut with lychee, cashew nut and miso salad", "url": "www_bbc_co_uk_food_recipes_halibutwithlycheecas_88171", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75ml/3fl oz sake", "75ml/3fl oz mirin", "225g/8oz white miso paste", "110g/4oz granulated sugar", "4 x 175g/6oz halibut fillets, skin on", "110g/4oz fresh lychees, peeled, stones removed, sliced", "75g/3oz toasted cashew nuts", "1 small bunch mint leaves", "110g/4oz mango, sliced", "1 small bunch coriander leaves", "1 red chilli, finely sliced on the diagonal", "50g/2oz fresh coconut shavings", "110g/4oz mizuna leaves", "50g/2oz rocket leaves", "1 lime, juice only", "2 tbsp groundnut oil", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 10, "preparationMins": 0}, "recommendations": 0, "method": ["For the halibut, place the sake and mirin into a pan and bring to the boil. Boil for 20-30 seconds to burn off the alcohol; then reduce the heat.", "Add the white miso paste and stir to dissolve. Turn the heat back up and add the sugar, stirring once more to dissolve.", "Remove from the heat, transfer to a bowl and allow to cool.", "Set a third of the miso aside for the salad.", "Place the halibut fillets into the remaining cold miso mixture, cover and place in the fridge for at least 24 hours, preferably 48 hours.", "Preheat the grill to high and the oven to 200C/390F/Gas 6.", "Remove the halibut from the miso and wipe off any excess before placing onto a grill tray.", "Place under the grill to cook for 2-3 minutes until golden-brown, then remove and place in the preheated oven. Cook for 5-8 minutes, or until the fish is cooked all the way through.", "For the salad, place all the salad ingredients except the lime juice and groundnut oil into a bowl and mix together.", "Place two tablespoons of the reserved miso into a bowl, add the lime juice and groundnut oil and whisk to combine. Season with salt and freshly ground black pepper. Add this dressing to the salad and stir to combine.", "To serve, spoon the salad onto each of four plates. Cut the halibut in half on the diagonal, place the fish on top of the salad and serve with a little more of the miso dressing over the top."]}, {"isVegetarian": false, "title": "Halibut with salsa verde, crabcakes and baby vine tomatoes", "url": "www_bbc_co_uk_food_recipes_halibutwithsalsaverd_89441", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 x 200g/7oz halibut steaks, skins removed", "salt and freshly ground black pepper", "50g/2oz unsalted butter", "2 tbsp groundnut oil", "350g/12oz potatoes, peeled, cooked in boiling water and cooled", "200g/7oz mixed white and brown crabmeat", "2tbsp chopped fresh flatleaf parsley", "½ lemon, juice only", "½ tsp anchovy essence", "1 free-range egg, beaten", "salt and freshly ground black pepper", "110g/4oz Japanese breadcrumbs (often sold as panko)", "5 tbsp groundnut oil", "250g/9oz baby plum tomatoes, cut in half", "2 tbsp olive oil", "2 tbsp balsamic vinegar", "salt and freshly ground black pepper", "20g/¾oz salted capers, washed and drained", "6 anchovy fillets in olive oil, drained", "40g/1½oz fresh flatleaf parsley, leaves only", "10g/½oz fresh tarragon, leaves only", "10g/½oz fresh mint, leaves only", "2 garlic cloves", "1 lemon, zest and juice", "150ml/5fl oz extra virgin olive oil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/390F/Gas 6.", "Season the halibut steaks with salt and freshly ground black pepper.", "Heat a frying pan until hot, add the butter, groundnut oil and halibut steaks and cook for three minutes on each side, or until lightly browned and completely cooked through. When the butter starts to bubble and turn brown, spoon it over the top of the fish. Remove from the pan.", "For the crabcakes, grate the potatoes into a large bowl.", "Add the white and brown crabmeat, parsley, lemon juice, anchovy essence and egg and mix carefully until combined. Season with salt and freshly ground black pepper.", "Roll the crab mixture into eight balls and flatten slightly with the palm of your hands. Roll each crab patty in the Japanese breadcrumbs.", "Heat the groundnut oil in a separate frying pan, add the crabcakes in batches, and cook for 3-4 minutes on each side until golden-brown on both sides and cooked through.", "For the baby vine tomatoes, place the tomato halves onto a baking tray and drizzle with the olive oil and balsamic vinegar.", "Season the tomatoes to taste with salt and freshly ground black pepper and cook in the oven for 8-10 minutes until softened slightly.", "For the salsa verde, blend all the salsa verde ingredients in a food processor to a purée the consistency of double cream. Season to taste with freshly ground black pepper.", "To serve, spoon some salsa verde onto each plate. Place the halibut on top and spoon over more salsa verde. Stack two of the crabcakes and a spoonful of the baby vine tomatoes next to it."]}, {"isVegetarian": false, "title": "Halibut with bean salad and tzatziki", "url": "www_bbc_co_uk_food_recipes_halibutwithbeansalad_89688", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 x 175g/6oz halibut steaks", "100g/3½oz plain flour", "2-3 tbsp cayenne pepper", "1 tsp celery salt", "1 tsp garlic powder", "salt and freshly ground black pepper ", "2 tsp oil", "knob of butter", "150ml/5fl oz fresh tomato juice (made by blending 4-5 fresh tomatoes and passing through a sieve to collect the juice. Discard the pulp and seeds.)", "50ml/2fl oz red wine vinegar", "100ml/3½fl oz olive oil", "1 garlic clove, finely chopped", "salt and freshly ground black pepper", "400g/14oz canned mixed beans, rinsed and drained", "2 sticks celery, finely chopped", "1 green chilli, seeds removed, chopped", "250ml/9fl oz Greek-style yoghurt", "1 tbsp chopped fresh dill", "1 lime, juice only", "half cucumber, peeled, grated", "salt and freshly ground black pepper", "1 lime, cut into wedges, to garnish ", "small handful chopped parsley, to garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the halibut, mix the flour, cayenne pepper, celery salt and garlic powder in a bowl and season well with salt and freshly ground black pepper. Dredge the halibut steaks in the spiced flour mixture and shake off anty excess.", "Heat the oil in a pan over a medium heat. Add the butter, and when it begins to foam add the fish.", "Cook the halibut steaks for three minutes on each side, or until just cooked through. (If the steaks are very thick, transfer them to the oven preheated to 180C/365F/Gas 4 and roast for a further 4-6 minutes, or until completely cooked through.)", "For the bean salad, whisk the tomato juice, red wine vinegar, olive oil and garlic together in a bowl. Season, to taste, with salt and freshly ground black pepper, then add the mixed beans, celery and chilli and mix well.", "For the tzatziki, mix the yoghurt, dill and lime juice together in a clean bowl.", "Add the grated cucumber and season, to taste, with salt and freshly ground black pepper. (Thin the mixture down with water if necessary.)", "To serve, place a large spoonful of the bean salad into each serving bowl. Place a piece of halibut on top of each and spoon a dollop of tzatziki alongside.", "Garnish with lime wedges and chopped parsley and serve."]}, {"isVegetarian": false, "title": "Halibut with spring onion cream sauce", "url": "www_bbc_co_uk_food_recipes_halibutwithspringoni_92292", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz butter", "12 spring onions, trimmed, sliced", "1 garlic clove, crushed to a paste with the edge of a knife", "12 fresh wild mushrooms, washed thoroughly to remove any grit, sliced", "75ml/2¾fl oz white wine", "300ml/10fl oz double cream", "salt and freshly ground black pepper", "1 lemon, juice only", "1 tbsp chopped fresh tarragon", "100g/3½oz flour, for dusting", "salt and freshly ground black pepper", "100g/3½oz butter", "4 x 175g/6¼oz halibut fillets", "100g/3½oz fresh spinach leaves, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the sauce, heat the butter in a frying pan over a medium heat. Add the spring onions, garlic and mushrooms and fry for 8-10 minutes, or until softened. ", "Add the wine and bring the mixture to the boil. Reduce the heat until the mixture is simmering, then continue to simmer until the liquid has almost completely evaporated.", "Add the cream and continue to simmer until the volume of liquid has reduced by one third. Season, to taste, with salt and freshly ground black pepper, then stir in the lemon juice and tarragon.", "Meanwhile, for the halibut, sprinkle the flour onto a plate and season, to taste, with salt and freshly ground black pepper. Dredge the halibut fillets in the flour until completely covered, shaking off any excess.", "Heat the butter in an ovenproof frying pan over a medium heat. Add the coated halibut fillets, in batches if necessary, and fry for 2-3 minutes on each side. ", "Transfer the pan to the oven and continue to cook the halibut for a further 6-8 minutes, or until just cooked through. (NB: The halibut is cooked through when the flesh is opaque.) ", "To serve, place a handful of raw spinach leaves into the centre of each of four serving plates. Place one halibut fillet on top of each. Spoon over the spring onion cream sauce."]}, {"isVegetarian": false, "title": "Halibut with spicy harissa sauce", "url": "www_bbc_co_uk_food_recipes_halibutwithmoroccans_91624", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 x 150g/5½oz halibut fillets", "125g/4½oz plain flour", "salt and freshly ground black pepper", "pinch paprika", "1 tsp vegetable oil", "1 tbsp unsalted butter", "200g/7oz bacon lardons", "200g/7oz dates, stones removed, chopped", "1 tbsp ready-made harissa paste", "75ml/2¾oz Madeira wine", "100ml/3½fl oz chicken stock", "20 black Kalamata olives", "200g/7oz cooked bulgar wheat or couscous", "4 lemon wedges ", "1 tbsp chopped fresh parsley"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Sprinkle the flour onto a plate and season, to taste, with salt and freshly ground black pepper and a pinch of paprika. Dredge the halibut fillets in the mixture until completely coated.", "Heat the vegetable oil in a frying pan over a medium heat. When the oil is hot, add the seasoned halibut fillets and fry for 2-3 minutes on each side, or until golden-brown on both sides.", "Place a knob of the butter on top of each halibut fillet and continue to cook. When the butter has melted, baste the fillets in the melted butter until completely cooked through, then squeeze over the lemon juice and set the halibut fillets aside on a warm plate. ", "Meanwhile, for the spicy harissa sauce, dry fry the bacon in a separate frying pan for 6-8 minutes, or until crisp and golden-brown. Add the dates and harissa paste and stir well to combine, then reduce the heat and continue to cook for 2-3 minutes.", "Add the Madeira wine, stock and olives and continue to cook for a further 4-5 minutes, or until the volume of liquid has reduced and the sauce has thickened. ", "To serve, divide the bulgar wheat or couscous equally among four serving plates. Place one fried halibut fillet on top of each. Pour over the Moroccan-style sauce and garnish with a lemon wedge. Sprinkle over the chopped fresh parsley."]}, {"isVegetarian": true, "title": "Halloumi and mushroom kebabs with salsa verde and couscous", "url": "www_bbc_co_uk_food_recipes_halloumi_and_mushroom_59313", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125g/4½oz couscous ", "125ml/4½fl oz hot vegetable stock ", "5 tbsp olive oil ", "1 lemon, juice only", "1 ready-roasted red pepper, shredded ", "50g/2oz toasted flaked almonds", "50g/2oz dried apricots, chopped", "200g/7oz halloumi cheese, cut into 2.5cm/1 inch cubes", "8 cherry tomatoes ", "8 button mushrooms", "3 tbsp olive oil ", "1 tsp dried oregano ", "bunch parsley, chopped leaves only", "bunch basil chopped, chopped leaves only", "bunch mint chopped, chopped leaves only", "2 tbsp drained capers", "2 garlic cloves, roughly chopped ", "½ tsp Dijon mustard ", "100ml/3½fl oz olive oil ", "sea salt and freshly ground black pepper to season"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the couscous, place the couscous into a bowl and cover with the hot stock. Cover the bowl with a plate or cling film and leave for four minutes. ", "Uncover the bowl and fluff up the couscous with a fork. Stir in the remaining ingredients, season to taste with salt and freshly ground black pepper.", "For the kebabs, preheat a griddle pan over a medium-high heat. Toss all of the kebab ingredients together and season to taste with sea salt and freshly ground black pepper. Thread the ingredients onto metal kebab skewers and cook on the hot griddle for 5-6 minutes, turning frequently.", "For the salsa verde, place all of the salsa verde ingredients, apart from the olive oil, into a food processor and blend, gradually adding the oil until you have a loose paste.", "To serve, spoon the couscous onto plates, top with the kebabs and drizzle with the salsa verde."]}, {"isVegetarian": true, "title": "Halloumi saganaki", "url": "www_bbc_co_uk_food_recipes_halloumi_saganaki_92664", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/halloumi_saganaki_92664_16x9.jpg", "ingredients": ["2-3 tbsp olive oil", "225g/8oz block halloumi or kefalotiri cheese", "1 small free-range egg, beaten", "3 tbsp fine semolina", "2 tbsp clear honey", "1 tsp black sesame seeds", "1 tsp dried oregano", "freshly ground black pepper"], "serves": "Serves 4-8", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a non-stick frying pan. ", "Cut the halloumi horizontally through the middle. Dip the halloumi slices in the beaten egg then roll in the semolina. Fry on a medium heat for a couple of minutes on each side until golden-brown.", "In a separate small pan, warm the honey. Serve the halloumi cut into squares, drizzled with warm honey and sprinkled with sesame seeds, oregano and black pepper."]}, {"isVegetarian": true, "title": "Halloumi and watermelon skewers with tamarind dip", "url": "www_bbc_co_uk_food_recipes_halloumi_and_watermelon_74518", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/halloumi_and_watermelon_74518_16x9.jpg", "ingredients": ["75ml/2½fl oz olive oil ", "1 tsp onion salt ", "1 tsp garlic powder ", "1 tsp chilli flakes ", "1 tbsp dried fenugreek leaves ", "500g/1lb 2oz halloumi, cut into 2cm/1in cubes ", "400g/14oz watermelon, cut into 2cm/1in cubes ", "150g/5½oz white bread, cut into 2cm/1in cubes ", "95g/3½oz tamarind paste ", "60g/2¼oz runny honey ", "½ tsp cinnamon ", "1 small red onion, finely chopped "], "serves": "Makes 8 skewers", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Soak eight wooden skewers in cold water for 15 minutes. ", "To make the marinade, put all the ingredients in a jug and mix together. ", "Pour freshly boiled water over the halloumi in a bowl and leave for 20 minutes. This will make the cheese really soft and smooth in the centre when cooked. ", "To make the skewers, drain the halloumi, then place in a large bowl with the watermelon and bread. Drizzle over the marinade and mix together with your hands. Skewer cubes of halloumi, watermelon and bread alternately until you run out of skewers. If there is any marinade left, drizzle all over the skewers. ", "For the dip, mix the tamarind paste, 100ml/3½fl oz water, honey, cinnamon and red onion together in a bowl. Set aside.", "Place a griddle pan on a high heat and brush lightly or spray with a little oil. Griddle the skewers for about 6 minutes, turning every 1–2 minutes so that you char each side. Alternatively, you can cook them under the grill for 8–10 minutes, turning occasionally. Serve the skewers with the tamarind dip."]}, {"isVegetarian": true, "title": "Halloumi, tomato, cucumber and couscous grain bowl", "url": "www_bbc_co_uk_food_recipes_halloumi_tomato_cucumber_92076", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/halloumi_tomato_cucumber_92076_16x9.jpg", "ingredients": ["50g/1¾oz couscous", "80g/3oz halloumi, sliced", "1 tomato, cut into 1cm/½in chunks", "¼ cucumber, cut into 1cm/½in chunks", "5 black olives, pitted", "2 sprigs mint, leaves picked", "1 tbsp extra virgin olive oil", "salt and freshly ground black pepper"], "serves": "", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the couscous according to packet instructions. ", "Heat a griddle pan over a high heat. Add the halloumi slices and griddle for 3-4 minutes, or until golden brown stripes appear on the cheese surface.", "Place the couscous in the bowl you plan to eat from and add the halloumi, tomato, cucumber, olives and mint. ", "Drizzle liberally with the oil and season with salt and pepper. Eat straight away or pack in your lunchbox ready to take to work. "]}, {"isVegetarian": true, "title": "Halloumi with quick sweet chilli sauce", "url": "www_bbc_co_uk_food_recipes_halloumi_with_quick_69971", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/halloumi_with_quick_69971_16x9.jpg", "ingredients": ["3 fresh red chillies", "2 tbsp runny honey", "1 lime, halved", "225g/8oz block halloumi cheese, sliced into 8 pieces", "salad leaves of your choice", "extra-virgin olive oil to taste"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Slice 2 of the chillies, leaving the seeds in, then de-seed the third and chop it into fine dice (this is for full-on fieriness; you may de-seed more cautiously if you wish) and add to a small pan – ideally, the sort sold as a butter-melting pan – along with the honey, and squeeze in 1 teaspoon of lime juice from one half of the lime. Put the pan on the smallest ring on the hob and bring to a bubble, then turn the heat down low, and let it foam away for 4 minutes. Stir frequently and do not leave the pan unattended, otherwise it will foam over the hob. Remove from the heat.", "Before you turn to the halloumi, arrange a few salad leaves on 2 plates, and pour as much or as little oil over them as you want. Cut the remaining lime half into wedges, and pop one on each plate if so wished.", "Heat a cast-iron or heavy-based frying pan. When it’s hot, add the halloumi slices and cook them – without any oil in the pan – for 30–60 seconds until they are tiger-striped underneath, then turn the slices over and cook until the underside is patchily bronzed, too.", "Remove the halloumi to the salad-lined plates and spoon the lipstick-red pieces of chilli in their honeyed glaze over the cheese. Eat immediately. Not hard to do."]}, {"isVegetarian": true, "title": "Halloumi and mango with a minty dressing", "url": "www_bbc_co_uk_food_recipes_halloumiandmangowith_1048", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz halloumi", "90ml/6tbsp seasoned flour", "200g/7oz mixed salad leaves", "1 ripe mango, peeled, stoned and sliced", "1 tbsp mint, finely chopped", "150ml/5fl oz natural yoghurt", "½ lemon, juice only", "salt and freshly ground black pepper", "3 tbsp groundnut oil", "125g/4oz cherry tomatoes, halved", "sprigs of mint, to garnish"], "serves": "2-4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Cut the halloumi into eight slices and then cut each in half. Coat in the seasoned flour and put aside.", "Arrange the salad leaves on four serving plates and place slices of mango on top.", "To make the dressing, mix the chopped mint, yoghurt and lemon juice together in a bowl and season to taste.", "Heat the oil in a non-stick frying pan or griddle and quickly fry the halloumi for about 2 minutes on each side, until golden.", "Arrange four pieces of halloumi on each bed of leaves and drizzle with a little of the dressing. ", "Garnish with cherry tomatoes and mint sprigs and serve immediately with extra dressing on the side."]}, {"isVegetarian": true, "title": "Halloumi cheese, lemon, olive oil", "url": "www_bbc_co_uk_food_recipes_halloumicheeselemono_13052", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5oz halloumi cheese ", "½ a lemon, juiced ", "20ml/1oz olive oil ", "cracked black pepper to taste"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Slice the halloumi into ½cm/¼in thick slices.  ", "Char-grill or pan-fry the cheese in the olive oil.  ", "Drizzle over the lemon juice and cracked black pepper and serve."]}, {"isVegetarian": false, "title": "Halloween Franken-cupcakes", "url": "www_bbc_co_uk_food_recipes_halloween_40352", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/halloween_40352_16x9.jpg", "ingredients": ["125g/4½oz plain flour", "25g/1oz cocoa powder", "1½ tsp baking powder", "150g/5oz caster sugar", "150g/5oz unsalted butter, softened at room temperature", "1 free-range egg", "8 tbsp milk", "125g/4½oz unsalted butter, softened", "250g/9oz icing sugar, sifted", "1 tbsp milk", "1 tsp vanilla extract", "green food colouring paste", "red food colouring paste", "Edible candy eyes", "chocolate sprinkles", "chocolate flake, crumbled", "soft black licorice twists"], "serves": "Makes 9 large cupcakes", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Line a muffin tray with 9 paper cases.", "Sift the flour, cocoa powder and baking powder into a bowl. Add the sugar and butter and beat the mixture together until well combined.", "Whisk in the egg and milk until the mixture is thick and smooth.", "Divide the mixture between the paper case and bake in the oven for 20-25 minutes, or until springy to the touch and skewer inserted into the middle of one of the cakes comes out clean. Set aside to cool on a wire rack.", "Put the butter into a large bowl and beat with an electric hand mixer until light and fluffy.", "Sift in the icing sugar, then work it into the butter, starting slowly at first, then beating more vigorously once all the sugar is combined.", "Add the milk and the vanilla, then beat until creamy and smooth.", "Set aside 1 tablespoon of the icing to colour red. Colour the remaining icing green (you may need to add the tiniest amount of red to make an olive green colour).", "Place a heaped tablespoon of icing on each cupcake. Use a palette knife to smooth the sides at an angle and flatten the top. ", "Decorate with licorice twists, candy eyes, crumbled flaked chocolate and chocolate sprinkles. Use the red icing to draw on stitches with a cocktail stick."]}, {"isVegetarian": false, "title": "Halloween cake", "url": "www_bbc_co_uk_food_recipes_halloween_cake_10801", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/halloween_cake_10801_16x9.jpg", "ingredients": ["250g/9oz butter, softened, plus extra for greasing", "250g/9oz caster sugar", "4 free-range eggs, lightly beaten", "1 tsp vanilla extract", "200g/7oz self-raising flour", "50g/2oz cocoa powder", "350g plain flour", "½ tsp ground ginger", "1 tsp bicarbonate of soda", "100g/3½oz butter, cut into cubes", "175g/6oz light soft brown sugar", "4 tbsp golden syrup", "1 free-range egg, lightly beaten", "white icing (such as royal icing), for decorating the biscuits", "125g/4½oz butter, softened", "250g/9oz icing sugar", "2 tbsp cocoa powder", "1 tbsp milk", "½ pack Oreo cookies or bourbon biscuits", "1 pack chocolate sticks (such as Matchmakers)", "halloween sweets"], "serves": "Serves 10", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Grease and line a 20x30cm/8x12in rectangular cake tin with baking parchment.", "Beat together the butter and sugar with a hand-held mixer until the mixture is pale and fluffy. Add the eggs a little at a time, beating well between each addition, adding the vanilla extract with the last of the egg.", "Sift together the flour and the cocoa powder into a bowl. Fold the flour mixture into the butter mixture until fully incorporated.", "Spoon the cake batter into the prepared tin and smooth the surface with the back of a spoon.", "Bake for 30 minutes until firm to the touch (a wooden skewer inserted in the centre should come out clean).", "Leave to cool for 10 minutes in the tin before turning out onto a wire rack to cool completely.", "For the ginger biscuit tombstones, place the flour, ginger and bicarbonate of soda into a mixing bowl. Rub the butter in with your fingertips until the mixture resembles fine breadcrumbs.", "Add the sugar, syrup and egg and mix together until it forms a soft dough. Wrap in cling film and chill in the fridge for 30 minutes.", "Pre-heat the oven to 180C/350F/gas 4.", "Roll out the dough on a lightly floured surface and cut out your shapes – you will only need a few for the cake so cut out some other Halloween shapes for extra biscuits.", "Place the shapes on to greased baking sheets and bake in the oven for 10-12 minutes. Remove from the sheets with a palette knife and place onto a wire rack to cool completely before decorating with white icing.", "For the buttercream, beat the butter in a large bowl with a hand held mixer until creamy then add the icing sugar a spoonful at a time beating well between each addition. Add the cocoa powder and milk and beat again for a further five minutes until light and fluffy.", "Blend the Oreo or bourbon biscuits to fine crumbs in a food processor. ", "Spread the buttercream over the cooled cake, covering the top and sides – don’t worry if it’s not smooth - a few lumps and bumps will make it more mud-like.", "Break the chocolate sticks in half unevenly, then stick around the sides of the cake to form the fence.", "Sprinkle the biscuit soil over the surface before sticking in the tombstones and decorating with spooky sweets."]}, {"isVegetarian": true, "title": "Halloween ghost cupcakes", "url": "www_bbc_co_uk_food_recipes_halloween_ghost_cupcakes_04170", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/halloween_ghost_cupcakes_04170_16x9.jpg", "ingredients": ["140g/5oz butter, softened", "250g/9oz caster sugar", "2 free-range eggs, lightly beaten", "1 tsp vanilla extract", "150g/5½oz plain flour", "75g/2½oz self-raising flour", "1 tsp bicarbonate of soda", "50g/2oz cocoa powder", "200ml/7fl oz buttermilk or plain yoghurt", "250g/9oz sugar", "120g/4½oz golden syrup", "4 free-range eggs, whites only", "2 tbsp chocolate sugar strands"], "serves": "Makes 18 cupcakes", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Line twelve muffin tins with muffin cases.", "For the cakes, beat together the butter and sugar with a hand-held mixer until very light and fluffy. Add the eggs a little at a time beating well after each addition. Add the vanilla extract with the last of the egg.", "Sift together the flours, bicarbonate of soda and cocoa into a large mixing bowl. ", "Gently fold the flour mix into the butter mixture along with the buttermilk until completely combined and smooth.", "Place a dessertspoonful of the batter into each muffin case then bake in the oven for 20 minutes until firm to the touch.", "Place on a wire rack to cool.", "For the icing, place the sugar, golden syrup and four tablespoons of water into a large saucepan. Heat gently, stirring until the sugar has dissolved. ", "Bring the sugar syrup to the boil and cook for about 5-6 minutes until the syrup reaches 115C/239F when measured with a sugar thermometer. Remove the pan from the heat.", "While the syrup is boiling, in a large bowl whisk the egg whites with a hand-held mixer until soft peaks form when the whisk is removed. Then, with the mixer on a low speed, pour in the sugar syrup in a thin steady stream - be careful not to pour the syrup onto the beaters as it may splash onto your hands.", "Once all the syrup has been added increase the speed of the mixer and mix for about 10 minutes until the icing is completely cool, thick and glossy. Do not skimp on the whipping or your icing will be too soft and your ghosts will sag.", "Place the icing into a piping bag fitted with a large plain nozzle. Pipe a circle of icing onto each cupcake. Then, holding the bag upright over the centre of the cake, pipe a tall mound of icing, then quickly pull the tip away to form a small peak on the top. ", "Add chocolate sugar strands for eyes or any decoration you fancy. The meringue icing will keep out of the fridge (the sugar syrup will have pasteurised the egg white), but make sure they don’t get too hot or the meringue will melt."]}, {"isVegetarian": true, "title": "Halloween punch", "url": "www_bbc_co_uk_food_recipes_halloween_punch_45819", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/halloween_punch_45819_16x9.jpg", "ingredients": ["500ml/18fl oz cranberry juice", "1.5 litres/2½ pints lemonade", "3 limes, juice only", "large handful gummi worms"], "serves": "Serves 10", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Pour all of the ingredients into a large glass bowl and mix until well combined.", "Drape the gummi worms over the edge of the bowl. "]}, {"isVegetarian": true, "title": "Halloween biscuits", "url": "www_bbc_co_uk_food_recipes_halloweenbiscuits_93840", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/halloweenbiscuits_93840_16x9.jpg", "ingredients": ["100g/3½oz unsalted butter, softened at room temperature", "100g/3½oz caster sugar", "1 free-range egg, lightly beaten", "275g/10oz plain flour", "1 tsp vanilla extract", "To decorate", "400g/14oz icing sugar", "3-4 tbsp water", "2-3 drops food colourings"], "serves": "Makes 6-8 biscuits", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5. Line a baking tray with greaseproof paper.", "Beat the butter and sugar together in a bowl until combined. ", "Beat in the egg and vanilla extract, a little at a time, until well combined.", "Stir in the flour until the mixture comes together as a dough.", "Roll the dough out on a lightly floured work surface to a thickness of 1cm/½in.", "Using Halloween-style biscuit cutters, cut biscuits out of the dough and carefully place onto the baking tray.", "Bake the biscuits for 8-10 minutes, or until pale golden-brown. Set aside to harden for 5 minutes, then cool on a wire rack. ", "For the icing, sift the icing sugar into a large mixing bowl and stir in enough water to create a smooth mixture. Stir in the food colouring. ", "Carefully spread the icing onto the biscuits using a knife and set aside until the icing hardens."]}, {"isVegetarian": false, "title": "Ha long crab and white fish vermicelli soup with rao ram herb", "url": "www_bbc_co_uk_food_recipes_halongcrabandwhitefi_81506", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 fresh whole crabs ", "small piece root ginger, sliced", "1 stalk lemongrass, bruised", "4 kaffir lime leaves, bruised", "1 shallot, chopped", "splash of fish sauce, plus extra to serve", "2 white fish fillets of your choice", "200g/7oz vermicelli noodles, cooked and cut into manageable lengths", "50g/2oz spring onion", "1 large chilli, sliced lengthways and deseeded", "2 handfuls of fresh rao ram herb, chopped (available at some Asian grocers. You can substitute a mixture of fresh coriander and mint)", "1 lime, cut into wedges ", "freshly ground black pepper, to taste"], "serves": "", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Put the crabs in a pan and cover with water. Add the ginger, lemongrass, kaffir lime leaves, shallot and a splash of fish sauce. Cover with a lid and bring to the boil. Simmer for 10-15 minutes. Remove the crabs and leave to cool.", "Meanwhile, place the white fish in the hot stock that the crab was cooked in and leave to cook in its residual heat.", "Pick the meat from the crabs. Reserve the white meat for the soup and use the dark meat for another dish.", "Place the noodles in a serving bowl, then add the spring onions, crabmeat, chilli, rao ram herb and lime wedges. ", "Bring the broth back to the boil and ladle over the noodles, together with a piece of white fish.", "Serve with fish sauce and freshly ground black pepper on the side."]}]