[{"ingredients": ["250 g / 9 oz de filete de cordero o un corte más barato como filetes de pierna de cordero (eliminar cualquier tendón), cortado en pequeñas tiras de 5 mm x 2 cm / 1 in", "2 cucharadas de harina de patata", "2 cucharadas de gránulos de tapioca, molidos", "aceite de maní, para freír", "1 cucharada de jengibre recién rallado", "1 cucharada de vino de arroz Shaoxing o jerez seco", "½ cucharadita de granos de pimienta tostados en seco de Sichuan", "½ cucharadita de sal marina", "1 cucharadita de salsa de soja liviana baja en sodio", "1 cucharadita de pasta de frijol amarillo", "1 cucharadita de salsa hoisin", "1 pizca chino de cinco especias en polvo", "½ naranja, solo jugo", "1 cucharadita de miel líquida", "1 cucharada de salsa de soja ligera baja en sodio", "1 cucharada de aceite de maní", "2 dientes de ajo, pelados y finamente picados", "2 calabacines medianos, superiores y de cola, en rodajas de 5 mm / ¼ en cubos", "2 pimientos Romano rojos, sin semillas y picados a 5mm / ¼ en cubos", "1 pequeño puñado asado de anacardos salados", "1 lechuga iceberg, partida a la mitad, separada, lavada y refrigerada", "3-4 kumquats, en rodajas finas (dos piezas en cada envoltura)", "flores comestibles frescas de color púrpura / amarillo, opcional", "pocas hojas de cilantro"], "method": ["Coloque las piezas de cordero en un recipiente no metálico. Agregue los ingredientes del adobo. Mezcle bien, cúbralo y déjelo marinar en la nevera durante al menos 20 minutos.", "Retire el cordero de la marinada, el polvo con harina de patata y luego los gránulos de tapioca molidos.", "Caliente una sartén o wok a fuego medio, medio lleno con aceite de cacahuate y caliente a 180 ° C / 350 ° F o hasta que un pedazo de pan se dore en 15 segundos (Precaución: El aceite caliente puede ser peligroso. No lo deje desatendido). Coloque las tiras de cordero en una cuchara de metal con ranuras y baje suavemente en el aceite y cocine durante 30 segundos o hasta que el cordero se ponga dorado y crujiente. Retirar, escurrir sobre papel de cocina y reservar.", "Para sofreír, mezcle el jugo de naranja, la miel líquida y la salsa de soja liviana.", "Calentar un wok a fuego alto, agregar el aceite de cacahuete y el ajo y freír durante unos segundos para liberar el aroma. Agregue los calabacines y los pimientos y cocine revolviendo constantemente durante unos segundos. A continuación, agregue los anacardos y la mezcla de miel de soja naranja. Dale un último revuelo quítatelo del fuego.", "Para servir, retire las tazas de lechuga de la nevera, coloque en un plato de servir. Coloque las verduras salteadas en cada paquete (retenga cualquier líquido), cubra con las crujientes piezas de cordero de Mongolia y cúbralas con rodajas de kumquat, flores comestibles si las usa y hojas de cilantro."], "url": "www_bbc_co_uk_food_recipes_crispy_mongolian_lamb_05784", "title": "Envolturas crujientes de lechuga de cordero de Mongolia", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 cucharadas de aceite de colza", "2 palitos de apio, finamente picados", "1 zanahoria, finamente picada", "½ cebolla, finamente picada", "Anís de 6 estrellas", "1 cucharada de pimienta blanca", "4 mejillas de cerdo", "500ml / 18fl oz de caldo de pollo", "4 chalotes de plátano, cortados en rodajas", "Leche 250ml / 9fl oz", "aceite vegetal para freír", "harina blanca llana para espolvorear", "3 cucharadas de aceite de oliva, más extra para lloviznar", "1 chile verde, picado con semillas", "sal y pimienta negra recién molida, al gusto", "4 rebanadas medianas de pan blanco, sin costras", "200ml / 7fl de leche en oz", "200 g / 7 oz de huevas de bacalao ahumado, despellejado", "3 dientes de ajo, aplastados", "200ml / 7fl oz aceite de oliva suave o aceite vegetal", "½ limón, solo jugo", "250g / 9 oz de harina blanca fuerte, más extra para amasar y enrollar", "½ cucharadita de sal", "4 cucharadas de aceite de oliva", "100ml / 3½fl oz de agua tibia"], "method": ["Caliente el aceite de colza en una cacerola a fuego medio. Agregue el apio, la zanahoria, la cebolla, el anís estrellado y los granos de pimienta blanca, cubra la olla y deje las verduras para freír suavemente y suelte el agua durante al menos cinco minutos hasta que se ablanden.", "Agregue las mejillas de los cerdos y el caldo de pollo. Aumente el fuego a alto y hierva, eliminando cualquier grasa que salga a la superficie. Baja la temperatura a bajo, cubre la sartén y refuerza las mejillas durante aproximadamente 2½ horas hasta que estén tiernas. Retire las mejillas de la reserva y déjelas enfriar.", "Mientras tanto, haz el taramasalata. Coloque el pan en un procesador de alimentos y pulse para formar migas de pan. Incline estos en un recipiente y cubra con la leche. Coloque las huevas y el ajo del bacalao en el procesador y mezcle hasta que quede suave. Agregue el pan remojado y la leche y mezcle nuevamente. Con el motor en marcha, agregue lentamente el aceite de oliva. Agregue el jugo de limón y la temporada. Transfiera el taramasalata a un tazón para servir, tape y deje enfriar hasta que sea necesario.", "Para hacer los panes planos, mezcle la harina y la sal en un bol y haga un pozo en el centro. Agregue el aceite de oliva, y luego agregue lentamente el agua tibia, juntando la pasta para formar la masa. Amasar en una bola apretada y dejar reposar, cubierto con película adhesiva, durante 30 minutos.", "Mientras tanto, pon los chalotes en un recipiente, cúbrelos con la leche y déjalos en remojo durante 10 minutos. Cuando esté listo para freír los aros de chalota, caliente suficiente aceite para freír en una freidora o freidora pesada a 180 ° C / 350 ° F (Precaución: el aceite caliente puede ser peligroso. No lo deje desatendido).", "Escurrir las chalotas, y luego espolvorearlas en harina, sacudiendo el exceso. Freír los anillos de chalota durante 3-5 minutos hasta que estén crujientes y dorados. Escurra sobre papel de cocina y sazone con sal y pimienta cuando aún esté caliente. Déjelos a un lado hasta que esté listo para servir. No necesitan mantenerse calientes: se agregan al plato para la textura. Solo asegúrate de no cubrirlos porque eso hará que se ablanden.", "Para los panes planos, después de que la masa haya descansado, enharine ligeramente la superficie de trabajo y divida la masa en cuatro porciones iguales. Enrolle cada porción en una forma oval de aproximadamente ½ cm / ¼ de grosor. Caliente una sartén antiadherente grande a fuego medio. Agregue tantos panes planos como quepan y fríe en seco por 2-3 minutos en cada lado hasta que estén ligeramente tostados y crujientes. Mantenga caliente hasta que esté listo para servir.", "Justo antes de que esté listo para servir, caliente las tres cucharadas de aceite de oliva en la sartén a fuego alto e introduzca las mejillas de los cerdos estofados. Use dos tenedores para triturar la carne y cocine, revolviendo, durante 8-10 minutos hasta que estén crujientes. Sazonar con sal y pimienta y espolvorear con el chile verde picado.", "Extienda los panes planos con taramasalata, luego agregue las mejillas crujientes de los cerdos y luego los anillos de chalota. Rocíe con un poco más de aceite de oliva y sirva."], "url": "www_bbc_co_uk_food_recipes_crispy_pigs_cheeks_and_62979", "title": "Mejillas crujientes de cerdo y chalotes fritos con taramasalata y pan plano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["600 g / 1 libra de filete de abadejo de 5 oz, pelado y deshuesado, cortado en trozos cuadrados de 4 cm / 1½", "sal", "3 cucharadas de cilantro picado", "1 chile verde, sin semillas, finamente picado", "1 lima, ralladura solamente", "1 cucharadita de pimentón ahumado", "100ml / 3½fl oz de vino blanco", "100ml / 3½fl oz de vinagre de vino blanco", "100g / 3½ oz de azúcar", "3 zanahorias, cortadas en piezas del tamaño de un fósforo", "1 chalota de plátano, en rodajas", "2 dientes de ajo, cortados por la mitad y eliminado el germen", "75g / 2½ oz de harina natural, más extra para espolvorear el pescado", "75g / 2½ oz de harina de maíz", "200ml / 7fl oz de agua de soda helada", "aceite de girasol, para freír", "2 cebollas tiernas, finamente cortadas", "120ml / 4fl oz de aceite de colza en frío"], "method": ["Sazone las piezas de pescado con sal, dos cucharadas de cilantro picado, la mitad de chile, la ralladura de limón y el pimentón ahumado en un tazón. Deje de lado por al menos 30 minutos y preferiblemente unas pocas horas.", "Ponga el vino, el vinagre, el azúcar y 100 ml / 3½ fl oz de agua en una sartén y caliente a fuego lento.", "Coloque las zanahorias, el chalote, el ajo y el chile verde en un recipiente y vierta el jugo de escabeche a fuego lento. Sumerja las zanahorias usando una película adhesiva para mantenerlas en su lugar. Deja enfriar.", "Para hacer la mezcla, mezcle la harina y la harina de maíz con una pizca de sal en un tazón. Agregue el agua de soda y mantenga la masa enfriado, idealmente en hielo, hasta que se necesite.", "Precaliente una freidora de grasa a 180 ° C / 350 ° F, o llene a medias una sartén de fondo grueso con aceite de girasol. (Precaución: el aceite caliente puede ser peligroso. No lo deje sin supervisión.) Espolvoree el pescado con harina y seque el exceso.", "Sumerja los trozos de pescado en la mezcla y cuidadosamente colóquelos en la freidora uno por uno. Cocine por dos minutos y luego transfiera a a en un plato forrado con papel de cocina. Sazone la mezcla crujiente con un toque de sal.", "Escurra las zanahorias y deseche el ajo. Mezcle la cucharada restante de cilantro picado y las cebolletas con la mezcla de zanahoria, sazone con sal y aliñelo con aceite de colza. Sirva el pescado frito en un plato con la ensalada de zanahoria en escabeche."], "url": "www_bbc_co_uk_food_recipes_crispy_pollack_pickled_03950", "title": "Abadejo crujiente con zanahorias en vinagre y aderezo de vinagre dulce", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 yemas de huevo grandes de gallinas camperas", "1 cucharadita de mostaza Dijon", "2 cucharaditas de vinagre de vino blanco", "400ml / 14fl oz de aceite de girasol", "jengibre molido, al gusto", "sal marina", "1 bulbo de hinojo, descuartizado, sin corazón y en rodajas finas, frondas reservadas", "100ml / 3½fl oz de aceite de colza", "20ml / ¾fl oz de vinagre chardonnay", "1 cucharadita de mostaza integral", "½ lima, solo jugo", "sal y pimienta negra recién molida", "aceite vegetal, para freír", "½ cucharadita de jengibre molido", "½ cucharadita de pimentón", "½ cucharadita de sal masala", "Harina normal de 100 g / 3½ oz", "2 huevos grandes de gallinas camperas, golpeados", "120g / 4½oz de chisporroteo de carne de cerdo", "2 tubos de calamar, limpiados y cortados en anillos", "sal marina", "1 lima, cortada en cuñas, para servir"], "method": ["Para hacer la mayonesa de mostaza, coloque las yemas de huevo en un tazón y bata la mostaza y el vinagre. Lentamente rocíe el aceite en el recipiente, batiendo constantemente, hasta que tenga una consistencia de mayonesa. Sazone con jengibre y sal y coloque en el refrigerador hasta que esté listo para servir.", "Para hacer la ensalada de hinojo, coloque el hinojo en un recipiente con agua helada para que quede crujiente, luego quite y escurra sobre papel de cocina.", "Mezcle el aceite, el vinagre y la mostaza en un bol con un chorrito de jugo de lima y sazone con sal y pimienta. Viste el hinojo, agrega las hojas de hinojo y reserva.", "Para hacer el calamar, llena una freidora o una sartén grande, profunda y de fondo grueso con aceite dos tercios lleno. Caliente a 180 ° C (un cubo de pan debe dorarse en un minuto cuando lo deje caer). PRECAUCIÓN: El aceite caliente puede ser peligroso. No dejes desatendido", "Mezcle el jengibre, el pimentón y el garam masala en un bol. Ponga la harina en un recipiente aparte, los huevos en otro recipiente y la carne de cerdo en otro cuenco.", "Enrolla los anillos de calamar en las especias, cúbrelas con la harina, luego el huevo y finalmente el crujiente de cerdo. Poner a un lado en un plato grande hasta que esté listo para freír.", "Freír el calamar en profundidad durante 1-2 minutos hasta que esté dorado y crujiente. Escurrir sobre papel de cocina y sazonar con sal.", "Sirva el calamar caliente con la mayonesa de mostaza y la ensalada de hinojo, adornada con rodajas de limón."], "url": "www_bbc_co_uk_food_recipes_crispy_pork_covered_43500", "title": "Calamar crujiente cubierto de cerdo con ensalada de hinojo y mayonesa de mostaza", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Calabaza de 250 g / 9 oz, pelada y sin semillas", "½ cucharadita de semillas de cilantro", "½ cucharadita de semillas de comino", "125ml / 4fl oz de vinagre de sidra en taza, más extra para el gusto", "Azúcar en polvo de 110 g / 4 oz", "sal y pimienta negra recién molida", "peladuras de papa, al gusto", "aceite de girasol para freír", "pizca de chile en polvo o pimentón ahumado"], "method": ["Para hacer la salsa de tomate, agregue todos los ingredientes a la sartén más pequeña posible, agregue agua para cubrir y cocine a fuego lento.", "Una vez que la calabaza esté tierna, escurra dos pulgadas de líquido y mezcle suavemente con una batidora o un procesador de alimentos.", "Regrese al fuego si es necesario, y cocine lentamente para reducir la consistencia del ketchup.", "Controle el condimento y agregue sal, pimienta y vinagre según sea necesario.", "Coloque el ketchup en una tina de plástico limpia o en un frasco de vidrio estéril y manténgalo en la nevera hasta dos semanas.", "Para las cáscaras, lave y drene bien las cáscaras y luego seque las cáscaras quitando el exceso de agua con un paño de cocina.", "Agregue una pulgada o más de aceite a una cacerola profunda y caliente a unos 160 ° C / 325 ° F, o hasta que un pequeño trozo de peeling chisporrotee al agregarlo al aceite. (Precaución: no deje el aceite caliente desatendido).", "Freír las cáscaras de papa en pequeños lotes hasta que estén crujientes, doradas y crujientes.", "Escurra bien sobre papel de cocina y sazone con sal y pimienta.", "Sirva las cáscaras de papa con el ketchup de calabaza para mojar y un poco de chili en polvo o pimentón ahumado."], "url": "www_bbc_co_uk_food_recipes_crispy_potato_peelings_07088", "title": "Patatas crujientes de pelar patatas con salsa de tomate de calabaza", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crispy_potato_peelings_07088_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["900 ml / 1½ pintas de verduras o caldo de pollo", "200g / 7oz de polenta instantánea", "1 barra de romero, hojas finamente picadas (alrededor de 1 cucharada de romero picado)", "sal marina escamada y pimienta negra recién molida", "20 hojas grandes de salvia", "20 rebanadas de tocino", "2 cucharadas de aceite de oliva", "4 dientes de ajo (puede usar más o menos dependiendo de su gusto), más o menos picados", "puñado de perejil fresco, toscamente picado", "1 limón, ralladura finamente rallada solamente", "50ml / 1¾fl oz de aceite de oliva", "2 cucharadas de aceite de oliva", "4 filetes de salmón, con la piel marcada", "Espárragos de 250 g / 9 oz, raíces de raíz leñosas se rompieron", "50 g / 1¾oz de mantequilla sin sal", "pequeñas hojas de perejil fresco, finamente picadas", "1 limón, solo jugo", "1 limón cortado en cuñas, para servir"], "method": ["Cubra una lata cuadrada de 20 cm / 8 pulgadas con papel pergamino o película adhesiva resistente al calor. Llevar el caldo a ebullición en una olla grande. Reduzca el fuego a fuego lento y, con un batidor o una espátula de silicona, agregue gradualmente la polenta. Agregue el romero y sazone con sal y pimienta.", "Cocine durante 4-5 minutos, revolviendo constantemente hasta que se formen grandes burbujas de aspecto volcánico. La polenta se hinchará y se pondrá espesa, no la deje por un minuto o podría llenarse de bultos. Vierta la mezcla en la lata preparada y alise la superficie con el dorso de una cuchara. Dejar enfriar por 20 minutos.", "Mientras tanto, haz la gremolata. Coloque el ajo, el perejil y la ralladura de limón en un almirez y mortero, y machaque la mezcla hasta obtener un puré para que todos los sabores se mezclen. Agregue el aceite. Alternativamente, mezcle todo junto en una mini-licuadora hasta lo más fino posible. De cualquier manera, ponga la cuchara en un tazón pequeño y déjelo a un lado.", "Alinee una bandeja grande para hornear con un pergamino para hornear. Una vez que la polenta esté firme, sáquela de la lata, colóquela en una tabla de cortar y retire con cuidado el papel o la película adhesiva. Corta la losa en tiras anchas de 10x2cm / 4x¾in y luego córtalas por la mitad para dar 20 chips gruesos. Teniendo cuidado de no romper las virutas, envuelve una hoja de salvia en el medio de cada una, seguida de una rodaja de panceta. Arregle en la bandeja sobre la marcha. Estos se pueden preparar en esta etapa un día antes de tiempo, en cuyo caso, cubrir con película adhesiva y mantener en la nevera.", "Precaliente el horno a 110C / 225F / Gas ¼ (ventilador 80C). Caliente dos sartenes grandes a fuego medio-alto y rocíe una cucharada de aceite en cada una. Freír 10 chips de polenta en cada sartén durante aproximadamente 1-2 minutos en cada lado. Use una pequeña porción de pescado para voltearlos cuidadosamente para evitar romperlos. Colóquelos de nuevo en la bandeja de hornear una vez cocinados y déjelos en el horno para mantenerlos calientes.", "Para el pescado y los espárragos, limpie las sartenes con papel de cocina y vuelva a ponerlas a fuego medio a alto con una cucharada de aceite en cada una. Sazone el salmón con sal y pimienta y, una vez que el aceite esté caliente, coloque el pescado con la piel hacia abajo en una sartén y déjelo cocer durante aproximadamente 3-4 minutos.", "Mientras tanto, para los espárragos, fríe los espárragos en la otra sartén durante 3-4 minutos, de vez en cuando.", "Si desea preparar la salsa, simplemente derrita la mantequilla en una cacerola pequeña y agregue el perejil finamente picado, el jugo de limón y sazone al gusto. Mantener caliente", "Una vez que el pescado ha tenido su tiempo, voltéelo y déjelo cocinar durante cuatro minutos en el otro lado.", "Mientras tanto, retire las astillas de polenta del horno y coloque cinco en cada plato para servir. Divida los espárragos de manera uniforme entre ellos también. Una vez que el salmón esté cocido a su gusto (ya sea un poco de rosa en el centro o completamente cocido) retírelo del fuego y coloque uno en cada plato de servir. Si hiciste la salsa opcional, vierte esto ahora.", "Sirva inmediatamente con la gremolata y las rodajas de limón."], "url": "www_bbc_co_uk_food_recipes_crispy_salmon_polenta_67895", "title": "Salmón crujiente, chips de polenta y espárragos a la parrilla", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crispy_salmon_polenta_67895_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 yemas de huevo de gallinas camperas", "½ cucharadita de sal marina", "pizca de pimienta blanca", "2 cucharaditas de vinagre de vino de arroz", "4 cucharaditas de salsa de chile y ajo preparada", "2 cucharaditas de jugo de yuzu (disponible en algunos supermercados y tiendas de comestibles asiáticos, o minoristas especializados en línea), o para degustar", "200ml / 7fl oz de aceite vegetal", "aceite vegetal, para freír", "Harina normal de 75g / 3oz", "sal y pimienta negra recién molida", "4 calamares medianos, limpios, quillas y picos eliminados, cortados en anillos de 0,5 cm / ½ en", "2 huevos de gallinas camperas", "Pan rallado panko japonés de 75g / 3oz"], "method": ["Para el aderezo ponzu cremoso, mezcle todos los ingredientes del aderezo, excepto el aceite vegetal, hasta obtener un puré suave en un procesador de alimentos.", "Con el motor todavía en funcionamiento, vierta gradualmente el aceite vegetal en una corriente delgada, hasta que la mezcla se haya espesado y se parezca a la mayonesa. Sazonar, al gusto, con más jugo de yuzu, según sea necesario. Enfríe hasta que sea necesario.", "Para el calamar, caliente el aceite en una freidora a 190C / 374F. Alternativamente, caliente el aceite en una sartén profunda de base pesada hasta que la miga de pan chisporrotee y se ponga marrón cuando se deje caer en ella. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Espolvoree la harina en un plato y sazone, al gusto, con sal y pimienta negra recién molida.", "Draga los anillos de calamar en la harina sazonada hasta que esté completamente cubierto, sacudiendo cualquier exceso.", "Batir los huevos en un tazón, luego espolvorear las migas de panko japonés en un plato por separado.", "Sumerja cada anillo de calamar enharinado primero en el huevo batido, luego drage en las migas de pan panko hasta que esté completamente cubierto.", "Cuidadosamente baje los anillos de calamar recubiertos, en tandas, dentro del aceite caliente. Freír por 2-3 minutos, o hasta que estén crujientes y doradas. Retire del aceite con una espumadera y déjelo a un lado para drenar el papel de cocina. Mantener caliente Repita el proceso con los anillos de calamar recubiertos restantes.", "Para servir, divida el calamar crujiente con migajas por igual entre cuatro platos para servir. Rocíe sobre el cremoso aderezo Ponzu. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_crispybreadcrumbedsq_93514", "title": "Calamar crujiente con migas de pan y aderezo ponzu cremoso", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 hongos grandes y planos (como Portabello o hongos de campo), sin tallos", "100 g / 3½ oz de hongos chinos, picados (los tallos de las setas grandes se pueden usar también aquí)", "1 diente de ajo, aplastado", "1 cucharada de mantequilla derretida", "1 huevo grande de gallinas camperas, solo yema de huevo", "2 cucharadas de pan rallado blanco", "2 cucharaditas de cebolletas picadas", "2 cucharaditas de perejil picado", "1 cucharadita de tomillo picado", "sal y pimienta negra recién molida", "pellizcar nuez moscada recién molida", "200ml / 7fl oz de leche entera", "algunas rodajas de zanahoria, al gusto", "algunas rodajas de cebolla, al gusto", "2 granos de pimienta", "tomillo de ramita", "perejil ramita", "15g / ½ oz de harina natural", "15g / ½ oz de mantequilla", "1/8 cucharadita de mostaza (preferiblemente Dijon)", "Queso cheddar 15 g / ½ oz, rallado", "15g / ½ oz de queso parmesano (o una alternativa vegetariana), rallado", "sal y pimienta negra recién molida", "25g / 1oz de mantequilla", "50g / 1¾oz de pan rallado blanco", "40 g / 1½ oz de queso cheddar rallado, o 25 g / 1 oz de queso parmesano rallado"], "method": ["Coloque las setas planas en una sola capa en un plato para servir a prueba de horno. Sazonar con sal y pimienta negra recién molida.", "Para hacer el llenado, precaliente el horno a 200C / 400F / Gas 6.", "Corta los tallos de las setas grandes y planas y corta todos los hongos chinos. Agregar a un tazón con el ajo, la mantequilla derretida, la yema de huevo, el pan rallado y las hierbas. Sazonar con sal, pimienta negra recién molida y una pizca de nuez moscada. Divida el relleno entre las setas planas.", "Para la salsa de queso, vierta la leche en una cacerola con zanahoria, cebolla, granos de pimienta, tomillo y perejil. Colocar a fuego medio y llevar a ebullición. Cocine a fuego lento durante 4-5 minutos, luego retire del fuego, cubra y deje en infusión durante 10 minutos.", "A medida que la salsa se infunde, haz un roux. Agregue la harina y la mantequilla a una cacerola limpia y coloque a fuego medio. Revuelva con frecuencia, durante aproximadamente dos minutos hasta que el roux sea grueso y bien combinado, luego déjelo enfriar.", "Cuele la leche para eliminar las verduras y hierbas. En una sartén, llevar la leche a ebullición y luego batir en el roux. Batir constantemente hasta que tenga una salsa lo suficientemente gruesa como para cubrir la parte posterior de una cuchara. Agregue la mostaza y el queso rallado. Sazone al gusto con sal y pimienta negra recién molida.", "Coloque la mantequilla en una sartén a fuego medio y derrita. Cuando esté solo hasta que se derrita, retírelo del fuego y agregue las migas de pan. Dejar de lado para enfriar.", "Extienda un poco de la salsa sobre cada hongo y cubra con el pan rallado y el queso rallado.", "Hornee en el horno por 15 minutos, o hasta que se doren ligeramente en la parte superior. Si desea que estén aún más crujientes, colóquelos bajo una parrilla caliente por un minuto o dos para terminar. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_crispy_stuffed_mushrooms_30058", "title": "Champiñones rellenos crujientes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 muslo de pollo, huesos extraídos, con la piel puesta", "1 cucharadita de aceite de oliva", "1 cucharadita de vinagre balsámico", "sal y pimienta negra recién molida", "puñado de perejil", "puñado de albahaca fresca", "puñado de cilantro fresco", "puñado de menta fresca", "½ pimienta, finamente rebanada", "1 ¼ de cebolla, finamente rebanada"], "method": ["Calentar una sartén y freír el lado del muslo de pollo hacia abajo durante 6-8 minutos en cada lado. Gire y cocine por el mismo período de tiempo. Cuando crujiente, dorado y cocido cortado en rodajas finas.", "Para el aderezo, mezcle el aceite de oliva, el vinagre balsámico, la sal y la pimienta.", "Agregue las hierbas, el pimiento y la cebolla al aderezo.", "Mezcle a través del pollo en el último minuto y sirva."], "url": "www_bbc_co_uk_food_recipes_crispychickensalad_75685", "title": "Ensalada de pollo crujiente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 rebanadas de pan blanco", "2 dientes de ajo picados", "1 limón, ralladura solamente", "pequeño puñado de cebolletas frescas, perejil, albahaca y estragón", "Mini-filetes de pollo de 240 g / 8½ oz", "5 cucharadas de harina normal", "1 huevo de gallinas camperas, golpeado", "1 cucharada de aceite de oliva", "ramita de perejil de perejil, para adornar", "½ cucharada de aceite de oliva", "½ cebolla, finamente picada", "1 diente de ajo, aplastado", "½ cucharadita de salsa Worcestershire", "1 cucharadita de miel clara", "3 cucharadas de ketchup de tomate", "1 limón, cortado en cuñas, para adornar", "ramita de perejil de perejil, para adornar"], "method": ["Para el pollo frito crujiente, coloque el pan, los dientes de ajo, la ralladura de limón y las hierbas en un procesador de alimentos pequeño y pulse hasta que se combinen. Transfiera la mezcla de hierbas a un plato.", "Espolvorea los filetes de pollo en harina común, métete en el huevo y revuelve en la hierba las migas de pan para cubrir bien.", "Caliente el aceite de oliva en una sartén pequeña antiadherente y fríe las piezas de pollo durante 4 a 6 minutos por cada lado, o hasta que estén cocidas.", "Para la salsa, caliente el aceite de oliva en una olla pequeña y agregue la cebolla. Freír hasta que la cebolla esté suave pero no coloreada.", "Agregue el ajo a la sartén y cocine por un minuto.", "Agregue los ingredientes restantes y cocine a fuego lento durante otros dos minutos.", "Para servir, vierta la salsa en un tazón pequeño. Coloque el pollo en un plato de servir y adorne con rodajas de limón y perejil."], "url": "www_bbc_co_uk_food_recipes_crispychickenwithbar_86974", "title": "Pollo frito crujiente con salsa de barbacoa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["150ml / ¼ pinta de aceite vegetal", "1 huevo blanco de corral", "45g / 1½ oz de harina de auto crianza", "Suela de 100 g / 3½ oz, cortada en 3 piezas", "½ mango, pelado y cortado en cubos pequeños", "½ chile, sin semillas, finamente picado", "¼ de cebolla, finamente picada", "½ lima, solo jugo", "cebollín fresco, para adornar"], "method": ["Caliente el aceite en una cacerola profunda de fondo grueso hasta que esté muy caliente o hasta que se agriete una migaja de pan (PRECAUCIÓN: El aceite caliente es muy peligroso. No lo deje desatendido).", "Coloque la clara de huevo y la harina en un tazón y batir para formar una mezcla suave. Agregue un poco de agua si es necesario.", "Sumerja las rebanadas de pescado en la mezcla y cuidadosamente baje en el aceite caliente. Freír a fuego lento durante tres minutos, o hasta que estén dorados y cocidos.", "Para la salsa, coloque todos los ingredientes de la salsa en un tazón y mezcle.", "Para servir, coloca la salsa en el centro de un plato para servir. Coloque el pescado encima de la salsa y adorne con cebolletas frescas."], "url": "www_bbc_co_uk_food_recipes_crispydeepfriedsolew_84481", "title": "Suela frita crujiente con salsa de mango picante", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 cucharadas de jengibre fresco rallado", "2 cucharadas de vino de arroz Shaoxing o jerez seco", "2 cucharadas de pimienta en grano de Sichuan", "pizca de sal, al gusto (opcional)", "6 anís estrellado", "1 cucharada de salsa de soja oscura", "1 cucharada de salsa de soja ligera", "2 pechos de pato, piel marcada en un patrón entrecruzado", "1 cucharada de aceite de maní", "hojas de ensalada, para servir", "100 ml / 3½ fl oz de agua", "2 ciruelas, piedras removidas, descuartizado", "50 g / 2 oz de albaricoques secos, picados", "2½ cucharaditas de azúcar en polvo", "1 cucharada de miel", "1 ramita de canela", "1 anís estrellado entero", "1 lima, solo jugo"], "method": ["Para el adobo, coloque todos los ingredientes del adobo en un tazón y bata bien para combinar.", "Para el pato, coloque el pato en el tazón con el adobo, cúbralo con una película adhesiva y déjelo marinar en el refrigerador durante 20-25 minutos.", "Precalentar el horno a 200C / 400F / Gas 6.", "Caliente un wok hasta que esté humeando y agregue el aceite de cacahuete, luego agregue el pato con la piel hacia abajo y freír durante 4-5 minutos, o hasta que la piel esté dorada y crujiente. Transfiera el pato a una bandeja para hornear, con la piel hacia arriba, y cocine en el horno durante 3-4 minutos, o hasta que esté cocido a su gusto.", "Para la salsa de albaricoque y ciruela, coloque el agua en una olla pequeña y deje que hierva. Agregue las ciruelas, los albaricoques, el azúcar, la miel, la canela y el anís estrellado y cocine a fuego medio hasta que se reduzca a una salsa pegajosa. Quite el fuego, cuele a través de un colador y agregue el jugo de lima. Deseche las especias que quedan en el colador.", "Para servir, coloque una pechuga de pato en cada plato de servir, vierta la salsa sobre el pato y sirva con la ensalada."], "url": "www_bbc_co_uk_food_recipes_crispyduck_89265", "title": "Pato crujiente con salsa de albaricoque y ciruela", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crispyduck_89265_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["dash aceite de oliva", "Pechuga de pato de 100 g / 3½ onzas, cortada en tiras", "¼ de cebolla, en rodajas", "½ chile rojo fresco, finamente cortado", "2 cucharadas de anacardos picados", "1 naranja, cáscara y jugo solamente", "1 limón, cáscara y jugo solamente", "1 lima, cáscara y jugo solamente", "splash salsa de soja", "Fideos de huevo frescos de 150g / 5½oz", "2 cucharadas de frijoles edamame"], "method": ["Calentar el aceite en un wok, agregar las tiras de pato y freír a fuego alto durante 5-6 minutos.", "Agregue la cebolla y cocine por 2-3 minutos. Agregue el resto de los ingredientes, revuelva bien y cocine durante 2-3 minutos más.", "Para servir, amontona los fideos en un plato de servir."], "url": "www_bbc_co_uk_food_recipes_crispyduckandcashewn_87404", "title": "Fideos crujientes de pato y anacardo salteados", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ cucharadita de canela molida", "½ cucharadita de jengibre molido", "½ cucharadita de pimienta de Jamaica molida", "2 cucharadas de vino de arroz Shaoxing o jerez seco", "2 cucharadas de miel", "1 cucharada de salsa de chile", "1 cucharada de salsa de soja ligera", "2 dientes de ajo, finamente picados", "2 patas de pato, con la piel puesta", "75g / 3oz de harina de papa o harina común", "aceite de maní, para freír", "100g / 3½ oz de rábano rojo, finamente picado", "½ pepino, cortado a la mitad a lo largo, sin semillas y finamente picado", "1 chile rojo, sin semillas y finamente picado (opcional)", "1 cucharada de vinagre de arroz claro o vinagre de sidra", "½ cucharadita de sal", "1 cucharadita de azúcar en polvo", "½ cucharadita de vino de arroz Shaoxing o jerez seco", "1 pequeño puñado de hojas de cilantro fresco, finamente picado", "pizca de sal", "pizca de copos de chile seco"], "method": ["Para el adobo, coloque todos los ingredientes del adobo en un tazón pequeño y mezcle bien.", "Para el pato, coloque las patas de pato en un recipiente y vierta sobre el adobo. Cubra con film transparente y colóquelo en el refrigerador para marinar durante al menos 24 horas.", "Para la ensalada de rábanos encurtidos, coloque todos los ingredientes de la ensalada en un tazón y mezcle bien para combinar. Cubra con una película adhesiva y déjela en la nevera durante una hora.", "Precalentar el horno a 180C / 350F / Gas 4.", "Para el pato, quite las patas de pato del adobo y coloque, con la piel hacia arriba, en una lata de asar. Coloque en el horno para asar durante diez minutos o hasta que la piel esté dorada y crujiente.", "Aumente la temperatura del horno a 220C / 425F / Gas 7.", "Ase las patas de pato durante cinco minutos más, o hasta que el pato esté cocido a su gusto. Retire del horno y deje reposar por 2-3 minutos.", "Cuando esté lo suficientemente frío como para manipularlo, corte el pato en rodajas del tamaño de un bocado y aspire ligeramente la harina de patata, sacudiendo cualquier exceso.", "Llene a la mitad un wok o una sartén profunda con aceite de cacahuete y caliente a 180 ° C / 350 ° F, o hasta que un cubo de pan caiga en chispas y se vuelva dorado en 15 segundos. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido). Baje con cuidado las rodajas de pato en el aceite y fría, en pequeños lotes, hasta que estén crujientes y doradas. Retire de la sartén con una espumadera y escurra sobre papel de cocina.", "Para servir, espolvorea un poco de ensalada de rábanos encurtidos en cada uno de los dos platos para servir y coloca las rebanadas crujientes de pato en la parte superior. Espolvorea sobre una pizca de sal y unas hojuelas de chile seco sobre las piezas de pato y sirve inmediatamente."], "url": "www_bbc_co_uk_food_recipes_crispyfragrantduckwi_89266", "title": "Pato fragante crujiente con ensalada de rábanos encurtidos", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 x 2kg / 2lb 4oz pato, hueso de la espalda eliminado, aplanado", "1 cucharada de aceite de oliva", "3 cebollas de primavera, en rodajas", "2 chiles rojos, finamente picados", "1 ramita de canela", "½ cucharadita de granos de pimienta de Sichuan", "Ciruelas de 500 g / 1 lb 2 oz, sin piedras, picadas", "125ml / 5fl oz de vinagre de vino de arroz", "75g / 3oz de azúcar en polvo", "sal y pimienta negra recién molida", "225g / 8oz de harina blanca fuerte", "175ml / 6fl oz de agua hirviendo", "4 cebolletas, finamente trituradas", "2 chiles rojos, sin semillas, finamente triturados"], "method": ["Precalentar el horno a 210C / 410F / Gas 7.", "Para el pato crujiente, coloque el pato, con la piel hacia arriba, en una rejilla sobre una bandeja de asar y perforar la piel con un cuchillo.", "Hervir un hervidor y verter el agua hirviendo sobre la piel del pato, descartando el agua. Seque el pato, use papel de cocina, frote la sal y la pimienta negra recién molida, al gusto, sobre la piel.", "Transfiera al horno para asar durante 1-1¼ horas, o hasta que estén crujientes y doradas. Retire del horno y deje reposar por 10 minutos. Triture el pato en pedazos finos usando dos tenedores.", "Para la salsa de ciruela picante, calienta el aceite de oliva en una sartén con tapa y freír las cebollas de primavera y los chiles durante 1-2 minutos, o hasta que estén blandos. Agregue las especias y continúe cocinando por otros 1-2 minutos.", "Agregue las ciruelas, el vinagre y el azúcar y ponga la mezcla a ebullición. Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento, cubra con una tapa y cocine a fuego lento durante 5-6 minutos, o hasta que las ciruelas estén tiernas. Pon las ciruelas a un lado para enfriar", "Retire la ramita de canela y mezcle la mezcla con un puré en un procesador de alimentos. Cuele el puré a través de un colador en un recipiente. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Mientras tanto, para los panqueques, coloca la harina en un bol y haz un pozo en el centro. Vierta el agua hirviendo y revuelva para formar una masa. Incline la masa sobre una superficie de trabajo enharinada y amase durante 2-3 minutos, o hasta que la masa esté suave.", "Cortar la masa en 16 piezas y enrollar cada pieza en un panqueque fino.", "Caliente una sartén hasta que esté caliente y fría cada panqueque por 1-2 minutos en cada lado, o hasta que estén pálidas doradas. Mantenga los panqueques calientes hasta que estén listos para servir.", "Para servir, coloque el pato rallado en un plato grande y coloque la cebolleta y los chiles al lado. Coloque los panqueques en un plato de servir por separado y sirva la salsa de ciruela al lado."], "url": "www_bbc_co_uk_food_recipes_crispyduckpancakeswi_93114", "title": "Panqueques crujientes de pato con salsa de chile y ciruela", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500ml / 18fl oz de aceite vegetal, para freír", "1 pechuga de pato cocida de estilo chino", "1 cucharada de salsa de soja", "1 cucharada de aceite de sésamo", "3 cucharadas de miel", "sal y pimienta negra recién molida", "6 panqueques de estilo chino listos para usar, calentados según las instrucciones del paquete", "¼ de pepino, en rodajas finas", "¼ de pimiento rojo, finamente picado", "¼ de cebolla, finamente picada"], "method": ["Para el pato, coloque el aceite vegetal en una olla profunda de fondo grueso y caliente hasta que un pequeño cubo de pan chisporrotee y se ponga dorado cuando se le caiga. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Con cuidado, coloque la pechuga de pato en el aceite caliente y fría por 3-4 minutos, o hasta que estén crujientes. Retirar del aceite con una cuchara ranurada y escurrir sobre papel de cocina, luego triture el pato en trozos finos con dos tenedores.", "Para la salsa, coloque todos los ingredientes de la salsa en un bol y mezcle bien.", "Para hacer los panqueques, distribuya la misma cantidad de salsa en cada panqueque, luego espolvorea sobre la misma cantidad de pato. Cubra con el pepino, el pimiento rojo y la cebolla y enrolle.", "Para servir, coloca los panqueques en platos para servir."], "url": "www_bbc_co_uk_food_recipes_crispyduckpancakes_85915", "title": "Panqueques crujientes de pato", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 filete de lubina, despellejado", "100 g / 3½ oz de harina de maíz", "1 cucharadita de sal, más extra para rociar", "5 cucharadas de agua con gas", "300ml / ½ pinta de aceite vegetal, para freír", "¼ de piña, pelada y picada", "pizca de copos de chile", "1 lima, ralladura y jugo", "55 g / 2 oz de judías verdes, cocidas y picadas"], "method": ["Para la lubina frita crujiente, corte el pescado por la mitad en diagonal. Coloque la harina de maíz, la sal y el agua en un tazón y batir para formar una masa espesa.", "Coloque el aceite vegetal en una olla profunda de fondo grueso y caliente hasta que un pequeño cubo de pan chisporrotee y se ponga dorado cuando se deje caer en él. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Sumerja la lubina en la masa para cubrir, sacudiendo cualquier exceso, luego coloque cuidadosamente en el aceite caliente. Freír a fuego lento hasta que estén crujientes y doradas. Retirar del aceite con una cuchara ranurada y escurrir sobre papel de cocina. Espolvorea con sal.", "Para la salsa, coloque todos los ingredientes de la salsa en un tazón y mezcle bien.", "Para servir, coloca la lubina frita crujiente en un plato con una cucharada de salsa."], "url": "www_bbc_co_uk_food_recipes_crispyfriedseabassfi_85747", "title": "Filete de lubina frito crujiente con salsa de piña", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "1 chalote, finamente picado", "2 dientes de ajo", "2 bulbos de hinojo, en rodajas", "1 vaso pequeño de vino blanco", "110g / 4oz de berros, blanqueados", "1 cucharadita de perejil", "85g / 3oz de mantequilla", "Filetes de lubina 4x140g / 5oz, piel sobre", "8 tomates baby, cortados a la mitad", "55g / 2oz de aceitunas negras, cortadas en cubitos"], "method": ["Saltee la chalota, el ajo y el hinojo en 1 cucharada de aceite. Agregue el vino blanco y cocine a fuego lento durante 3-5 minutos.", "Coloque el berro y el perejil en un procesador de alimentos y mezcle hasta que quede suave.", "Caliente la mantequilla con el aceite restante y coloque la lubina en la sartén con la piel hacia abajo. Sazonar y entregar el pescado. Agregue las mitades de tomate y cocine durante 1-2 minutos.", "Para servir: Ponga el hinojo en el plato y cubra con el pescado. Coloque los tomates y las aceitunas alrededor y rocíe con la salsa de berros."], "url": "www_bbc_co_uk_food_recipes_crispyfriedseabasswi_14506", "title": "Lubina frita crujiente con hinojo asado y salsa de berros", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filete de salmón 600g / 1¼lb, con piel", "4 limones", "salpicar vino blanco", "2 cucharadas de hojas de tomillo", "2 cucharadas de hojas de romero", "2 cucharadas de hojas de eneldo", "300ml / ½ pinta de aceite de oliva", "2 cucharadas de perejil picado", "Sal marina Maldon y pimienta negra agrietada"], "method": ["Corta salmón en cuatro y puntúa la piel. Poner en un plato no metálico.", "Zest y jugo dos limones. Reduce a la mitad los limones restantes.", "Combine la ralladura y el jugo con vino, tomillo, romero, eneldo, un tercio del aceite y la mitad del perejil. Temporada.", "Precaliente el horno a 180 ° C / 350 ° F / Gas 4.", "Vierta el adobo sobre el salmón y déjelo durante 30 minutos.", "Retire el salmón, escurra el adobo y fría, con la piel hacia abajo, durante 1 minuto. Gire y selle el otro lado.", "Coloque el salmón, con la piel hacia arriba, en una bandeja para asar, espolvoree sal y tueste durante aproximadamente 10 minutos o hasta que esté recién cocido.", "Ponga el plato para servir, rocíe con el aceite restante, espolvoree con el perejil restante y sirva con mitades de limón."], "url": "www_bbc_co_uk_food_recipes_crispyherbedsalmon_243", "title": "Salmón herbáceo crujiente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 pechuga de pollo", "sal y pimienta negra recién molida", "Fideos de huevo de 55 g / 2 oz, cocidos", "1 cucharadita de aceite de sésamo", "1-2 cucharadas de aceite vegetal", "55ml / 2fl oz de vinagre de vino blanco", "pizca de copos de chile", "Azúcar en polvo de 55 g / 2 oz", "3 cucharadas de salsa de soja", "1 diente de ajo, pelado y aplastado"], "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Calentar el aceite en una sartén plancha. Sazone el pollo y el carbón en la sartén caliente durante 5-6 minutos por cada lado. Transfiera al horno y cocine durante 10-12 minutos, hasta que esté cocido.", "Para la torta de fideos, mezcle los fideos y el aceite de sésamo en un tazón grande. Caliente el aceite vegetal en una olla pequeña o en un blini y coloque los fideos. Cocine durante 3-4 minutos por cada lado hasta que estén crujientes y dorados.", "Para hacer el aderezo, caliente el vinagre, los copos de chile, el azúcar, la salsa de soja y el ajo en una sartén pequeña durante 4-5 minutos, revolviendo ocasionalmente.", "Para servir, transfiere el pollo a un plato de servir. Sirva la torta de fideos crujiente al costado y rocíe el aderezo."], "url": "www_bbc_co_uk_food_recipes_crispynoodlecakewith_76490", "title": "Pastel de fideos crujiente con pollo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]