[{"isVegetarian": true, "title": "Apple and cinnamon breakfast pot", "url": "www_bbc_co_uk_food_recipes_apple_and_cinnamon_79023", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz fat-free Greek-style yoghurt", "1 tbsp rolled oats ", "1 small apple, grated", "25g/1oz blueberries ", "pinch ground cinnamon", "low-calorie sweetener, to taste (optional)"], "serves": "Serves 1", "time": {"preparation": "overnight", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 0, "preparationMins": 0}, "recommendations": 0, "method": ["Mix the yoghurt and oats together in a bowl, cover and refrigerate overnight. ", "When ready to eat, stir in the apple, blueberries, cinnamon and sweetener, if using. Serve."]}, {"isVegetarian": true, "title": "Apple and cinnamon kugelhopf with honeyed apples", "url": "www_bbc_co_uk_food_recipes_apple_and_cinnamon_79794", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["60g/2¼oz unsalted butter, softened, for greasing ", "60g/2¼oz ground almonds, for dusting ", "200ml/7fl oz full-fat milk", "85g/3oz caster sugar", "85g/3oz unsalted butter, softened", "400g/14oz plain flour", "3 tsp ground cinnamon", "1 tsp fine sea salt ", "2 lemons, zest only ", "12g fast-action yeast ", "2 large free-range eggs", "2 Golden Delicious apples, peeled, cored and diced (about 220g/8oz after peeling and coring)", "75g/2½oz sultanas soaked in calvados", "120g/4oz unsalted butter", "8 tbsp calvados ", "½ tsp ground cinnamon ", "½ tsp vanilla bean paste  ", "240g/8½oz honey ", "1 tsp lemon juice", "5 Golden Delicious apples, peeled, cored and diced", "30 blanched almonds "], "serves": "Makes 1 large cake", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Thoroughly grease the bundt tin with butter and dust with ground almonds ensuring no areas have been missed. Preheat a warming drawer to 28C/82F (if you don’t have a warming drawer you can prove the dough by a sunny window or suspended over a bowl of hot water).", "For the dough, place a heatproof bowl over a pan of gently simmering water. Add the milk and 25ml/1fl oz water to the bowl and warm it gently until it reaches 45C/113F on a cook’s thermometer. ", "Meanwhile, in the bowl of a freestanding mixer, cream together the caster sugar and softened butter until pale and fluffy. Add the flour, cinnamon, salt, lemon zest and instant yeast, making sure the yeast doesn’t touch the salt. ", "Add the warm milk mixture and eggs. Slowly mix using the paddle attachment to bring the mixture together, then increase the speed to medium and continue to mix for five minutes. The dough will be really sticky and stringy. ", "Fold in the diced apples and sultanas, then transfer the dough to the prepared tin. Shake the tin to make sure the dough is in all the nooks and crannies. Cover with a large piece of cling film (or a shower cap) and place in the warming drawer for 1hr 10 minutes, or until the dough has doubled in size and nearly reaches the top of the tin.", "Preheat the oven to 190C/375F/Gas 5. Place a rack on the third shelf of the oven.", "For the honeyed apples, melt 40g/1½oz of the butter in a large frying pan. Add the calvados, cinnamon, vanilla, honey, lemon juice and 120ml/4fl oz water and bring to the boil over a medium heat. ", "Stir in the apples and reduce the heat. Stir often and cook for about eight minutes, or until the apples are tender and the liquid has thickened. Remove from heat and stir in the remaining butter. Transfer to a bowl and set aside to cool.", "When the cake has finished proving, bake for 35–40 minutes. Check it after 30 minutes, it is ready when a skewer placed in the centre comes out clean and the cake has come away from the sides of the tin slightly. Remove the cake from the oven and set aside to cool in the tin for about five minutes.", "To decorate, put the blanched almonds on a baking tray and roast in the oven until golden-brown. ", "Turn out the cake into the centre of a serving plate and allow to cool for five minutes. ", "Prick the top of the cake with a skewer and drizzle over some of the sauce from the honeyed apples.", "Decorate the cake with the roasted almonds. Place on a serving platter and spoon the honeyed apples in and around the cake. Drizzle any remaining sauce from the honeyed apples over the cake and serve."]}, {"isVegetarian": true, "title": "Loaf cake with apple and cinnamon", "url": "www_bbc_co_uk_food_recipes_apple_and_cinnamon_loaf_75570", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/apple_and_cinnamon_loaf_75570_16x9.jpg", "ingredients": ["75g/2½oz butter, softened", "200g/7oz self-raising flour", "100g/3½oz light muscovado sugar", "1 tsp ground cinnamon", "3 dessert apples, about 350g/12oz before peeling", "3 free-range eggs, beaten", "1-2 tbsp demerara sugar, to taste", "2 tbsp warmed, sieved apricot jam"], "serves": "Makes 2 x 450g/1lb loaves", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Set the oven to 180C/350F/Gas 4 (160C fan).", "Rub the butter into the flour until it resembles fine breadcrumbs (this can be done in a food processor). Stir in the sugar and cinnamon.", "Peel the apples, core and dice two and a half apples and stir into the cake mixture with the eggs. Beat until combined. ", "Divide the cake mixture evenly between the cake tins. Thinly slice the remaining half of apple and arrange in a row along the middle on top of each cake. Sprinkle with demerara sugar and bake for 35-45 minutes, or until golden-brown, risen, firm to the touch in the centre and just shrinking from the sides of the tin. ", "Brush the top of the cakes with the apricot jam. Allow to cool in the tins for 10 minutes, then turn out and leave to cool on a wire rack. "]}, {"isVegetarian": true, "title": "Apple and plum cake with rum caramel sauce", "url": "www_bbc_co_uk_food_recipes_apple_and_plum_pudding_27042", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/apple_and_plum_pudding_27042_16x9.jpg", "ingredients": ["125g/4oz unsalted butter, softened, plus extra for greasing", "200g/7oz golden caster sugar", "1 free-range egg, lightly beaten", "150g/5oz plain flour", "1 tsp baking powder", "½ tsp salt", "1 tsp ground cinnamon", "½ tsp grated nutmeg", "100g/3½oz pecans, roughly chopped", "3 medium apples (mix of granny smith and golden delicious), peeled, cored, chopped into small pieces", "5 plums, stone removed, chopped into small pieces", "2 tbsp finely chopped stem ginger", "200g/7oz caster sugar", "250ml/8floz whipping cream", "1-2 tbsp dark rum", "1 tsp vanilla essence"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the apple and plum cake, preheat the oven to 180C/350F/Gas 4. Grease and line a 23cm/9in deep, round cake tin.", "Beat the butter and sugar together in a bowl until light and fluffy. Add the egg and two tablespoons of flour and mix until well combined.", "Beat in the remaining flour, salt, baking soda, cinnamon and nutmeg and until just combined.", "Stir in the remaining ingredients.", "Pour the mixture into the cake tin and bake for 35-45 minutes, or until golden-brown and springy to the touch.", "Remove the pudding from the oven and set aside to cool slightly.", "Meanwhile, for the rum caramel sauce, heat the sugar in a saucepan for 4-5 minutes, or until it becomes caramel. Remove the pan from the heat and set aside to cool slightly.", "Heat the cream in a saucepan set over a medium heat, then whisk it into the caramel to form a smooth sauce.  Stir in the vanilla and add the rum, to taste. ", "To serve, cut the pudding into wedges and serve with the rum caramel sauce."]}, {"isVegetarian": true, "title": "Apple and lemon kites", "url": "www_bbc_co_uk_food_recipes_apple_and_lemon_kites_00762", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["160g/5¾oz unsalted butter, 120g/4¼oz chilled and 40g/1½oz at room temperature", "250g/9oz strong white flour", "10g/⅓oz powdered milk ", "30g/1oz caster sugar", "7g salt", "8.5g fast-action dried yeast", "30g/1oz caster sugar", "30g/1oz icing sugar", "30g/1oz ground almonds", "½ unwaxed lemon, zest only", "2 drops lemon extract", "1 large free-range egg yolk, beaten", "1 dessert apple (ideally Pink Lady or braeburn)", "1 tbsp lemon juice ", "50ml/1¾fl oz lemon juice", "50g/1¾oz caster sugar", "3 tbsp icing sugar ", "1 large free-range egg, beaten"], "serves": "Makes 6 pastries", "time": {"preparation": "over 2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["Prepare the chilled butter by placing it between two sheets of greaseproof paper and banging with a rolling pin until you have a 8x15cm/3¼x6in rectangle about 1cm/½in thick.  Put this back into the fridge.", "Place the room temperature butter, strong white flour, powdered milk, caster sugar, salt and 150ml/5fl oz water into the bowl of a freestanding mixer fitted with a dough hook. Mix on a low setting until combined. Pour in the yeast and continue to mix on low speed for five minutes, then turn up the speed to medium and continue mixing for another 5-7 minutes.  ", "Tip the dough out of the bowl and bring it together into a smooth ball, then place in a greased, non-metallic bowl and set aside, covered, for 15 minutes.  ", "Transfer the bowl to the microwave and heat at 100 watts for six minutes then leave to rest for another 10 minutes.  Alternatively, prove the dough in a warm room for a further 45 minutes, or until doubled in size.", "Tip the risen dough out onto a worktop then roll out into a 18x25cm/7x10in rectangle about 1cm/½in thick.  ", "Transfer to a baking sheet lined with baking parchment, cover with cling film and place in the freezer for 10 minutes.  ", "Remove the dough from the freezer and place the rolled block of chilled butter in the centre of the rectangle. Fold the top third over the butter then the bottom third up over the top. Roll out until it is about 1cm/½in thick again, turn the dough 90 degrees and repeat the folding and rolling process again.  ", "Fold the dough back into thirds and place back into the freezer for 15 minutes.  Roll out again and this time fold into quarters – folding each short edge into the centre, then closing it up like a book.  Roll out again, then repeat this double-fold once more and freeze the dough for another 15 minutes.", "Wrap the dough in cling film and set aside in the fridge. ", "For the apple and lemon filling, place the sugars, almonds, lemon zest and extract in a bowl and mix. Add a little egg yolk to bind the dry ingredients and mix to a smooth paste.  Tip the paste onto the work surface, then roll into six equal balls and place in the fridge.  ", "Slice the dessert apple very thinly, keeping the skin on, allowing four slices for each kite, i.e. 24 pieces. Place into a bowl with the lemon juice to prevent them turning brown.", "Roll out the chilled dough into a rectangle 20x30cm/8x12in and cut into six equal squares (approximately 10cm/4in).  Leaving a 1cm/½in border, cut a 4cm/1½in square from the middle of each square - cutting right through two opposite corners, but leaving the other two corners connected for about 1cm/½in either side of the corner points (see item four in the technique video below for further guidance). Brush a little beaten egg in the centre, add a squished ball of almond and lemon filling and then place four apple slices over the top.  Fold the corner borders over to the opposing sides of the internal square. Sprinkle caster sugar over the apples and leave to prove for an hour. ", "To make the lemon glaze, put 25ml/1fl oz water, half the lemon juice and the sugar in a pan set over a low heat. Cook until the sugar is dissolved then bring to a boil and continue to simmer for about 5-10 minutes, or until a thick syrup forms. Set aside to cool. ", "Preheat the oven to 220C/425F/Gas 7.", "When ready to bake, brush the top of the pastries (though not the apple slices) with beaten egg and bake for 8-10 minutes, or until golden-brown. Remove from the oven, brush with the lemon glaze and allow to cool for five minutes on the tray before transferring to a wire rack. Leave to cool completely.", "To make the lemon icing, mix the icing sugar with a teaspoon of lemon juice to form a thick icing.  Place in a food bag with a small corner cut off .", "Once the kites are completely cool, drizzle with the lemon icing and serve. "]}, {"isVegetarian": true, "title": "Apple and raisin muffins", "url": "www_bbc_co_uk_food_recipes_apple_and_raisin_muffins_04810", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp runny honey", "2 medium Braeburn apples, peeled and diced", "1 tsp Chinese five-spice powder", "1 tsp ground mixed spice", "2 large free-range eggs, beaten", "3 tbsp toasted sesame oil", "200ml/7fl oz semi-skimmed milk", "2 small bananas, mashed", "300g/10½oz self-raising flour", "2–3 tsp granulated sweetener", "1 tsp bicarbonate of soda", "40g/1½oz raisins", "1 tbsp rolled oats", "1 tbsp light brown sugar"], "serves": "Makes 12", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6 and line a 12-hole muffin tray with large muffin cases.", "Place the honey into a small non-stick saucepan over a medium heat and heat for 2–3 minutes or until it turns a dark golden-brown and just begins to smoke. ", "Stir in the apples and spices and cook for 3–4 minutes, or until slightly softened. Remove from the heat and set aside to cool.", "Beat together the eggs, sesame oil and milk in a bowl. Mix in the mashed bananas.", "In a large bowl, stir together the flour, sweetener, bicarbonate of soda and raisins. Make a well in the middle and pour in the egg mixture. Stir in the apples and any liquid from the pan. Spoon into the muffin cases. ", "Mix together the oats and sugar and sprinkle on top of each muffin.", "Bake for 20 minutes or until a skewer pressed into the centre comes out clean. Cool on a wire rack and eat warm or keep in a airtight container for up to 3 days and warm for 5 minutes at 200C/180C Fan/Gas 6."]}, {"isVegetarian": true, "title": "Apple and raspberry gratin with polenta crumble", "url": "www_bbc_co_uk_food_recipes_apple_and_raspberry_22932", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz blanched almonds", "60g/2¼oz ‘00’ flour", "40g/1½oz polenta", "2 drops vanilla extract ", "350g/12oz caster sugar, plus extra for cooking the fruit", "75g/2¾oz butter, chilled and diced", "500ml/18fl oz whole milk, plus a dash", "1 vanilla pod, split", "6 free-range eggs, plus 2 whites", "75g/2¾oz plain flour", "2 Bramley apples, peeled and diced", "1 lemon, juice only", "2 Cox’s apples, peeled and diced", "300g/10½oz raspberries "], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Grind the almonds to a coarse texture in a food processor. ", "Put the ground almonds, ‘00’ flour, polenta, vanilla extract and 50g/1¾oz sugar in a bowl, then roughly rub in the butter. Spread the mixture out on a baking tray, cover and put in the fridge for 1 hour. Preheat the oven to 180C/Fan 160C/Gas 4.", "Bake the crumble for 10–20 minutes, but check from time to time to make sure the edges aren't burning. Leave to cool, then break up into crumble.", "Meanwhile, pour the milk into a medium heavy-bottomed saucepan, add the vanilla pod and bring to the boil.", "Separate the whole eggs and whisk the six yolks with 75g/2¾oz sugar in a large, heatproof bowl. Stir in the plain flour to make a paste. Pour over the hot milk, whisk well, then return to the saucepan over the heat. Reduce the heat and cook gently for 5 minutes, or until thickened. Pour into a bowl, then cover and chill.", "Spoon 4 tablespoons of the cold custard into a small bowl and add a dash of milk to let it down. Set aside.", "Meanwhile, cook the Bramley apples in a little water with a 100g/3½oz  sugar and half the lemon juice, until smashed to a purée. Cook the Cox’s apples in a little water with 50g/1¾oz sugar and the remaining lemon juice until soft but holding their weight.", "Spoon the apple puréeonto a plate, cover with the softened diced apple, scatter over the raspberries, then spoon over the cold custard. ", "Whisk the eight egg whites and the remaining 75g/2¾oz sugar in a clean, glass bowl until thick. Stir in the reserved 4 tablespoons custard. ", "Spoon the egg white mixture over the fruit and glaze using a blow torch. Sprinkle over some crumble mixture and serve."]}, {"isVegetarian": true, "title": "Apple and rhubarb muffins", "url": "www_bbc_co_uk_food_recipes_apple_and_rhubarb_37109", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/apple_and_rhubarb_37109_16x9.jpg", "ingredients": ["6 tbsp sunflower oil", "200g/7oz soft brown sugar", "1 free-range egg, beaten", "250ml/9fl oz buttermilk", "1½ tsp vanilla extract", "85g/3oz rhubarb, cut into 1cm/½in pieces", "85g/3oz apple, peeled, cored and diced", "55g/2oz walnuts, chopped ", "1 tbsp baking powder", "250g/9oz plain flour, sifted ", "55g/1oz oat bran", "1 tbsp demerara sugar", "¼ tsp ground cinnamon", "¼ tsp ground nutmeg"], "serves": "Makes 12 muffins", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.  Line 12 muffin tins with paper cases.", "In a large bowl, mix together the oil, brown sugar, egg, buttermilk and vanilla.  Fold in the rhubarb, apple, walnuts, baking powder, flour and oat bran, then spoon the mixture into the cases.", "Mix together the demerara sugar, cinnamon and nutmeg and sprinkle over the muffins.  Bake in the oven for 20-25 minutes until golden brown and springy to the touch. "]}, {"isVegetarian": false, "title": "Delia's any kind of cheese sauce", "url": "www_bbc_co_uk_food_recipes_anykindofcheesesauce_70007", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/anykindofcheesesauce_70007_16x9.jpg", "ingredients": ["2oz/50g mature Cheddar, grated ", "1oz/25g parmesan (Parmigiano Reggiano), finely grated ", "1 pint/570ml milk ", "1½oz/40g plain flour ", "1½oz/40g butter ", "pinch of cayenne pepper ", "a little freshly grated nutmeg ", "salt and freshly milled black pepper"], "serves": "Makes 1 pint/570ml", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["All you do is place the milk, flour, butter and cayenne pepper into a medium saucepan and place it over a gentle heat. Then, using a balloon whisk, begin to whisk while bringing it to a gentle simmer. Whisk continually until you have a smooth, glossy sauce, and simmer very gently for 10 minutes. Then add the cheeses and whisk again, allowing them to melt. Then season with salt, freshly milled black pepper and some freshly grated nutmeg."]}, {"isVegetarian": true, "title": "Apple and Stilton dumplings", "url": "www_bbc_co_uk_food_recipes_apple_and_stilton_23994", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 red onions, sliced into thin rings", "3 tbsp white wine vinegar", "2 lemons, juice only", "1 tbsp caster sugar", "5 cloves", "1 cinnamon stick", "100g/3½oz golden sultanas", "3 eating apples, such as Cox's Orange Pippin, peeled, cores removed, roughly chopped", "1 lemon, juice only ", "320g/11¼oz ready-made all-butter puff pastry", "plain flour, for dusting", "160g/5½oz Stilton", "1 free-range egg, beaten", "2 tbsp nigella seeds "], "serves": "Makes 8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the chutney, heat the onion, vinegar, lemon juice, sugar, cloves and cinnamon in a non-reactive saucepan over a low heat for 15 minutes.", "Turn the heat off and add the golden sultanas. Set aside for 30 minutes to allow the sultanas to soak.", "Preheat the oven to 200C/180C fan/Gas 6.", "For the dumplings, put the apples, lemon juice and 300ml/10½fl oz water in a lidded saucepan. Cover the pan with the lid and bring the mixture to a simmer. Stew the apples gently for 18-20 minutes, stirring occasionally. When completely softened, mash the apple mixture and transfer to a bowl to cool.", "Roll the sheet of puff pastry out onto a lightly floured work surface to a 50cm/20in square. With a sharp knife, cut 16 squares measuring 12cm/4½in from the pastry.", "Transfer 8 of the pastry squares onto a baking sheet and spoon a generous helping of the cooled apple sauce into the centre of each. Crumble about 20g/¾oz of the Stilton over each.", "Brush the edges of each pastry square with a little of the beaten egg. Lay the remaining 8 pastry squares over the filled pastry squares, crimping the edges of each to seal. Brush the tops of the pastry parcels with more of the beaten egg, then sprinkle over the nigella seeds.", "Bake for 18-20 minutes, or until the pastry has risen and is golden-brown."]}, {"isVegetarian": true, "title": "Apple and syrup steamed pudding with plum and apple compôte and homemade custard", "url": "www_bbc_co_uk_food_recipes_apple_and_syrup_steamed_81727", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 tbsp golden syrup", "1 Bramley cooking apple, peeled and chopped", "175g/6oz butter, softened (plus extra for greasing)", "175g/6oz soft dark brown sugar", "1 lemon, zest only", "1 vanilla pod, split in half lengthways and seeds scraped out", "4 medium free-range eggs", "175g/6oz self-raising flour", "1 tsp baking powder", "2 tbsp unsalted butter", "150g/5½oz caster sugar", "250g/9oz plums, stones removed", "150g/5½oz Bramley apples, peeled and chopped", "2 cinnamon sticks", "3-4 cloves", "1 tbsp chopped fresh root ginger", "6 free-range egg yolks", "75g/2½oz caster sugar", "200ml/7fl oz milk", "200ml/7fl oz double cream", "1 vanilla pod, split in half lengthways and seeds scraped out"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the steamed pudding, butter a 1.2litre/2 pint heatproof bowl then pour the golden syrup into the bottom. Add the apple and mix.", "Mix the butter and sugar in a separate bowl until light and fluffy. Stir in the lemon zest and vanilla seeds. Beat in the eggs one at a time, beating well between each addition. Fold in the flour and baking powder and mix to form a smooth, thick batter.", "Spoon the sponge mixture into the buttered bowl. Cut a large piece of baking paper and a matching piece of aluminium foil. Place the foil on top and fold a pleat down the middle to allow the paper to expand. Place over the pudding and secure around the edge using cooks’ string. Fold a large piece of aluminium foil into a long strip and place under the pudding bowl to use as a handle later. ", "Place a saucer or small plate upside down into the bottom of a large saucepan. ", "Put the covered bowl on the saucer and pour water into the pan to reach two-thirds of the way up the bowl. Cover the pan with a lid and bring to a boil. Reduce the heat and simmer for 1-1½ hours.", "For the plum and pear compôte, heat a large saucepan and add the butter and sugar. Add the plums, apples, cinnamon sticks, cloves and ginger and simmer for 8-10 minutes. Simmer the sauce, stirring gently until it thickens.", "For the custard, place the egg yolks and sugar in a bowl and whisk until well blended. Put the milk, cream, vanilla pod and seeds into a saucepan and bring to the boil. Simmer for a minute, then pour onto the egg mixture and whisk in. Return to the saucepan and heat slowly, or until the custard has thickened enough to coat the back of the spoon. Strain through a sieve into a clean pan.", "To serve, remove the pudding from the saucepan using the foil strip to help you. Discard the foil and baking parchment. Place a plate on top of the pudding and turn over, tipping out the pudding onto the plate. Cut the pudding into slices and serve along with the compôte and custard."]}, {"isVegetarian": true, "title": "Apple and toffee crumble pie", "url": "www_bbc_co_uk_food_recipes_apple_and_toffee_crumble_76635", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/apple_and_toffee_crumble_76635_16x9.jpg", "ingredients": ["oil, for greasing", "450g/1lb soft dark brown sugar", "5g/¼oz cream of tartar", "100g/3½oz golden syrup", "130g/4½oz black treacle", "225g/8oz butter", "115g/4oz sugar", "1 free-range egg yolk", "400g/14oz flour, sifted", "100g/3½oz butter", "100g/3½oz sugar", "1 orange, zest only", "4 bramley apples, peeled and diced", "1 cinnamon stick", "4 eating apples (such as Cox or Royal Gala), peeled and diced ", "200g/7oz plain flour", "100g/3½oz caster sugar", "35g/1¼oz ground almonds", "10g/¼oz flaked almonds", "80g/2½oz butter, softened", "custard, crème fraîche, ice cream or clotted cream"], "serves": "Serves 8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["To make the toffee, line a tray with baking parchment and grease it with oil. ", "In a pan, bring 125ml/4fl oz water to the boil with the dark brown sugar.  When the sugar is dissolved, remove from the heat and add the cream of tartar, golden syrup and black treacle. Return to the heat and cook until it reaches 140C/284F on a sugar thermometer. (This will take a while, but be patient and don’t leave it unattended - it can burn very easily!) Once it reaches 140C/284F, pour the mixture straight into the lined tin and leave to cool.", "For the pastry, preheat the oven to 150C/300F/Gas 2.", "Cream together the butter and sugar in an electric mixer. Add the egg yolk and then the sifted flour. Mix to combine but do not over work.", "Wrap the pastry in cling film and leave to rest in the fridge for an hour.", "After resting, roll out the pastry on a lightly floured work surface to about 5mm/¼in thick. Line a 20cm/8in tart ring with the pastry and gently push into the base. Line with cling film and fill with baking beans or rice (NB: Not every type of cling film is suitable for using with all foods. Check the description on the packaging to see what foods and what temperatures it can be used with. If unsure, use tin foil or baking paper instead). Place in the fridge for an hour to rest again. ", "Bake in the preheated oven for 35 minutes, then remove the baking beans and cling film and bake for another 5-10 minutes, or until cooked all the way through and a light golden-brown colour. Remove from the oven and set aside to cool.", "For the filling, place the butter, sugar and orange zest in a pan. Heat until the butter and sugar are melted.", "Add the bramley apples and the cinnamon and cook until the apple is very soft and turning into a purée.  Add the eating apples and cook for a further 1-2 minutes, then remove from the heat.", "Pour the mixture into a colander or sieve to remove any excess liquid. Discard the cinnamon stick and leave the apples to cool. ", "For the crumble topping, preheat the oven to 180C/350F/Gas 4. ", "Mix the plain flour, caster sugar, ground almonds, flakes almonds and butter together with your hands, using your fingertips to rub the dry ingredients into the butter.", "Place this mixture on a baking tray and bake for approximately 20 minutes, or until golden-brown and crumbly. Stir the crumble every five minutes so that it cooks evenly. Remove from the oven and leave to cool.", "To assemble the pie, spoon the apple mixture into the cooked pastry case. Break the toffee into chunks and place a few over the top of the apple (you will not need all the toffee). Completely cover the apple mixture with the toasted crumble and the dot a few more pieces of toffee on top. ", "Bake in the oven at 180C/350F/Gas 4 for 10-12 minutes, or until the filling is bubbling and the toffee has melted. ", "Serve with custard, crème fraîche, ice cream or clotted cream….or all four!"]}, {"isVegetarian": true, "title": "Apple, blackberry and cinnamon chutney", "url": "www_bbc_co_uk_food_recipes_apple_blackberry__91830", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2.2lb Bramley apples, peeled, cored, cut into large chunks", "300g/10½oz onions, peeled, thinly sliced", "275g/10oz granulated sugar", "150ml/5fl oz balsamic vinegar", "2 tsp ground cinnamon", "freshly ground black pepper", "300g/10½oz blackberries"], "serves": "Makes 1.3kg/3lb", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Sterilise the jars by putting them into the dishwasher on the hottest cycle to wash and dry. Take them out when you are about ready to use them and don’t touch any of the inside of the jars with your hands. (Alternatively, put the jars in a very large pan of boiling water. You will also need to sterilise the equipment you use to take the jars out of the pan.) ", "Place the jars into the oven set at a low temperature until completely dry inside.", "Put the apples, onions, sugar, balsamic vinegar, cinnamon and freshly ground black pepper into a large saucepan.  Place over a medium heat and gently stir together until well combined.", "Once the mixture has reached boiling point, turn down the heat and leave to simmer for 45–55 minutes, stirring occasionally. The apples and onions should become lovely and soft, and the liquid should be thick and syrupy.", "Add the blackberries and cook for a further 10–12 minutes.", "Spoon the chutney into a sterilised jug and fill the jars. Seal and store in a dark place. The chutney will keep for up to four months."]}, {"isVegetarian": true, "title": "Apple and Wensleydale pie", "url": "www_bbc_co_uk_food_recipes_apple_and_wensleydale_16189", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/apple_and_wensleydale_16189_16x9.jpg", "ingredients": ["350g/12oz plain flour", "175g/6oz cold unsalted butter, cut into roughly 1cm cubes, plus extra for greasing", "500g/1lb 2oz cooking apples", "500g/1lb 2oz eating apples", "100g/3½oz caster sugar", "125g/4½oz Wensleydale cheese, crumbled", "a little milk", "about 1 tbsp caster sugar"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["To make the pastry, put the flour in a bowl. Add the butter and rub it in lightly with your fingertips until the mixture resembles fine breadcrumbs. Alternatively, do this in a food processor or a mixer and then transfer to a bowl.", "Using a table knife, work in just enough cold water (about 75ml/2½fl oz) to bring the pastry together. When the dough begins to stick together, use your hands to gently knead it into a ball. Wrap the pastry in cling film and rest in the fridge for about 30 minutes.", "Preheat the oven to 200C/400F/Gas 6. Lightly butter a baking tin, about 26x20cm/10½x8in and 3cm/1¼in deep.", "For the filling, peel, quarter and core all the apples. Slice into a large bowl and mix them together.", "Once the dough has rested, cut it into two pieces, roughly one-third and two-thirds of the total. Lightly dust a work surface with flour. Roll out the larger piece of pastry so it’s a good centimetre larger all round than the tin. Line the base and sides of the tin with the pastry, leaving the excess hanging over the sides.", "Lay a third of the apple slices in the pastry-lined tin and sprinkle with a third of the sugar. Repeat with the remaining apple and sugar. Now scatter the crumbled cheese evenly over the fruit.", "Roll out the remaining pastry to make a lid. Brush the edges of the pastry in the tin with milk then put the pastry lid on top. Seal the edges with your fingertips and trim off the excess pastry neatly. Brush the pastry with milk and sprinkle over a little sugar. Make two slits in the top to allow steam to escape.", "Bake for 30-35 minutes, or until the crust is golden-brown. Leave for at least 15 minutes before slicing. The pie is delicious hot or cold and needs no accompaniment."]}, {"isVegetarian": true, "title": "Apple charlotte", "url": "www_bbc_co_uk_food_recipes_apple_charlotte_08809", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["80g/3oz caster sugar", "25g/1oz unsalted butter, chilled", "500g/1lb 2oz Cox’s Orange Pippin apples, peeled, cored and each cut into 8 wedges", "150ml/5fl oz fresh apple juice", "10g caster sugar", "½ tsp apple pectin", "250g/9oz Blenheim Orange apples (about 5), peeled and chopped", "½ tsp vanilla purée or good-quality vanilla extract", "50g/1¾oz unsalted butter, softened", "50g/1¾oz caster sugar", "200g/7oz wholemeal bread, cut into 11 slices; each 5mm/¼in thick ", "50g/1¾oz unsalted butter, softened"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the caramelised apples, in a large sauté pan or frying pan over a medium–high heat, heat the sugar to a dark golden-brown caramel without stirring, then add the butter. The caramel will emulsify with the butter and the cold butter will also stop the cooking of the caramel. Add the apples and cook in the caramel for 5 minutes, with a lid on, until they soften but still hold their shape (the centre will still be a little raw). Remove from the heat.", "For the compôte, mix 50ml/2fl oz of the apple juice with the sugar and pectin. Slide the chopped apple into a medium saucepan set over a medium heat. Add the remaining apple juice and cook for 10 minutes, covered with a lid, until the apples break down. Add the sugar/pectin mix and vanilla purée or extract, stir and cook for a further 5 minutes to allow any moisture to evaporate. Remove from the heat.", "Preheat the oven to 210C/190C Fan/Gas 6½.", "To prepare the cake ring, lightly butter the inside of a 15x6cm/6x2½in cake ring. Dip the ring in sugar so that the sugar coats the inside of the ring. Tap it lightly to ensure an even coating; tap off any excess. Lay out a 25cm/10in square of aluminium foil, then cover it with the same size of parchment paper. Place the cake ring on top and roll up the foil and paper, so the foil holds tightly to the bottom of the ring – this will prevent any juices escaping. Place the ring on a baking tray.", "For the Charlotte, cut the slices of bread into 6cm/2½in squares. Lightly spread both sides of the bread with the butter and fry in a large frying pan over a medium–high heat for 20–30 seconds on one side, until evenly golden-brown. Transfer the bread to a plate or tray then use it to line the inside of the ring, browned sides facing outwards and overlapping by 2cm/¾in. Press to ensure they stick to the sides.", "To build, mix the caramelised apple into the compôte, then pour the mixture into the centre of the ring to fill the Charlotte. It will look too much and there will be a slight dome, but after cooking the apples will collapse under their own weight until they are level with the rim of the ring. Place the apple Charlotte in the oven for 30 minutes. Remove from the oven and leave to cool completely for a minimum of 3 hours. This will allow the pectin to set fully and firm up, which will also make the Charlotte easier to slice. Once cool, turn the Charlotte upside down by placing a large plate on top and flipping it over. Remove the foil and paper from the ring. You will need to heat the ring a little to lift it off smoothly; either use a blowtorch or place in an oven heated to 180C/160C Fan/Gas 4 for a minute, then ease it off gently.", "To serve, carefully cut the Charlotte into 6–8 pieces. This beautiful dessert can be served with vanilla ice cream or crème Chantilly. It’s also perfect with a glass of your best cider."]}, {"isVegetarian": true, "title": "Apple Charlotte", "url": "www_bbc_co_uk_food_recipes_apple_charlotte_12801", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["900g/2lb unsalted butter", "600g/1lb 5oz caster sugar", "5kg/11lb Bramley apples, peeled, cored and chopped", "60 slices white bread, crusts removed"], "serves": "Serves 40", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Heat 250g/9oz of the butter in a large saucepan, add the sugar and the apples and cook for 20 minutes or until the apples have broken down.", "Place the remaining butter in a microwaveable dish and heat for 3-4 minutes, or until melted.", "Cut each slice of bread into four strips and dip into the melted butter. Line five 1.2 litre/2 pint pudding basins with the bread, overlapping the slices slightly, reserving some bread to place on the top.", "Fill the lined basins with the apple mixture and top with the remaining bread that has been dipped in butter.", "Bake in the oven and cook for 30 minutes or until golden-brown on top."]}, {"isVegetarian": true, "title": "Apple Charlotte", "url": "www_bbc_co_uk_food_recipes_apple_charlotte_36737", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz lightly salted butter, softened", "50g/1¾oz caster sugar", "1 loaf medium sliced white bread, crusts removed", "300g/10½oz caster sugar", "100g/3½oz lightly salted butter", "2kg/4lb 8oz Cox apples, peeled, cored and cut into 8 equal wedges", "500ml/18fl oz full-fat milk", "1 vanilla pod, seeds scraped", "5 free-range egg yolks", "30g/1oz caster sugar"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. Generously butter the inside of the Charlotte mould with butter, then dust with the sugar. ", "Using a 4cm/1½in round cookie cutter, cut out rounds of white bread and then line the mould in an overlapping pattern, pressing down to seal as you go. Set the remaining bread aside. Transfer the mould to the fridge while you make the filling.", "To make the filling, heat the sugar in a large sauté pan over a medium heat until it reaches a dark caramel colour. Tip in the butter and let the mixture bubble for a few seconds. Add the apples, toss to coat in the caramel, then cook over a high heat for 5 minutes, stirring occasionally.", "Pour the apple filling into the lined mould, then top with enough pieces of bread to seal. Clip the lid on firmly, or if you’re using a pudding basin, cover with foil and rest a heavy baking tray on top. Bake for 30 minutes, then remove from the oven and leave to rest for 10 minutes. Turn out onto a warm serving plate.", "Meanwhile, to make the custard, combine the milk, vanilla pod and seeds in a saucepan and bring to a gentle simmer. Meanwhile, whisk together the egg yolks and sugar in a large, heatproof bowl. ", "Pour the milk through a sieve onto the egg yolk mixture, whisking as you pour to combine. Return the mixture to the pan over a low heat and cook gently for 2–3 minutes, stirring constantly, until the custard is thick enough to coat the back of a spoon. As soon as the custard is cooked, pour into a serving jug. Serve alongside the apple Charlotte. See recipe tips below. "]}, {"isVegetarian": true, "title": "Apple, cherry and marzipan pie", "url": "www_bbc_co_uk_food_recipes_apple_cherry_and_37920", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz unsalted butter, in pieces", "430g/15oz plain flour, plus extra for dusting", "50g/1¾oz caster sugar", "pinch salt", "1 lemon, zest only", "pinch ground cinnamon ", "60g/2¼oz caster sugar", "4 tbsp cornflour", "3 Braeburn apples, peeled, cored and cut into 1cm/½in thick slices", "3 Cox apples, peeled, cored and cut into 1cm/½in thick slices ", "200g/7oz marzipan, cut into small cubes", "150g/5½oz dried sour cherries ", "1 free-range egg, lightly beaten with a pinch of salt"], "serves": "Serves 8", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Place the butter and flour in a large bowl and, using your fingertips, rub the butter into the flour until it resembles fine breadcrumbs.  Mix in the sugar and a pinch of salt.  Measure five tablespoons of water in a jug and slowly add it to the mixture until it comes together to form a dough (you may not need all the water). The dough should be firm but not crumbly.  ", "Transfer the pastry to a lightly floured work surface and knead very briefly just to combine. Wrap in cling film and transfer to the fridge to chill for 20 minutes.", "Preheat the oven to 190C/fan oven 170C/375F/Gas 5. ", "For the filling, in a large bowl combine the lemon zest, cinnamon, caster sugar and cornflour. Add the apples and toss to coat.", "Lightly flour a work surface and rolling pin. Remove the pastry from the fridge and set aside one-third for the pie lid.  Roll out the remaining pastry until it is big enough to generously fit the pie dish. Use the rolling pin to help you lift the pastry into the pie dish and gently press it into the sides, leaving any excess pastry overhanging the sides. Place in the freezer to chill for 10 minutes.", "Roll out the remaining pastry to form the pastry lid. Use any excess to form shapes to decorate the pie.", "Arrange a layer of apple slices in the pie dish and scatter with marzipan cubes and cherries.  Repeat in layers until the dish is nearly full at the edges and heaped in the centre.", "Place the pastry lid on top and crimp the edges to seal.  Make a hole in the centre to allow stream to escape. Place any decorative shapes on top and then glaze with beaten egg. ", "Bake in the preheated oven for 40-45 minutes, or until the pastry is golden-brown and crisp. Check after 25 minutes and, if necessary, cover with foil to prevent the pastry edges from burning."]}, {"isVegetarian": true, "title": "Apple croustade with Armagnac custard", "url": "www_bbc_co_uk_food_recipes_apple_croustade_with_56799", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["175g/6oz caster sugar", "75g/3oz butter", "3 tbsp water", "50g/2oz dried cranberries", "50g/2oz sultanas", "50g/2oz raisins", "1kg/2lb 2oz dessert apples, such as Cox's Orange Pippin, peeled, cored and quartered", "200g/7oz filo pastry, cut into 5cm/2in-wide strips", "½ tsp ground cinnamon", "1 clementine, zest only", "1 lemon, zest only", "75g/3oz clarified butter", "4 free-range egg yolks", "40g/1½oz caster sugar", "150ml/5fl oz milk", "150ml/5fl oz double cream", "2-3 tbsp Armagnac"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the croustade, preheat the oven to 200C/400F/Gas 6.", "Heat a 24cm/9½in ovenproof frying pan or tatin dish until hot. Add 125g/4½oz of the caster sugar and heat until the sugar melts into a caramel. Add the butter and cook for a further 2-3 minutes.", "Remove the pan from the heat and stir in the dried cranberries, sultanas and raisins. ", "Stir in the apples until completely coated in the caramel mixture. Return the pan to the heat and cook for a further 3-4 minutes. Set aside.", "Mix the filo pastry strips, cinnamon, clementine zest and lemon zest in a bowl until the zest and spices coat the pastry, then stir in the clarified butter until it coats the pastry.", "Scrunch the coated strips of filo pastry in your hands and place them on top of the caramel mixture in the pan.", "Place the pan into the oven for 10-15 minutes, or until the filo pastry is crisp and golden- brown. ", "Meanwhile, for the Armagnac custard, whisk the egg yolks and sugar in a bowl until well combined. ", "Heat the milk, cream and Armagnac in a saucepan until just boiling. Remove the pan from the heat, then slowly whisk the warm cream mixture into the egg mixture.", "Return the custard mixture to the saucepan and cook over a gentle heat for 2-3 minutes, or until the custard is thick enough to coat the back of a spoon.", "To serve, cut the croustade into wedges and serve drizzled with the Armagnac custard."]}, {"isVegetarian": true, "title": "Apple crumble", "url": "www_bbc_co_uk_food_recipes_apple_crumble_95357", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["70g/2½oz unsalted butter", "100g/3½oz brown sugar", "6-8 apples (a mixture of cooking and eating varieties), peeled, cored, cut into 2cm/¾in chunks", "300g/10½oz plain flour", "200g/7oz cold butter, cubed", "pinch ground cinnamon", "150g/5oz demerara sugar", "100g/3½oz porridge oats"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160 Fan/Gas 4.", "For the filling, place a casserole or flameproof baking dish over a medium heat. Add the butter and the sugar and stir until melted and well combined. ", "Increase the heat and continue to cook until the mixture has darkened in colour and started to caramelise (take care you don’t burn the mixture or it will taste bitter).", "Add the chopped apples and stir to coat them in the mixture. Continue to cook for 6-8 minutes, or until softened, over a low heat then return the heat to medium and keep cooking until the apple chunks are completely tender. Set the caramelised apples aside to cool while you make the topping.", "For the topping, put the flour in a large mixing bowl. Using your fingertips, rub the cold butter into the flour until the mixture resembles breadcrumbs. Gently stir in the remaining topping ingredients until well combined. ", "Sprinkle the crumble mixture evenly on top of the apple filling. Bake in the oven for 30-35 minutes, or until the filling is piping hot and the crumble is golden-brown all over. Serve with custard or cream."]}, {"isVegetarian": true, "title": "Apple crumble cheesecake", "url": "www_bbc_co_uk_food_recipes_apple_crumble_cheesecake_79571", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/apple_crumble_cheesecake_79571_16x9.jpg", "ingredients": ["100g/3½oz plain flour", "100g/3½oz light soft brown sugar", "½ tsp ground cinnamon", "50g/2oz unsalted butter", "1 tsp milk", "100g/3½oz butter", "250g/9oz oat biscuits, crushed", "1 large Bramley apple, peeled, core removed, sliced, mixed with 1 tbsp lemon juice", "500g/1lb 2oz mascarpone cheese", "400g/14oz cream cheese", "125g/4½oz caster sugar", "1 vanilla pod, split lengthways, seeds only", "1 x 150ml/5fl oz tub soured cream", "4 free-range eggs", "100g/3½oz sultanas (optional)", "½ tsp ground cinnamon", "¼ tsp grated nutmeg"], "serves": "Serves 8-12", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the crumble topping, tip the flour, sugar and cinnamon into a bowl. Rub in the butter with your fingertips until the mixture resembles breadcrumbs. Stir in the milk and set aside.", "For the biscuit base, mix the melted butter and crushed biscuits together in a bowl, then press the mixture into the base of 23cm/9in springform tin. Leave to chill in the fridge for 30 minutes.", "For the filling, cook the apple slices in a pan of boiling water for 1-2 minutes, or until just tender but still holding their shape. Drain and cool. ", "Beat the mascarpone and cream cheese in a large bowl until smooth. Beat in the sugar, vanilla seeds and soured cream and beat until smooth. Beat in the eggs, one at a time, until well combined. ", "Spoon half of the filling onto the chilled biscuit base. Top with the apple slices and sultanas (if using) and sprinkle over the spices, then spoon over the remaining mixture. ", "Bake for 30 minutes, then open the oven door, pull the cheesecake out a little bit and sprinkle the crumble topping over the top. Shut the door and bake for a further 40-45 minutes, or until the cheesecake is mostly set with a slight wobble in the middle.", "Turn off the oven and leave the cheesecake in the oven for two hours, then remove from the oven and set aside to cool completely."]}, {"isVegetarian": true, "title": "Apple crumble with cardamom custard", "url": "www_bbc_co_uk_food_recipes_apple_crumble_with_63159", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/apple_crumble_with_63159_16x9.jpg", "ingredients": ["150g/5½oz butter, softened", "60g/2¼oz caster sugar", "1 tbsp plain flour", "70g/2½oz flaked almonds", "½ tsp ground cinnamon ", "60g/2¼oz panko breadcrumbs", "5 large Royal Gala apples, coarsely grated", "5 cardamom pods, seeds only", "300ml/10fl oz whipping cream", "1 tsp vanilla extract", "2 free-range egg yolks", "1½ tbsp caster sugar", "½ tsp cornflour"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. Beat the butter and sugar together in a large bowl.", "Mix together the flour, almonds, cinnamon and breadcrumbs in another bowl. Tip this into the butter-sugar mixture and rub in with your fingers to form a thick, crumbly dough. ", "Put the grated apples into a 20cm/8in square ovenproof dish. Spread the crumble mixture on top  and bake for 30 minutes, or until brown.", "Meanwhile, to make the cardamom custard,  grind the cardamom seeds to a powder using a pestle and mortar,. Place a heavy-bottomed saucepan over a medium heat and add the cream, cardamom and vanilla. Bring to the boil, reduce the heat and simmer for 3 minutes. Set aside to cool slightly, then strain into a bowl using a fine sieve. ", "Whisk the egg yolks, sugar and cornflour together in a large bowl. Pour in the warm cream mixture, whisking constantly. Pour this mixture back into the saucepan and cook over a low heat for 6–8 minutes, or until the custard thickens.", "Serve the warm apple crumble with the cardamom custard. "]}, {"isVegetarian": true, "title": "Apple crumble with walnuts and sunflower seeds", "url": "www_bbc_co_uk_food_recipes_apple_crumble_with_81274", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/apple_crumble_with_81274_16x9.jpg", "ingredients": ["1.5kg/3lb 5oz cooking apples", "½ lemon, juice only", "100g/3½oz light muscovado sugar", "50g/1¾oz plain flour", "50g/1¾oz porridge oats", "150g/5½oz light muscovado sugar", "150g/5½oz walnuts, roughly chopped", "50g/1¾oz sunflower seeds", "100g/3½oz softened butter"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4 (160C fan). ", "Peel and core the apples, then cut them into thin slices. Place in a small flameproof casserole with the lemon juice, sugar and six tablespoonfuls of water. Bring to the boil, then place in the oven and cook for about 20 minutes, or until the apple is tender but has not fallen to a pulp.", "Put the dry topping ingredients in a mixing bowl and rub in the butter until it is evenly distributed and the mixture has formed small clumps. Spread the mixture evenly over a baking tray and bake for about 20 minutes, or until golden-brown and crisp. ", "Stir to break up the crumble and sprinkle over the hot apple."]}, {"isVegetarian": true, "title": "Apple crumble with star anise", "url": "www_bbc_co_uk_food_recipes_apple_crumble_with_star_50461", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz plain flour", "200g/7oz brown sugar", "200g/7oz unsalted butter, cubed and softened to room temperature, plus extra for greasing", "pinch salt", "75g/3oz unsalted butter, plus extra for buttering", "1 kg/2lb 4oz eating apples (such as russet or cox), peeled, cored and chopped into large chunks", "150g/5oz caster sugar ", "5 star anise ", "1 cinnamon stick", "crème fraîche", "pomegranate seeds"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. To make the crumble topping, put the flour and brown sugar in a large bowl and mix well. Taking a few cubes of butter at a time, rub them into the flour mixture until it resembles breadcrumbs.", "Sprinkle the mixture onto a baking tray in a thin layer, using two sheets if necessary. Bake in the preheated oven for 5-6 minutes, or until lightly golden brown. Remove from the oven and break with a fork, then return to the oven and repeat the process a couple of times, until you have a lovely crunchy biscuit topping. Set aside; if continuing to cook the apple crumble immediately, leave the oven on.", "To make the filling, heat a wide, shallow, heavy-bottomed pan and melt the butter until it foams. Add the star anise and cook over a low heat until the butter is flavoured with the star anise. Add the apples, sugar and cinnamon (if using), and cook, stirring frequently, until the sugar has dissolved and the apple is soft at the edges. Remove the cinnamon (if using) and the star anise, and add a little bit more sugar if you like.", "To assemble, butter a medium-sized ovenproof dish. Spoon the fruit mixture into the bottom, then sprinkle the crumble mixture on top. Ensure the oven is preheated to 200C/400F/Gas 6, and bake for 20 minutes until the crumble is browned and the fruit mixture bubbling. Leave to cool slightly.", "To serve, put some crème fraîche into a small bowl and top with some pomegranate seeds. Serve alongside the crumble."]}, {"isVegetarian": true, "title": "Apple dappy", "url": "www_bbc_co_uk_food_recipes_apple_dappy_68570", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz self-raising flour, plus extra for dusting", "30g/1oz butter", "1 tbsp caster sugar", "4 tbsp single cream", "1 eating apple, peeled, core removed, flesh grated", "pinch ground cinnamon", "2 heaped tsp demerara sugar"], "serves": "Makes 7 slices", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/450F/Gas 7. Line a baking tray with baking parchment.", "Rub the flour and butter together in a bowl using your fingertips until the mixture resembles breadcrumbs. Stir in the caster sugar until well combined. ", "Mix in the cream tablespoon by tablespoon until the contents of the bowl come together as a soft dough. You may not need all the cream.", "In a separate bowl, mix together the grated apple, cinnamon and one teaspoon of demerara sugar until well combined.", "Lightly dust a work surface with a little flour. Roll the dough out into a rectangular shape the thickness of 0.5cm/¼in.", "Remove the apple mixture from the bowl using a slotted spoon, so that as much juice as possible is left in the bowl. Spread the apple mixture all over the pastry. ", "With the long side of the pastry rectangle facing you, roll up the pastry like a Swiss roll. Using a sharp knife, cut the pastry roll into seven thick slices. ", "Place each pastry swirl flat onto the lined baking tray, arranging them in a circle with one in the centre. Sprinkle over the remaining demerara sugar. Bake in the oven for 20-25 minutes, or until crunchy on top and golden-brown. Serve immediately."]}]