[{"ingredients": ["6 salchichas de cerdo de buena calidad - alrededor de 14oz / 400g", "1 cucharada de maní u otro aceite sin sabor (si es necesario)", "Harina simple de 3oz / 75g", "1 huevo grande", "3fl oz / 75ml leche semidesnatada", "sal y pimienta negra recién molida", "Cebollas de 8oz / 225g, peladas y rebanadas", "2 cucharaditas de maní u otro aceite sin sabor", "1 cucharadita de cucharadita de azúcar en polvo de oro", "2 cucharaditas de salsa Worcestershire", "1 nivel de polvo de mostaza en cucharadita", "15fl oz / 425ml de caldo de verduras", "2 cucharadas de harina integral lisa", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Comience haciendo la mezcla, y para hacer esto, tamice la harina en un tazón grande, sosteniendo la criba en alto para que la harina se ventile bien. Ahora, con la parte posterior de una cuchara, haga un pozo en el centro, rompa el huevo en él y agregue un poco de sal y pimienta. Ahora, mida la leche y 2fl oz / 55ml de agua en una jarra de medir, luego, usando un batidor de mano eléctrico a baja velocidad, comience a batir el huevo en la harina; mientras bate, la harina alrededor de los bordes se incorporará lentamente . Luego agregue el líquido gradualmente, deteniéndose para raspar la harina en la mezcla. Batir hasta que la masa esté suave. Ahora el rebozado está listo para usar, y aunque se ha rumoreado que el rebozado se deja reposar es mejor, nunca lo he encontrado, así que solo hazlo cuando sea conveniente.", "Ahora coloque las cebollas en rodajas en un bol, agregue una cucharadita de aceite y azúcar y revuelva las cebollas para obtener el recubrimiento más ligero, luego, extiéndalas en la bandeja de hornear. A continuación, coloque las salchichas en la lata de asar, coloque las cebollas en un estante alto en el horno, con las salchichas en un estante inferior, y configure un temporizador durante 10 minutos. Cuando el temporizador se apaga, retire las salchichas del horno, pero deje las cebollas durante otros 4-5 minutos; deben estar bien ennegrecidas alrededor de los bordes. Cuando estén listos, quítelos y déjelos a un lado.", "Ahora coloque la lata de asar que contiene las salchichas sobre el calor directo convertido en medio y, si las salchichas no han liberado mucha grasa, agregue la cucharada de aceite. Cuando la lata esté realmente caliente y el aceite comience a brillar (debe estar ardiendo), vierta rápidamente la mezcla en todas las salchichas. Inmediatamente devuelva la lata de asar al horno, esta vez en el estante más alto, y cocine todo durante 30 minutos.", "Ahora para la salsa. Primero agregue la salsa Worcestershire y el polvo de mostaza al caldo, luego agregue las cebollas de la bandeja para hornear a una sartén de tamaño mediano. Ahora agregue la segunda cucharadita de aceite, luego, usando una cuchara de madera, agregue la harina común. Mezcle todo esto a fuego medio y luego cambie a un batidor, luego agregue gradualmente el caldo a la sartén, batiendo todo el tiempo, hasta que todo esté listo. Luego, llévelo a fuego lento y cocine a fuego lento durante 5 minutos. Pruebe verificar el condimento y luego viértalo en una jarra de servir caliente.", "Cuando el sapo esté listo, debe hincharse marrón y crujiente y el centro debe verse cocido y no demasiado lloroso. Sirve inmediatamente con la salsa, y es absolutamente maravilloso con puré de papa."], "url": "www_bbc_co_uk_food_recipes_toadintheholewithroa_70008", "title": "Sapo en el hoyo con salsa de cebolla asada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 2-3", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["30g / 1oz rebanada de pan integral o de granero", "30 g / 1 oz de queso suave y suave", "30g / 1oz rebanada de jamón listo para comer", "1 manzana pequeña"], "method": ["Tueste el pan y extiéndalo con el queso blando. Coloque el jamón sobre el queso y sirva con una manzana."], "url": "www_bbc_co_uk_food_recipes_toast_with_ham_and_11297", "title": "Tostadas con jamón y queso", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["30g / 1oz rebanada de pan integral o de granero", "1 plátano pequeño (75 g / 2½ oz de peso pelado), en puré", "1 taza pequeña de yogur bajo en grasa y sin azúcar (65 kcal o menos)"], "method": ["Tostar el pan. Extienda el puré de plátano sobre la tostada y sirva con el yogur."], "url": "www_bbc_co_uk_food_recipes_toast_with_mashed_banana_95514", "title": "Tostadas con puré de plátano y yogur", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["60g / 2¼ oz de coco endulzado (disponible en línea o, como alternativa, agregue azúcar al coco desecado)", "225g / 8oz de harina autoacabada, más extra para quitar el polvo", "½ cucharadita de sal marina", "½ lima, solo ralladura", "1 cucharada de aceite vegetal, más extra para doblar y cocinar"], "method": ["Tueste el coco en una sartén seca a fuego medio hasta que esté dorado y deje enfriar.", "Tamiza la harina y la sal en un tazón grande. Agregue el coco tostado y la ralladura de limón y luego rocíe sobre el aceite vegetal. Agregue 150ml / 5fl oz de agua y combine para hacer una masa suave.", "Incline la masa sobre una superficie ligeramente enharinada y amasar durante aproximadamente cinco minutos. Cubra y descanse la masa durante 20 minutos.", "Divida la masa en seis bolas de igual tamaño. Aplane las bolas de masa en su mano, girándolas mientras lo hace, para hacer discos. Usando un rodillo, enrolle cada uno tan finamente como sea posible.", "Cepille el tercio inferior del roti con un poco de aceite vegetal y dóblelo hasta que se encuentre con el centro, luego doble la parte superior hacia abajo. Gire la masa un cuarto de vuelta y dóblela de la misma manera. Repita con los cinco roti restantes y luego deje de lado hasta que esté listo para cocinar.", "Coloque una sartén a fuego medio / alto y agregue un poco de aceite. Estirar un roti fino y freír en la sartén hasta que se hinche y tenga parches dorados. Voltea y repite en el otro lado. Cuando todos los roti estén cocidos, apilarlos y colocarlos dentro de un paño de cocina. Envuelva la toalla en una hoja grande de papel de aluminio. Selle la lámina de modo que atrape el calor y la humedad en el interior y consérvela en un lugar cálido hasta que esté lista para su uso."], "url": "www_bbc_co_uk_food_recipes_toasted_coconut_and_lime_30529", "title": "Roti tostado de coco y lima", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Rinde 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 bollos", "100g / 3½oz de yogur griego sin grasa", "Fresas maduras de 150g / 5½oz, mondadas y en rodajas", "Frambuesas 50g / 2oz", "50g / 2oz de arándanos", "2 pizcas grandes de especias mixtas molidas", "2 cucharaditas de miel líquida, para lloviznar"], "method": ["Tueste los bollos en una tostadora o debajo de la parrilla, hasta que estén ligeramente dorados.", "Coloque el yogur en un recipiente y revuelva hasta que se vea brillante.", "Coloque una sartén antiadherente a fuego medio-alto y agregue toda la fruta. Espolvoree con dos buenas pizcas de especias mezcladas molida y cocine por solo un minuto, revolviéndolas regularmente hasta que la fruta se ablande pero aún mantenga su forma. Esto sacará la dulzura sin la necesidad de agregar azúcar extra.", "Divida los bollos calientes y tostados entre dos platos. Con una cuchara, coloca la fruta sobre la parte superior y deja que parte de ella caiga sobre los platos. Coloque el yogur encima y rocíe con un poco de miel."], "url": "www_bbc_co_uk_food_recipes_toasted_crumpets_and_99702", "title": "Bollitos tostados y bayas condimentadas calientes con yogur y miel", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/toasted_crumpets_and_99702_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100g / 3½oz de brócoli, cortado en florecillas", "1 chile rojo, finamente picado", "55g / 2oz anacardos, tostados", "2 cucharadas de salsa de soja", "1 cucharada de aceite de sésamo"], "method": ["Ponga a hervir una olla de agua con sal. Agregue el brócoli y cocínelo durante 5-6 minutos, o hasta que estén tiernos.", "Para servir, escurra el brócoli y colóquelo en un plato para servir. Esparce el chile rojo y los anacardos sobre el brócoli, luego vístelo con la salsa de soja y el aceite de sésamo."], "url": "www_bbc_co_uk_food_recipes_toastedcashewandchil_89382", "title": "Ensalada de anacardo tostado y chile brócoli con aderezo de soja de sésamo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/toastedcashewandchil_89382_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina de 115g / 4oz para aumentar la temperatura, más extra para quitar el polvo", "Harina integral autoregenerable de 115g / 4oz", "100g / 3½oz de azúcar morena oscura", "1 cucharadita de polvo de hornear", "2 cucharaditas de canela molida", "5 cucharadas de aceite de girasol", "5 cucharadas de leche", "2 huevos de gallinas camperas", "2 comiendo manzanas, peladas, sin corazón y cortadas en cubos de 5mm / ¼ en cubitos", "Toffe 50g / 2oz, roto en pequeños pedazos"], "method": ["Unte con mantequilla un recipiente a prueba de calor de 1,2 litros / 2 pinta y polvo con harina. Precalentar el horno a 180C / 350F / Gas 4.", "En un tazón, mezcle las harinas, el azúcar, el polvo de hornear y la canela. En un tazón o jarra por separado, bata el aceite, la leche y los huevos. Vierta esto sobre los ingredientes secos y revuelva para combinar. Doble las piezas de manzana y caramelo.", "Verter en el plato preparado y hornear durante 50-60 minutos. Pruebe que la torta esté bien cocida insertando una brocheta en el centro, si está cocida saldrá limpia.", "Deja enfriar en el plato durante 10 minutos y luego retira el pastel. Dejar enfriar completamente y servir."], "url": "www_bbc_co_uk_food_recipes_toffee_apple_cake_86505", "title": "Pastel de manzana con caramelo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/toffee_apple_cake_86505_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "200g / 7oz de cuscús", "½ pimiento rojo, semillas removidas, picadas", "2 cucharadas de maíz dulce enlatado", "250ml / 9fl oz de agua hirviendo", "½ cubo de caldo de pescado", "1 cucharada de cilantro fresco picado", "1 cucharada de perejil fresco picado"], "method": ["Calentar el aceite en una sartén a fuego medio, agregar los granos de cuscús y freír durante 2-3 minutos.", "Agregue el pimiento rojo y el maíz dulce y fría por 2-3 minutos más.", "Agregue el agua, desmorone en el cubo de reserva, quite la sartén del fuego y cúbrala con una tapa. Deja durante 5-6 minutos.", "Una vez que el cuscús ha absorbido el agua, peló los granos con un tenedor, luego mezcle el cilantro y el perejil en el cuscús.", "Para servir, espolvorear el cuscús en un plato de servir y servir como guarnición."], "url": "www_bbc_co_uk_food_recipes_toastedcouscouswiths_89409", "title": "Cuscús tostado con maíz dulce, pimienta y perejil", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6 cucharadas de leche entera", "1 cucharadita de levadura seca", "1 cucharada de azúcar en polvo", "250g / 9oz de harina blanca fuerte", "½ cucharadita de sal", "50 g / 1¾oz de mantequilla sin sal, derretida, más extra para engrasar", "1 huevo grande de gallinas camperas", "aceite vegetal, para freír", "3 manzanas Granny Smith, peladas, sin corazón, picadas", "40 g / 1½ oz de azúcar en polvo", "½ cucharada de harina de maíz", "25 g / 1oz de mantequilla sin sal", "¼ cucharadita de jengibre molido", "1 cucharadita de canela molida", "100 g / 3½ oz de azúcar en polvo", "35 g / 1¼ oz de mantequilla sin sal", "Crema doble 50ml / 2fl oz", "½ cucharadita de sal", "1 cucharada de canela molida", "50 g / 1 oz de azúcar en polvo"], "method": ["Para la masa, caliente la leche y ponga 50ml / 1¾fl de ella en un tazón pequeño con la levadura y media cucharadita de azúcar. Reserve durante 15 minutos para permitir que la levadura se reconstituya.", "Mezcle la harina, la sal y dos cucharadas de azúcar en una batidora independiente con un accesorio de gancho de masa. Agregue la mezcla de levadura, la leche calentada restante, 100 ml / 3½ onzas de agua, la mantequilla y los huevos.", "Mezcle con un gancho de masa durante 10 minutos, o hasta que la masa esté suave y elástica. Luego cubra y reserve para probar durante 45 minutos.", "Mientras tanto, haz que la manzana se llene. Coloque todos los ingredientes de relleno en una cacerola a fuego medio. Agregue cuatro cucharadas de agua y cocine hasta que las manzanas estén blandas. Dejar de lado para enfriar.", "Para el caramelo salado, derrita el azúcar en una sartén hasta que alcance un color marrón oscuro. Luego retírelo del fuego e inmediatamente bata la mantequilla.", "Agregue la crema lentamente, batiendo hasta que esté combinada. Mezcle la sal y luego vierta el caramelo en un recipiente y reserve.", "Para la masa, amase brevemente la masa levantada en una superficie de trabajo enharinada para derribarla.", "Divida la masa en 12 bolas del mismo tamaño y luego gire en esferas ordenadas.", "Engrase una bandeja grande para hornear con un poco de mantequilla. Coloque las bolas de masa en la bandeja, cubra con una toalla de té enharinada y deje que se levante hasta que duplique su tamaño (aproximadamente una hora).", "Para cocinar las donas, precaliente una freidora a 190 ° C o 375 ° F, o alternativamente caliente el aceite en una sartén grande de base pesada hasta que un pedazo de pan chisporrotee y se ponga dorado cuando se le caiga. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Freír las bolas de masa por lotes (no amontonar la sartén), volteándolas de vez en cuando para asegurarse de que tengan un color uniforme. Cocine por alrededor de 3-5 minutos o hasta que se dore.", "Una vez cocido, retire con cuidado las rosquillas cocidas con una cuchara ranurada. Drene en el rollo de cocina y, cuando esté seco, déjelo enfriar sobre una rejilla de alambre.", "Para armar las rosquillas, mezcle la canela y el azúcar impalpable en un tazón.", "Mezcle el relleno de manzana en un procesador de alimentos, o usando una licuadora de mano, hasta que tenga un puré suave.", "Llene una manga larga con el puré de manzana. Alternativamente, mezcle el puré en una jeringa de tubería con una boquilla de inyector conectada.", "Cuando las donas estén completamente frías, use un cuchillo pequeño y afilado para hacer un corte en el lateral de cada rosquilla, llegando al centro. Pipe, o jeringa, el puré de manzana generosamente en el interior.", "Sumerja la mitad de las donas rellenas en el azúcar de canela. Sumerja el otro lado en el caramelo salado enfriado. Si el caramelo es demasiado duro, caliéntelo muy suavemente para aflojarlo, pero no permita que se caliente tanto que no pueda manipularse con seguridad.", "Coloque las donas a un lado para permitir que el caramelo se asiente antes de servir."], "url": "www_bbc_co_uk_food_recipes_toffee_apple_doughnuts_45012", "title": "Donuts de manzana toffee", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Rinde 12 rosquillas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Manzanas de 200g / 7oz, peladas", "1 cucharadita de bicarbonato de soda", "200g / 7oz de mantequilla", "180g / 6oz de azúcar moreno oscuro", "2 huevos de gallinas camperas", "Harina normal de 200g / 7oz", "1 cucharadita de polvo de hornear", "Crema doble 250ml / 9fl oz", "Leche 250ml / 9fl oz", "6 huevos de gallinas camperas", "100 g / 3½ oz de azúcar en polvo", "1 vaina de vainilla, solo semillas", "65g / 2½oz de azúcar moreno oscuro", "65 g / 2½ oz de mantequilla, cortada en cubos", "4 cucharadas de crema doble", "80g / 2¾oz de azúcar moreno oscuro", "80g / 2¾oz de mantequilla", "Harina normal 150g / 5½ oz", "Crema doble de 100ml / 3½oz", "1 cucharadita de azúcar glas, más extra para quitar el polvo", "½ vaina de vainilla, solo semillas"], "method": ["Precaliente el horno a 150 ° C / 300 ° F / Gas 2 y forre un molde cuadrado de 30x30 cm / 12 in en papel de pergamino.", "Para el pastel de manzana, coloque las manzanas en una sartén con 300 ml / ½ pinta de agua y deje hervir durante 1-2 minutos.", "Retire del fuego, agregue el bicarbonato de soda a las manzanas y mezcle con una batidora manual. Dejar de lado.", "En un tazón grande, unte la mantequilla y el azúcar hasta que estén suaves y esponjosos. Agregue los huevos y bata para combinar.", "Vierta la mitad de la mezcla de manzana en el recipiente con la mantequilla y los huevos (deje a un lado el puré de manzana restante para servir).", "Doble la harina y el polvo de hornear hasta que estén completamente combinados.", "Vierta la mezcla en la lata de pastel preparada y hornee durante 45 minutos-1 hora, o hasta que la torta esté dorada y un pincho de madera insertado en el centro salga limpio.", "Para la crema, mezcle la crema, la leche, los huevos, el azúcar y las semillas de vainilla en un tazón resistente al calor. Suspenda el recipiente sobre una cacerola con agua hirviendo a fuego lento y caliente para espesar, batiendo constantemente.", "Para la salsa toffee, agregue el azúcar y la mantequilla a una sartén grande y caliéntela suavemente hasta que se derrita. Agregue la crema doble y caliente, luego retírela del fuego y déjela a un lado hasta que esté lista para servir.", "Para el relleno de crumble, aumente la temperatura del horno a 180C / 350F / Gas 4.", "Usando sus manos, frote todos los ingredientes para hacer una textura áspera de pan rallado. Espolvorea la cobertura en una bandeja para hornear y hornea hasta que se dore.", "Para la crema de Chantilly, bate la crema en un tazón grande con el azúcar glas y las semillas de vainilla hasta que se formen picos suaves cuando se quite el batidor del tazón.", "Para servir, espolvoree un puré de manzana en cada una de las cuatro placas para servir y arrastre con el dorso de una cuchara para crear un efecto de frotis. Cubra con una tajada de tarta de manzana. Rocíe con la salsa de toffe y cubra con la crema encima.", "Coloque una cucharada limpia de la crema de Chantilly junto a cada rebanada de pastel, espolvoree con la migaja y el polvo con azúcar glasé."], "url": "www_bbc_co_uk_food_recipes_toffee_apple_cake_with_99093", "title": "Tarta de manzana con caramelo y flan de vainilla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["mantequilla, para engrasar", "200 g / 7 oz de azúcar en polvo", "3 manzanas Granny Smith grandes, peladas, sin corazón y cortadas en rodajas a 1cm / ½ en cuñas", "1 naranja grande, solo ralladura", "75g / 2½oz de arándanos secos", "225g / 8oz de mantequilla salada, ablandada", "225g / 8oz de azúcar en polvo de oro", "Harina de levante 225g / 8oz", "½ cucharadita de bicarbonato de soda", "4 huevos de gallinas camperas, a temperatura ambiente", "60ml / 4 cucharadas de leche entera", "½ cucharadita de extracto de vainilla", "200 g / 7 oz de azúcar en polvo"], "method": ["Engrase la lata de hornear cuadrada de 23cm / 9 pulgadas con mantequilla y cúbrala con papel resistente a la grasa. Precalentar el horno a 180C / 350F / Gas 4.", "Para el relleno, ponga una sartén a fuego alto. Agregue el azúcar y tres cucharadas de agua y cocine hasta que el azúcar se derrita y se vuelva ámbar. No se mueva en ningún momento. Retire del fuego y vierta cuidadosamente el toffee en la bandeja de horno forrada, teniendo cuidado de cubrir la base por completo. Coloque las cuñas de manzana en tres filas en la parte superior del caramelo y espolvoree con un tercio de la ralladura de naranja. Agregue los arándanos en cualquier espacio entre las filas de manzana.", "Para el pastel, bata la mantequilla, la cáscara de naranja restante y el azúcar hasta que esté pálida y esponjosa. Tamice la harina y el bicarbonato de soda y agregue una cucharada de esto a la mezcla de mantequilla junto con un huevo. Mezcle hasta que se combine y repita el proceso hasta que se hayan usado toda la harina y los huevos. Agregue la leche y unas gotas de vainilla. Vierta en la lata de la torta y alise suavemente con una espátula. Hornee durante 40-50 minutos o hasta que un pincho insertado en el centro salga limpio. Usando guantes para hornos, coloque una rejilla de enfriamiento sobre la lata y voltee rápidamente, teniendo cuidado de no quemarse con caramelo caliente que pueda salir de la lata. Retire de la lata y reserve para enfriar completamente.", "Para la corona de caramelo, en una sartén a fuego alto agregue el azúcar y dos cucharadas de agua y cocine hasta que se forme un caramelo, sin remover. Coloque la base de una lata de torta limpia sobre una estera resistente al calor. Rocíe con cucharadas de caramelo para hacer un patrón. Deje que se seque, y luego suavemente retire y coloque en la parte superior de la torta."], "url": "www_bbc_co_uk_food_recipes_toffee_apple_upside_down_02328", "title": "Pastel boca abajo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 12 rebanadas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["15 g / ½ oz de mantequilla sin sal ablandada", "50 g / 2 oz de azúcar en polvo", "125ml / 4fl oz de crema doble", "50 g / 2 oz de tallo de jengibre, picado", "4 cucharadas / 60 ml / 2 fl oz de jarabe de la jarra de tallo de jengibre"], "method": ["Disuelva el azúcar en una sartén de fondo grueso hasta que esté completamente disuelta y se ponga marrón, formando un caramelo.", "Retire del fuego y muy cuidadosamente agregue un pomo de mantequilla.", "Batir en la crema doble. Una vez que todas las burbujas hayan desaparecido, agregue el jengibre y el jarabe picados. Regrese al fuego para disolver el azúcar caramelizado restante, revolviendo ocasionalmente.", "Enfríe ligeramente antes de servir sobre un tazón de helado de vainilla."], "url": "www_bbc_co_uk_food_recipes_toffeeandstemgingers_4138", "title": "Toffee y salsa de jengibre", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100 ml / 3½ fl oz de agua", "225g / 8oz de azúcar granulada", "30 ml / 1 fl oz de jarabe de oro", "30g / 1oz de mantequilla sin sal", "450 g / 1 lb de manzanas para cocinar, peladas, sin corazón y cortadas en rodajas", "450g / 1lb comiendo manzanas, peladas, sin corazón y cortadas en rodajas", "Harina normal 150g / 5oz", "100g / 3½oz de mantequilla sin sal", "Azúcar demerara 100 g / 3½ oz", "6 yemas de huevo de gallinas camperas", "75 g / 2½ oz de azúcar en polvo", "600ml / 1 pinta 1½fl oz de leche entera", "1 vaina de vainilla, solo semillas"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para las manzanas de caramelo, coloque el agua y el azúcar en una cacerola y llévela lentamente hasta que hierva. Reduzca el calor una vez que el azúcar se haya derretido, agregue el jarabe y la mantequilla y luego vuelva a hervir, revolviendo constantemente.", "Baje el fuego, agregue las manzanas y cocine, revolviendo suavemente, hasta que estén suaves. Coloque en un plato refractario.", "Para la migaja, frote la harina, la mantequilla y el azúcar en un tazón con los dedos hasta que la mezcla se asemeje a pan rallado. Vierta la migaja sobre la mezcla de toffee apple y colóquela en el horno para hornear por 15 minutos o hasta que esté crujiente y dorada.", "Para la crema pastelera, coloque las yemas de huevo y el azúcar en un tazón. Coloque la leche y las semillas de vainilla en una olla y deje que hierva, luego vierta en el huevo y la mezcla de azúcar. Batir hasta que esté bien combinado. Regrese la mezcla de natillas a la cacerola y caliente a fuego lento hasta que espese lo suficiente como para cubrir la parte posterior de una cuchara.", "Para servir, divida la migaja entre 4-6 platos para servir y coloque una cucharada de crema en cada uno."], "url": "www_bbc_co_uk_food_recipes_toffeeapplecrumble_87427", "title": "Toffee apple crumble", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/toffeeapplecrumble_87427_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["225g / 8oz de mantequilla sin sal", "225g / 8oz de azúcar en polvo de oro", "4 huevos de gallinas camperas", "Harina de auto crianza de 200g / 7oz", "salpicar leche entera", "1 cucharadita de tallo de jengibre (de un recipiente)", "250 g / 9 oz de manzanas para cocinar, peladas, sin núcleo, picadas", "2 cucharadas de azúcar", "150 g / 5½ oz de mantequilla", "150g / 5½oz de azúcar morena oscura", "150ml / 5½ fl oz crema doble", "100ml / 3½fl oz de leche condensada", "Calvados 50ml / 2fl oz (opcional)", "flan listo para servir"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para la esponja, bata la mantequilla y el azúcar juntos en un tazón para mezclar hasta que estén pálidos y esponjosos.", "Agriete los huevos, uno a la vez, batiendo cada huevo en la mezcla hasta que esté completamente incorporado antes de agregar el siguiente.", "Dobla la harina hasta que esté bien combinada. Agregue un chorrito de leche para aflojar la mezcla, según sea necesario. (NB: la mezcla debería ser de consistencia baja). Dobla el jengibre.", "Coloque las manzanas picadas y el azúcar en una sartén y cocínelas durante 4-5 minutos, o hasta que el azúcar se haya disuelto y burbujee y la manzana se haya ablandado.", "Para la salsa, ponga a hervir todos los ingredientes de la salsa en una sartén, revolviendo constantemente para formar una salsa suave que sea lo suficientemente espesa como para cubrir la parte posterior de una cuchara. Retirar del fuego y reservar para enfriar un poco.", "Cuchara un poco de la salsa en ocho moldes dariole. Divida la manzana cocida por igual entre los moldes, luego cubra la mezcla de esponja.", "Coloque los moldes dariole en una bandeja de tostado grande, profunda. Vierta suficiente agua hirviendo en la bandeja de asar para llegar a la mitad de los lados de los moldes dariole. (NB: Esto se conoce como baño maría). Cubra la bandeja con papel de aluminio, luego transfiérala al horno y cocínela durante 25 minutos, o hasta que la esponja haya salido y esté dorada.", "Ponga un budín de esponja en cada uno de los seis platos para servir. Rocíe cualquier salsa restante alrededor del borde de los platos. Rocíe la natilla sobre los postres de esponja."], "url": "www_bbc_co_uk_food_recipes_toffeeapplespongepud_92633", "title": "Pudín de esponja de manzana toffee", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Rinde 8 pudines", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/toffeeapplespongepud_92633_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["225g / 8oz de mantequilla", "200g / 7oz de azúcar mascabado ligero u otro azúcar moreno claro", "3 cucharadas de agua", "1 cucharada de jarabe de oro", "1 cucharada de vinagre de vino blanco", "5 claras de huevo grandes de gallinas camperas", "450 g / 1lb de azúcar en polvo", "2 cucharadas de harina de maíz", "1 cucharadita de vinagre de vino blanco", "Crema doble 500ml / 18fl oz", "75ml / 3fl oz de agua", "175g / 6oz de chocolate negro, derretido"], "method": ["Para el caramelo, coloque todos los ingredientes de caramelo en una sartén y deje que hierva.", "Coloque un termómetro de azúcar en la sartén y continúe cocinando hasta que la temperatura indique 128C / 260F, luego sumerja la base de la sartén en agua fría. Inmediatamente vierta el toffee en un recipiente de vidrio a prueba de calor frío y batir bien.", "Agregue una cucharada de agua fría y bata hasta que el caramelo se haya espesado, luego vierta en una bandeja para horno poco profunda con pergamino para hornear. Deje enfriar hasta que esté firme.", "Para pavlova, precaliente el horno a 140C / 285F / Gas 1.", "Coloque las claras de huevo en un recipiente limpio y bata hasta que se formen picos suaves cuando se quite el batidor.", "Agregue 300g / 10½oz del azúcar, una cucharada a la vez, batiendo constantemente, hasta que se formen picos rígidos cuando se quite la batidora y la mezcla parezca lisa y brillante.", "Agregue la harina de maíz y el vinagre y bata para combinar.", "Corta el caramelo en trozos. Agregue la mitad del caramelo a la mezcla de merengue y doble suavemente.", "Cubra una bandeja para hornear con papel pergamino y coloque la mezcla de merengue y toffee en la bandeja en forma redonda y grande.", "Coloque en el horno para hornear durante diez minutos, luego apague el horno y déjelo durante al menos 2-3 horas (preferiblemente durante la noche), hasta que estén crujientes pero sin color. Retire del horno y enfríe. Transfiera a un plato de servir.", "Coloque el resto de 150 g / 5 oz de azúcar en polvo y el agua en una sartén a fuego medio y deje que hierva. Reduzca el fuego y cocine a fuego lento hasta que se forme un caramelo.", "Vierta la mitad del caramelo en una bandeja para hornear forrada con pergamino para hornear y deje que se enfríe. Mantenga caliente el caramelo restante.", "Batir la crema doble hasta que se formen picos suaves cuando se quita la batidora.", "Doble las piezas restantes de caramelo, dos tercios del chocolate derretido y casi todo el caramelo caliente.", "Coloque la mezcla de crema, chocolate y caramelo en el centro del merengue.", "Rocíe con el chocolate derretido restante y el caramelo.", "Rompe el frío, coloca el caramelo en fragmentos y colócalo en el centro de la pavlova. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_toffeechocolateandca_88633", "title": "Pavlova de caramelo, chocolate y caramelo", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100g / 3½ oz de tofu firme, escurrido", "50g / 1¾oz de arroz de sushi", "25 g / 1 oz de frijoles de soja congelados", "aceite en aerosol bajo en calorías", "4 rábanos, en rodajas finas", "¼ pepino pequeño, cortado a la mitad a lo largo, sin semillas, cortado en fósforos finos", "¼ zanahoria pequeña, pelada y cortada en fósforos finos", "3 cebolletas, finamente trituradas", "1 cucharadita de semillas de sésamo tostadas", "1 cucharada de jengibre encurtido japonés, escurrido, para servir", "½ lima, ralladura finamente rallada y jugo", "1/2 cucharadita de miel", "½ cucharada de tamari o salsa de soja oscura", "½ cucharadita de vinagre de arroz", "tablero de aceite de sésamo tostado"], "method": ["Para hacer el plato de sushi, envuelva el tofu en papel de cocina, sándwich entre dos platos o tablas de cortar y pesar con unas latas de su armario. Deja escurrir por 15 minutos.", "Mientras tanto, ponga a hervir una olla grande de agua y hierva el arroz de sushi durante 8-10 minutos o hasta que esté cocido. Escurrir, colocar de nuevo en la sartén, tapar y reservar.", "Ponga a hervir una olla pequeña de agua y cocine los frijoles de soja durante 2 minutos o hasta que estén tiernos. Escurrir, refrescar bajo agua fría y dejar de lado.", "Para hacer el aderezo, ponga la ralladura de limón, jugo y miel en una olla pequeña y cocine a fuego lento durante 1 minuto. Agregue el tamari, el vinagre y el aceite de sésamo y deje a un lado.", "Corta el tofu en 1.5cm / ½ en cubos. Rocíe una sartén grande con un poco de aerosol para cocinar bajo en calorías y colóquelo a fuego medio-alto. Agregue el tofu y cocine durante 1 minuto por cada lado hasta que esté crujiente y dorado.", "Coloque el arroz en un recipiente o caja de almuerzo y mezcle el aderezo. Cubra con los frijoles de soja, rábanos, pepino, zanahoria y dos tercios de las cebolletas. Espolvoree sobre el tofu, las cebolletas restantes y las semillas de sésamo y sirva con el jengibre en escabeche o coloque en el refrigerador hasta que esté listo para comer."], "url": "www_bbc_co_uk_food_recipes_tofu_sushi_rice_bowl_69171", "title": "Tazón de sushi Tofu", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tofu_sushi_rice_bowl_69171_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["30g / 1oz de mantequilla sin sal", "2 cucharadas de aceite de oliva", "1 cebolla, finamente rebanada", "2 dientes de ajo, finamente picados", "Arroz arborio 280g / 10oz", "200ml / 7fl oz de vino blanco seco", "1,1 litros / 1 pinta 16fl oz de caldo de verduras calientes (hecho con cubos de papel)", "1 calabaza pequeña (o ½ grande) de butternut, pelada, sin semillas, cortada en cubos pequeños", "pequeñas hojas de salvia fresca, finamente cortadas", "100g / 3½ oz de parmesano (o un queso duro vegetariano similar), finamente rallado", "Mozzarella 150g / 5oz, escurrida, cortada en cubos pequeños", "30 g / 1 / oz de piñones, para servir", "sal y pimienta negra recién molida"], "method": ["Caliente la mantequilla y la mitad del aceite en una sartén a fuego medio-bajo. Agregue la cebolla y el ajo y fría por 8-10 minutos, hasta que estén suaves pero no coloreados. Agregue el arroz y fría por 1-2 minutos, revolviendo constantemente hasta que esté cubierto con aceite.", "Verter el vino y llevar a ebullición. Reduzca ligeramente el fuego hasta que el vino esté hirviendo a fuego lento, luego cocine hasta que dos tercios del vino se hayan evaporado.", "Agregue un cucharón de caldo caliente a la sartén y vuelva a hervir a fuego lento, reduciendo el calor si el líquido comienza a burbujear con demasiada fuerza, para evitar que el arroz se cocine demasiado rápido. Cuando la mayoría de las existencias se haya evaporado, agregue otro cucharón. Cocine el risotto de esta forma durante 12-15 minutos, o hasta que el arroz haya absorbido la mayor parte del caldo y el arroz esté tierno pero tenga un ligero mordisco.", "Mientras tanto, calentar el aceite restante en una sartén a fuego medio y freír y la calabaza por 10-12 minutos, volteando regularmente, hasta que esté tierno y dorado por todas partes.", "Mezcle la salvia, la calabaza, el parmesano y la mozzarella en el risotto. Apague el fuego, deje la sartén al fuego y deje que el queso se derrita. Sazonar, al gusto, con sal y pimienta.", "Mientras tanto, caliente una sartén seca a fuego medio. Agregue los piñones y las tostadas durante 1-2 minutos, hasta que estén doradas. Agitarlos en el risotto y servir."], "url": "www_bbc_co_uk_food_recipes_tom_kerridges_butternut_56661", "title": "Risotto de calabaza sabrosa y salvia de Tom Kerridge", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tom_kerridges_butternut_56661_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Tofu semirresistente de 400 g / 14 oz, enjuagado y escurrido, rallado", "1 cebolleta pequeña, solo en la parte blanca, finamente picada", "2 zanahorias, finamente ralladas", "1 calabacín, rallado", "50g / 2oz de harina", "2-3 ramitas de tomillo fresco", "100g / 3½oz de pan rallado fino seco", "sal y pimienta negra recién molida, al gusto", "aceite vegetal, para freír", "100g / 3½ oz de azúcar", "250g / 9 oz de arándanos frescos o congelados", "100ml / 3½fl oz de jugo de naranja fresco", "1 naranja, ralladura finamente rallada solamente (opcional)"], "method": ["Para hacer las croquetas de tofu, use sus manos para mezclar todos los ingredientes de la croqueta. El resultado debe ser una masa suave. Agregue la harina para hacer que se mantenga unida, y sabor a gusto con tomillo, sal y pimienta.", "Divida la masa en 12 hamburguesas, aplánelas y fría en lotes por 5 minutos en cada lado, teniendo cuidado al girarlas.", "Colóquelos uno al lado del otro en un plato pequeño a prueba de horno para recalentarlos en el horno cuando sea necesario (aunque serán menos crujientes, pero no menos deliciosos, si lo hace). Si tiene la intención de congelarlos, déjelos enfriar completamente, luego cubra antes de hacerlo.", "Para la salsa de arándanos, agregue todos los ingredientes en una sartén y cocine suavemente durante 10-15 minutos, hasta que los arándanos se ablanden y estallen en sus pieles y la salsa se espese.", "Sirva las croquetas de tofu con la salsa de arándanos al lado."], "url": "www_bbc_co_uk_food_recipes_tofucroquetteswithcr_73354", "title": "Croquetas de tofu con salsa de arándano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 12 croquetas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tofucroquetteswithcr_73354_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["½ bloque de tofu firme, escurrido", "¼ cucharadita de hojuelas de chile seco", "pizca de sal", "1 pequeño racimo de tomillo fresco, hojas recogidas", "2 hojas de pasta de filo lista para usar, cortadas en cuadrados de 15cm / 6 pulgadas", "1 huevo de gallinas camperas, golpeado", "1 cucharadita de semillas de sésamo", "aceite de oliva, a llovizna"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Coloque los copos de chile seco, la sal y el tomillo en un bol. Agregue el tofu y mezcle para cubrir uniformemente.", "Cepille las dos hojas de hojaldre con el huevo batido.", "Divida el tofu entre las dos hojas, colóquelo en el centro de cada hoja, luego doble los bordes del filo por todos lados para crear dos parcelas.", "Cepillar todo con huevo y espolvorear con semillas de sésamo, luego colocar en una bandeja para hornear y colocar en el horno para hornear durante cinco minutos, o hasta que estén doradas.", "Retire y coloque sobre un plato calentado y rocíe con aceite de oliva para servir."], "url": "www_bbc_co_uk_food_recipes_tofuinfilopastry_80572", "title": "Tofu en hojaldre", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500 g / 1 libra de carne picada 2 oz", "salpicar aceite vegetal", "100g / 3½oz de tocino rayado ahumado, cortado en cubitos", "1 cebolla, finamente picada", "2 tallos de apio, cortados, en rodajas finas", "2 zanahorias, finamente cortadas en cubitos", "2 dientes de ajo rallados", "1 hoja de laurel", "3-4 cucharadas de vinagre de vino tinto", "1 cucharadita de azúcar demerara", "1 cucharada de orégano seco", "400g de tomates cortados en lata", "300ml / 10½fl oz de caldo de res (hecho de cubos de carne)", "150g / 5oz botón setas, descuartizado", "sal y pimienta negra recién molida", "400g / 14oz de espagueti seco", "queso parmesano rallado, para adornar (opcional)"], "method": ["Precaliente el horno a 190C / 180C Fan / Gas 5.", "Coloque la carne picada en un colador y enjuague bajo el grifo frío para separarlo en trozos más pequeños. Escurra bien y seque con papel de cocina.", "Transfiera la carne picada a una bandeja de asar y tueste durante 35-60 minutos, o hasta que esté completamente crujiente y dorado. Esto intensifica el sabor y lo ayuda a absorber los ingredientes de la salsa. Drene la grasa.", "Caliente el aceite en una cazuela grande de base pesada a fuego medio. Agregue el tocino y fría por 4-5 minutos, revolviendo de vez en cuando, hasta que la grasa se derrita y el tocino comience a dorarse.", "Agregue la cebolla, el apio, las zanahorias, el ajo y la hoja de laurel y cocínelos durante 4-5 minutos, o hasta que empiecen a ablandarse.", "Agregue el vinagre, luego el azúcar y el orégano. Agregue la carne picada cocida, los tomates, el caldo y los champiñones. Revuelva bien y lleve a ebullición, luego reduzca el fuego y cocine a fuego lento durante 45-60 minutos, revolviendo ocasionalmente, hasta que espese. Sazone, al gusto, con sal y pimienta, luego reserve.", "Mientras tanto, cocine los espaguetis en una sartén con agua hirviendo y salada, revolviendo a menudo con un tenedor, hasta que estén tiernos (al dente). Escurrir inmediatamente en un colador, sacudiéndolo.", "Para servir, gire los espaguetis en 4 platos. Cuchara sobre la salsa boloñesa y decorar con parmesano, si lo desea."], "url": "www_bbc_co_uk_food_recipes_tom_kerridges_spaghetti_51800", "title": "Espagueti boloñés de Tom Kerridge", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tom_kerridges_spaghetti_51800_16x9.jpg", "isVegetarian": false, "recommendations": 0}]