[{"ingredients": ["50 g / 2 oz de cacao en polvo", "6 cucharadas de agua hirviendo", "3 huevos de gallinas camperas", "4 cucharadas de leche", "Harina de 175g / 6oz de auto crianza", "1 cucharada de polvo de hornear redondeada", "100 g / 4 oz de pasta para untar o mantequilla blanda", "300 g / 10 oz de azúcar en polvo natural", "150 g / 5 oz de chocolate negro, roto en pequeños trozos", "150ml / 5fl oz de crema doble", "3 cucharadas de mermelada de albaricoque", "azúcar glas, al polvo"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4 y engrase y forre dos latas tipo sándwich de 20 cm con papel para hornear.", "Coloque el polvo de cacao y el agua hirviendo en un tazón grande y mezcle bien para hacer una pasta. Agregue los ingredientes restantes y bata nuevamente hasta que se combinen. Esto también se puede hacer en un procesador de alimentos, pero tenga cuidado de no batir demasiado. Divida la mezcla de la torta entre las latas preparadas. Hornee durante unos 25-30 minutos, o hasta que estén bien levantados y encogiéndose lejos de los lados de la lata.", "Mientras tanto, para la formación de hielo y el relleno, mida el chocolate y la crema juntos en un recipiente y coloque el recipiente sobre una fuente de agua hirviendo durante aproximadamente 10 minutos, o hasta que se derrita. Revuelva de vez en cuando. Poner a un lado y dejar hasta que esté frío y casi listo.", "Una vez horneado, retire los pasteles del horno y permita que se enfríen por completo. Extiende la parte superior de cada pastel con mermelada de albaricoque. Llena los pasteles con la mitad del glaseado y extiende el resto encima. Dibuja formas grandes en \"S\" sobre la torta con un cuchillo palatte para dar un efecto de remolino. Polvo con azúcar glas y servir en rodajas."], "url": "www_bbc_co_uk_food_recipes_chocolate_cake_48307", "title": "Bizcocho de chocolate", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_cake_48307_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["10 vainas de cardamomo", "50g / 1¾oz de azúcar en polvo de oro", "35g / 1 oz azucarada clara y suave", "2 naranjas, solo cáscara", "170g / 6oz de mantequilla sin sal, suavizada", "Harina normal de 245g / 9oz", "pizca de sal", "50g / 1¾oz de almendras copos tostadas, finamente picadas", "200 g / 7 oz de chocolate negro (preferiblemente naranja y almendra con sabor) finamente picado", "azúcar glas, para rociar"], "method": ["Retire las semillas de las vainas de cardamomo y muela en un almirez y mortero. Poner en un bol con los azúcares y la ralladura de naranja. Apílalas con la parte posterior de una cuchara para que los aceites entren en el azúcar y puedas oler la naranja y el cardamomo.", "Agregue la mantequilla ablandada y mezcle hasta que estén combinados. Agregue la harina y la sal y luego mezcle con las manos hasta que solo se combinen (no sobre-trabaje la masa). Divida en dos pedazos.", "Agregue la mitad de las almendras y 50g / 1¾oz del chocolate a una pieza de masa. Mézclalo con tus manos.", "Aplane los dos pedazos de masa, envuélvalos en una película adhesiva y colóquelos en la nevera durante 20-30 minutos.", "Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Sobre una superficie ligeramente enharinada, extender ambas piezas de masa a 1,25 cm / ½ pulgada de grosor. Cortar galletas con estrella, corazón u otros cortadores de Navidad.", "Transfiera los bizcochos a una bandeja de horno forrada, dejando un pequeño espacio entre ellos, y ponga en el congelador por 10 minutos.", "Hornee por 20-25 minutos hasta que estén doradas. Dejar enfriar sobre una rejilla.", "Espolvorear el shortbread de chocolate y almendras con azúcar glas.", "Suavemente derrita el chocolate restante en un recipiente a prueba de calor sobre una olla de agua hirviendo a fuego lento.", "Sumerja las esquinas o los lados de la manteca de naranja en el chocolate y luego espolvoree con las almendras tostadas restantes. Coloque sobre una hoja de silicona o papel para hornear para establecer. Guárdelos en un frasco de vidrio o envuélvalos en plástico transparente y conviértelos en regalos."], "url": "www_bbc_co_uk_food_recipes_chocolate_cardamon_78064", "title": "Torta dulce de naranja de cardamomo de chocolate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 8-12 galletas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 100 g / 3½ oz", "50 g / 1¾oz de cacao en polvo", "¾ cucharadita de polvo de hornear", "pizca de sal", "300 g / 10% C2% BDoz% 20dark% 20chocolate,% 20at% 20least% 2070 %% 20cocoa% 20solids", "250g / 9oz de mantequilla", "250g / 9 oz de azúcar granulada", "4 huevos de gallinas camperas", "100 g / 3½ oz de avellanas, más o menos picadas", "Extensión de avellana de chocolate de 100 g / 3½ oz (opcional)", "Licor de avellana 50ml / 2fl oz (opcional)"], "method": ["Precalentar el horno a 170 ° C / 150 ° Ventilador / Gas 3. Cubra una lata de brownie de lados rectos de 30x20 cm / 12 x 8 pulgadas con papel de aluminio o pergamino antiadherente.", "Tamiza la harina, el cacao y el polvo de hornear en un bol y agrega una buena pizca de sal. Rompa 250 g / 9 oz del chocolate en un recipiente resistente al calor y póngalo sobre una olla de agua a fuego lento, asegurándose de que el recipiente no toque el agua. Deje que se derrita, revolviendo regularmente.", "Cuando el chocolate se haya derretido, retíralo y déjalo enfriar ligeramente. Cortar el resto del chocolate y reservar.", "Batir la mantequilla y el azúcar juntos en un bol hasta que estén muy suaves y esponjosos. Agregue los huevos, uno a la vez, luego vierta el chocolate. Mezcle completamente, luego agregue un tercio de la mezcla de harina. Revuelva para combinar, luego repita con los otros dos tercios de harina.", "Agregue la mitad de las avellanas y todo el chocolate picado reservado y revuelva para combinar, luego raspe la mezcla en la lata preparada.", "Batir la mezcla de chocolate y el licor de avellana juntos (si se usa), hasta que tenga una pasta suave y apta para servir. Haga pequeños pocillos en la mezcla de brownie y agregue cucharadas de la mezcla.", "Espolvorea sobre las avellanas restantes y presiona ligeramente hacia abajo. Hornee en el horno precalentado durante unos 30 minutos, y pruebe después de 25 minutos. Cuando terminen los brownies, un pincho de madera debe salir con unas migas unidas, no debe estar mojado, pero tampoco debe estar completamente limpio.", "Dejar enfriar en la lata. Si puede aguantar la espera, coloque la lata de brownie en la nevera para que descanse durante la noche antes de cortarla; esto los ayudará a establecer una consistencia que no sea demasiado parecida a una torta. Cortar en cuadrados y almacenar en una lata hermética."], "url": "www_bbc_co_uk_food_recipes_chocolate_brownies_83180", "title": "Chocolate avellana brownies extendidos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_brownies_83180_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["300 g / 10½ oz de mantequilla sin sal, más la perilla para engrasar", "300 g / 10% C2% BDoz% 20dark% 20chocolate% 20 (% mínimo 2070%% 20cocoa% 20solids)", "450 g / 1lb de azúcar en polvo", "5 huevos grandes de gallinas camperas", "Harina normal de 200g / 7oz", "1 cucharadita de sal", "1 x 225g / 8oz tarro de cerezas de cóctel marrasquino, escurridas, picadas", "Avellanas blanqueadas de 150 g / 5½ oz, picadas", "200g / 7oz de chocolate blanco, picado en trozos gruesos", "15 cerezas frescas", "azúcar en polvo, para quitar el polvo"], "method": ["Precaliente el horno a 180C / 160C ventilador / 350F / Gas 4. Engrase y forme la parte inferior y los lados de una lata para hornear de 30x23 cm / 12x9in con mantequilla.", "Pon el chocolate negro y la mantequilla en una olla pequeña y calienta hasta que se derrita. Retirar del fuego y dejar enfriar un poco.", "En un tazón grande, bata el azúcar y los huevos juntos hasta que estén livianos y espumosos.", "En un recipiente aparte, combine la harina con la sal.", "Una vez que el chocolate se haya enfriado un poco, agréguelo a la mezcla de azúcar y huevo y mezcle hasta que esté combinado. Poco a poco agregue la mezcla de harina y sal, mezclándose bien entre cada adición.", "Agregue las cerezas de cóctel, las avellanas y 150 g / 5½ oz del chocolate blanco. Mezcle hasta que esté distribuido uniformemente, luego vierta en la lata engrasada y forrada y alise la mezcla en las esquinas.", "Derretir el resto del chocolate blanco de 50g / 1¾oz y colocar gotas de chocolate distribuidas uniformemente encima de la mezcla de brownie. Use un palillo de cóctel para hacer girar las gotas de chocolate en la mezcla. Coloque una cereza fresca en la base de cada remolino.", "Coloque en el estante del medio en el horno y hornee por aproximadamente 35-40 minutos, o hasta que esté listo. Tenga cuidado de no sobrepasar los brownies.", "Dejar enfriar en la lata durante 10 minutos, luego retirar cuidadosamente y colocar en la rejilla para enfriar. Cuando se enfría se corta en 12 a 16 piezas y se coloca en un montón de fudgy bondad en un bonito plato generosamente espolvoreado con azúcar glas."], "url": "www_bbc_co_uk_food_recipes_chocolate_cherry_and_80567", "title": "Brownies de chocolate, cereza y avellana", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 12-16 brownies", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal 150g / 5½ oz", "½ cucharadita de sal marina fina", "½ cucharadita de bicarbonato de soda", "110 g / 4 oz de mantequilla sin sal", "85g / 3oz azúcar marrón claro suave", "1 cucharadita de pasta de vainilla o extracto", "1 huevo grande de gallinas camperas", "170 g / 6 oz de chocolate negro chips", "helado o, crème fraiche, para servir"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Mida la harina, la sal y el bicarbonato de soda en un recipiente, bifurcando para mezclar.", "Con una batidora eléctrica, o con la mano, bata la mantequilla y el azúcar hasta que tenga una mezcla ligera y cremosa, luego agregue la pasta de vainilla o el extracto y el huevo, batiendo nuevamente para incorporar.", "Doble suavemente la mezcla de harina, luego, una vez que esté todo mezclado, doble las chispas de chocolate.", "Divida la masa entre 6 moldes (necesitará alrededor de 4½ cucharadas de masa para cada uno). Usando una espátula pequeña o la parte posterior de una cucharilla, extienda la mezcla para cubrir la parte inferior de los moldes y alise las partes superiores.", "Coloque los moldes en una bandeja para hornear y hornéelos en el horno de 13 a 15 minutos. Seguirán siendo bastante pegajosos por dentro, pero la parte superior estará dispuesta, y deberían ser dorados en los bordes y comenzar a desprenderse de los costados de los moldes.", "Deje que se enfríe durante 5-10 minutos antes de servir. Puede poner una cucharada de helado en la parte superior de cada uno o servir con crema o crema fresca en el lado. Se establecerán a medida que se enfríen, así que no pierdas el tiempo ahora."], "url": "www_bbc_co_uk_food_recipes_chocolate_chip_cookie_83680", "title": "Macetas de masa de galletas de chispas de chocolate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_chip_cookie_83680_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 cucharadas de agua", "4 cucharadas de leche entera", "50 g / 2 oz de mantequilla sin sal, a temperatura ambiente", "1 cucharadita de azúcar en polvo", "Una pizca de sal marina", "Harina normal de 100g / 4oz", "4 huevos medianos de granja, golpeados", "20 g /% C2% BEoz% 20unsweetened% 20chocolate,% 20100 %% 20cocoa% 20solids% 20", "450 g / 1 libra de crema de pastelería (crème patissière), a temperatura ambiente (consulte la sugerencia de la receta superior a continuación)", "1 cucharada de cacao en polvo fuerte, tamizado", "200g / 7oz de glaseado de fondant blanco", "1 cucharada de cacao en polvo", "1-2 cucharaditas de agua"], "method": ["Precalentar el horno a 170 C / 325 F / Gas 3.", "Para la pastelería choux, coloca el agua, la leche, la mantequilla, el azúcar y la sal en una cacerola mediana a fuego alto y lleva la mezcla a ebullición.", "Retire la sartén del fuego y, con una cuchara de madera, bata rápidamente la harina hasta que la mezcla esté completamente suave.", "Baje el fuego a medio, regrese la sartén a la placa y cocine durante aproximadamente un minuto, batiendo todo el tiempo, o hasta que la mezcla se desprenda del borde de la sartén.", "Retire la sartén del fuego y gradualmente bata los huevos hasta que tenga una consistencia suave y suave. (Usted está buscando que la mezcla simplemente se suelte de la cuchara, no se salga de ella, puede que no necesite todo el huevo para llegar a esta etapa).", "Transfiera la pasta a una manga pastelera grande equipada con una boquilla estriada de 1,5 cm / ½ pulgada y deje que la mezcla se enfríe durante unos cinco minutos en la bolsa para que se endurezca un poco antes de comenzar la tubería.", "Alinee una bandeja grande para hornear con papel y tubo a prueba de grasa en 12 éclairs, cada uno de aproximadamente 15 cm de largo. Alternativamente, para obtener un acabado más profesional y uniforme, pase cuatro filas de pasteles, cada una de aproximadamente 36 cm de largo, sobre una bandeja antiadherente y congele. Corte las tiras congeladas en tres y descongele y cocine como se indica a continuación, o cocínelas congeladas y agregue cinco minutos al tiempo de cocción.", "Hornee los éclairs en el horno precalentado durante 30-35 minutos o hasta que estén dorados, luego transfiéralos a un estante y déjelos enfriar.", "Para el relleno, derrita el chocolate en un tazón sobre una fuente de agua hirviendo. No permita que el fondo del recipiente toque el agua o el chocolate se quemará.", "Vierta el chocolate derretido en la crema pastelera, mezcle el cacao en polvo y mezcle hasta lograr una consistencia suave. Podría enfriar la mezcla en este punto durante 30 minutos, luego batir nuevamente antes de llenar los éclairs, para darle una sensación más cremosa en la boca al relleno.", "Cuando esté listo para llenar los éclairs, transfiera el relleno a una manga pastelera equipada con una boquilla de 0.5cm / ¼ in. Perfora la parte inferior de cada éclair cuatro veces con la punta de la boquilla, echando suavemente un poco del relleno en el éclair mientras lo haces.", "Para el glaseado, caliente suavemente el fondant en una sartén pequeña a fuego lento hasta que alcance la temperatura corporal.", "Agregue el cacao en polvo y suficiente agua para hacer una pasta suave, luego transfiera a una manga pastelera equipada con una boquilla de 1,5 cm / ½ pulgadas.", "Pase el glaseado sobre la parte superior de cada éclair, retire cualquier exceso con la parte posterior de su dedo, luego colóquelo en el refrigerador para que el glaseado se fije antes de servir."], "url": "www_bbc_co_uk_food_recipes_chocolate_clairs_03600", "title": "Eclairs de chocolate", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Hace alrededor de 12 rayos", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_clairs_03600_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["250 g / 9 oz% 20dark% 20chocolate% 20 (at% 20least% 2070% 20cocoa% 20solids)", "250g / 9oz de mantequilla sin sal", "1 cucharada de café instantáneo de buena calidad", "Harina de auto aumento de 150g / 5oz", "½ cucharadita de bicarbonato de soda", "80g / 3oz de cacao en polvo", "500 g / 1 lb 2 oz de azúcar en polvo", "4 huevos de gallinas camperas", "2 cucharadas de aceite de girasol", "125ml / 4fl de leche en oz", "Harina normal 150g / 5oz", "100 g / 3% C2% BDoz% 20chocolate% 20 (at% 20least% 2070 %% 20cocoa% 20solids)", "50g / 2oz de mantequilla sin sal", "6 cucharadas de crema doble", "50g / 2oz de azúcar glasé"], "method": ["Precalentar el horno a 170C / 340F / Gas 3½. Engrase un molde para pastel de 24 cm / 10 pulgadas de diámetro y cúbralo con papel para hornear.", "Para la torta, coloque el chocolate, la mantequilla y el café en un recipiente colocado sobre una olla hirviendo a fuego lento, asegurándose de que el recipiente no toque el agua.", "Revuelva hasta que se derrita y suavice, luego retírelo del fuego y déjelo a un lado.", "Mezcle la harina, el bicarbonato de soda y el cacao en un tazón grande. Agregue el azúcar y haga un pozo en el medio.", "Agregue los huevos batidos, el aceite y la leche en el pozo y revuelva suavemente para combinar todos los ingredientes.", "Agregue la mezcla de chocolate y mantequilla y revuelva para combinar. La mezcla estará húmeda y descuidada.", "Vierta en la lata de hornear preparada y cocine durante una hora o hasta que esté firme.", "Deje que se enfríe completamente antes de salir de la lata.", "Para la guinda, coloque todos los ingredientes en una sartén. Calienta suavemente y revuelve hasta que quede suave.", "Una vez que el pastel y el glaseado se hayan enfriado, extienda la guinda sobre el pastel con un cuchillo de cocina."], "url": "www_bbc_co_uk_food_recipes_chocolate_coffee_cake_72340", "title": "Pastel de chocolate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 1 torta", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["125g / 4½oz de mantequilla, ablandada, más o menos picada", "1 yema de huevo de gallinas camperas", "60g / 2¼oz de azúcar morena suave", "1 cucharada de miel", "pizca de sal", "Harina normal 130g / 4¾oz", "45 g / 1½ oz de cacao en polvo", "pizca de polvo de hornear", "100g / 3½oz de chocolate blanco, roto en pedazos"], "method": ["Precaliente el horno a 200C / 180C Fan / Gas 4 y alinee una bandeja de horno con papel de hornear.", "En un tazón grande, bata la mantequilla, la yema de huevo, el azúcar, la miel y la sal hasta que estén suaves.", "Gradualmente tamice la harina, el cacao en polvo y el polvo de hornear y mezcle hasta que quede suave, pero tenga cuidado de no trabajar en exceso la mezcla. Agregue el chocolate blanco y combine.", "Haga rodar la masa en un cilindro de aproximadamente 3 cm / 1¼ pulgada de diámetro. Envuelva en papel para hornear y refrigere por 45 minutos, o hasta que esté firme.", "Corta el rollo en rebanadas de 5 mm / ¼ en trozos y colócalo en la bandeja para hornear, dejando un espacio entre las galletas.", "Hornea por 15 minutos; aún deberían estar un poco blandos cuando los saque del horno. Dejar enfriar un poco antes de servir."], "url": "www_bbc_co_uk_food_recipes_chocolate_cookies_14418", "title": "Galletas dobles de chocolate", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Hace 10-12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200g / 7oz% 20dark% 20chocolate% 20at% 20least% 2070 %% 20cocoa% 20solids", "75g / 3oz de mantequilla", "225g / 8oz de azúcar mascabado ligero", "2 huevos de gallinas camperas", "extracto de vainilla", "50g / 2oz de avellanas peladas", "150g / 5¼ oz de harina de auto crianza", "puñado de cerezas frescas y frambuesas, para servir"], "method": ["Precalienta el horno a 180 ° C / 350 ° F / Gas 4. Prepara el chocolate en trozos en un pequeño recipiente de vidrio a prueba de calor. Coloque el recipiente sobre una olla pequeña de agua hirviendo, y la base del recipiente no toque el agua. Permita que el chocolate se derrita. No tengas la tentación de removerlo, solo que ocasionalmente empujes el chocolate sin derretir dentro del chocolate líquido para alentarlo a que se derrita. Apague el fuego tan pronto como se derrita el chocolate.", "Bata la mantequilla y el azúcar en un procesador de alimentos hasta que quede suave y cremoso. Rompa los huevos y el extracto de vainilla en un tazón pequeño o jarra, mezcle lo suficiente como para romper los huevos, luego agregue la mezcla gradualmente a la mantequilla y el azúcar, batiendo constantemente. Vale la pena raspar los lados del tazón con una espátula de goma de vez en cuando para asegurar una mezcla completa. Agregue el chocolate derretido y continúe mezclando.", "Tueste las avellanas en una sartén poco profunda hasta que estén doradas, sacudariendo regularmente para que se coloreen uniformemente. Triture las nueces en trozos gruesos usando un mortero y una mano de mortero para la textura de la grava, luego retire la mitad y continúe moliendo la otra mitad hasta que se asemeje a migas de pan finas. Agregue la harina y ambas texturas de nueces a la mezcla de galletas. Deje de latir tan pronto como todo esté combinado.", "Coloque cucharadas grandes y apiladas de la mezcla sobre una bandeja para hornear forrada con pergamino para hornear. Deberías obtener doce galletas grandes. La mezcla está bien para sentarse durante unos minutos si los está cocinando en dos lotes. No tengas la tentación de aplanar las galletas, lo harán en el horno de todos modos.", "Hornee las galletas por 10-12 minutos. Las cookies se habrán extendido y serán muy suaves al tacto. Retírelos del horno y déjelos a un lado para que se enfríen un poco. Tan pronto como se enfríen lo suficiente como para moverse sin romperse, deslice una cuchilla de paleta debajo y levante cuidadosamente sobre una rejilla de enfriamiento. Sirva con un puñado de cerezas y frambuesas."], "url": "www_bbc_co_uk_food_recipes_chocolate_cookies_with_95245", "title": "Galletas de chocolate con fruta escarlata", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 12 galletas grandes", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_cookies_with_95245_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["5 barras de chocolate de turrón caramelo, como barras de Mars, picadas", "150g / 5oz de mantequilla, picada, más extra para engrasar", "Arroz con 100 g / 3½ oz, como Rice Krispies", "75g / 3oz de chocolate puro"], "method": ["Engrase una lata cuadrada de 20 cm / 8 pulgadas con mantequilla.", "Suspenda un recipiente grande a prueba de calor sobre una fuente de agua hirviendo a fuego lento (no permita que la base del recipiente toque el agua).", "Agregue las barras de Mars y la mantequilla al tazón y revuelva hasta que se derrita, suave y bien combinado. La mezcla se cuajará al principio, pero continúe removiendo (o use un batidor) y eventualmente se volverá suave.", "Retire el recipiente del fuego, agregue el arroz Krispies y doble hasta cubrir la mezcla de chocolate.", "Coloque la mezcla en la lata preparada y presione hacia abajo para formar una capa uniforme, empujando la mezcla hacia las esquinas y los lados de la lata. Dejar de lado para enfriar.", "Mientras tanto, suspenda otro recipiente resistente al calor sobre la fuente de agua hirviendo a fuego lento (no permita que la base del recipiente toque el agua). Derrita el chocolate en el tazón, luego rocíe o unte sobre la torta crujiente de chocolate enfriado. Aparta para enfriar y endurecer.", "Enfríe el pastel de chocolate crujiente en la nevera hasta que esté listo, preferiblemente durante la noche. Cortar en cuadrados mientras aún está en la lata, luego sacar de la lata, amontonar en un plato y servir."], "url": "www_bbc_co_uk_food_recipes_chocolate_crispy_cakes_25316", "title": "Pasteles de chocolate crujientes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Hace 16-20", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_crispy_cakes_25316_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["125 g / 4½ oz de cacao en polvo tamizado", "6 huevos grandes de gallinas camperas", "100ml / 3½ fl oz de leche", "Harina de auto aumento 350g / 12oz", "1 cucharada de levadura en polvo", "200 g / 7 oz de mantequilla ablandada, más extra para engrasar", "Azúcar en polvo de 550 g / 1 lb 2 oz", "400g / 14oz de chocolate blanco", "300 ml / 10 fl oz doble crema", "300g / 10½oz de queso crema con toda su grasa", "6 cucharadas de mermelada de albaricoque", "200 g / 7 oz% 20plain% 20chocolate% 20 (70%% 20cocoa% 20solids)", "200 g / 7 oz% 20plain% 20chocolate% 20 (68-70%% 20cocoa% 20solids)"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4 (ventilador 160 ° C). Engrase y forme dos latas de sándwich de 20cm / 8 pulgadas de profundidad, una lata de 15cm / 6 pulgadas de torta y una lata de torta de 10 cm / 4 pulgadas con pergamino para hornear.", "Para las tortas de chocolate, mezcle el cacao en polvo y 200 ml / 7 fl oz de agua hirviendo en un tazón grande. Agregue los ingredientes restantes de la torta y bata hasta que la mezcla se haya convertido en una masa suave y espesa.", "Divida la mezcla de la torta entre las latas preparadas, llenando las latas del bocadillo hasta la mitad y las dos latas del pastel dos tercios llenas. Nivele las superficies.", "Coloque las cuatro latas en el estante del medio del horno precalentado y cocine las latas de sándwich durante unos 25-30 minutos, el molde de torta de 10cm / 4in durante 35-40 minutos y el pastel de 15cm / 6in durante 45-50 minutos, o hasta que esté bien -riso y la parte superior de los pasteles vuelven hacia atrás cuando se presiona ligeramente con un dedo. (Si las latas no caben en el mismo estante, coloque la torta de 15 cm en el estante superior y muévala al estante del medio lo antes posible; esto puede reducir ligeramente el tiempo de cocción). Deje enfriar en las latas. durante unos minutos y luego colóquelo sobre una rejilla de alambre, retire el pergamino y deje que se enfríe por completo.", "Para el ganache de chocolate blanco, divide el chocolate blanco en pedazos. Calentar la crema en una sartén hasta que esté lo suficientemente caliente como para derretir el chocolate. Coloque las piezas de chocolate en la crema y revuelva hasta que se hayan derretido.", "Retirar del fuego y dejar enfriar hasta que esté frío como una piedra. Batir el queso crema en un tazón para ablandarlo, luego gradualmente batir en la mezcla de crema de chocolate fría. Es posible que deba dejar de lado la mezcla en la nevera durante 15 minutos para que se espese.", "Para ensamblar, corte los pasteles de 15cm / 6in y 10cm / 4in por la mitad horizontalmente y sándwalos junto con algo del ganache de chocolate blanco. Coloque los pastelitos de 20cm / 8 pulgadas junto con la ganache de chocolate blanco y apile los pasteles uno encima del otro con el pastel de 10cm / 4 pulgadas en la parte superior, los pasteles de 15cm / 6 pulgadas en el centro y el pastel de 15cm / 6 pulgadas en El fondo. Deja de lado el resto del ganache.", "Caliente la mermelada de albaricoque en una sartén pequeña y cepíllela sobre los pasteles apilados. Con una espátula, extiende el resto de la ganache de chocolate blanco sobre los pasteles para cubrir. Si su cocina está caliente, es posible que deba colocar los pasteles en el refrigerador para permitir que se fije el ganache.", "Para los collares de encaje de chocolate, rompa 150 g / 5½ oz del chocolate normal en un recipiente colocado sobre una fuente de agua hirviendo. Revuelva hasta que el chocolate alcance una temperatura de fusión de 47C / 115F (use un termómetro de cocina para verificar). Retire el recipiente del fuego, agregue los 50 g / 1¾ oz restantes de chocolate y revuelva hasta que el chocolate se haya enfriado a 31C / 90F.", "Corta dos tiras de papel o acetato a prueba de grasa de 10 cm / 4 pulgadas de ancho y lo suficientemente largas como para envolver las tartas grandes y medianas. (Necesitarán tener aproximadamente 10x55cm / 4x22 pulgadas para la media torta y aproximadamente 10x70cm / 4x28 pulgadas para la torta grande). Coloque las tiras en una superficie de trabajo.", "Vierta el chocolate en una manga pastelera equipada con una boquilla de escritura y deje que el chocolate se caiga de la bolsa mientras gira hacia arriba y hacia abajo las tiras de grasa para crear un efecto de encaje. (No se preocupe si el chocolate cae fuera de las tiras de papel, solo asegúrese de mover las tiras de papel antes de colocarlas para que no se peguen a la superficie de trabajo). Deje que se enfríe hasta que esté firme y lo suficientemente firme como para envolver la base y la capa intermedia de la torta dejando el acetato encendido (aproximadamente 15 minutos).", "Deje que fragüe por completo (aproximadamente una hora) antes de quitar el papel de acetato o de grasa. No se sienta tentado a colocar los collares de chocolate en el refrigerador, ya que esto hará que el chocolate se torne opaco y no brille cuando retire el papel. Decora el exterior de las tortas inferiores y medias con los collares de encaje de chocolate.", "Para los rizos de chocolate, rompa el chocolate en un recipiente colocado sobre una fuente de agua hirviendo. Revuelva hasta que el chocolate se derrita y luego vierta sobre una superficie fría de mármol o granito. Deje que se enfríe hasta que esté listo. Con una rebanadora de queso, corta suavemente desde la parte superior del chocolate hasta la parte inferior, para crear rizos de chocolate. Espolvorea los rizos sobre el nivel superior del pastel."], "url": "www_bbc_co_uk_food_recipes_chocolate_creation_12531", "title": "Creación de chocolate", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Rinde 1 torta de tres niveles", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_creation_12531_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["150g / 5½oz de harina blanca fuerte", "Harina normal 150g / 5½ oz", "2 huevos medianos de rango libre", "100ml / 3½fl oz de agua fría", "250g / 9oz de mantequilla sin sal", "pizca de sal", "90 g / 3½ oz de azúcar en polvo", "3 yemas de huevo de gallinas camperas", "1 cucharada de harina de maíz", "pizca de sal", "250ml / 9fl oz de leche entera", "1 vaina de vainilla", "1 ramita de canela", "mantequilla sin sal, para engrasar", "100 g / 3½ oz de chocolate negro", "100ml / 3½ fl oz crema doble"], "method": ["Para la masa de hojaldre, ponga las harinas, los huevos y el agua en un tazón grande y mezcle suavemente todo hasta conseguir una masa dura. Transfiera la masa a una superficie ligeramente enharinada y amasarla bien durante 10 minutos. La masa debe ser apretada pero elástica, por lo que el amasado requerirá un poco de esfuerzo. Cuando la masa esté suave, forme una bola y colóquela en una bolsa de plástico en la nevera para que se enfríe durante al menos 30 minutos, pero puede dejarla toda la noche en esta etapa.", "Aplaste la mantequilla en un rectángulo de aproximadamente 1 cm / ½ de grosor y deje enfriar durante aproximadamente una hora para endurecer la mantequilla nuevamente, si es necesario.", "Estirar la masa en forma rectangular, también alrededor de 1 cm / ½ pulgada de espesor. Coloque la mantequilla en la parte superior para que cubra los dos tercios inferiores de la masa. Asegúrese de que esté posicionado ordenadamente y llegue casi a los bordes. Doble ligeramente los bordes para que la mantequilla no se escape durante el proceso de doblado y plegado, un pequeño pliegue lo hará.", "Dobla la masa expuesta en la parte superior hacia abajo más de un tercio de la mantequilla, luego corta suavemente la brocheta de mantequilla expuesta y colócala en la parte superior de la masa que acabas de doblar. Dobla la mitad inferior de la masa hacia arriba. Ahora tendrás un sándwich de dos capas de mantequilla y tres de masa.", "Gire el cuadrado de masa alrededor de un cuarto de vuelta (90 grados). Estirar la masa en un rectángulo como antes. Dobla un tercio de la masa hacia abajo y luego la parte inferior un tercio hacia arriba en la parte superior para formar un cuadrado ordenado. Esto se llama un solo turno. Coloque la masa en una bolsa de plástico para alimentos, o envuélvala en una película adhesiva y déjela enfriar en la nevera durante otra hora. Repita este proceso dos veces más, asegurándose de enfriar la masa durante una hora entre cada turno.", "Enfríe en la bolsa de plástico para alimentos o añádase la película durante la noche. Tu masa ahora está lista para usar.", "Caliente el horno a 200C / 400F / Gas 6. Aplique mantequilla a los agujeros en una lata para muffins de 12 hoyos.", "Estire la masa en un rectángulo y corte 12 discos con un cortador de 9cm / 3½ pulgadas. Presione cada disco de repostería dentro de los orificios de lata del panecillo, alinee con el pergamino para hornear, llénelo con unos cuantos granos para hornear y hornee a ciegas durante 10 a 15 minutos.", "Deje que se enfríe completamente en la lata. Deja el horno a la misma temperatura.", "Para hacer la crema pastelera, mezcle el azúcar, las yemas de huevo, la harina de maíz y la sal juntas. Ponga la leche en una sartén grande de base pesada con la vaina de vainilla (partida por la mitad, con las semillas raspadas en la leche) y la ramita de canela.", "Llevar a ebullición y luego eliminar del fuego. Pase la leche caliente por un colador para quitar la vara de canela y la vaina de vainilla, luego vierta la leche caliente sobre la mezcla de huevo y mezcle.", "Devuelve esta mezcla a la sartén. Regrese a fuego lento y cocine, revolviendo continuamente, hasta que la mezcla se espese. Retire del fuego de inmediato y bata durante un minuto para eliminar los grumos. Deja enfriar.", "Suavemente derrita el chocolate en un recipiente suspendido sobre una fuente de agua hirviendo (sin dejar que el recipiente toque el agua). Mezcle el chocolate derretido junto con la crema doble en un tazón para producir un ganache suave.", "Vierta la crema enfriada en cada una de las cajas de repostería enfriadas, llenándolas aproximadamente tres cuartas partes. Luego, usando una cucharilla, sumerja el mango de la cuchara en la ganache de chocolate caliente, y cuidadosamente mezcle un poco de chocolate en cada una de las tartas de crema.", "Vuelva a colocar las tartas en el horno precalentado y hornee por otros 10 minutos.", "Enfriar y espolvorear con azúcar glas para servir."], "url": "www_bbc_co_uk_food_recipes_chocolate_custard_tarts_55591", "title": "Tartas de crema de chocolate", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Hace 12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 paquete de 400 g / 14 oz de chocolate digestivo, triturado a finas migas", "75g / 3oz de mantequilla, derretida y enfriada ligeramente", "800 g / 1 libra de queso crema 12 oz", "azúcar glas, al gusto", "400g / 14oz% 20milk% 20chocolate% 20 (35 %% 20cocoa% 20solids),% 20or% 20you% 20can% 20use% 20a% 20mixture% 20of% 20300g / 10% C2% BDoz% 20milk% 20chocolate% 20and% 20100g / 3 % C2% BDoz% 20dark% 20chocolate% 20 (70 %% 20cocoa% 20solids)", "1 cucharadita de aceite vegetal", "100g / 3½ oz de chocolate blanco"], "method": ["Mezcle las galletas trituradas y la mantequilla juntas en un tazón con el dorso de una cuchara de madera hasta que estén bien combinadas.", "Con una cuchara, vierta la mezcla en un molde de resorte de 23 cm / 9 pulg. Y presione con fuerza hasta la base hasta que quede plano y parejo.", "Mezcle el queso crema y el azúcar glas juntos en un tazón.", "Mientras tanto, derrita el chocolate en un recipiente resistente al calor colocado sobre una fuente de agua hirviendo, asegurándose de que el fondo del recipiente no toque el agua.", "Vierta un cuarto del chocolate en una jarra, mezcle el aceite, luego póngalo a un lado y manténgalo caliente. (El chocolate también puede recalentarse en el microondas durante 20 segundos si se enfría).", "Coloque una cucharada grande de la mezcla de queso crema en el tazón de chocolate restante y revuelva hasta que esté bien combinado. Siga agregando la mezcla, una cucharada a la vez, y mezcle vigorosamente hasta que la mezcla de chocolate se vuelva suave y sedosa y haya agregado todo el queso crema.", "Vierta la mezcla en la base de la galleta y use la parte posterior de una cuchara grande para alisar la parte superior, presionando hacia abajo para que no queden espacios. Enfríe la tarta de queso en la nevera durante 20 minutos o hasta que la parte superior de chocolate comience a endurecerse. La tarta de queso también se puede colocar en el congelador durante 10 minutos para establecer.", "Derrita el chocolate blanco en un tazón resistente al calor sobre una fuente de agua hirviendo y asegúrese de que la jarra de chocolate con leche esté bien y goteando.", "Retire la tarta de queso de la nevera y vierta el chocolate con leche en la parte superior, extendiéndolo a medida que avanza hasta que la parte superior esté completamente cubierta. (Para un acabado suave, levante la tarta de queso e incline hacia adelante y hacia atrás, deje que el chocolate se vuelque y cubra el relleno de queso crema).", "Rocía líneas de chocolate blanco en la parte superior, a unos 2 cm de separación. La mejor forma de hacerlo es colocando el chocolate en una manga con una boquilla muy pequeña.", "Coloque la tarta de queso para que las líneas corran hacia usted, luego tome una barra de cóctel y arrástrela de izquierda a derecha, haciendo líneas de izquierda a derecha a 2 cm / ¾ pulg de distancia para formar una cuadrícula. Arrastre el palillo de cóctel una vez más de derecha a izquierda entre las líneas de mondadientes que acaba de hacer. Necesitarás hacer esto bastante rápido para que las líneas de chocolate sigan moqueando. Deje la tarta de queso en un lugar fresco para establecer durante aproximadamente dos horas.", "Pase un cuchillo filoso por el interior de la lata y retire cuidadosamente la torta. Sirva en rodajas con una llovizna de crema única."], "url": "www_bbc_co_uk_food_recipes_chocolate_digestive_43476", "title": "Pastel de chocolate con glaseado de chocolate blanco", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 120}, "serves": "Sirve 10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["225g / 8oz de mantequilla", "Azúcar en polvo 140g / 5oz", "1 yema de huevo de gallinas camperas", "2 cucharaditas de extracto de vainilla", "Harina normal de 250g / 9oz", "25 g / 1 oz de cacao en polvo", "pizca de sal", "100 g / 3½ oz de chocolate negro, finamente picado", "200g / 7oz% 20dark% 20chocolate% 20 (a% 20least% 2070 %% 20cocoa% 20solids),% 20finely% 20chopped% 20", "200g / 7oz de chocolate con leche, finamente picado", "200g / 7oz de chocolate blanco, finamente picado"], "method": ["Precaliente el horno a 190 ° C / 375 ° F / Gas 5. Cubra una bandeja para hornear con papel para hornear.", "Con un mezclador eléctrico portátil, bata el azúcar y la mantequilla en un tazón grande. Batir el huevo y el extracto de vainilla.", "En otro recipiente, tamice la harina, el cacao y la sal. Revuelva en la mezcla de mantequilla, luego agregue el chocolate picado.", "Enrolle cucharaditas de masa en bolas y colóquelas en la bandeja para hornear forrada a una distancia mínima de 2,5 cm. Aplanar ligeramente con la parte posterior de la cuchara.", "Hornea los bizcochos por 10 minutos. Deje que se enfríe durante un minuto en la bandeja, luego transfiéralo a una rejilla para que se enfríe por completo.", "Mientras tanto, derrita los tres tipos de chocolate por separado en un microondas (al menos un minuto). Alternativamente, derrita el chocolate picado en un recipiente suspendido sobre una olla de agua hirviendo a fuego lento (no permita que el fondo del recipiente toque el agua).", "Sumerja las galletas refrigeradas hasta la mitad en un tipo de chocolate, luego permita que el exceso se escurra antes de colocarlo en una hoja de pergamino para hornear."], "url": "www_bbc_co_uk_food_recipes_chocolate_dipped_11340", "title": "Torta de chocolate bañada en chocolate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 18 galletas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Mantequilla de 185g / 6½oz, ablandada", "185g / 6½ oz de chocolate negro", "340g / 11¾oz de azúcar en polvo", "3 huevos de gallinas camperas", "Almendras molidas 140 g / 5 oz", "Harina de auto crianza de 200g / 7oz", "250ml / 9fl oz espresso fuerte caliente, endulzado con 2 cucharadas de azúcar en polvo", "crema batida, para servir"], "method": ["Precaliente un horno asistido por ventilador a 180C / 350F / Gas 4.", "Engrase ligeramente una lata antiadherente en forma de resorte de 20cm / 8in y forre la base con papel de hornear.", "Suavemente caliente la mantequilla y el chocolate a fuego lento y revuelva hasta que se derrita.", "Batir el azúcar y los huevos hasta que estén pálidos y espesos, usando un batidor eléctrico.", "Dobla rápidamente el chocolate, las almendras y la harina en la mezcla de huevo hasta que quede suave.", "Vierta la mezcla en la lata de torta preparada y hornee en el horno durante 50 minutos a una hora, o hasta que esté firme.", "Cuando esté cocido, retire la torta del horno y déjela enfriar durante 20 minutos antes de sacarla de la lata.", "Mientras tanto, coloque el café espresso endulzado en una cacerola, lleve a ebullición y cocine a fuego lento durante un minuto hasta que esté almibarado.", "Retire el papel de hornear del pastel y colóquelo en un plato para servir.", "Sirva la torta caliente con una cucharada de crema batida y un chorrito de salsa de café exprés caliente."], "url": "www_bbc_co_uk_food_recipes_chocolate_espresso_cake_56805", "title": "Pastel de chocolate espresso", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharadita de cacao en polvo", "1 cucharadita de harina común", "150g / 5oz% 20plain% 20chocolate,% 20minimum% 2070 %% 20cocoa% 20solids,% 20broken% 20into% 20pieces", "150 g / 5 oz de mantequilla, más extra para engrasar", "3 huevos grandes de gallinas camperas", "3 yemas de huevo grandes de gallinas camperas", "50 g / 2 oz de azúcar en polvo", "2 limas, ralladura fina solamente", "25g / ¾oz de harina de auto crianza", "225g / 8oz de mermelada de lima", "1 lima, ralladura y jugo, más 1 lima, solo jugo", "300ml / 10½ fl oz de leche de coco", "100ml / 3½ fl oz crema doble", "3 yemas de huevo de gallinas camperas", "2 cucharadas de harina de maíz", "crema coagulada, crema fresca o helado de vainilla, para servir"], "method": ["Para los fondants de chocolate, engrase generosamente seis moldes de dariole de 175ml / 6fl con mantequilla, luego forre la base de cada uno con un pequeño círculo de pergamino para hornear.", "Mezcle el cacao en polvo y la harina común en un recipiente y tamice un poco en cada molde Dariole, enrollándolos para cubrir la base y los costados. Sacuda cualquier exceso.", "Traiga un poco de agua a fuego lento en una cacerola. Suspenda un recipiente resistente al calor sobre el agua (no permita que la base del recipiente toque la superficie del agua). Agregue el chocolate y la mantequilla al tazón y revuelva hasta que quede suave y derretido.", "Retire el recipiente del fuego y déjelo enfriar durante 10 minutos.", "Mientras tanto, bata los huevos, las yemas de huevo, el azúcar en polvo y la ralladura de lima en un bol, usando un batidor eléctrico. (Cuando la mezcla es pálida y espesa, y el batidor deja un rastro en la mezcla cuando se saca, la mezcla está lista).", "Doble suavemente la mezcla de chocolate derretida con una cuchara grande de metal, hasta que se combine.", "Tamice la harina que se levanta por sí sola y dóblela con cuidado hasta que quede combinada.", "Vierta la mezcla de fondant en los moldes de dariole preparados, cubra cada uno con film transparente y enfríe en la nevera durante al menos 30 minutos y hasta ocho horas.", "Mientras tanto, para el jarabe de lima, caliente suavemente la mermelada de lima y el jugo de lima en una olla pequeña hasta que hierva a fuego lento. Continúe cocinando a fuego lento durante 3-4 minutos, o hasta que el volumen de jarabe se haya reducido en aproximadamente un cuarto, revolviendo ocasionalmente. (El jarabe se espesará aún más mientras se enfría).", "Retire el jarabe de lima del fuego y déjelo enfriar por completo, pero no lo enfríe. (Si el jarabe se espesa demasiado al enfriar, agregue un poco de agua fría y caliente cuidadosamente antes de usarlo).", "Para la crema de coco, caliente suavemente la leche de coco y la crema doble en una cacerola hasta que esté hirviendo a fuego lento.", "Batir las yemas de huevo y la harina de maíz juntas en un tazón hasta que estén suaves, pálidas y bien combinadas.", "Vierta la mezcla de coco y crema caliente sobre la mezcla de yema de huevo y mezcle hasta que esté suave y bien combinado. Regrese la mezcla de crema a la cacerola y caliente suavemente, revolviendo constantemente, hasta que la natilla se espese lo suficiente como para cubrir la parte posterior de una cuchara. Retirar del fuego y mantener caliente.", "Para cocinar los fondant de chocolate, precaliente el horno a 200C / 400F / Gas 6. Retire los fondants del refrigerador para que alcancen la temperatura ambiente y deseche la película adhesiva. Coloque los moldes dariole en una bandeja de horno resistente.", "Hornee los fondant de chocolate durante 11 minutos, o hasta que la esponja haya subido, pero los budines retienen un ligero temblor (aún deben estar líquidos en el centro, vea el consejo a continuación). Retire los fondant de chocolate del horno.", "Para servir, cuchara un círculo de crema de coco en el centro de cada una de las cuatro placas de postre. Decora la natilla con puntos de jarabe de lima, usando la punta de un cuchillo. Con una toalla de té doblada y seca o un guante de horno para proteger su mano, afloje el fondant de chocolate de los lados de cada molde de dariole con un cuchillo de punta redondeada y rompa en los platos de postre. Retire el círculo de pergamino para hornear y cubra los fondants con quenelles de crème fraiche, crema cuajada o helado de vainilla, si los está usando. Espolvorear con ralladura de lima y servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_chocolate_fondant_78091", "title": "Postres de fondant de chocolate con jarabe de lima y flan de coco", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_fondant_78091_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["110g / 4 oz de azúcar morena oscura", "110g / 4oz de mantequilla", "½ cucharadita de flor de sal (o sal marina)", "Crema doble 175ml / 6fl oz", "100 g / 3½ oz de azúcar en polvo", "50g / 1¾oz de mantequilla, más extra para engrasar", "½ cucharadita de flor de sal (o sal marina)", "100 g / 3½ oz de avellanas blanqueadas", "125g / 4½oz de chocolate negro, roto en pedazos", "125g / 4½oz de mantequilla, más extra para engrasar", "4 huevos de gallinas camperas", "100 g / 3½ oz de azúcar en polvo", "Harina normal de 60g / 2oz", "4 chocolates con caramelo salado", "cacao en polvo, para quitar el polvo", "500 g / 1 libra de helado de vainilla de 2 onzas", "200g / 7oz de frambuesas frescas"], "method": ["Para la salsa de caramelo, coloque el azúcar, la mantequilla y la sal en una cacerola y caliente hasta que el azúcar se haya derretido, luego agregue la crema.", "Llévelo a ebullición y déjelo cocer a fuego lento durante tres minutos hasta que espese. Transfiera a un tazón y relájese en la nevera durante dos horas.", "Para el caramelo salado quebradizo, coloca el azúcar, la mantequilla, la sal y las cuatro cucharadas de agua en una sartén de base pesada y calienta suavemente sin remover. Aumenta el fuego hasta que el caramelo se torne dorado claro. Retire del fuego.", "Con una cuchara o un cuchillo de paleta, coloque una línea de caramelo en el centro de cada plato para servir.", "Alinee una bandeja para hornear con papel pergamino. Agregue las avellanas a la olla y colóquelas en la bandeja de hornear preparada. Dejar de lado para enfriar.", "Una vez frío, rompe el caramelo en pedazos y déjalo a un lado.", "Para el fondant de chocolate, precaliente una bandeja para hornear plana en el horno a 220 ° C / 450 ° F / Gas 7. Engrase cuatro moldes dariole.", "Coloque el chocolate y la mantequilla en un tazón sobre una fuente de agua hirviendo y deje que se derrita.", "Mientras tanto, divida los huevos en un tazón grande, agregue el azúcar y bata durante dos minutos o hasta que estén pálidos y esponjosos, luego mezcle la harina.", "Una vez que el chocolate se haya derretido, viértalo sobre los huevos y el azúcar y revuelva bien.", "Ponga un poco de la mezcla en los moldes y coloque los chocolates de caramelo salados y agregue otra cucharada de la mezcla. Solo llénalos tres cuartos llenos.", "Coloque los fondants en una bandeja para hornear y cocine en el horno durante seis minutos", "Para servir, retire los fondants de sus moldes y colóquelos en el centro de los platos preparados con líneas de caramelo. Coloque una quenelle de helado a cada lado de los postres y decore con caramelo quebradizo. Polvo con cacao en polvo. Rocíe un poco de la salsa de caramelo alrededor del plato y salpique con frambuesas."], "url": "www_bbc_co_uk_food_recipes_chocolate_fondant_with_28686", "title": "Pasta de chocolate con salsa de caramelo salado y caramelo", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200ml / 7fl oz de leche entera", "70 g / 2½ oz de azúcar en polvo", "100 g / 3½ oz de yemas de huevo", "Crema doble de 200 ml / 7 fl oz", "3 barras de chocolate y maní, picadas", "200g / 7oz de cerezas frescas, piedras removidas", "200ml / 7oz de azúcar en polvo", "125g / 4½oz de mantequilla sin sal, más extra para engrasar", "125 g / 4% C2% BDoz% 20dark% 20chocolate% 20 (% mínimo 2070%% 20cocoa% 20solids)", "35 g / 1¼ oz de almendras molidas", "4 huevos de gallinas camperas, separados", "100 g / 3½ oz de azúcar en polvo", "60 g / 2¼ oz de harina", "200g / 7oz de chocolate blanco, derretido", "4 cucharadas de azúcar glas", "100g / 3½oz de avellanas tostadas, toscamente picadas", "8 ramitas de menta de chocolate (use menta normal si la menta de chocolate no está disponible)"], "method": ["Para helado de barra de chocolate, caliente la leche en una cacerola hasta que alcance 80C / 175F en un termómetro de cocción.", "Ponga el azúcar impalpable y las yemas de huevo en un bol y mezcle, luego vierta la leche tibia sobre ellos, batiendo todo el tiempo. Regrese la mezcla a la cacerola y cocine hasta que alcance 83C / 180F y espese un poco. Retire del fuego y mezcle con la crema doble. Poner a un lado para enfriar a 60 ° C / 140 ° F, luego agregue las barras de chocolate y permita que se derrita.", "Transfiera a una máquina para hacer helados y revuelva según las instrucciones del fabricante hasta que se congele.", "Para las cerezas escalfadas, coloque las cerezas, 200 ml / 7 fl oz de agua y azúcar en una olla grande y cocine durante 6-8 minutos. Las cerezas deben ser suaves, pero conservan su forma. Dejar que se enfríe antes de servir.", "Para el fondant de chocolate, precaliente el horno a 220C / 200C fan / Gas 7 y engrase 8 moldes dariole con mantequilla ablandada, usando un pincel de pastelería.", "Derretir la mantequilla y el chocolate juntos en un recipiente a prueba de calor se sentó sobre una olla de agua hirviendo a fuego lento. En otro recipiente, bata los huevos y el azúcar durante 2 minutos, o hasta que lleguen a la etapa de cinta (esto es cuando la mezcla deja un rastro en la superficie donde se quita el batidor).", "Dobla la mezcla de chocolate en la mezcla de huevo y luego dobla la harina, divide la mezcla entre los moldes preparados. Coloque en una bandeja para hornear y cocine durante 8 minutos.", "Para adornar, pinte una línea de chocolate blanco derretido en el centro de cada plato y espolvoree con azúcar glasé.", "Apague los fondants calientes en el centro de cada plato (en la parte superior del chocolate blanco) y agregue algunas cerezas escalfados. Coloque una quenelle de helado en un lado y adorne con las avellanas picadas y la menta de chocolate."], "url": "www_bbc_co_uk_food_recipes_chocolate_fondant_with_29611", "title": "Fondant de chocolate con cerezas escalfados y helado de barra de chocolate", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["250ml / 9fl oz de crema batida", "50ml / 2fl de leche en oz", "pieza combinada de ralladura de naranja", "1 canela en rama, rota", "½ vaina de vainilla, dividida longitudinalmente", "1 chili chipotle, dividido", "pocos dientes", "1 cucharadita de bayas de pimienta de Jamaica, ligeramente trituradas", "2 cuchillas Maza", "½ cucharadita de granos de pimienta, ligeramente triturados", "1 cucharada de jengibre molido", "350g / 12oz de chocolate negro", "generosa pizca de sal", "100 ml / 3½ fl oz de un tarro de tallo de jengibre", "1-2 cucharadas de ron, brandy o vino de jengibre (opcional)", "cubos de madeira cake", "cubos sobrantes pudín de Navidad o pastel", "trozos de fruta, como mango, physalis, segmentos de mandarina o peras"], "method": ["Ponga la crema batida y la leche en una olla junto con la ralladura de naranja, canela, vaina de vainilla, chile, clavo de olor, bayas de pimienta, macis, pimienta y jengibre.", "Poco a poco llevar a ebullición, luego retire del fuego y deje que se infunda hasta que la crema vuelva a la temperatura ambiente. Cuele a través de un colador en una olla limpia.", "Rompe el chocolate y agrega a la crema. Derrita el chocolate en la crema a fuego lento hasta que el chocolate se derrita, batiendo regularmente y luego constantemente hacia el final hasta que tenga una salsa suave.", "Transfiera a un tazón de fondue y déjelo reposar por 10 minutos, luego, si es necesario, comience a recalentar muy suavemente con una tetera o un quemador de fondue debajo. Vigila esto mientras comes ya que no quieres que comience a recalentarse: se dividirá.", "Sirva con cubos de tarta de madeira, restos de pudin de Navidad o pastel, o cualquier fruta."], "url": "www_bbc_co_uk_food_recipes_chocolate_fondue_73345", "title": "Fondue de chocolate, naranja y especias", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_fondue_73345_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["125g / 5½ oz de mantequilla, cortada, más extra para engrasar", "125 g / 5% C2% BDoz% 20dark% 20chocolate% 20 (% mínimo 2070%% 20cocoa% 20solids),% 20broken% 20into% 20pieces", "4 huevos de gallinas camperas", "80g / 2¾oz de azúcar en polvo", "60g / 2¼ oz de harina común", "4 bombones redondos de caramelo suave centrado", "80g / 2¾oz de mantequilla sin sal", "80g / 2¾oz de azúcar en polvo", "400 ml / 14 fl oz crema doble", "150 g / 5% C2% BDoz% 20dark% 20chocolate% 20 (72%% 20cocoa% 20solids),% 20broken% 20into% 20pieces", "50g / 1¾oz de mantequilla", "4 bolas de helado de vainilla", "4 ramitas de menta de chocolate"], "method": ["Precaliente el horno a 220C / 200C Fan / Gas 7. Engrase 4 moldes dariole (circulares) con mantequilla.", "Para los fondants, derrita la mantequilla y el chocolate en un recipiente sobre un baño María, asegurándose de que el recipiente no toque el agua. Deja enfriar por 1 minuto.", "Mientras tanto, bata los huevos y el azúcar hasta que hayan doblado su tamaño y sean de color pálido. Vierta la mezcla de chocolate enfriada sobre la mezcla de huevo (si hace esto cuando está demasiado caliente, revolverá los huevos). Tamice la harina, luego dóblela con cuidado.", "Cuarta-llene los moldes dariole con la mezcla de chocolate. Deja caer un chocolate en cada maceta, luego coloca la mezcla de chocolate restante sobre la parte superior, dejando un espacio cuando se levanten. Hornee por 5-6 minutos.", "Mientras tanto, para la salsa de caramelo, derrita la mantequilla en una cacerola mediana y agregue el azúcar. Cocine hasta que el azúcar se haya disuelto. Agregue la crema y cocine hasta que tenga una salsa espesa y brillante.", "Para la salsa de chocolate, ponga a hervir 100 ml / 3½ fl oz de agua en una olla mediana. Agregue el chocolate y bata hasta que quede suave. Agregue la mantequilla y bata para combinar.", "Rocíe las salsas de caramelo y chocolate alrededor de los fondants en platos de postre individuales. Sirve con el helado y la menta de chocolate."], "url": "www_bbc_co_uk_food_recipes_chocolate_fondant_with_60044", "title": "Fondant de chocolate con salsa de chocolate y caramelo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]