[{"ingredients": ["75 g / 2½ oz de mantequilla", "Hojas de col roja de 600 g / 1 lb 5 oz, finamente cortadas", "280ml / 10fl oz de vino tinto", "50g / 1¾oz de azúcar morena suave", "Anís de 2 estrellas", "½ ramita de canela", "5 cucharadas de jalea de grosella", "2 cucharadas de vinagre de vino tinto", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "2 x 200 g / 7 oz de filete de venado, totalmente recortado", "sal marina y pimienta negra recién molida", "50g / 1¾oz de mantequilla", "1 chalotes, en rodajas finas", "1 diente de ajo", "5 ramitas de tomillo fresco, hojas recogidas", "2 bayas de enebro, aplastadas", "½ laurel fresco", "1 cucharada de azúcar", "100ml / 3½fl oz de puerto de rubí", "150ml / 5fl oz de caldo de pollo, preferiblemente casero", "150 g / 5½ oz de moras frescas", "2 cucharadas de aceite de oliva", "50g / 1¾oz de mantequilla", "1 apio nabo grande, pelado y cortado en cubitos", "1 manojo de remolachas baby, cocidas, peladas y cortadas a la mitad", "75 g / 2½ oz de mantequilla", "2 patatas grandes, cortadas en espiral en un espiralizador", "50 g / 1¾oz de mantequilla sin sal", "1 col rizada de cabeza, hojas quitadas y más o menos picadas"], "method": ["Para el puré de repollo rojo, caliente una olla grande, agregue la mantequilla y la col lombarda y fríalos durante 1-2 minutos, o hasta que se ablanden.", "Agregue el vino tinto y deje que hierva. Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento y cocine hasta que el volumen del líquido se haya reducido a la mitad. Agregue los ingredientes restantes y cocine a fuego lento. Cubra y continúe cocinando durante 40-45 minutos, revolviendo ocasionalmente, hasta que estén tiernos.", "Retire la tapa y cocine por otros 5-8 minutos a fuego alto, o hasta que el líquido se haya evaporado y la col roja esté ligeramente pegajosa y brillante. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Deje que se enfríe un poco, luego transfiera a una licuadora y mezcle hasta que quede suave.", "Para la carne de venado, precalentar el horno a 200C / 400F / Gas 6.", "Caliente el aceite en una sartén pequeña a prueba de horno. Sazone la carne de venado con sal marina y pimienta negra recién molida y agregue a la sartén. Freír rápidamente por todos lados hasta que estén ligeramente dorados. Transfiera al horno para asar durante 6-8 minutos o hasta que esté cocido a su gusto. Reserve para descansar antes de servir.", "Para hacer la salsa, caliente una cacerola y agregue la mantequilla. Una vez caliente, agregue los chalotes, el ajo y las hojas de tomillo y fría durante 1-2 minutos, o hasta que se ablanden.", "Agregue el resto de los ingredientes, aparte de las moras, y cocine durante 5-8 minutos, hasta que se reduzca su volumen. Justo antes de servir pasar a través de un colador y agregar el líquido a la sartén y agregar un pomo de mantequilla y las moras.", "Para el apio nabo y las remolachas baby, precaliente dos sartenes pequeñas. Una vez caliente, agregue el aceite y la mantequilla. Agregue el apionabo a una sartén y el bebé remolacha a la otra y cocine ambos durante 6-8 minutos.", "Para la galette de papas, caliente una sartén pequeña y agregue la mantequilla, una vez derretida coloque la papa en espiral en la sartén. Cocine por ambos lados durante 3-4 minutos, hasta que estén crujientes y doradas.", "Para cocinar la col rizada, caliente la mantequilla en una sartén, luego agregue la col rizada y dos cucharadas de agua y cocine hasta que la col rizada se caiga.", "Para servir, coloque el puré de col roja en las placas con la papa galette. Pon una cucharada de col rizada en la parte superior. Una vez que el venado haya descansado, córtalo en pedazos y colóquelo en los platos.", "Coloque el apionabo y las remolachas alrededor de los platos y coloque la salsa de zarzamora sobre la parte superior."], "url": "www_bbc_co_uk_food_recipes_venison_with_kale_red_24792", "title": "Venado con col rizada, puré de col lombarda, apio nabo, remolacha baby, galette de patata y salsa de mora", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["55g / 2oz de mantequilla sin sal ablandada", "3 pastinacas, peladas y en rodajas finas", "3 papas, peladas y en rodajas finas", "1 cebolla, en rodajas", "3 dientes de ajo, en rodajas", "300g / 10½ oz gruyère, rallado", "300g / 10½oz de queso cheddar fuerte, rallado", "200g / 7oz Stilton, desmenuzado", "3 ramitas de tomillo frescas, hojas retiradas", "1 litro / 1¾ pintas de crema doble", "pizca de nuez moscada fresca rallada", "pizca de sal", "pizca de pimienta blanca", "100ml / 3½fl oz de aceite de oliva", "1 ramita fresca de orégano, hojas retiradas", "1 cucharada de puré de ajo", "800 g / 1lb 12 oz de carne de venado", "150ml / ¼ de pinta de vino tinto", "150g / 5½oz de mantequilla sin sal, cortada en cubitos", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200 ° C / 180 ° C / Gas 6. Engrasar una fuente honda para hornear con la mantequilla.", "Coloque alternativamente las chirivías, las patatas, la cebolla y el ajo en el plato, salpicando entre cada capa con una mezcla de los tres quesos y unas pocas hojas de tomillo. Continúa cubriendo hasta que todos los ingredientes se hayan agotado, reservando algunas hojas de tomillo y algo de queso.", "Coloque la crema en una olla con las hojas de tomillo, la nuez moscada, la sal y la pimienta blanca reservadas y caliéntela durante unos minutos, hasta que esté tibia. Vierta la crema en la fuente para hornear, asegurándose de que la crema se haya empapado adecuadamente en todas las capas.", "Esparza el queso reservado sobre la parte superior, cubra con papel de cocina y hornee durante 1 hora y media, o hasta que las verduras estén tiernas. Retire la lámina y frótela por 20 minutos más. Dejar reposar durante 30 minutos antes de servir. Mantenga el horno encendido.", "Para el venado, rellene el aceite, el orégano y el puré de ajo en un pequeño procesador de alimentos. Condimentar con sal y pimienta. Frote la pasta en toda la grupa de venado.", "Coloque una sartén a fuego alto, agregue la grupa y el sello en todos los lados. Coloque la grupa en una lata de asar y cocine en el horno durante 8-10 minutos. Déjalo reposar por otros 10 minutos antes de tallar.", "Transfiera los jugos de la lata de tueste a una cacerola y colóquelos a fuego medio. Agregue el vino tinto y cocine a fuego lento hasta que se reduzca a la mitad. Batir la mantequilla hasta que tenga una consistencia espesa. Condimentar con sal y pimienta.", "Cortar la carne de venado en rodajas y colocar en platos calientes con el gratinado en el lateral. Vierta la salsa sobre la carne de venado y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_venison_with_potato_and_06201", "title": "Venado con gratinado de papas y chirivía", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 patatas dulces, limpiadas", "2 x 180 g / 6 oz de lomo de venado, recortado", "3 cucharadas de aceite de oliva", "4 ramitas de tomillo", "50g / 1¾oz de mantequilla", "50ml / 2fl oz de melaza de granada", "2 chiles anchos, limpios", "2 pasilla chilles, cleaned", "3 chiles guajillo, limpios", "½ ramita de canela", "1 estrella de anís", "1 cucharadita de semillas de comino", "50g / 1¾oz de maní", "50g / 1¾oz de almendras", "50 g / 1¾oz de semillas de sésamo", "3 cucharadas de aceite de oliva", "1 cebolla, cortada en trozos", "2 dientes de ajo, aplastados", "1 chile rojo, picado", "2 tomates, picados", "poco caldo de pollo", "50 g / 1% C2% BEoz% 20dark% 20chocolate,% 20minimum% 2070 %% 20cocoa% 20solids,% 20chopped", "sal y pimienta", "2 tortillas grandes", "50g / 1¾oz cuajada de queso", "50g / 1¾oz de condimento de maíz", "100g / 3½oz de queso ahumado, rallado"], "method": ["Precaliente el horno a 220C / 200C Fan / Gas 7. Hornee las batatas hasta que estén cocidas pero firmes. Pelar y cortar en rondas gruesas, luego reservar.", "Mientras tanto, para el lunar, coloque una sartén seca a fuego alto. Agregue los chiles y tostadas ancho, pasilla y guajillo durante 1-2 minutos, hasta que se hinchen, teniendo cuidado de no quemarlos. Llene un recipiente con agua caliente, luego vierta los chiles y déjelos en remojo durante 20-30 minutos antes de desecarlos y picarlos.", "Regrese la sartén seca a fuego alto y tueste la canela, el anís estrellado, las semillas de comino, los cacahuetes, las almendras y las semillas de sésamo hasta que estén aromáticos. Moler en una maja y mortero.", "Caliente el aceite de oliva en una cacerola a fuego alto. Agregue la cebolla, el ajo, el chile rojo y los tomates y cocínelos hasta que estén ligeramente carbonizados. Agregue los chiles hidratados y cocine por unos minutos. Incline la salsa en una licuadora y, cuando esté casi lisa, agregue la mezcla de especias y nueces y un poco de caldo de pollo. Transfiera a una cacerola, lleve a ebullición y cocine a fuego lento durante 2 minutos; puede que necesite aflojar la salsa con algo de caldo adicional.", "Mientras tanto, caliente una sartén a prueba de horno a fuego alto. Frote la carne de venado con aceite de oliva y sazone bien con sal y pimienta. Coloque en la sartén, agregue el tomillo y el asado en el horno durante 6-8 minutos.", "Coloque las rodajas de boniato en una bandeja para hornear, agregue la mantequilla y la melaza de granada, y tueste durante 5 minutos.", "Para las quesadillas, caliente una sartén grande a fuego medio. Extienda las tortillas con el queso cuajado y luego con el condimento de maíz. Cubra con el queso ahumado y luego la segunda tortilla. Coloque en la sartén y ponga un peso encima. Cocine durante 1 minuto, hasta que huele a tostado, luego dé la vuelta y cocine el otro lado mientras está cargado. Retire de la sartén y corte en octavos.", "Revuelva el chocolate en la mole. Carve el venado. Ponga rodajas de boniato en los platos, cubra con la carne de venado y sirva con la mole y las quesadillas."], "url": "www_bbc_co_uk_food_recipes_venison_with_mole_and_40040", "title": "Venado con quesadillas de mole y queso", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["150g / 5½oz de col roja, rallada", "1 manzana comiendo, pelada, sin corazón y finamente picada", "½ cebolla roja pequeña, finamente picada", "25 g / 1 oz de pasas, remojadas en agua caliente durante 10 minutos", "½ cucharadita de alcaparras, escurridas y enjuagadas", "1½ cucharadas de aceite de oliva, más extra para freír", "½ cucharada de vinagre de vino tinto", "2 x 150 g / 5½ oz de lomo de carne de venado o filetes", "botón de mantequilla sin sal", "2 cucharadas de perejil fresco picado", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "En un tazón grande, mezcle la col, las manzanas, la cebolla, las pasas y las alcaparras.", "Mezcle el aceite y el vinagre en un tazón limpio para hacer una vinagreta. Agregar a la ensalada, reservar una pequeña vinagreta para servir. Sazonar el repollo con sal y pimienta, cubrir y dejar macerar durante al menos 10 minutos.", "Mientras tanto, condimentar el venado con sal. Caliente una pizca de aceite y la mantequilla en una sartén grande hasta que forme espuma. Cocine la carne de venado hasta que se dore por todos lados. Transfiéralo al horno por 4 minutos, luego déjalo reposar.", "Para servir, mezcle el perejil en la ensalada. Corta el venado. Coloque la ensalada en dos platos y cubra con rebanadas de carne de venado. Termine con la vinagreta restante."], "url": "www_bbc_co_uk_food_recipes_venison_with_red_cabbage_54866", "title": "Venado con ensalada de repollo rojo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/venison_with_red_cabbage_54866_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva, para freír", "Pancetta ahumada de 300 g / 10½ oz, cortada en cubos", "12 cebollas bebé", "3 salsifíes, pelados y cortados en cubos", "Puerto de oz 325ml / 11fl", "500ml / 18fl oz de vino tinto", "1 cucharada de azúcar en polvo", "1 cucharada de jalea de grosella", "8 chuletas de venison ahora", "botón de mantequilla", "1 cucharada de granos de pimienta verde", "1 hoja de nori", "½ manojo de perejil de flatleaf, finamente picado, para adornar", "2 cucharadas de aceite de perejil, para decorar", "1 remolacha cocida mediana, pelada y finamente cortada, para adornar", "1 remolacha confitada cruda, pelada y finamente cortada, para adornar", "sal y pimienta negra recién molida"], "method": ["Caliente un poco de aceite de oliva en una cacerola grande y fría la panceta hasta que se dore. Agregue las cebollas, el salsifí, el puerto y el vino tinto. Llevar a ebullición y luego agregar el azúcar, la jalea de grosella y una pizca de sal. Cubra y cocine a fuego lento durante 15-20 minutos, o hasta que los vegetales estén tiernos.", "Mientras tanto, precalentar el horno a 180C / 160C Fan / Gas 4.", "Calentar un poco de aceite en una sartén a prueba de horno. Freír la carne de venado durante 3 minutos por cada lado. Agregue la mantequilla a la sartén y, cuando se derrita, glasee la carne de venado. Agregue los granos de pimienta y transfiéralos al horno por 3 minutos, o hasta que estén cocidos a su gusto, luego déjelos a un lado para que descanse.", "Sumerja el nori en agua, drene y seque. Caliente una freidora a 180 ° C (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido) y luego fría hasta que esté crujiente. Condimentar con sal y pimienta.", "Para servir, coloque el puerto y las verduras glaseadas con vino en los platos para servir. Cortar las chuletas de venado y colocar encima de las verduras. Adorne con algas marinas crujientes, perejil picado, aceite de perejil, remolacha cocida, remolacha confitada y granos de pimienta untados con mantequilla."], "url": "www_bbc_co_uk_food_recipes_venison_with_winter_10477", "title": "Venado con verduras de invierno, algas crujientes y perejil", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 cucharadas de pan rallado blanco fresco", "2 cucharadas de perejil fresco picado", "1 cucharada de hojas de tomillo fresco picado", "pizca de copos de chile", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "1 cucharada de mantequilla", "Venado de 85 g / 3 oz, aplanado con un mazo de carne o un rodillo", "1 huevo de gallinas camperas, golpeado", "½ calabaza, pelada y picada", "3 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "4 cucharadas de aceite de oliva", "2 cucharadas de perejil fresco picado", "2 cucharadas de albahaca fresca picada", "2 cucharadas de cebolletas frescas picadas", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para el venado alla Milanese, coloque las migas de pan, las hierbas, los copos de chile y la sal y la pimienta negra recién molida en un procesador de alimentos y pulse hasta que se combinen.", "Caliente el aceite de oliva y la mantequilla en una sartén. Sumerja la carne de venado en el huevo batido, luego cubra con la mezcla de pan rallado y fríe durante 3-4 minutos en cada lado, o hasta que esté dorado y cocido.", "Para la calabaza asada, pula la calabaza en una sartén con agua salada hirviendo durante 4-5 minutos, luego escurra. Transfiera a una lata para asar, rocíe sobre el aceite de oliva y sazone bien con sal y pimienta negra recién molida. Coloque en el horno para asar durante 10-12 minutos, o hasta que estén dorados y tiernos.", "Para el pesto de hierbas, coloque todos los ingredientes del pesto en un procesador de alimentos y mezcle hasta que quede suave.", "Para servir, coloca la carne de venado en un plato para servir y coloca la calabaza asada al lado. Rocíe el pesto de hierbas alrededor de los bordes del plato para adornar."], "url": "www_bbc_co_uk_food_recipes_venisonallamilanesew_89977", "title": "Venison alla Milanese con calabaza tostada y pesto de hierbas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de harina, más extra para quitar el polvo", "100 g / 3½ oz de mantequilla", "2 huevos de gallinas camperas, más uno extra, golpeado, para cepillar", "2 cucharadas de agua", "1 cucharada de aceite de oliva", "½ cebolla roja picada", "1 diente de ajo, picado", "Filete de venado 200 g / 7 oz, cortado en trozos del tamaño de un bocado", "6 cucharadas de vino tinto", "1 cucharada de vinagre balsámico", "sal y pimienta negra recién molida", "1 cucharada de chocolate negro, rallado", "ramitas de romero fresco, para adornar"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para la masa, coloque la harina, la mantequilla, dos de los huevos y el agua en un procesador de alimentos y pulse hasta que la mezcla se una para formar una masa.", "Sobre una superficie ligeramente enharinada, extender la masa a 0.5cm / ¼ de espesor y cortar dos círculos para que quepan sobre un plato pequeño a prueba de horno.", "Coloque los discos en una bandeja para hornear antiadherente y cepille con huevo batido. Transfiera al horno y hornee por 8-10 minutos, o hasta que esté ligeramente dorado.", "Para el relleno, caliente el aceite en una sartén y fría la cebolla hasta que esté blanda pero no coloreada. Agregue el ajo y cocine por un minuto.", "Agregue la carne de venado y cocine, revolviendo con frecuencia, hasta que se dore por todas partes.", "Agregue el vino y el vinagre y cocine a fuego lento hasta reducir a la mitad. Sazone con sal y pimienta negra recién molida, agregue el chocolate y revuelva hasta que se derrita.", "Divida el relleno entre dos platos pequeños y refuerce cada uno con un disco de pastelería.", "Transfiera al horno y hornee durante diez minutos, o hasta que la masa esté crujiente y dorada y el relleno esté bien cocido.", "Para servir, coloque los pasteles en platos y decore con una ramita de romero."], "url": "www_bbc_co_uk_food_recipes_venisonandglazedonio_85858", "title": "Venado y pasteles de cebolla glaseada con salsa balsámica", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 2 pasteles pequeños", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "25g / 1oz de mantequilla", "2 cebollas, cortadas en cubitos", "4 dientes de ajo, aplastados", "4 lonchas de tocino ahumado, picadas", "500g / 1Ib 2oz de champiñones castaños, cortados por la mitad", "2,5 kg / 5½ lb de muslo o hombro de venado, cortado en cubitos", "½ botella de vino tinto", "400ml / 14fl oz de agua", "2 cubos de caldo de carne desmenuzados", "3 cucharadas de jalea de grosella", "sal y pimienta negra recién molida, al gusto", "50g / 2 oz de harina de maíz", "redcurrants del cilantro, para decorar", "6 ramitas de romero o tomillo, para decorar", "papas nuevas", "espinaca marchita"], "method": ["Precalentar el horno a 150C / 300F / Gas 2.", "En la encimera, caliente el aceite de oliva y la mantequilla en una cacerola con tapa grande. Agregue las cebollas y cocine hasta que estén suaves, pero no doradas.", "Agregue el ajo, tocino y champiñones y cocine por un minuto más.", "En una sartén, dore el venado un puñado a la vez y agrégalo a la cacerola. Cuando toda la carne esté dorada, agregue el vino tinto, agua, cubos de caldo, mermelada de grosella y sal y pimienta.", "Llevar a ebullición y revolver bien. Coloque la tapa en la cacerola y colóquela en el medio del horno - cocínelo durante 90 minutos.", "Retire del horno. Haga una pasta con la harina de maíz y dos cucharadas de agua. Añada tanta pasta a la cazuela como sea necesario para espesar la salsa; agregue un poco cada vez que no esté seguro de cuánto necesitará.", "Transfiera la cazuela a la cocina y, a fuego lento, cocine hasta que la salsa se espese, esto demorará unos cinco minutos.", "Sirva con papas nuevas y espinacas marchitas. Decore cada plato con una ramita de romero o tomillo y un manojo de grosellas frescas."], "url": "www_bbc_co_uk_food_recipes_venisoncasserole_83746", "title": "Cazuela de venado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 8-10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/venisoncasserole_83746_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite vegetal", "Paleta de carne de venado de 450 g / 1 libra, cortada y cortada en trozos grandes", "1 cebolla, finamente picada", "1 pimiento rojo, picado", "1 pimiento verde, picado", "1 apio en barra, picado", "8-10 chiles rojos picados", "250 g / 8½ oz de champiñones, en rodajas", "1 diente de ajo, aplastado", "1 cucharada de puré de tomate", "pellizcar el comino molido", "pizca de tierra pizca", "Juego de 150ml / 5fl oz o caldo de carne", "125ml / 4½fl oz de vino tinto", "400g / 14oz de tomates picados enlatados", "sal y pimienta negra recién molida", "50g / 1¾oz de chocolate negro, rallado", "arroz llano, cocinado de acuerdo con las instrucciones del paquete", "4 tortillas de harina blandas"], "method": ["Caliente el aceite vegetal en una sartén antiadherente hasta que esté caliente y agregue la carne de venado. Freír la carne durante unos minutos en cada lado, hasta que se dore por todas partes. Retire el venado de la sartén y déjelo a un lado para mantenerlo caliente.", "En la misma sartén, agregue las cebollas, los pimientos rojos y verdes, el apio, los chiles rojos, los champiñones y el ajo y fría hasta que los vegetales estén suaves pero no coloreados.", "Agregue el puré de tomate a la sartén, baje el fuego y fríe con cuidado durante otros diez minutos.", "Agregue las especias, el caldo, el vino tinto y los tomates picados enlatados a la sartén y deje que hierva.", "Regrese la carne de venado a la sartén y agregue el chocolate rallado. Reduzca el fuego a muy bajo y cocine a fuego lento durante una hora, o hasta que el venado esté tierno.", "Para servir, coloca el chile de venado en las placas. Ponga un poco de arroz común al costado y sirva con las tortillas de harina blandas."], "url": "www_bbc_co_uk_food_recipes_venisonchilli_86999", "title": "Carne de venado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 salchichas de venado, sin piel", "6 ciruelas", "3 pinchos de madera", "1 cucharada de aceite de oliva"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Comience enrollando la carne de venado en nueve bolas pequeñas.", "Tome un pincho y alternativamente coloque una bola de venado y luego una ciruela; cada pincho debe tener tres bolas de venado y dos ciruelas pasas.", "Calentar una sartén, agregar el aceite y dorar ligeramente los kebabs.", "Coloque en el horno precalentado durante seis minutos y sirva."], "url": "www_bbc_co_uk_food_recipes_venisonkebabs_79138", "title": "Kebabs de venado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 huevos de gallinas camperas", "125ml / 4fl de leche en oz", "Filete de carne de venado picada 450g / 1lb", "200g / 7oz de pan rallado", "Parmesano 75 g / 3 oz, rallado", "1 diente de ajo, finamente picado", "1 cucharada de aceite vegetal", "1 cucharada de aceite vegetal", "1 cebolla, finamente picada", "1 zanahoria, finamente picada", "1 apio en barra, finamente picado", "4 dientes de ajo, finamente picados", "Puré de tomate 150 g / 5 oz", "450ml / ¾ pinta de vino tinto", "450 ml / ¾ pinta de caldo de pollo", "2 ramitas de romero fresco", "espagueti, cocinado de acuerdo con las instrucciones del paquete", "parmesano, recién rallado"], "method": ["Para las albóndigas, bata los huevos y la leche en un bol. Agregue la carne de venado picada, pan rallado, parmesano y ajo y mezcle bien.", "Moldee la mezcla de albóndigas en bolas, cada una del tamaño de una pelota de golf.", "Coloque las albóndigas en un plato o bandeja y deje enfriar en la nevera durante 20 minutos.", "Calentar el aceite en una sartén a fuego medio.", "Retire las albóndigas de la nevera y colóquelas en una sartén caliente. Freír durante 8-10 minutos, o hasta que estén doradas por todas partes.", "Para los ragu, caliente el aceite en una sartén aparte. Freír la cebolla, la zanahoria, el apio y el ajo durante 5-6 minutos o hasta que se ablanden.", "Agregue el puré de tomate y cocine por otros 7-8 minutos, hasta que la salsa tenga un color rojo oscuro y espeso.", "Agregue el vino, caldo de pollo y romero y deje hervir. Reduzca el fuego y cocine a fuego lento durante 45 minutos a una hora.", "Agregue las albóndigas a la salsa y cocine a fuego lento durante 5-6 minutos, hasta que las albóndigas estén completamente cocidas.", "Para servir, coloque una porción generosa de espagueti cocido en cada tazón de servir. Vierta una cucharada sobre la misma cantidad de albóndigas y salsa, y termine con parmesano rallado."], "url": "www_bbc_co_uk_food_recipes_venisonmeatballs_89798", "title": "Albóndigas de carne de venado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["125 g / 4½ oz de arándanos", "3 cucharadas de vino blanco o jerez", "azúcar pizca", "½ cucharada de vinagre balsámico", "2 cucharadas de jugo de naranja", "sal y pimienta negra recién molida", "1 cucharadita de mantequilla", "mantequilla perilla", "1 cucharadita de aceite de oliva", "2 filetes de carne de venado"], "method": ["Para la salsa, reserve 4-6 arándanos para decorar y coloque los arándanos restantes en una sartén pequeña de base pesada con el vino o el jerez y el azúcar.", "Cocine a fuego lento durante unos diez minutos, hasta que los arándanos alcancen una consistencia blanda. Agregue el vinagre, el jugo de naranja y la sal y la pimienta negra recién molida al gusto. Agregue la mantequilla y mantenga la salsa caliente.", "Mientras la salsa hierve a fuego lento, prepare el venado. En una sartén, derretir la mantequilla y el aceite a fuego medio y agregar la carne de venado a la sartén. Freír la carne de venado durante 3-5 minutos por cada lado, hasta que esté cocido a su gusto. Deje el venado para descansar en un lugar cálido durante al menos cinco minutos antes de servir.", "Coloque los filetes de carne de venado en dos platos, cubra la salsa y decore con los arándanos restantes. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_venisonwithblueberri_86030", "title": "Venado con arándanos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 cebolla, finamente picada", "2 puerros, divididos longitudinalmente hasta la raíz varias veces, lavados con agua fría y luego cortados en rodajas", "2 zanahorias, cortadas en dados de 1 cm / ½ pulgadas", "2 dientes de ajo, finamente cortados en cubitos", "1 cucharadita de pimentón dulce ahumado", "½ cucharadita de tomillo seco", "2 papas, peladas, cortadas en dados de 1cm / ½in", "600ml / 21fl oz de caldo de verduras", "Coliflor de 1/2 cabeza, cortada en pequeños floretes", "Frijoles verdes finos de 200g / 7oz, cortados en pedazos de 2cm / ¾in", "1 x 400 g / 14 oz de frijoles al horno", "2 cucharadas de perejil de flatleaf tostado", "pan crujiente, para servir", "sal y pimienta negra recién molida"], "method": ["Caliente una sartén o una sartén grande hasta que esté medio caliente, agregue el aceite de oliva, la cebolla y los puerros y cocine suavemente durante 5 minutos hasta que se ablanden.", "Agregue las zanahorias, el ajo, el pimentón y el tomillo y revuelva para combinar. Cocine por 5 minutos.", "Agregue las papas y el caldo de verduras y deje que hierva. Baje la temperatura y cocine a fuego lento durante 5 minutos hasta que las papas se suavicen, luego agregue la coliflor y cocine a fuego lento durante otros 5 minutos.", "Por ahora, todas las verduras deberían estar casi cocinadas. Agregue las judías verdes y los frijoles cocidos y cocínelos durante 3 minutos, luego agregue el perejil picado y sazone bien con sal y pimienta.", "Servir con un montón de pan crujiente."], "url": "www_bbc_co_uk_food_recipes_versatile_vegetable_stew_50136", "title": "Guiso de verduras versátil", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/versatile_vegetable_stew_50136_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Fresas de 500g / 1lb y 2oz, sin cáscara y en cuartos", "Frambuesas de 500 g / 1 lb 2 oz", "175g / 6oz de azúcar en polvo", "250ml / 9fl oz Pimm's", "1 pan de sándwich blanco grande, las cortezas se quitaron y se cortaron en 16 rebanadas luego se partieron en dos diagonalmente", "1 cucharada de menta fresca finamente picada", "Fresas de 250g / 9oz, descascadas y partidas por la mitad", "75g / 2½ oz de gelatina de grosella", "200ml / 7fl oz de crema coagulada", "Fresas de 200g / 7oz", "ramitas de menta, para adornar (opcional)"], "method": ["Coloque las bayas, el azúcar y el Pimm en una cacerola mediana y deje que hierva a fuego lento, revolviendo ocasionalmente hasta que el azúcar se disuelva. Cocine por 2 minutos, luego retire la sartén del fuego y déjela enfriar. Cuele las bayas en un tazón grande, reserve el almíbar y deje las bayas a un lado.", "Cepille un lado de cada pedazo de pan con el jarabe. Coloque 24 rebanadas de pan, con el lado del almíbar hacia abajo, alrededor de la base y los lados del recipiente de budín, superponiéndose sobre la marcha. Guarde las 8 rebanadas de pan restantes.", "Revuelva la menta a través de la mezcla de bayas reservada y la cuchara en el recipiente. Coloque las rebanadas de pan reservadas en la parte superior y cúbralas con una película adhesiva. Coloque un plato pequeño encima del budín, pese con latas u otros pesos y refrigere durante la noche.", "Coloque el jarabe restante, las fresas y la jalea de grosella en una olla pequeña. Llevar a ebullición y cocinar a fuego lento, sin tapar, durante 5 minutos, o hasta que el almíbar se haya espesado ligeramente. Deje enfriar y refrigere hasta que sea necesario.", "Convierta el pudín en un plato para servir y cepille con el jarabe.", "Para servir, corte el budín en trozos gruesos y sirva con el jarabe restante, la crema coagulada, bayas extra frescas y una ramita de menta, si se usa."], "url": "www_bbc_co_uk_food_recipes_very_summery_summer_11544", "title": "Pudín de verano muy veraniego", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 8-10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Pasta de vermicelli 200g / 4oz", "2 cucharadas de aceite de oliva", "12 gambas de tigre crudas, sin cáscara", "1 albahaca grande, solo hojas", "sal y pimienta negra recién molida", "1 limón, ralladura y jugo", "2 puñados de hojas frescas de albahaca", "2 yemas de huevo de gallinas camperas", "1 cucharadita de vinagre de vino blanco", "1 cucharadita de mostaza Dijon", "200ml / 7floz colza o aceite de oliva ligero", "sal y pimienta negra recién molida"], "method": ["Para las gambas, precaliente una freidora a 180C / 350F.", "Cocine los fideos en agua hirviendo durante 2 a 3 minutos, o hasta que se ablanden. Drene y renueve en agua helada, luego drene una vez más. Seque con papel de cocina y mezcle con un poco del aceite de oliva.", "Envuelva cada gamba en una hoja de albahaca, luego envuelva con 4-5 hilos de vermicelli.", "Baje cuidadosamente las gambas en la freidora y cocine por 2-3 minutos, o hasta que la gamba esté cocida y la pasta esté crujiente y dorada. Repita con las gambas restantes.", "Retire las gambas de la freidora, déjelas a un lado para escurrirlas sobre papel de cocina y sazone con un poco de sal y pimienta negra recién molida.", "Para la mayonesa de limón y albahaca, mezcle la ralladura de limón, las hojas de albahaca, las yemas de huevo, el vinagre y la mostaza en un procesador de alimentos hasta que quede suave. Mientras el motor todavía está funcionando, agregue lentamente el aceite hasta que la mezcla se haya emulsionado y se haya agregado todo el aceite. Sazonar con el jugo de limón, sal y pimienta negra recién molida.", "Para servir, vierta la mayonesa en el centro de las placas para servir. Coloque tres gambas en cada plato, luego esparza sobre las hojas de albahaca restantes y rocíe con aceite de oliva."], "url": "www_bbc_co_uk_food_recipes_vermicelli-wrapped_87793", "title": "Gambas envueltas en fideos con mayonesa de albahaca y limón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Medallones de venado 6 x 150 g / 5 oz, cortados del lomo", "200ml / 7fl oz de vino tinto", "4-6 ramitas de tomillo fresco", "4-6 ramitas de romero fresco", "1 diente de ajo, pelado y aplastado", "1 chalote pequeño, finamente picado", "1 zanahoria pequeña, finamente picada", "1 tallo de apio, finamente picado", "8 granos de pimienta blanca", "10 bayas de enebro, aplastadas", "2 cucharadas de aceite de semilla de uva", "sal y pimienta negra recién molida", "20 g / oz de mantequilla", "300 g / 10½oz de cerezas frescas o congeladas, sin piedras", "2 cucharaditas de jalea de grosella", "½ cucharadita de tomillo fresco picado", "110ml / 4fl oz de buen caldo de pollo", "600g / 1lb 5oz papas King Edward (o papas harinas similares), peladas y picadas", "600g / 1lb 5 oz de calabaza, pelada y picada", "5 cucharadas de aceite de oliva virgen extra", "sal y pimienta negra recién molida"], "method": ["Para la carne de venado, coloque todos los ingredientes de la carne de venado, excepto el aceite de semilla de uva y la sal y la pimienta negra recién molida, en un tazón grande, mezcle bien y colóquelos en el refrigerador para marinar durante la noche.", "Precalentar el horno a 200C / 400F / Gas 6.", "Retire la carne de venado del adobo y seque con papel de cocina. Reserve el adobo.", "Ligeramente cepille la carne de venado con una cucharada de aceite de semilla de uva y sazone con sal y pimienta negra recién molida.", "Caliente una sartén a prueba de horno hasta que esté caliente, luego agregue la cucharada restante de aceite de semilla de uva y la carne de venado. Cocine por 1-2 minutos en cada lado, luego transfiera al horno para asar durante 10-12 minutos por raro, o más largo si le gusta de mediano a bien hecho. Retire la carne de venado cuando esté cocinado a su gusto y déjelo reposar en un lugar cálido.", "Para la salsa, devuelva la cacerola en la que se cocinó el venado al fuego y agrega la mantequilla. Cuele las verduras del adobo, reserve el líquido y agregue a la sartén para freír durante 4-5 minutos.", "Agregue las cerezas, la jalea de grosella, el tomillo, el caldo y la mitad del líquido de adobo. Llevar a ebullición y cocinar para reducir el líquido a la mitad, luego pasar a través de un colador fino en un recipiente. Retire las cerezas del tamiz y regréselas al líquido filtrado.", "Para el puré, coloque la papa y la calabaza en una cacerola grande a fuego alto y cubra con agua. Llevar a ebullición, agregar una pizca de sal, luego reducir el fuego y hervir a fuego lento durante 15 minutos, o hasta que los vegetales estén tiernos.", "Escurra las papas y la calabaza, luego regrese a la sartén al fuego durante un minuto para eliminar la humedad adicional.", "Agregue el aceite de oliva y machaque la papa y la calabaza hasta que quede suave. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, coloca una cucharada de puré de papa y calabaza en el centro de cada una de las seis placas. Rebane cada medallón de venado en tres pedazos y coloque tres rebanadas en la parte superior de cada montón de puré, luego espolvoree la salsa de guindas."], "url": "www_bbc_co_uk_food_recipes_venisonwithjuniperbe_84738", "title": "Venado con bayas de enebro, salsa de guindas y puré de calabaza", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina simple de 450g / 1lb", "1 cucharadita de sal", "200 g / 7oz de manteca de cerdo", "225ml / 8 fl oz de leche", "225ml / 8fl oz de agua", "dash aceite de oliva", "2 chalotes de plátano, en rodajas finas", "1 diente de ajo, finamente picado", "450 g / 1 libra de carne de venado picada", "2 huevos de gallinas camperas, golpeados", "1 cucharadita de bayas de enebro molido", "½ cucharadita de clavo de olor molido", "1 cucharada de hojas de tomillo", "1 cucharada de perejil flatleaf, más o menos picado", "sal y pimienta negra recién molida", "Filete de carne de venado de 450 g / 1 lb, en rodajas finas", "12g de gelatina de hojas", "500ml / 18fl oz de caldo de pollo", "1 hoja de laurel", "10 granos de pimienta", "50g / 2oz de mantequilla", "500g / 1lb cebolla roja de 2oz, finamente rebanada", "1 diente de ajo, aproximadamente picado", "50 g / 2 oz de azúcar en polvo", "1 cucharadita de hojas de tomillo, recogidas", "150ml / 5fl oz de vino tinto", "75ml / 3fl oz de buen vinagre de vino tinto"], "method": ["Para la masa, coloque la harina y la sal en un bol y haga un pozo en el centro.", "Coloque la manteca en una sartén, junto con la leche y el agua y deje que hierva.", "Vierta la manteca y el agua en la harina. Mezcle con una cuchara de madera hasta que se espese y se incorpore toda la harina.", "Amasar la masa en una superficie de trabajo enharinada hasta que quede suave y elástica. Convierta la masa en una bola, envuélvala en una película adhesiva y colóquela en el refrigerador, mientras prepara el pastel.", "Para el pastel, precaliente el horno a 170 C / 340 F / Gas 3.", "Calentar una sartén hasta que esté caliente, agregar el aceite de oliva, los chalotes y el ajo y freír durante 2-3 minutos hasta que se suavice y se ponga dorado. Retirar del fuego y dejar enfriar.", "Coloque la carne de venado picada, la mitad del huevo, las bayas de enebro molidas, los clavos molidos, el tomillo y el perejil en un bol y mezcle bien con las manos.", "Agregue los chalotes enfriados, sazone con sal y pimienta negra recién molida y mezcle una vez más. Dejar de lado.", "Retire la masa de la nevera, extiéndala con un rodillo y presione dos tercios de ella en un molde para pastel, reservando el resto para la tapa.", "Coloque un cuarto de la mezcla de carne picada en la base del plato alineado, alisando los bordes. Coloque un tercio de la carne de venado en rodajas en la parte superior y sazone con sal y pimienta negra recién molida. Repita con la carne picada y el bistec restantes, colocando capas para terminar con una capa de carne picada.", "Coloque la masa restante en la parte superior y use los dedos y el pulgar para doblar los bordes. Cepille con huevo batido, reserve algo del huevo y haga un agujero en el centro del pastel con un cuchillo afilado.", "Coloque en el horno para hornear durante 1 hora y media. Retirar y enfriar durante 30 minutos.", "Aumente la temperatura del horno a 190C / 380F / Gas 5. Retire con cuidado la tarta del molde y coloque la tarta en una bandeja para hornear. Cepillar nuevamente con huevo batido, cubriendo todos los lados. Devuelva el pastel al horno por otros 20 minutos. Eliminar y enfriar.", "Para la gelatina, remoje la hoja de gelatina en un recipiente de agua fría hasta que se ablande. Coloque el caldo de pollo, la hoja de laurel y los granos de pimienta en una olla y cocine a fuego lento.", "Agregue la hoja de gelatina y cocine a fuego lento un poco más hasta que la gelatina se haya disuelto. Colar en una jarra y luego verter en el pastel a través del agujero en la parte superior, lentamente, permitiendo que el líquido se filtre en el pastel a través de todo.", "Coloque en la nevera durante al menos una hora para que se enfríe por completo.", "Para la mermelada de cebolla roja, caliente una sartén hasta que esté caliente, agregue la mantequilla, la cebolla roja picada y el ajo y fríe durante 3-4 minutos, hasta que estén blandos.", "Agregue el azúcar y el tomillo, y cocine lentamente a fuego lento durante 20 minutos, o hasta que estén suaves y caramelizados. Encienda el fuego y agregue el vino tinto y el vinagre de vino tinto. Deje hervir a fuego lento y cocine por otros 10-15 minutos hasta que el líquido se haya evaporado. Sazonar con sal y pimienta negra recién molida. Deja enfriar.", "Para servir, corta el pastel y sírvelo con la mermelada de cebolla."], "url": "www_bbc_co_uk_food_recipes_venisonpiewithredoni_89186", "title": "Pastel de venado con mermelada de cebolla roja", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50ml / 1¾fl oz de aceite de oliva", "50g / 2oz de mantequilla", "sal y pimienta negra recién molida", "4 pechugas de pollo con piel", "500ml / 17½fl oz de agua mineral", "25 g / 1 oz de azúcar", "1 cucharadita de sal", "500 g / 1lb 2 oz zanahorias bebé", "50g / 2oz de mantequilla", "25g / 1oz de perejil de hojaldre, picado", "25g / 1oz de perifollo picado"], "method": ["Precalentar el horno a 190C / 375F / Gas 5.", "Calentar una sartén hasta que esté caliente y agregar el aceite de oliva y la mantequilla.", "Sazonar el pollo y colocarlo en la sartén con la piel hacia abajo.", "Freír durante tres minutos hasta que estén dorados, voltear y colocar en el horno.", "Asar durante ocho minutos hasta que estén tiernos, luego retirar y descansar durante cinco minutos.", "En una sartén ponga el agua, el azúcar, la sal y la mantequilla, luego las zanahorias, deje hervir y baje a fuego lento.", "Las zanahorias solo deben tener una pequeña cantidad de líquido. Retire la tapa y deje que se reduzca hasta que tenga la consistencia de un jarabe espeso a fuego alto, luego agregue las hierbas picadas y sirva con el pollo."], "url": "www_bbc_co_uk_food_recipes_vichyglazedcarrotswi_83903", "title": "Pechuga de pollo con zanahorias glaseadas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["55 g / 2 oz de mantequilla", "1 cebolla picada", "300g / 10½oz de puerro, en rodajas finas", "salpicar vino blanco", "Papas de 110 g / 4 oz, peladas y en rodajas", "290ml / 10fl oz / ½ pinta de caldo de verduras", "sal y pimienta negra recién molida", "290ml / 10fl oz / ½ leche pizca", "2 cucharadas de crema", "puñado de cebolletas cortadas", "pequeño puñado de perejil picado"], "method": ["Derrita la mantequilla en una olla mediana. Agregue la cebolla y el puerro y cocínelos hasta que estén blandos, unos 10-15 minutos a fuego lento.", "Agregue un poco de vino blanco, las papas, el caldo y el condimento y cocine a fuego lento hasta que las papas estén tiernas.", "Licuar usando una licuadora de mano, o transferir a un licuadora. Pase a través de un colador antes de agregar la leche y la crema.", "Enfríe en el refrigerador hasta que esté listo para servir.", "Espolvorear con cebollino y perejil justo antes de servir."], "url": "www_bbc_co_uk_food_recipes_vichysoissesoup_83872", "title": "Sopa Vichyssoise", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["420g / 15oz de mantequilla, ablandada", "160g / 5¾oz de azúcar en polvo, más extra para rociar", "2 cucharaditas de extracto de vainilla", "Harina simple de 420g / 15oz, más extra para quitar el polvo", "210 g / 7½ oz de harina de maíz o arroz", "230 g / 8¼ oz de mantequilla sin sal, ablandada", "4 cucharadas de leche", "2 cucharaditas de extracto de vainilla", "450 g / 1 libra de azúcar glas", "1 kg / 2 lb 4 oz fresas pequeñas, sin cáscara", "Mermelada de 850 g / 1 lb 14 oz o azúcar conservante", "1 limón, solo jugo", "30 fresas, cascadas, en rodajas finas"], "method": ["Precaliente el horno a 170 ° C / 160 ° Ventilador / Gas 3. Engrase dos bandejas para hornear y forre con pergamino.", "Bata la mantequilla y el azúcar en un tazón hasta que estén pálidos y esponjosos. Agregue el extracto de vainilla.", "Tamizar y doblar la harina y la harina de maíz gradualmente hasta que se una. Amase suavemente hasta que esté suave (tenga cuidado de no trabajar demasiado). Envuelva la película adhesiva y colóquela en la nevera durante 30 minutos.", "Ponga en harina una superficie de trabajo y extienda la masa a 5 mm / ¼ de grosor. Use un cortador de galletas grande para cortar en 48 círculos. Transfiera a las bandejas de horneado preparadas y hornee durante 15-20 minutos, o hasta que estén pálidas doradas.", "Espolvoree con el azúcar impalpable restante y deje enfriar durante 10 minutos. Con cuidado transfiera a una rejilla de alambre.", "Para la crema de mantequilla, coloca la mantequilla, la mitad de la leche y todo el extracto de vainilla en un tazón grande. Batir hasta que quede suave usando una batidora eléctrica. Tamice el azúcar glas y, con la batidora a baja velocidad, continúe mezclando hasta que quede suave. Agregue un poco más de leche si es necesario.", "Para la mermelada, reserve un puñado de fresas y aplaste el resto en una pulpa áspera. Vierta la pulpa en una sartén ancha de fondo grueso. Agregue el azúcar mermelada y el jugo de limón y deje que hierva. Agregue las fresas restantes y hiérvalas durante aproximadamente 5 minutos; consulte la sección de sugerencias para saber cómo comprobar si el atasco se ha establecido. Retirar del fuego y quitar la espuma rosada. Deja enfriar.", "Pon una capa de crema, luego una capa de mermelada en un shortbread y usa otra ronda para hacer un 'sándwich'. Abanico las fresas en rodajas en la parte superior. Repita el proceso con los bizcochos restantes, crema de mantequilla, mermelada y fresas para hacer 24 sándwiches."], "url": "www_bbc_co_uk_food_recipes_victoria_sandwich_11498", "title": "Shortbread sandwich de Victoria", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Hace 24 shortbread", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]