[{"isVegetarian": true, "title": "Dark and white chocolate cherry brownies", "url": "www_bbc_co_uk_food_recipes_dark_and_white_chocolate_89301", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/dark_and_white_chocolate_89301_16x9.jpg", "ingredients": ["350g/12oz plain chocolate (minimum 55% cocoa solids)", "250g/9oz unsalted butter, plus extra for greasing", "3 large free-range eggs", "250g/9oz dark soft brown sugar", "110g/4oz plain flour", "1 tsp baking powder", "150g/5½oz fresh cherries, cut in half, stones removed ", "150g/5½oz white chocolate, roughly chopped", "1-2 tbsp cocoa powder, for dusting"], "serves": "Makes 12 brownies", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 170C/150C Fan/Gas 3. Grease a 30x23cm/12x9in baking tin with butter then line the base and sides with baking paper. ", "Heat the plain chocolate and butter in a saucepan over a low heat until just melted and well combined, stirring occasionally. Remove from the heat and set aside to cool slightly (at least 5 minutes).", "Meanwhile, whisk the eggs with the sugar in a large bowl until thick, pale and creamy.", "Whisk the cooled chocolate mixture into the egg mixture, then gently fold in the flour, baking powder and half the cherries until just combined.", "Spoon the brownie mixture into the prepared tin, then scatter over the white chocolate and the remaining cherries.", "Bake the brownies in the oven for 25-30 minutes, or until the surface is cracked and a skewer inserted into the centre of the brownies comes out with just a little mixture sticking to it. Remove from the oven and set aside to cool completely in the tin, on a wire rack.", "To serve, dust the brownies with cocoa powder, then cut into squares and remove from the tin. "]}, {"isVegetarian": true, "title": "Dark chocolate gelato", "url": "www_bbc_co_uk_food_recipes_dark_chocolate_gelato_74292", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["750ml/1¼ pint milk", "40g/1½oz cocoa powder", "5 free-range egg yolks", "80g/3oz sugar", "1 tsp vanilla extract", "200g/7oz dark chocolate, chopped"], "serves": "", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Take 50ml/2fl oz of the measured milk and combine with the cocoa powder to form a thin paste. Heat the remaining milk just to the boiling point, then remove from the heat and allow to cool slightly.", "In a large heat-proof bowl, whisk the egg yolks with the sugar until very pale and thick (this is best done with an electric whisk). ", "In a thin stream, add the hot milk to the egg mixture, whisking continuously, until completely combined. Add the cocoa paste and return the mixture to the saucepan.", "Over a medium heat, stirring constantly, cook the custard very gently for at least five minutes.  This is important to cook the cocoa powder. Continue to cook the custard very gently until it thickens and coats the back of a spoon (if you draw a line through the custard on the back of the spoon with your finger, it will stay clear). ", "Remove from the heat and pour the mixture into a large bowl. Stir in the vanilla extract and the chopped chocolate until melted. ", "Allow the mixture to cool , then refrigerate, covered, for at least eight hours, preferably overnight. ", "Churn in an ice cream maker according to the manufacturer’s instructions. Alternatively pour the mixture into a large plastic box. Cover and freeze for an hour. Remove from the freezer and whisk with a hand-held electric mixer or stick blender until the ice crystals are broken up. Repeat three more times and then freeze until firm. "]}, {"isVegetarian": true, "title": "Dark chocolate polenta cake with salted caramel sauce", "url": "www_bbc_co_uk_food_recipes_dark_chocolate_polenta_00242", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz dark chocolate, minimum 70% cocoa solids", "150g/5½oz ground almonds", "100g/3½oz polenta", "1 tsp gluten-free baking powder", "225g/8oz caster sugar", "225g/8oz butter, softened, plus extra for greasing", "3 large free-range eggs", "1 tsp vanilla extract", "crème fraîche, to serve", "100g/3½oz butter", "150g/5½oz soft dark brown sugar", "3 tbsp golden syrup", "150ml/5fl oz double cream", "1 tsp vanilla extract ", "generous pinch sea salt"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. Grease a 20cm/8in round springform tin and line the base with baking paper.", "Melt the chocolate in a heatproof bowl set over a pan of gently simmering water. Leave to cool slightly. ", "Mix together the almonds, polenta and baking powder in a small bowl.", "Beat the sugar and butter in a large mixing bowl until the mixture is light and pale. Add the eggs, one at a time, beating well after each addition. Fold through the melted chocolate until completely incorporated. Tip the bowl of dry ingredients into the chocolate mixture and fold in using a spatula, until just combined. Add the vanilla extract and fold through.", "Pour the mixture into the prepared tin and bake on the middle shelf of the oven for 40 minutes, or until a skewer comes out clean. Remove from the tin and leave to cool slightly on a wire rack. ", "For the sauce, put the butter, sugar and syrup in a saucepan. Bring to a gentle boil, then cook until the sugar has dissolved. Add the cream, vanilla and salt, then whisk. Bring to a steady simmer, then cook for 3 minutes, or until sticky and thick.", "Cut the warm cake into slices and serve with a little crème fraîche and a drizzle of sauce."]}, {"isVegetarian": false, "title": "Dark and white chocolate terrine with strawberry and ginger compôte and praline", "url": "www_bbc_co_uk_food_recipes_darkandwhitechocolat_90938", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75g/3oz caster sugar", "50g/2oz chopped hazelnuts", "200g/7oz good quality dark chocolate, minimum 70 per cent cocoa solids, roughly chopped", "125ml/4½fl oz warm water", "4 free-range egg yolks", "50g/2oz caster sugar", "200ml/7fl oz double cream", "3 gelatine leaves, soaked in cold water to soften, then squeezed dry", "200g/7oz white chocolate, roughly chopped", "4 free-range egg yolks", "50g/2oz caster sugar", "2 gelatine leaves, soaked in cold water to soften, then squeezed dry", "200ml/7fl oz double cream", "450g/1lb strawberries, hulls removed, cut in half", "30g/1¼oz stem ginger (from a jar), roughly chopped", "2 tbsp icing sugar", "25g/1oz butter"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the praline, line a baking tray with greaseproof paper. Heat a frying pan over a high heat until hot. Add the sugar and cook until the sugar has completely melted and is sticky and golden-brown.", "Add the chopped hazelnuts and stir until they are coated in the sugar mixture, then pour the mixture onto the prepared baking tray. Set aside until the mixture has hardened.", "When the praline mixture has hardened, cover with a sheet of cling film and break into small pieces using a toffee hammer or rolling pin. Set aside.", "For the dark chocolate mousse, bring a pan of water to a simmer. Suspend a heatproof bowl over the water (do not allow the base of the bowl to touch the water). Add the dark chocolate and warm water to the bowl and stir until smooth and glossy and completely melted. Remove from the heat and set aside to cool slightly.", "Suspend a separate, clean bowl over the pan of simmering water, add the egg yolks and sugar and whisk continuously for 3-4 minutes, or until the mixture is pale and has thickened. Remove from the heat and set aside to cool slightly.", "Place half of the cream and the softened gelatine into a separate pan and heat gently over a medium heat, stirring until the gelatine has dissolved.", "Add the cream mixture to the melted chocolate and whisk until well combined.", "Add the egg yolk and sugar mixture and whisk again until well combined.", "In a separate bowl, whip the remaining cream until soft peaks form when the whisk is removed. Fold the whipped cream into the chocolate mixture.", "Line a 1kg/2lb loaf tin with cling film. Carefully pour the dark chocolate mixture into the loaf tin and tap the sides gently to get rid of any air bubbles. Chill the fridge for at least 30 minutes, or until just set.", "For the white chocolate mousse, suspend a clean heatproof bowl over the pan of simmering water (do not allow the base of the bowl to touch the water). Add the white chocolate to the bowl and stir until smooth and glossy and completely melted. Remove from the heat and set aside to cool slightly.", "Suspend a separate, clean bowl over the pan of simmering water, add the egg yolks and sugar and whisk continuously for 3-4 minutes, or until the mixture is pale and has thickened. Remove from the heat and set aside to cool slightly.", "Place half of the cream and the softened gelatine into a pan and heat gently over a medium heat, stirring until the gelatine has dissolved.", "Add the cream mixture to the melted chocolate and whisk until well combined.", "Add the egg yolk and sugar mixture and whisk again until well combined.", "In a separate bowl, whip the remaining cream until soft peaks form when the whisk is removed. Fold the whipped cream into the chocolate mixture. ", "When the dark chocolate mousse has just set, carefully pour the white chocolate mixture into the loaf tin, on top of the dark chocolate mousse, then tap the sides gently to get rid of any air bubbles. Chill the fridge for at least two hours, or until completely set. ", "For the strawberry and ginger compote, blend 250g/9oz of the strawberries, all of the stem ginger and the icing sugar in a food processor to a purée.", "Pass the mixture through a fine sieve, collecting the sieved liquid in a bowl. Reserve the liquid.", "Heat the butter in a frying pan over a medium heat. When the butter is foaming, add the remaining strawberries and fry for 1-2 minutes, or until just softened.", "To serve, spoon a little of the strawberry and ginger compote into the centre of each of eight serving plates. Cut the dark and white chocolate terrine into eight slices using a hot knife. Place one slice into the centre of each plate. Garnish each plate with a few of the remaining strawberry halves. Sprinkle over the praline pieces."]}, {"isVegetarian": true, "title": "Dark cherry and hazelnut biscotti", "url": "www_bbc_co_uk_food_recipes_darkcherryandhazelnu_92470", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/darkcherryandhazelnu_92470_16x9.jpg", "ingredients": ["250g/9oz plain flour", "250g/9oz caster sugar", "1½ tsp baking powder", "3 medium free-range eggs, lightly beaten", "250g/9oz dried black cherries, chopped", "125g/4½oz whole hazelnuts, shells removed (shelled weight)", "1 lemon, zest only"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the biscotti, preheat the oven to 150C/300F/Gas 2. Line a baking tray with greaseproof paper.", "Mix together the flour, sugar and baking powder in a bowl until well combined. ", "Whisk in half of the beaten eggs until well combined. Gradually add the remaining beaten egg, a little at a time, making sure all of the egg has been fully incorporated into the mixture before adding more, until the mixture comes together as a dough. (NB: You may not need to use all of the egg.)", "Add the cherries, hazelnuts and lemon zest and mix well.", "Divide the dough into six equal portions. Roll each portion into a sausage shape about 3cm/1¼in in diameter, using your hands. Gently flatten each portion of dough with the palm of your hand.", "Place each dough 'sausage' onto the prepared baking tray, leaving a 6cm/2½in gap between each portion of dough to allow for expansion. Bake in the oven for 15-20 minutes, until pale golden-brown.", "Remove the 'sausages' from the oven and set aside for 10 minutes to cool and firm up.", "Using a serrated knife, cut 5cm/2in thick slices from the dough 'sausages' on the diagonal. Arrange the slices onto the lined baking tray and return them to the oven for a further 6-8 minutes.", "Turn the biscotti over and continue to bake for 6-8 minutes, or until crisp and golden-brown. Set aside to cool on a wire rack. "]}, {"isVegetarian": true, "title": "Dark chocolate and coffee terrine with coffee crème anglaise", "url": "www_bbc_co_uk_food_recipes_darkchocolateandcoff_91608", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["vegetable oil, for greasing", "600g/1lb 5oz dark chocolate, roughly chopped", "600ml/1 pint 1½fl oz double cream", "8 free-range egg yolks", "125g/4½oz caster sugar", "75ml/3½fl oz cold water", "125g/4½oz boudoir biscuits or sponge fingers", "200ml/7fl oz chilled coffee", "200ml/7fl oz double cream", "200ml/7fl oz milk", "25g/1oz roasted coffee beans", "6 free-range egg yolks", "75g/3oz caster sugar", "40-50 chocolate-coated coffee beans"], "serves": "Serves 8", "time": {"preparation": "over 2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["For the terrine, lightly grease a 1.5kg/3lb 4oz loaf tin with a little oil and line with cling film, pressing into the corners.", "Place the chocolate into a heatproof bowl set over a pan of simmering water to melt (make sure the bottom of the bowl doesn't touch the water). Once melted, remove the bowl from the pan and stir in half of the double cream. Set aside.", "Place a clean heatproof bowl over a pan of simmering water (again making sure the bottom of the bowl doesn't touch the water), add the egg yolks and sugar and whisk for 3-4 minutes, or until the mixture is pale and thickened. ", "Whisk the egg and sugar mixture into the chocolate until well combined, then whisk in the cold water.", "Whisk the remaining double cream in a bowl until soft peaks form when the whisk is removed. Gently fold the whipped cream into the chocolate mixture until just combined. ", "Dip the boudoir biscuits or sponge fingers into a bowl of the chilled coffee, then arrange the soaked biscuits vertically along the sides of the prepared loaf tin. Make sure there are no gaps between each biscuit. ", "Spoon the chocolate mixture into the centre, then tap the tin lightly on the work surface to even out the mixture, ensuring the mixture goes into the corners. Cover with cling film and chill in the fridge for at least two hours, or until set. ", "For the coffee crème anglaise, place the double cream, milk and roasted coffee beans into a pan and bring to a simmer.", "Whisk the egg yolks and sugar together in a bowl, then slowly pour in the warm cream mixture, whisking continuously until well combined. Pour the mixture back into a clean pan and cook over a low heat for 4-5 minutes, or until the mixture coats the back of a wooden spoon. ", "Pass the mixture through a fine sieve into a bowl and allow to cool slightly before chilling in the fridge for at least 30 minutes. ", "To serve, remove the terrine from the fridge 30 minutes before serving to allow it to soften slightly. Turn out from the tin onto a plate and remove the cling film. Using a hot knife, thickly slice the terrine and place a slice onto each serving plate. Spoon the chilled crème anglaise around the plate and decorate the plate with a few chocolate-coated coffee beans."]}, {"isVegetarian": true, "title": "Dark chocolate and pear filo pastry cups", "url": "www_bbc_co_uk_food_recipes_darkchocolateandpear_14573", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4-5 layers filo pastry ", "2 pear halves ", "55g/2oz dark chocolate ", "2 eggs, yolks only ", "55ml/2fl oz double cream ", "30g/1oz caster sugar"], "serves": "Serves 1 per person", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Lay the filo pastry on a damp surface and cut into a square. Grease a dariole mould with butter and place the pastry inside so it falls over the sides. Place in a hot oven 200C/400F/Gas 6 for a few minutes. ", "Melt the chocolate over a bain marie (simmering water in a pan, with the bowl of chocolate sitting over the top). ", "In a separate bowl beat the egg mixture along with the double cream. Add the chocolate and mix together ", "Chop up the pears into small pieces and place in the mould. Pour the mixture into the mould and serve."]}, {"isVegetarian": true, "title": "Dark chocolate tart with Turkish delight", "url": "www_bbc_co_uk_food_recipes_darkchocolatetartwit_89320", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["butter, for greasing", "flour, for dusting", "375g/13oz ready-made sweet pastry", "400g/14oz dark chocolate, 85 per cent cocoa solids, roughly chopped", "250ml/9fl oz double cream", "2 free-range egg yolks, beaten", "450g/1lb granulated sugar", "1 lemon, juice only", "550ml/19½fl oz water", "75g/3oz cornflour", "1 tsp cream of tartar", "3 tbsp rosewater", "3 tbsp icing sugar, plus extra for dusting", "110g/4oz dark chocolate, 85 per cent cocoa solids, melted", "vanilla ice cream"], "serves": "Serves 6-8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Grease a 20cm/8in loose-bottomed tart tin. ", "On a lightly floured work-surface, roll out the sweet pastry to a size large enough to line the tart tin with a little excess all around. ", "Line the tart tin with the pastry, pressing the pastry into the edges. Trim off the excess pastry with a sharp knife and cover with cling film. Place into the fridge to chill for 30 minutes.", "Preheat the oven to 180C/360F/Gas 4.", "Remove the tart case from the fridge and uncover. Line the pastry with baking parchment then fill with baking beans (or uncooked rice).", "Transfer to the oven to bake blind for 10-15 minutes, then remove the greaseproof paper and baking beans (or rice) and return to the oven to bake for a further 3-5 minutes, until it is just cooked and golden-brown. Remove from the oven and set aside.", "Reduce the oven temperature to 170C/345F/Gas 3.", "Meanwhile, place the chocolate into a heatproof bowl and place over a pan of barely simmering water (do not let the water touch the base of the bowl). Leave to heat until melted, then remove the bowl from the heat.", "Add the cream and the egg yolks and whisk into the chocolate until combined.", "Carefully pour the chocolate mixture into the pre-cooked pastry case, smoothing out the mixture to fill the case to the edges.", "Place the chocolate tart into the oven to bake for 15 minutes, or until the chocolate filling is just set. Remove from the oven and allow to cool to room temperature before serving.", "For the Turkish delight, line a 23cm/9in square deep baking tray with baking parchment.", "Place 350ml/12½fl oz of the water, the cornflour and cream of tartar into a separate pan and whisk together well. Place over a medium heat and cook until the mixture has thickened. ", "Meanwhile, place the sugar and the remaining 200ml/7fl oz water and the lemon juice into a pan and place over a medium heat. Bring to the boil and heat to 116C/240F (you will need a sugar thermometer).", "When the sugar and water mixture has reached 116C/240F, add the cornflour mixture and whisk vigorously to combine. Return to the heat and cook over a low heat for 20-30 minutes, until thickened and light golden-brown.", "Remove from the heat, add the rosewater and stir well.", "Pour the Turkish delight mixture into the parchment-lined tray and smooth to the edges. Allow to cool, then transfer to the fridge to chill for 1-2 hours, or until completely set.", "When the Turkish delight is set, dust a piece of baking parchment with icing sugar, then turn out the set Turkish delight onto the paper. Cut the Turkish delight into squares.", "Dust one third of the squares with icing sugar and set aside.", "Dip the remaining squares of Turkish delight into the melted chocolate and place onto a plate. Place into the fridge to chill and for the chocolate coating to set.", "To serve, place a slice of the chocolate tart into the centre of each plate. Place two pieces of chocolate-coated Turkish delight and one piece of plain Turkish delight alongside. Serve with a spoonful of vanilla ice cream."]}, {"isVegetarian": true, "title": "Date and walnut scones", "url": "www_bbc_co_uk_food_recipes_date_and_walnut_scones_11690", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225ml/8fl oz milk ", "6 tbsp hazelnut liqueur", "55g/2oz chopped dates ", "500g/1lb 2oz self-raising flour ", "30g/1oz baking powder ", "85g/3oz sugar ", "85g/3oz butter, cubed", "2 free-range eggs", "55g/2oz chopped walnuts "], "serves": "Makes 6 scones", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Remove all racks from the oven except the central rack and preheat to 200C/400F/Gas 6. Grease and flour a baking tray.", "Pour the milk and hazelnut liqueur into a pan, add the dates and heat gently. Remove from the heat set aside to cool and infuse. Drain the dates, reserving the milk and hazelnut liqueur.", "Sift the flour and baking powder into a large bowl and add the sugar and butter.  Rub together until the mixture resembles coarse breadcrumbs.", "In a separate bowl, beat the eggs with the cooled hazelnut milk.  ", "Make a well in the middle of the butter and flour mixture and slowly add the egg mixture, reserving two tablespoons of the liquid to glaze the scones.  ", "Add the drained dates and walnuts to the mixture and combine to make a dough. ", "Gently work the dough until smooth, but do not over work.  ", "Roll out the dough on a floured surface to a thickness of 4cm/1½in, cut out into scone shapes using a round cutter and place onto the prepared baking tray. ", "Brush the reserved egg and milk over the top of the scones, bake for 15 minutes, or until golden-brown."]}, {"isVegetarian": true, "title": "Dauphinoise potatoes", "url": "www_bbc_co_uk_food_recipes_dauphinoisepotatoes_90205", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/dauphinoisepotatoes_90205_16x9.jpg", "ingredients": ["1 kg/2lb 4oz baking potatoes, peeled and placed in a bowl of cold water to prevent them from browning (use floury potatoes such as Russet, King Edward, Maris Piper or Desiree)", "3-4 cloves garlic", "500ml/17½fl oz double cream (you may need a bit extra)", "salt and freshly ground black pepper"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 160C/320F/Gas 2.", "Slice the potatoes into thin slices, about 3mm/⅛in thick. Place the slices into a bowl as you cut them.", "Trim the ends off the garlic cloves but don't peel. Grate the cloves on a grater. The flesh will go through the fine holes and the skins will be left behind. Scrape the grated garlic flesh into the bowl with the potatoes.", "Season the potatoes, to taste, with salt and freshly ground black pepper.", "Pour the cream over the potatoes and mix well again.", "Place the potato slices into the gratin dish. They should come to just below the top of the dish. Press the potato down with the back of a spoon or your hands so it forms a solid layer. The cream should come to just below the top layer of potato (top up with more double cream if necessary).", "Place the potatoes in the oven and bake for 1-1½ hours, or until the potatoes are completely tender. (If the cream looks like it's splitting, your oven is too hot, so turn it down a bit.)", "Serve the dauphinoise as a side dish to roasted meat or poultry."]}, {"isVegetarian": true, "title": "Date parcels stuffed with frangipane and pomegranate", "url": "www_bbc_co_uk_food_recipes_date_parcels_stuffed_58807", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/date_parcels_stuffed_58807_16x9.jpg", "ingredients": ["16 large medjool dates, stoned and halved", "40g/1½oz soya margarine ", "6 sheets vegan filo pastry, halved widthways", "sunflower oil, for deep frying", "1 tbsp rosewater", "40g/1½oz caster sugar", "6 tbsp water", "70g/2½oz ground almonds", "30g/1oz fresh pomegranate seeds", "50g/1¾oz shelled pistachios, chopped", "50g/1¾oz fresh pomegranate seeds"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Place the halved dates between two sheets of greaseproof paper. Using a rolling pin, roll firmly to flatten into a rectangle about 13cm x 25cm/5in x 10in. Lay the greaseproof-wrapped date sheet onto a baking tray and leave to set in the fridge for 30-40 minutes.", "Meanwhile, make the frangipane. Mix the rosewater, sugar and water in a small pan and heat gently until the sugar has dissolved. Add the ground almonds and beat to make a smooth, thick paste.", "Put the soya margarine into a small pan and heat gently to melt. Then pour into a bowl and set aside until needed. ", "To assemble, take the date sheet out of the fridge and set it on a flat board. Peel off the top layer of greaseproof paper, trim the edges to make them neat and cut the date sheet into three rectangular pieces, each about 12cm x 8cm/4½in x 3¼in. Divide the frangipane between the date pieces, spreading it down the length in the middle of each and leaving a small gap at each end. Sprinkle over the pomegranate seeds and roll each piece into a long sausage shape. Using a sharp knife, trim the ends and cut each roll into four pieces.", "Preheat the oven to 190C/375F/Gas 5. Take a piece of filo pastry and brush the edges with the melted margarine. Roll up a date piece in the pastry, twisting each end like a wrapped sweet to seal.  Trim the ends with a sharp knife. Repeat with the remaining pastry and date pieces, then transfer to the fridge for 15 minutes.", "Meanwhile, scatter the chopped pistachios over a non-stick baking tray and roast in the oven for 6-8 minutes, or until lightly toasted. Remove from the oven and reserve for the garnish.", "To finish the date parcels, heat the sunflower oil in a deep pan to 180C/350F. (CAUTION: Do not leave the hot oil unattended.) Drop an off-cut of pastry into the oil; if it sizzles and rises to the top, the oil is hot enough.  Fry the date parcels in batches for about four minutes, or until golden-brown, then drain on kitchen paper. Serve garnished with the pomegranate seeds and toasted pistachios."]}, {"isVegetarian": true, "title": "Deconstructed cream tea", "url": "www_bbc_co_uk_food_recipes_deconstructed_cream_tea_18986", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/deconstructed_cream_tea_18986_16x9.jpg", "ingredients": ["1kg/2lb 4oz strawberries, hulled", "1kg/2lb 4oz jam sugar", "½ tsp lemon juice", "25g/1oz butter", "150ml/5½fl oz champagne", "400g/14oz strong white flour, plus extra for dusting", "3 tsp baking powder", "75g/2½oz sugar", "75g/2½oz butter", "2 free-range eggs, beaten", "250ml/9fl oz milk", "1 free-range egg, beaten for egg wash", "clotted cream, to serve"], "serves": "Serves 24 scone fingers", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["To make the strawberry compôte, put the strawberries, sugar and lemon juice into a large pan and gently mix together.", "On a low heat, warm the mixture. Once the sugar has dissolved increase the heat and boil rapidly for five minutes. Remove the pan from the heat and stir in the butter.", "Leave to cool for 15 minutes, then stir in the champagne. Pour into sterilised jars.", "To make the scone fingers, preheat the oven to 220C/425F/Gas 7 and line a baking tray with baking parchment. ", "Place the flour, baking powder and sugar in a bowl. Add the butter and rub in using your fingers until the mixture resembles breadcrumbs.", "Add the eggs and mix in. Gradually add the milk bringing everything together to form a soft dough.  You may not need all the milk.", "Sprinkle a generous handful of flour onto a work surface. Tip the dough out onto it and sprinkle more flour on top. Use your hands to fold the dough in half, and then turn 90 degrees and repeat. Do this a few times until a smooth dough is formed. If the dough becomes sticky, use extra flour to coat your hands but try not to overwork the dough.", "Sprinkle a little more flour onto the work surface. Roll out the dough to 1.5cm/ ½in thick and  into a rectangle approximately 22x25cm/9x10in. Trim the edges to neaten the rectangle.", "Roll a docker over the surface or prick all over with a fork. Score the dough to mark out finger-sized rectangles (two lines vertically and eight horizontally to make 24 scone fingers).", "Brush the top with egg wash and bake for 15-17 minutes, or until risen and golden-brown. Remove from the oven and cut through the scored lines to make the fingers. Leave to cool.", "Serve the scone fingers with the strawberry compôte and clotted cream."]}, {"isVegetarian": false, "title": "Deconstructed kebab", "url": "www_bbc_co_uk_food_recipes_deconstructed_kebab_99889", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["10 unwaxed lemons, cut into 5mm/¼-inch slices", "60g/2¼oz flaked sea salt", "200ml/7fl oz rapeseed oil", "175ml/6fl oz olive oil", "1 tbsp sweet paprika", "½ tsp chilli flakes", "1 tsp cumin seeds, toasted and ground", "50ml/2fl oz olive oil", "1 large onion, chopped                     ", "50g/1¾oz pistachio nuts, roughly chopped", "50g/1¾oz pine nuts, roughly chopped", "4 garlic cloves, chopped", "500g/1lb 2oz beef mince", "250g/9oz lamb mince", "1 tsp sweet paprika", "1 tsp cumin seeds, toasted and ground", "1 tsp ground turmeric", "1 tbsp cured lemon paste (see above)", "salt and freshly ground black pepper ", " 250g/9oz Kalamata olives, pitted", "1 sprig fresh thyme, leaves only", "1 tsp soy sauce", "1 tbsp rapeseed oil", "1 bunch watercress, thick stems removed", "1 bunch basil", "1½ tbsp pine nuts, toasted", "½ tsp runny honey", "25g/1oz Parmesan, finely grated", "1–2 garlic cloves, chopped (to taste)", "2 tbsp lemon juice", "50ml/2 fl oz olive oil", "50ml/2 fl oz rapeseed oil", "salt, to taste", "200g/7oz Greek yoghurt", "5 tbsp tahini", "squeeze of lemon juice", "harissa", "8 pitta breads"], "serves": "Serves 8", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["For the lemon paste, sterilize a 2-litre/3½-pint airtight container and arrange one layer of the lemon slices in the container, then sprinkle with some of the salt. Repeat this process until all the lemons and salt are used up. Cover with the oils and seal the container. These can be used after three days and kept for up to a week.", "To make the paste, strain the lemons from the oil and reserve the oil. Put the lemons in a food processor and add the spices. Blend, adding enough oil as you go to make a paste.", "For the kebab, put a large, shallow pan over a medium heat. Add the oil and onion and sweat for 5 minutes. Add the pistachios and pine nuts and sauté for another 5 minutes. Add the garlic and sauté for 3 minutes.", "Add both types of mince, in batches, breaking up each batch with a wooden spoon and allowing it to cook for 3–4 minutes before you add the next batch. Increase the heat to high and cook, stirring, for 10–15 minutes. Stir in the spices and lemon paste and season with salt and pepper. Reduce the heat to medium and cook for 5 minutes.", "For the tapenade, put all the ingredients except the oil in a blender and blend. Gradually add the oil until you have the right consistency. ", "For the pesto, put all the ingredients in a blender and blend until combined. ", "For the tahigurt, mix all the ingredients together in a bowl. Divide between four plates. ", "Spoon the meat over the tahigurt. Spoon over the toppings and serve with theharissa and pittas. "]}, {"isVegetarian": true, "title": "Deep-filled homity pie", "url": "www_bbc_co_uk_food_recipes_deep-filled_homity_pie_48616", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/deep-filled_homity_pie_48616_16x9.jpg", "ingredients": ["125g/4oz plain flour, plus extra for rolling", "125g/4oz wholemeal flour", "150g/5oz butter", "1 free-range egg, beaten", "850g/1lb 14oz floury potatoes, such as Maris Piper or King Edward, peeled and cut into quarters", "25g/1oz butter", "1 tbsp sunflower oil", "3 onions, halved and sliced", "2 garlic cloves, crushed", "100g/3½oz baby spinach leaves", "175g/6oz mature cheddar cheese, coarsely grated", "2 tbsp chopped fresh parsley leaves", "250ml/9fl oz double cream", "pinch freshly grated nutmeg", "flaked sea salt and freshly ground black pepper"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Put the flour and butter in a food processor and blend until the mixture resembles fine breadcrumbs. Add the egg and pulse until the mixture just comes together as a dough.  Bring the dough together and flatten into a round.", "Put the pastry in the centre of a 20cm/8in springform cake tin and carefully ease it over the base and up the sides of the tin. ", "Cook the potatoes in boiling water for 15 minutes, or until just tender. Drain in a colander, tip back into the saucepan and cut into 3cm/1¼in pieces with a round-bladed knife. ", "Melt the butter and oil in a frying pan and fry the onions gently for 15 minutes, or until soft and pale golden-brown. Add the garlic and cook for two further minutes, stirring regularly. ", "Preheat the oven to 200C/180C (fan)/Gas 6.  ", "Add the onions and garlic to the potatoes and sprinkle with 100g/3½oz of the cheese and the parsley. Add the spinach leaves and season with nutmeg, salt and freshly ground black pepper. Mix all the ingredients together until well combined.", "Spoon the filling mixture into the pastry case. Pour over the cream and allow it to drizzle down between the layers. Sprinkle the remaining cheese on top. Place the tin on a baking tray and bake in the oven for 40-45 minutes, or until the pastry is crisp and pale golden-brown.", "Leave the pie to cool in the tin for 10 minutes. Remove the pie from the tin and place it on a serving plate. Cut into thick wedges with a sharp knife."]}, {"isVegetarian": true, "title": "Deep-filled lemon meringue pie", "url": "www_bbc_co_uk_food_recipes_deep-filled_lemon_50034", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz plain flour, plus extra for dusting", "1 tsp caster sugar", "125g/4½oz cold butter, cut into cubes", "1 free-range egg, beaten", "50g/1¾oz cornflour", "350ml/12fl oz cold water", "200g/7oz caster sugar", "4 lemons, zest and juice ", "1 free-range egg plus 3 free-range eggs yolks", "3 free-range eggs whites", "175g/6oz caster sugar", "½ tsp vanilla extract"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. Grease a 20cm/8in fluted flan tin.", "To make the pastry, place the flour, sugar and the butter in a food processor and pulse until the mixture resembles fine breadcrumbs. With the motor running, gradually add the beaten egg and blend until the mixture forms a ball. Do not over blend or the pastry will be tough.", "Tip onto a floured board, knead briefly, then roll out to a 5mm/¼in thickness, turning the pastry and flouring the surface regularly. Use it to a line the prepared flan tin. Trim the edges neatly, prick the base lightly with a fork and chill the pastry for 30 minutes. ", "While the pastry is resting, make the filling. Put the cornflour in a small bowl and mix with enough of the cold water to make a thin paste then set aside. Pour the remaining water into a large saucepan and add the sugar, lemon zest and juice. (You should have around 225ml/8fl oz lemon juice.) Heat gently until the sugar dissolves then bring to the boil. Reduce the heat slightly and quickly stir in the cornflour mixture - the sauce should thicken immediately. ", "Cook over a low heat for three minutes, stirring until thickened and glossy. Remove from the heat and cool for five minutes. Whisk the egg yolks with the whole egg until smooth, then whisk vigorously into the sauce. Set aside to cool for 25 minutes.", "Put the pastry case on a sturdy baking tray, line with crumpled baking parchment and fill with baking beans. Bake blind for 15 minutes then carefully take out of the oven and remove the paper and beans. Return to the oven for a further 3-4 minutes until the surface of the pastry is dry. Remove from the oven and reduce the temperature to 150C/300F/Gas 2. ", "For the meringue topping, whisk the egg whites in a large bowl until stiff then gradually whisk in half the sugar. Add the vanilla extract and whisk in the remaining sugar. ", "Stir the cooled lemon filling and pour into the pastry case. Cover very gently with large dessertspoonfuls of the meringue topping, starting at the sides then working your way into the middle, and gently swirl the top. Bake for 25 minutes or until the meringue is set and very lightly browned. Leave to cool before removing from the tin."]}, {"isVegetarian": false, "title": "Deep-fried aubergine with halibut and miso", "url": "www_bbc_co_uk_food_recipes_deep-fried_aubergine_80854", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150ml/5fl oz white miso", "150g/5oz caster sugar", "vegetable oil, for deep frying", "2 aubergines, cut into 1-2cm/½-¾in cubes", "2 tbsp roughly chopped fresh coriander", "50g/2oz butter", "500g/1lb 2oz halibut fillet, skin and pin bones removed, flesh cut into 8 pieces", "100g/3½oz edamame beans", "1 tbsp white sesame seeds", "1 tbsp black sesame seeds", "2 tbsp micro-cress, ideally a mixture of red amaranth and bronze fennel fronds"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Dissolve the miso and sugar in 50ml/2fl oz of water in a saucepan, then bring the mixture to the boil. Reduce the heat and simmer for 8-10 minutes, or until it has thickened and darkened in colour. Decant the mixture into an airtight container such as a squeezy bottle fitted with a small nozzle lid (it can be kept like this in the fridge for 1 week).", "Heat the oil in a deep-fat fryer to 180C. Alternatively, heat the oil in a deep, heavy-based frying pan until a breadcrumb sizzles and turns brown when dropped into it. (Caution: hot oil can be dangerous. Do not leave unattended.)", "Deep-fry the diced aubergine, in batches if necessary, for 2-3 minutes, or until golden-brown and crisp. Remove from the oil using a slotted spoon, then set aside to drain on kitchen paper. Sprinkle over the chopped coriander and mix together. Repeat the process with the remaining aubergine.", "Heat the butter in a large frying pan over a medium to high heat. When the butter is foaming, add the halibut pieces (in batches if necessary) and fry on each side for 2-3 minutes, or until golden-brown and just cooked through. Add the edamame beans and continue to fry until warmed through.", "Mix the sesame seeds together.", "To serve, spoon the fried aubergines onto the serving plates, scatter over the edamame beans, then sprinkle the sesame seeds on top. Finish with 2 pieces of fish and a drizzle of the miso sauce, then garnish with the mixed cress."]}, {"isVegetarian": false, "title": "Daube of beef with greens and colcannon mash", "url": "www_bbc_co_uk_food_recipes_daubeofbeefwithgreen_92028", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp olive oil ", "10 shallots, peeled and left whole", "3 bay leaves", "350g/¾lb dry-cured bacon lardons", "handful fresh thyme sprigs, on the branch, washed, tied together tightly with string", "5 garlic cloves, peeled, chopped", "750ml/1¼ pints red wine", "2.5kg/5½lb chuck steak or braising steak, cut into 4cm/1½in cubes", "salt and freshly ground black pepper", "1 litre/1¾ pints beef stock", "2 x 415g/14½oz cans beef consommé", "1kg/1¾ lbs floury potatoes, such as King Edward or Maris Piper, peeled and cut into quarters", "40g/1½oz butter", "150ml/5fl oz milk", "1 x 350g/12½oz head spring greens, leaves only", "pinch freshly grated nutmeg", "4 spring onions, trimmed, sliced", "30g/1oz chopped fresh flatleaf parsley"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 170C/325F/Gas 3. ", "Heat the oil in a large roasting tray over a medium heat. Add the shallots, bay leaves, bacon lardons, thyme and garlic, and fry gently for 10-15 minutes, or until the shallots have softened and are translucent and the bacon lardons are beginning to brown and stick to the bottom of the pan. ", "Add the wine and scrape the sediment from the bottom of the roasting tray using a wooden spoon. Bring the wine to a simmer and continue to simmer for 8-10 minutes, or until the volume of liquid has reduced. ", "Season the cubed meat, to taste, with salt and freshly ground black pepper.", "Lay the seasoned meat on top of the shallots, lardons and wine mixture without  mixing it. Pour over the stock and consommé so that the meat is all well covered. ", "Bring the mixture to a simmer, then cover the tray with foil and transfer to the oven. Cook for 2½-3½ hours. Test the meat for tenderness after 1½ hours by squeezing a piece between your thumb and forefinger. If it gives, remove the foil covering and continue to cook the beef daube, uncovered, for the remaining cooking time, until the sauce has thickened and the beef is tender.", "Meanwhile, thirty minutes before serving, bring the potatoes to the boil in a pan of salted water. Cover and simmer for 15-20 minutes, or until tender, then drain well. ", "Return the cooked potatoes to the pan, add the butter and milk and return the pan to the heat. Mash until smooth, then season, to taste, with salt, freshly ground black pepper and nutmeg. ", "Bring another pan of water to the boil, then add the spring greens leaves and a pinch of salt. Boil for 4-5 minutes, stirring occasionally, or until just tender, then drain well. ", "When the beef is really tender and the sauce has thickened, remove the beef daube from the oven and set aside to rest for 10 minutes. ", "Just before serving, stir the cooked spring greens and chopped spring onions into the mashed potato and stir until well combined.", "To serve, spoon some of the colcannon mash into the centre of each of four serving plates. Spoon over the beef daube, in its sauce. Garnish with the chopped parsley."]}, {"isVegetarian": true, "title": "Date and toffee pudding with caramelised bananas and the ultimate toffee sauce", "url": "www_bbc_co_uk_food_recipes_date_and_toffee_pudding_38967", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150ml/5fl oz dark rum", "1 vanilla pod, split in half and the seeds scraped out", "250g/9oz chopped dates", "125g/4½oz butter, softened, plus extra for greasing", "125g/4½oz soft dark brown sugar", "3 free-range eggs", "150g/5½oz plain flour, plus extra for dusting", "2 tsp bicarbonate of soda", "2 bananas, peeled and thinly sliced", "demerara sugar, for dusting", "175g/6oz demerara sugar", "1 tbsp golden syrup", "1 tbsp black treacle", "170g/5¾oz butter", "500ml/18fl oz double cream", "pinch salt"], "serves": "Serves 6-8", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["In a pan bring the rum, 250ml/9fl oz water and the vanilla seeds to the boil. Place the dates in a bowl, pour the liquid over the dates and leave to soak for an hour. ", "Preheat the oven to 180C/350F/Gas 4. Grease and flour 6-8 individual moulds or loaf tins (depending on how many people you are serving).  ", "Cream the butter and the soft dark brown sugar with an electric hand-whisk in a bowl. Add the eggs one at a time, beating between each addition. Sift in the flour and bicarbonate of soda. Mix and then fold in the date and rum mixture.", "Spoon the mixture into the prepared cake tins and bake in the oven for 12-15 minutes, or until just firm to the touch. Once cooked, remove from the oven and place on a wire rack to cool.", "For the toffee sauce, put the sugar, syrup, treacle and butter into a pan and bring to the boil. Turn down the heat and cook, without stirring, until all the sugar crystals have dissolved and you have a deep-brown caramel. Meanwhile, gently warm the cream in a saucepan. Remove the caramel from the heat and carefully add one-third of the cream. Once the bubbling has subsided, whisk in the remaining cream. Add a pinch of salt and pass through a fine sieve. Set aside until needed.", "Fan the banana slices into circles on top of the cooked puddings. Dust with demerara sugar and caramelise with a cooks’ blowtorch (alternatively place the puddings under a very hot grill). Set aside for a few minutes to allow the sugar to cool and set, then serve with the toffee sauce. "]}, {"isVegetarian": false, "title": "Deep-fried chicken wings al ajillo with braised peas and serrano ham with eggs", "url": "www_bbc_co_uk_food_recipes_deep-fried_chicken_wings_91652", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/deep-fried_chicken_wings_91652_16x9.jpg", "ingredients": ["16 large, meaty, free-range chicken wings ", "olive or sunflower oil, for deep-frying ", "4 garlic cloves", "sea salt", "4 tbsp extra virgin olive oil ", "1 tsp crushed dried chillies", "1 tsp sweet paprika (pimentón) ", "3 tsp sherry vinegar ", "6 tbsp olive oil ", "200g/7oz shallots, finely chopped ", "8 garlic cloves, thinly sliced", "900g/2lb shelled peas, fresh or frozen ", "200ml/7fl oz chicken stock, preferably homemade", "150g/5oz thinly sliced Serrano ham, finely shredded", "sea salt and freshly ground black pepper", "4 free-range eggs"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cut the pointy tips from each chicken wing and discard. Dry the wings well on kitchen paper. ", "Heat the oil for deep-frying to 180C/350F (use a cooking thermometer), or alternatively use a deep fat fryer. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Deep fry a quarter of the chicken wings for 6-7 minutes, until cooked through, crisp and golden-brown. ", "Meanwhile, for the dressing, put the garlic cloves on a board, sprinkle with some salt and crush them into a smooth paste with the flat side of a large knife. ", "Put the extra virgin olive oil and the crushed garlic in a small pan over a medium-low heat. As soon as the garlic begins to sizzle, add the crushed dried chillies and cook very gently for two minutes, until the garlic is very lightly golden-brown. ", "Stir in the sweet paprika and sherry vinegar and remove from the heat. ", "As soon as the first batch of chicken wings is cooked, remove them from the oil with a slotted spoon and drain them briefly on kitchen paper. Tip them into a serving bowl and drizzle with some of the warm garlic and chilli dressing. ", "Stir to coat the chicken with the dressing then sprinkle with a little sea salt.", "Repeat with the remaining wings frying in batches.", "For the peas, heat the olive oil in a medium, lidded, frying pan. Add the shallots and garlic, cover and cook gently for five minutes until soft but not browned. ", "Stir in the peas and chicken stock, part-cover and simmer gently for five minutes until the peas are tender and the liquid has reduced to leave them just moist. ", "Stir in the Serrano ham, and season to taste with salt and pepper. ", "Break the eggs, spaced well apart, on top of the peas, season lightly with salt and freshly ground black pepper and cover the pan with a well-fitting lid. ", "Leave to cook gently for five minutes, or until the eggs are set to your liking. ", "To serve, pile the hot chicken wings alongside the peas and eggs."]}, {"isVegetarian": true, "title": "Deep-fried courgette flowers and onion bhaji with a sweetcorn salsa", "url": "www_bbc_co_uk_food_recipes_deep-fried_courgette_78312", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["vegetable oil, for deep frying", "100g/3½oz cornflour", "pinch salt", "150ml/5½fl oz sparkling water", "8 courgette flowers", "125g/4½oz white onion, chopped", "35g/1¼oz gramflour ", "1 tsp coriander seeds, toasted and ground", "½ green chilli, seeds removed, finely chopped", "pinch salt", "pinch red chilli powder", "pinch turmeric", "150g/5½oz sweetcorn, blanched, griddled and kernels removed", "½ red onion, finely chopped", "1 green chilli, finely chopped", "1 lime, juice only", "2 tbsp roughly chopped fresh mint leaves ", "2 tbsp roughly chopped fresh coriander leaves", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the deep-fried courgette flowers, heat the vegetable oil in a deep-fat fryer, or fill a large, deep, heavy-based pan two-thirds full with vegetable oil. Heat the oil to 190C/375F (use a probe thermometer to check the temperature if you're not using a deep-fat fryer). (CAUTION: Hot oil can be dangerous. Don't leave unattended)", "Mix the cornflour and salt in a bowl. Whisk in enough sparkling water to form a smooth batter (you may not need all the water).", "Dip the courgette flowers into the batter and place in the deep-fat fryer, taking care not to overcrowd the fryer (you may need to do this in batches). Fry for two minutes. Once cooked, carefully remove from the oil using a slotted spoon and drain on a plate lined with kitchen paper. Season with salt and pepper.", "For the onion bhaji, mix the onions, gram flour, ground coriander seeds and green chilli together with enough water to bind into a thick batter mixture. Add the salt, chilli powder and turmeric and mix thoroughly.", "Gently drop a little of the bhaji mixture into the hot oil or deep-fat fryer to test it's hot enough.", "When ready, place golf-ball sized amounts of the mixture into the oil. Fry until golden-brown.", "Remove from the oil and drain on kitchen paper.", "For the sweetcorn salsa, place all of the salsa ingredients into a large bowl and mix to combine. Season, to taste, with salt and freshly ground black pepper. ", "To serve, place the deep-fried courgette flowers and onion bhajis on a serving plate with the sweetcorn salsa alongside."]}, {"isVegetarian": false, "title": "Deep-fried crab claws with crab ravioli", "url": "www_bbc_co_uk_food_recipes_deep-fried_crab_claw_01294", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 cooked crabs, brown and white meat removed and kept separate, shells reserved, claws left whole", "200g/7oz raw prawns, heads and shells removed and reserved, de-veined, meat finely chopped", "2 star anise", "600ml/1 pint chicken stock", "150ml/5fl oz brandy", "sunflower oil, for deep-frying", "2cm/¾in fresh root ginger, peeled and finely chopped", "1 garlic clove, finely chopped", "2 tbsp soy sauce", "1 tbsp sesame oil", "1 tbsp dry sherry", "75g/2½oz plain flour", "2 free-range eggs, beaten", "75g/2½oz panko or fresh breadcrumbs", "30g/1oz nduja", "24 wonton wrappers", "salt and freshly ground black pepper", "2 tbsp finely chopped fresh coriander, to serve"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Put the crab shells, prawn heads and shells, star anise, chicken stock and brandy in a large saucepan and cook for 40–50 minutes. Strain, reserve the liquid and set aside.   ", "Fill a deep-fat fryer or large, deep, heavy-bottomed saucepan two-thirds full with the oil. Heat to 180C (a cube of bread should turn brown in 1 minute when dropped in.) CAUTION: Hot oil can be dangerous. Do not leave unattended.", "Crack the crab claws to expose most of the flesh and remove the shell. Mix the finely chopped prawns, ginger, garlic, soy sauce, sesame oil and sherry together to form a paste, or blend in a food processor. Coat the crab claw flesh in the paste.", "Put the flour, eggs and breadcrumbs in separate bowls. Coat the crab claws in the flour, then with the eggs and then the breadcrumbs.", "Deep-fry the claws for 2–4 minutes, or until cooked through. Put them on a plate lined with kitchen paper to drain.", "Mix 150g/5½oz brown crab meat and the nduja paste together. Place a teaspoon of the mixture in the centre of a wonton wrapper and wet the edges. Place another wonton wrapper on top and press down to seal. Use a pastry cutter to cut out a perfect circle. Repeat with the rest of the wrappers to make 12 ravioli.", "Cook the ravioli in a large pan of boiling salted water for 1–2 minutes or until they rise to the surface. Meanwhile, gently heat the reserved crab stock.", "To serve, place the white crab meat in the bottom of a serving bowl, add three ravioli, ladle over the stock and top with a claw. Garnish with the coriander. "]}, {"isVegetarian": false, "title": "Deep-fried crab spring rolls with spiced fresh mango salad", "url": "www_bbc_co_uk_food_recipes_deep-fried_crab_spring_20161", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 crab shell", "100ml/3½fl oz vegetable oil", "2 free-range egg yolks", "1 tbsp Dijon mustard", "picked brown crabmeat from 1 crab", "200g/7oz picked white crabmeat", "3 tbsp chopped spring onion", "3 tbsp chopped mooli", "1 tbsp chopped fresh coriander", "squeeze of lemon juice, soy sauce and oyster sauce, to taste", "12 sheets filo pastry", "vegetable oil, for deep-fat frying", "50g/1¾oz sugar", "50ml/2fl oz white wine vinegar", "5 star anise ", "3 cardamom pods", "1 cinnamon stick", "1 red chilli", "200g/7oz baby spinach", "1 tbsp sesame oil", "2 tsp sesame seeds ", "2 mangoes, cubed (or 350g/12oz prepared mango)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the crab mayo, put the crab shell and vegetable oil in a pan and heat to warm. Remove from the heat and set aside to infuse the oil with the crab flavour.", "Strain the crab-flavoured oil into a jug.", "Put the egg yolks in a bowl and whisk. ", "Gradually whisk in the drained oil, adding a little at a time.", "Stir in the Dijon mustard, add the brown crabmeat and combine. Set aside.", "For the spring rolls, mix all the ingredients in a bowl except the pastry and oil, adding the lemon juice, soy sauce and oyster sauce to taste.", "Lay one sheet of pastry on a clean work surface, spread a twelve of the mixture in a line along one end of the pastry. Gently roll tucking in the edges. Repeat with the remaining pastry.  ", "Preheat the oil in a deep fat fryer to 180C/350F (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Deep fry each spring roll for a few minutes until crisp and golden-brown. Carefully remove with a slotted spoon and transfer to a plate lined with kitchen paper.", "For the spiced fresh mango salad, in a pan heat 250ml/9fl oz water, the sugar and vinegar. Add the star anise, cardamom, cinnamon stick and chilli. Bring to the boil and set aside to cool down.", "Gently toss the baby spinach leaves in the sesame oil in a bowl and sprinkle over the sesame seeds. ", "To serve, put a few of the leaves on each plate, coat the mango cubes in the dressing and drizzle it on top of the leaves. Place the spring rolls on top with a generous spoonful of the mayo."]}, {"isVegetarian": true, "title": "Deep-fried doughnuts (struffoli)", "url": "www_bbc_co_uk_food_recipes_deep-fried_doughnuts_39832", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz type '00' pasta flour", "5 free-range eggs", "4 tbsp caster sugar", "1 lemon, finely grated zest only", "1 orange, finely grated zest only", "2 tbsp vodka or whisky", "pinch salt", "olive oil or lard, for deep-frying", "250g/9oz runny honey", "100g/3½oz caster sugar", "2 tbsp water", "1 tangerine, peel only, julienned", "candied citrus peel, to serve (optional)"], "serves": "Makes 10-12", "time": {"preparation": "over 2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["For the doughnuts, put the flour into a large bowl and make a well in the centre. Add the remaining doughnut ingredients, except for the fat, to the well. Gradually stir the ingredients using a wooden spoon or your hands, until the mixture comes together as a soft dough. Cover the bowl with a clean tea towel and set aside to rest in a cool room for 2-3 hours.", "Once the dough has rested, tear small pieces from it and roll them into equal-sized sausage shapes about 1cm/½in thick. Cut each sausage into little pellets about 1cm/½in long.", "Heat the oil or lard in a deep, heavy-based saucepan over a medium heat, until a breadcrumb sizzles and turns golden-brown when dropped into it. (Caution: Hot oil can be dangerous. Do not leave unattended.)", "Carefully lower the dough pellets into the hot fat, in batches if necessary. Fry for 2-3 minutes, or until crisp and golden-brown. Remove from the fat using a slotted spoon and set aside to drain on kitchen paper. Repeat the process with the remaining dough pellets. Set all of the struffoli aside to cool.", "Meanwhile, for the sauce, heat the sauce ingredients in a saucepan over a low heat, stirring well until the sugar has melted. Bring the mixture to a simmer and simmer for 3-4 minutes, or until the sauce has the consistency of syrup. Set aside to cool.", "To serve, pile the struffoli onto a serving platter and drizzle over the sauce. Decorate with candied citrus peel, if desired."]}, {"isVegetarian": false, "title": "Deep-fried fish bites with homemade ketchup and fennel salad", "url": "www_bbc_co_uk_food_recipes_deep-fried_fish_bites_30521", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250ml/9fl oz red wine vinegar", "1 bay leaf", "½ tsp ground coriander", "½ tsp ground cinnamon", "75g/3oz light soft brown sugar", "1.6kg/3lbs 8oz tinned chopped tomatoes", "1 tsp flaked sea salt", "1 tbsp English mustard powder", "1 garlic clove, crushed", "splash Tabasco sauce", "2 tbsp tomato purée", "1-2 tbsp cornflour", "vegetable oil, for deep frying", "15g/½oz fresh yeast", "pinch sugar", "300ml/10fl oz beer ", "1 tsp cider vinegar", "200g/7oz plain flour", "pinch salt", "200g/7oz cod fillet, skinned, cut into pieces", "200g/7oz smoked haddock, skinned, cut into pieces", "200g/7oz tiger prawns, tails on and shelled", "1 butterhead lettuce, leaves removed", "1 head fennel, thinly sliced lengthways on a mandoline", "5 radishes, sliced", "2-3 tbsp extra virgin olive oil", "1 lemon, juice only"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the tomato ketchup, heat the vinegar, bay, spices and sugar in a heavy-based pan until simmering.", "Add the remaining ingredients, bring to the boil and stir to prevent the mixture from sticking to the side of the pan. ", "Reduce the temperature to a simmer and cook for a further 30 minutes, stirring occasionally.", "Blend the mixture in a blender until smooth, then push the ketchup through a sieve.", "For the fish bites, fill a deep-fat fryer or a large, deep, heavy-bottomed pan two-thirds full with vegetable oil. Heat to 180C. (CAUTION: Hot oil can be dangerous. Do not leave unattended.)", "Meanwhile, mix the yeast and sugar in a bowl. Pour over the beer and vinegar and whisk in the flour and salt. Leave to ferment. It is ready to use when the mixture starts to bubble. ", "Dip the fish into the batter and deep fry until golden-brown and cooked through (3-4 minutes). Remove with a slotted spoon and drain on kitchen paper.", "For the salad, mix together all the ingredients.", "Put the fish bites in a basket lined with greaseproof paper and serve with the ketchup and salad."]}, {"isVegetarian": false, "title": "Deep-fried Goosnargh egg with wild mushroom, toasted brioche and truffle mayonnaise", "url": "www_bbc_co_uk_food_recipes_deep-fried_goosnargh_87087", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp white wine vinegar", "5 free-range eggs", "salt and freshly ground black pepper", "110g/4oz plain flour", "200g/7oz fresh breadcrumbs", "vegetable oil, for deep frying", "2 free-range eggs, yolks only", "2 tsp white wine vinegar", "1 tsp Dijon mustard", "300ml/10fl oz rapeseed oil", "1 tsp lemon juice ", "1 English truffle, finely grated", "sea salt, to taste", "75g/3oz butter", "4 slices of brioche, 12.5cm/5in long, 5cm/2in wide and 5mm/¼in thick", "200g/7oz mixed wild mushrooms, cleaned ", "1½ tbsp finely chopped chives", "1 small punnet pea shoots", "4 tbsp chicken demi-glace, warmed (200ml/7floz chicken stock simmered over a low heat until reduced to 4 tbsp)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the deep-fried egg, bring a large saucepan of water to the boil, add the vinegar and a pinch of salt. Boil four of the eggs for 5½ minutes. Remove the eggs from the saucepan using a slotted spoon, and leave to chill in a bowl of iced water.", "Whisk the remaining egg in a bowl with a pinch of salt and freshly ground black pepper.", "Peel the boiled eggs. Prepare a shallow plate of flour and a separate plate of breadcrumbs. Dredge the boiled eggs in the flour, then dip into the beaten egg  and roll in the breadcrumbs. Set aside on a tray in the fridge until needed.", "Meanwhile for the truffle mayonnaise, place the egg yolks, white wine vinegar and mustard into a food processor and blend until pale and creamy.", "With the motor running, pour in the oil, in a slow steady stream, until the mayonnaise is thick (you may not need all the oil). Mix in the lemon juice and truffle. Set aside in the fridge until needed.", "For the wild mushrooms, heat a large frying pan over a medium heat, add half of the butter and fry the brioche croûtons until golden-brown on each side.", "Drain onto kitchen paper then carefully stamp out a small hole with a 2.5cm/1in round cutter at one end of the croûton.", "Place onto the serving plates.", "Return the frying pan to the heat, add the remaining butter and the mushrooms and gently fry over a high heat for 2-3 minutes, or until just tender.", "Season with salt and freshly ground black pepper, then stir in the chives.", "To cook the eggs, heat the oil in a deep-fat fryer to 180C/350F. Alternatively, pour the oil into a deep, heavy-based pan to a depth of 2cm/¾in and bring to the same temperature on the hob, checking with a sugar thermometer. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Fry the eggs until golden-brown all over. Remove with a slotted spoon, drain on kitchen paper and season with salt.", "To serve, carefully place each egg into the hole on each brioche croûton and take a slice off of the top to just show the yolk.", "Pile the mushrooms onto the other end of the croûton, then spoon a little truffle mayonnaise directly in the middle in front of the croûton.", "Scatter some pea shoots around and then finish with a drizzle of the chicken demi-glace around the edge. "]}]