[{"ingredients": ["500 g / 1 lb 2 oz de azúcar en polvo", "500ml / 17fl oz de agua", "6 peras de Comice, peladas, semillas y médula recogidas de la parte inferior con un baller de melón o una cucharadita", "50 g / 1 oz de azúcar en polvo", "50g / 1¾oz de harina natural", "2 claras de huevo de gallinas camperas", "50 g / 1¾oz de mantequilla sin sal, derretida, más extra para engrasar", "130 ml / 4½ fl oz de agua", "175g / 6¼ oz de chocolate negro, mínimo 70 por ciento de sólidos de cacao", "45 g / 1½ oz de mantequilla sin sal", "75ml / 2½ fl oz crema doble", "crema fresca, para servir"], "method": ["Para las peras escalfados de caramelo, coloque el azúcar impalpable en una sartén antiadherente a fuego lento hasta que el azúcar se derrita. Cuando el azúcar esté dorado, retire del fuego y agregue rápidamente el agua. Regrese al fuego y revuelva hasta que los grumos se hayan disuelto. (NB: Párese con los brazos extendidos y use un guante de horno cuando le agregue agua; el caramelo puede salpicar).", "Ponga a hervir el almíbar y agregue las peras, con los tallos hacia arriba. Baje el fuego y cocine a fuego lento durante al menos 10 minutos, o hasta que las peras estén tiernas. Luego retire la sartén del fuego y deje que las peras se enfríen en el almíbar.", "Para las tazas de tuile, precaliente el horno a 180 ° C / 360 ° F / Gas 4. En un bol, bata el azúcar blanco, la harina y las claras de huevo juntas durante 2-3 minutos o hasta que se forme una pasta homogénea.", "Batir la mantequilla derretida hasta que esté bien combinada, luego cubrir y enfriar en la nevera durante 15-20 minutos.", "Pon cuatro cucharaditas de la mezcla de tuile refrigerada a intervalos regulares sobre una bandeja para hornear antiadherente ligeramente engrasada.", "Extienda cucharaditas de la mezcla de tuiles en círculos finos de aproximadamente 12.5 cm de diámetro usando una espátula húmeda. Hornee durante 6-8 minutos, o hasta que estén pálidas doradas en el centro y doradas oscuras en los bordes.", "Retire del horno y deje enfriar por unos segundos. Luego, usando una espátula, levante rápidamente cada galleta tuile de la bandeja para hornear y déle forma a una taza volteada.", "Retire las peras del líquido de caza furtiva y déjelas a un lado. Llevar el líquido de cocción a fuego lento, hervir a fuego lento y reducir hasta que se forme un jarabe espeso. Dejar de lado para enfriar.", "Para la salsa de chocolate, en una sartén caliente el agua, el chocolate, la mantequilla y la crema doble, revolviendo ocasionalmente hasta que la mezcla esté suave y el chocolate se haya derretido.", "Para servir, coloque una de las peras pochadas en cada una de las seis placas para servir. Llene una cesta tuile con una cucharadita de crème fraîche y colóquela junto a la pera pochada. Rocíe sobre la salsa de chocolate."], "url": "www_bbc_co_uk_food_recipes_caramelpoachedpearwi_91096", "title": "Pera cocida al caramelo con una taza tuile y salsa de chocolate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["10 albaricoques, cortados a la mitad", "225 g / 8 oz de azúcar en polvo", "1 naranja, solo jugo", "25g / 1oz de mantequilla", "25g / 1oz de almendras marcona, picadas", "Avellanas de 25g / 1oz, más o menos picadas", "25 g / 1 oz de pistachos, toscamente picados", "Frambuesas 200 g / 7 oz", "500ml / 18fl oz de helado de vainilla"], "method": ["Precalentar el horno a 200C / 390F / Gas 6.", "Coloque los albaricoques, con el lado cortado hacia arriba, en una bandeja de asar.", "Caliente una sartén hasta que esté caliente, agregue el azúcar en polvo y cocine por dos minutos hasta que tenga un caramelo ligero.", "Agregue el jugo de naranja y la mantequilla y agite para combinar.", "Espolvoree las nueces sobre los albaricoques, luego vierta sobre el caramelo naranja y mezcle ligeramente para combinar.", "Coloque en el horno y tueste durante cinco minutos.", "Agregue las frambuesas y vuelva al horno por dos minutos más.", "Para servir, coloque una bola de helado de vainilla en el centro de cada una de las cuatro placas.", "Coloque cinco mitades de albaricoque alrededor del borde de cada porción de helado, luego cubra el caramelo y las frambuesas. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_caramelroastedaprico_88733", "title": "Albaricoques asados ​​con caramelo con helado de vainilla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 rebanadas de tocino, cortadas en tiras finas", "100ml3½ fl oz crema doble", "75g / 2¾oz de queso azul", "Pasta de 100 g / 3½ oz, cocida (como tallarines)"], "method": ["Para la carbonara, fría el tocino en una cacerola durante dos minutos hasta que quede crujiente y agregue la crema.", "Cocine por otros dos minutos.", "Agregue el queso azul a la salsa para que se derrita, y luego agregue la pasta y sirva."], "url": "www_bbc_co_uk_food_recipes_carbonara_75833", "title": "Queso azul carbonara", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filete de cerdo 900g / 2lb", "1-2 cucharadas de aceite de oliva o girasol", "Cebolla 110g / 4oz finamente picada", "60ml / 2 ½ fl oz de vino blanco seco", "150ml / ¼ pinta de caldo de pollo (preferiblemente hecho en casa)", "225 g / 8 oz de champiñones en rodajas", "300 ml / ½ pinta de crema agria o crema ligera", "jugo de limón fresco", "sal y pimienta recién molida", "2 cucharadas de perejil de flatleaf recién picado", "110g / 4oz de mantequilla", "Harina blanca 110g / 4oz", "6-8 crutones hechos con pan blanco frito en mantequilla clarificada o aceite de oliva"], "method": ["Cortar el cerdo en rodajas de aproximadamente 7 mm / ¾ de espesor.", "Vierta un poco de aceite en una sartén bien caliente, saltee las piezas de cerdo, hasta que estén doradas por ambos lados. Retirar a un plato para mantener caliente.", "Agregue un poco más de mantequilla a la sartén y cocine las cebollas suavemente hasta que estén suaves y doradas.", "Desglasar la sartén con vino y llevar a ebullición, agregar el caldo y hervir de nuevo para reducir en un cuarto.", "Mientras tanto, saltee los champiñones en tandas con un poco de mantequilla y aceite y agregue al cerdo.", "Agregue la crema a la salsa, vuelva a hervir y espese con un poco de roux.", "Agregue el cerdo cocido y los champiñones a la salsa y todos los jugos.", "Agregue un poco de jugo de limón y cocine a fuego lento por un par de minutos. Sumerja la punta de los crotones en la salsa y luego en el perejil picado, agregue el resto del perejil a la salsa.", "Vierta en platos calientes y adorne con crutones crujientes."], "url": "www_bbc_co_uk_food_recipes_carbonnadeofporkwith_73920", "title": "Carbonnade de cerdo con champiñones", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 remolacha joven (aproximadamente 120 g / 4¼ oz), cocida", "125ml / 4fl oz de leche de coco, refrigerada", "1 plátano maduro", "2 semillas de cardamomo (ver consejos)", "7 cubitos de hielo", "1 cucharadita de extracto de vainilla", "pequeña sal marina pizca", "2 cucharadas de jugo de limón recién exprimido", "semillas de cacao o semillas de sésamo, para adornar (opcional)"], "method": ["Mezcle la remolacha con dos tercios de la banana y todos los ingredientes restantes hasta que esté completamente suave.", "Corta el plátano restante.", "Divida el batido entre dos vasos altos. Adorne con las rodajas de plátano y una pizca de semillas de sésamo o semillas de cacao."], "url": "www_bbc_co_uk_food_recipes_cardamom_and_beetroot_04997", "title": "Helado de helado de cardamomo y remolacha", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cardamom_and_beetroot_04997_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100g / 3½oz de mantequilla sin sal", "Galletas digestivas 250 g / 9 oz", "100g / 3½oz de azúcar glasé", "Crema de queso 280 g / 10 oz", "½ cucharadita de semillas de cardamomo verde molido", "1 cucharadita de jengibre molido", "200 ml / 7½ fl oz crema doble", "50 g / 1¾oz de pistachos triturados para decorar", "pétalos de rosa azucarados, para decorar", "50 g / 1 oz de azúcar en polvo", "¼ cucharadita de agua de rosas", "1 cucharada de jugo de limón", "1 fruta de dragón, pelada y cortada en trozos", "1 guanábana, pelada y cortada en trozos", "1 fruta Sharon, pelada y cortada en trozos"], "method": ["Derretir la mantequilla en una olla pequeña. Coloque los bizcochos en un procesador de alimentos y gírelos para hacer migas. Agregue la mantequilla derretida y mezcle.", "Presione la mezcla de galletas en la base y los lados de una lata de flants suelta aflautada de 23 cm / 9 pulg. Ponlo en el congelador por 15 minutos para reafirmarlo.", "Mientras tanto, bata el azúcar glas y el queso crema juntos en un tazón grande. Agregue el cardamomo y el jengibre.", "En un tazón grande y separado, bata la crema doble. Agregue la mezcla de queso crema.", "Extienda la mezcla sobre la base de la galleta y vuelva a colocarla en el congelador durante 15 minutos.", "Mientras tanto, para hacer la ensalada de fruta, hierva 50 ml / 2 fl oz de agua con el azúcar en una cacerola pequeña a fuego medio, hasta que el azúcar se haya disuelto. Agregue el agua de rosas y el limón y deje enfriar.", "Esparce los pistachos en la parte superior de la tarta de queso, espolvorea con un poco de jarabe de rosas y decora con algunos pétalos.", "Combine la fruta en un tazón grande y vierta sobre el jarabe de agua de rosas restante. Mezcle y sirva con la tarta de queso."], "url": "www_bbc_co_uk_food_recipes_cardamom_and_rose_water_54533", "title": "Tarta de queso de cardamomo y agua de rosas", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 70}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["225g / 8 oz de mantequilla, suavizada", "150 g / 5½ oz de azúcar en polvo", "1 limón, ralladura solamente", "Harina normal de 250 g / 9 oz", "100 g / 3½ oz de almendras molidas", "3 cucharaditas de cardamomo molido o 1 cucharadita colmada de semillas de cardamomo, molida en una mano de mortero"], "method": ["Precaliente el horno a 190 ° C / 375 ° F / Gas 5. Coloque 2 bandejas grandes para hornear con papel para hornear.", "Con un batidor de mano eléctrico, bata la mantequilla, el azúcar y la ralladura de limón en un tazón grande hasta que esté pálida y esponjosa.", "Bata la harina, las almendras y el cardamomo hasta que la mezcla esté bien combinada y se una para formar una masa dura.", "Enrolla la masa en 24 bolas y coloca 12 en cada bandeja de hornear; asegúrate de dejar espacio entre cada una.", "Presione cada galleta con un sello de galleta o el fondo de un vaso para aplanar y dejar huecos decorativos en la masa.", "Hornee una bandeja a la vez durante 12-14 minutos hasta que las galletas estén doradas.", "Deje que se enfríen en la bandeja durante unos minutos, luego transfiéralos a una rejilla de alambre. Se mantendrán crujientes a medida que se enfríen. Guarde las galletas en una lata hermética y coma dentro de 7 días."], "url": "www_bbc_co_uk_food_recipes_cardamom_and_lemon_74033", "title": "Cardamomo y galletas de limón", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Hace 24 galletas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cardamom_and_lemon_74033_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["225g / 8oz de mantequilla sin sal, ablandada, más extra para engrasar", "4 huevos de gallinas camperas", "225 g / 8 oz de azúcar en polvo", "Harina de levante 225g / 8oz", "Polvo de hornear 2 cucharaditas de nivel", "12 vainas de cardamomo", "100g / 3½oz de chocolate blanco, roto en pedazos", "50 g / 1¾oz de mantequilla sin sal, ablandada", "75g / 2½ oz de queso crema", "200g / 7oz de azúcar glasé", "½ cucharadita de extracto de vainilla", "guinda de azúcar y paloma, decorar (opcional)"], "method": ["Precalentar el horno 180C / 160C Fan / Gas4. Engrase dos latas de sándwich de fondo suelto de 20cm / 8in y alinee con papel de hornear.", "Coloque la mantequilla, los huevos, el azúcar, la harina y el polvo de hornear en un tazón grande y bata al mismo tiempo (usando un batidor de mano eléctrico si tiene uno) hasta que estén bien combinados.", "Bash las vainas de cardamomo con un rodillo para lanzar las semillas. Incline las semillas en un mortero y mastique hasta que estén finas. (Asegúrese de triturar las semillas de cardamomo solamente, no las vainas, ya que éstas no se ablandan.) Mezcle las semillas trituradas en la masa de la torta, luego vierta la mezcla en las latas.", "Hornee durante 25 minutos, o hasta que estén dorados y elásticos al tacto. Deje que se enfríe durante 5 minutos, luego coloque una pequeña espátula o un cuchillo de mantequilla redondo alrededor del borde de las latas y con cuidado pase las tortas a una rejilla. Despegue el papel y deje que se enfríe por completo.", "Para la formación de hielo, derrita suavemente el chocolate blanco en un recipiente resistente al calor sobre una fuente de agua hirviendo a fuego lento, asegurándose de que el recipiente no toque el agua. (No sobrecaliente el chocolate blanco o no se endurecerá.) Revuelva hasta que se escurra, luego déjelo a un lado para que se enfríe y espese un poco.", "Batir la mantequilla y el queso crema juntos hasta que estén esponjosos y suaves. Agregue la mitad del azúcar glasé, bata de nuevo, agregue la vainilla y el azúcar glas restante y bata de nuevo. Agregue el chocolate blanco hasta que se combinen. Transfiera al refrigerador por cerca de 20 minutos, o hasta que se espese a una consistencia creciente.", "Rebana cada torta por la mitad horizontalmente para darles cuatro esponjas delgadas. Sándwich junto con la guinda y organizar en un soporte de pastel para que tenga cuatro capas de pastel y tres capas de glaseado, dejando la parte superior de la torta plana.", "Espolvorea con azúcar glas, usando una plantilla de paloma decorativa si tienes una."], "url": "www_bbc_co_uk_food_recipes_cardamom_sponge_with_34236", "title": "Cardamomo y esponja de chocolate blanco", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cardamom_sponge_with_34236_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["mantequilla, para engrasar", "½ cucharadita de semillas de cardamomo verde", "4 huevos grandes de gallinas camperas", "100 g / 3½ oz de azúcar en polvo, más extra para quitar el polvo", "100g / 3½ oz de harina de auto crianza", "azúcar en polvo, para rociar sobre el pergamino de la cocción", "300 ml / 10 fl oz doble crema", "1 cucharada de azúcar en polvo", "1 cucharadita de café instantáneo, disuelto en 1 cucharada de agua caliente", "50g / 1¾oz de chocolate negro, para hacer flores", "50 g / 1¾oz de pistachos sin pelar, finamente picados", "azúcar glas, al polvo"], "method": ["Precaliente el horno a 200C / 400F / Gas 6. Engrase y forme una lata de rollo suizo de 33 x 23 cm / 13 x 9 pulgadas con papel para hornear.", "Machaca las semillas de cardamomo en un mortero hasta que estén casi en polvo.", "Para el rollo suizo, bata los huevos y el azúcar en un tazón hasta que la mezcla se vuelva liviana y cuando quites el batidor del tazón, deja un rastro, esto podría tomar de 10 a 15 minutos.", "Agregue las semillas molidas de cardamomo a la mezcla de huevo. Tamiza la harina en la mezcla de huevo y dóblala con cuidado. Vierte la mezcla en la lata y agítala para nivelarla, de modo que se extienda uniformemente.", "Hornee durante 8-10 minutos o hasta que el pastel se dore.", "Incline la torta sobre una hoja de pergamino para hornear rociada con azúcar impalpable. Enróllelo y cubra con una toalla de té limpia. Deje que se enfríe, enrollado.", "Mientras la torta se está enfriando, prepare el relleno. Vierta la crema en un tazón grande y agregue el azúcar. Batir hasta que se formen picos suaves cuando se quite la batidora de la taza. Agregue el café a esta mezcla y mezcle bien.", "Derretir el chocolate en un bol y enfriarlo ligeramente. Vierta el chocolate en una manga pastelera y haga diseños de flores en una lámina de acetato (o puede hacer cualquier otro diseño que desee). Pon esta hoja en la nevera hasta que el chocolate esté listo. Una vez establecido, puede pelar las flores de la hoja.", "Una vez que la torta se haya enfriado, desenróscala. Extienda casi la totalidad de la crema de café sobre la torta y espolvoree sobre ella los pistachos. Una vez más, enrolle el pastel con cuidado y decore con un poco más de crema de café y espolvoree algunas nueces. Finalmente coloque algunas flores de chocolate en la parte superior. Polvo con azúcar glas."], "url": "www_bbc_co_uk_food_recipes_cardamom_pistachio_and_48559", "title": "Cardamomo, pistacho y café Swiss roll", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["½ cucharadita de harina de maíz", "2 cucharadas de leche", "200 ml / 7¼ fl oz de leche evaporada", "200ml / 7¼ fl oz leche condensada", "200g / 7¼ oz de crema doble de espesor", "semillas de 2-3 vainas de cardamomo, aplastadas"], "method": ["Mezcle la harina de maíz con la leche y reserve.", "En una cacerola, calentar la leche evaporada y llevar a ebullición.", "Agregue la leche condensada, la crema doble, el cardamomo y la mezcla de harina de maíz.", "Revuelva bien por un minuto.", "Retire del fuego. Deje que se enfríe un poco.", "Coloque la mezcla cremosa en un procesador de alimentos y mezcle por un par de minutos para suavizar los grumos. Utilizo una licuadora portátil para aceitar la mezcla que funciona bien.", "Vierta en un recipiente de plástico con tapa y congélelo durante al menos seis horas o toda la noche hasta que el helado esté bastante firme.", "El helado es bastante rico, así que dos cucharadas pequeñas para una persona son abundantes."], "url": "www_bbc_co_uk_food_recipes_cardamomkulfi_74037", "title": "Cardamomo kulfi", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["8 muslos de pollo deshuesados, despellejados o un pollo articulado, despellejado", "4 cebolletas, más o menos picadas", "4 dientes de ajo, toscamente picados", "Jengibre de raíz de 20 g / ¾oz, aproximadamente picado", "2 chiles con bonete escocés (o según el gusto), semillas retiradas, finamente picadas", "1 lima, ralladura y jugo", "2 cucharadas de mezcla de curry en polvo, preferiblemente caribeña", "½ cucharadita de pimienta de Jamaica molida", "sal y pimienta negra recién molida", "1 cucharada de aceite vegetal o de coco", "1 cebolla, rebanada gruesa", "300 ml / 10 fl oz de caldo de pollo o agua", "2 tomates, pelados y cortados en cubitos", "2 ramitas grandes de tomillo", "2 hojas de laurel", "Calabaza de 400g / 14oz, cortada en trozos grandes", "½ lima, solo jugo", "1 cucharadita de ron (opcional)", "arroz al vapor", "cebollas de primavera en rodajas", "perejil o cilantro fresco picado"], "method": ["Coloque los muslos de pollo en un recipiente y sazone con sal y pimienta.", "Coloque todos los ingredientes del adobo en un pequeño procesador de alimentos y mezcle hasta que se peguen, agregue un poco de agua si es necesario.", "Vierta el adobo sobre el pollo y mezcle bien para asegurarse de que el pollo esté completamente cubierto. Cúbralo y déjelo todo el tiempo que pueda, al menos un par de horas, pero de la noche a la mañana es mejor. Si lo dejas afuera por más de una hora, pon el pollo en la nevera.", "Para el curry, caliente el aceite vegetal o de coco en una cazuela grande. Agregue la cebolla y cocine a fuego medio durante varios minutos hasta que comience a dorarse. Agregue el pollo y el adobo a la cazuela; la idea no es dorar el pollo, pero sí deje cocinar los ingredientes del adobo durante unos minutos antes de agregar el caldo o el agua.", "Agregue los tomates, el tomillo y las hojas de laurel y sazone con sal y pimienta. Llevar a ebullición, luego baje la temperatura, cubra y deje hervir a fuego lento durante unos 40 minutos.", "Agregue la calabaza y cocine por otros 10 minutos, cubierto. Vierta el jugo de lima y el ron, si se usa. Retire la tapa y cocine por otros 5 a 10 minutos para reducir ligeramente la salsa y termine de cocinar la calabaza.", "Sirva con arroz al vapor y cubierto con rodajas de cebollas y perejil fresco o cilantro."], "url": "www_bbc_co_uk_food_recipes_caribbean_chicken_and_44098", "title": "Pollo al caribe y calabaza al curry", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/caribbean_chicken_and_44098_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200g / 7oz de mantequilla, ablandada, más extra para engrasar", "200 g / 7 oz de azúcar en polvo", "4 huevos de gallinas camperas", "3 cucharadas de café fuerte", "8 vainas de cardamomo, semillas retiradas y molidas", "Harina de auto aumento 250g / 9 oz", "250g / 9fl oz de crema doble", "1 cucharada de azúcar glas", "5 vainas de cardamomo, semillas retiradas y molidas", "60 g / 2½ oz de pistachos, conchas eliminadas, más o menos picadas", "Azúcar glas de 110g / 4oz", "1 cucharada de café caliente"], "method": ["Precalentar el horno a 190C / 375F / Gas 5.", "Engrase y forme una lata honda de 23cm / 9pulg.", "Coloque la mantequilla y el azúcar en un bol y mezcle hasta que esté suave y esponjoso.", "Agregue los huevos, uno a la vez, batiendo entre cada adición hasta que estén bien incorporados.", "Agregue el café y las semillas molidas de cardamomo y mezcle bien, luego doble la harina.", "Vierta la mezcla en la lata de la torta, transfiérala al horno y hornee por 20-25 minutos, o hasta que esté dorada y bien levantada. Retirar del horno y dejar enfriar.", "Para el relleno, coloque la crema en un recipiente y bata hasta que se formen picos suaves cuando se quite la batidora.", "Agregue el azúcar glas, las semillas de cardamomo molido y los pistachos y bata suavemente hasta que la mezcla forme picos firmes.", "Para la formación de hielo, coloque el azúcar glas en un tazón, agregue el café y mezcle hasta que quede suave.", "Para armar el pastel, corte cuidadosamente el pastel por la mitad horizontalmente con un cuchillo de pan y coloque la mitad inferior en un plato. Extienda la crema de pistacho sobre la mitad inferior de la torta, luego cubra con la otra mitad. Cuchara sobre la guinda, permitiéndole rociar los lados del pastel.", "Para servir, corte el pastel en trozos y colóquelo en platos para servir."], "url": "www_bbc_co_uk_food_recipes_cardamomandcoffeecak_86632", "title": "Tarta de café y cardamomo con crema de pistacho", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 8-10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cardamomandcoffeecak_86632_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["aceite en aerosol", "6 tortillas de harina blandas, integrales o sin semillas (19cm / 7½ pulgadas de diámetro)", "1 pimiento rojo, sin semillas, cortado en dados de 1cm / ½ en", "1 aguacate maduro pero firme, pelado, apedreado y cortado en 1cm / ½ en dados", "1 mango maduro pequeño, pelado, sin hueso, cortado en dados de 1cm / ½ en dados o 125 g / 4½ oz de trozos de mango preparados, cortado en dados de 1cm / ½ en dados", "200g / 7oz de frijoles rojos enlatados, escurridos y enjuagados", "2 cebollas de primavera, cortadas y finamente rebanadas", "1 chile rojo, semillas retiradas (si se prefiere), finamente picado", "1 lima, solo jugo", "½ manojo de menta fresca, solo hojas, finamente picado (para dar aproximadamente 2 cucharadas)", "sal marina escamada y pimienta negra recién molida", "1 cucharada de aceite de oliva virgen extra (opcional)"], "method": ["Precaliente el horno a 200C / 400F / Gas 6 (ventilador 180C). Rocíe dos bandejas de magdalenas poco profundas de 12 hoyos con aceite y reserve. Puede trabajar en dos lotes separados si solo tiene una bandeja.", "Coloque las tortillas en una pila una sobre otra sobre una tabla de cortar y córtelas en cuartos para dar 24 piezas. Presione un cuarto en cada orificio de las bandejas de magdalena, presionándola para encajar. Realmente presione hacia abajo para formar un fondo resistente y las partes superiores deben desplegarse en la parte superior creando una 'taza'. Cocine en el horno durante unos cinco minutos, o hasta que las copas estén crujientes y doradas, vigílelas ya que pueden arder muy rápido.", "Para el relleno, mezcle el pimiento rojo, el aguacate, el mango, los frijoles rojos, la cebolleta, el chile, el jugo de lima y la menta en un tazón grande y sazone al gusto con sal y pimienta. Agregue un poco de aceite si lo desea.", "Una vez que las copas de tortilla estén crujientes y doradas, sáquelas del horno y colóquelas en un plato para servir. Divida la mezcla de llenado de manera uniforme entre las tazas y sirva."], "url": "www_bbc_co_uk_food_recipes_caribbean_toastie_cups_20898", "title": "Tazas de tostadas caribeñas con aguacate, mango y menta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Hace 24 tazas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/caribbean_toastie_cups_20898_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["25g / 1oz de mantequilla", "2 cebollas tiernas, finamente picadas", "1 diente de ajo, pelado y aplastado", "100ml / 3½fl oz de leche de coco clara", "100g / 3½oz de arroz basmati", "½ x 410 g / 14 oz pueden frijoles (no drenar)", "1 ramita de tomillo fresco", "½ pts de sal", "310ml / 11fl oz de agua hirviendo", "1 guindilla verde (o ½ Scotch bonnet pepper)", "2 cucharadas de condimento ligero tirón", "1 cucharada de salsa de soja", "2-3 cucharadas de ketchup de tomate (o salsa de barbacoa)", "1 cucharada de miel clara", "2 pechugas de pollo sin hueso, con la piel puesta", "2 cucharadas de aceite vegetal", "30 g / 1½ oz de mantequilla", "1-2 cucharadas de aceite vegetal", "1 plátano grande maduro, sin piel, cortado en diagonal en rodajas de 2cm / ¾ de espesor", "½ cebolla roja pequeña, pelada y finamente picada", "½-1 chile rojo, finamente picado", "½ piña madura pequeña, pelada y finamente picada", "½ lima, solo jugo", "½-1 cucharada de azúcar", "Jengibre fresco de 2.5cm / 1 en pieza, rallado (opcional)", "1 cucharada de cilantro fresco picado", "1 cucharada de menta fresca picada"], "method": ["Para el arroz y los guisantes, caliente la mantequilla en una cacerola y fríe con cuidado las cebollas y el ajo. No permita que se doren.", "Agregue la leche de coco y deje que hierva.", "Agregue el arroz, los frijoles (junto con el líquido en la lata), el tomillo, la sal y el agua hirviendo. Agregue la guindilla, revuelva, cubra con una tapa y vuelva a hervir.", "Una vez que ha llegado a ebullición, reduzca el fuego y cocine a fuego lento durante 20-25 minutos, o hasta que todo el líquido se haya absorbido y el arroz esté tierno. Pelusa ligeramente con un tenedor para separar los granos, cubrir y dejar reposar.", "Para el pollo jerk, precaliente el horno a 200C / 400F / Gas 6. Coloque el condimento jerk, la salsa de soja, el ketchup de tomate (o salsa de barbacoa) y la miel en un bol y mezcle hasta obtener una pasta.", "Use un cuchillo afilado para hacer cuatro o cinco cortes profundos en ángulo sobre el lado de la piel de las pechugas de pollo.", "Cepille la mitad del jerk paste sobre el pollo con un cepillo de pastelería.", "Cepille una bandeja para hornear con la mitad del aceite vegetal. Coloque las pechugas de pollo en la bandeja para hornear y rocíe con el aceite restante. Transfiera al horno y tueste por 25 minutos. Cepille con la pasta de tirón restante durante la cocción.", "Durante los últimos cinco minutos de cocción, coloque la bandeja de horno en la parte superior del horno, donde la temperatura es más alta, para dorar el pollo. Verifique que el pollo esté bien cocido; no debe haber rosado cuando lo corta.", "Para el plátano, caliente la mantequilla y el aceite en una sartén a fuego medio, agregue el plátano y cocínelos durante 4-5 minutos por cada lado hasta que queden dorados. Retire de la sartén y escurra sobre papel de cocina.", "Para la salsa, coloque la cebolla, el chile, la piña, el jugo de lima, el azúcar y el jengibre, si está usando, en una sartén y caliéntela suavemente durante 2-3 minutos. Retirar del fuego, enfriar, luego incorporar el cilantro y la menta.", "Para servir, coloque el pollo en platos para servir con un poco de arroz y guisantes, unas rodajas de plátano y una cucharada de salsa. Sirve con ponche fuerte de Irlanda"], "url": "www_bbc_co_uk_food_recipes_caribbeanjerkchicken_86981", "title": "Jerk pollo con arroz, guisantes y plátano frito", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50 g / 1¾oz de chiles guajillo secos, sin semillas", "4 tomates maduros grandes", "4 dientes de ajo, piel sobre", "30g / 1oz de manteca de cerdo o 3 cucharadas de aceite vegetal", "1kg / 2lb 4oz bistec estofado, en cubos", "1 cebolla grande, más o menos picada", "1 cucharadita de comino molido", "1 cucharadita de orégano seco", "4 bayas de pimienta de Jamaica, magulladas", "1 hoja de laurel", "1 cucharadita de sal", "2 tbsp chipotles en adobo", "12-18 tortillas de maíz", "puñado de cilantro, toscamente picado", "200ml / 7fl oz de crema agria", "Queso Lancashire, desmenuzado", "1 aguacate, piedra removida, pelada y cortada en cubitos", "1 cebolla grande, finamente picada", "4 rábanos, finamente rebanados"], "method": ["Coloque una sartén de base pesada a fuego medio y tueste los chiles por 20 segundos, hasta que estén fragantes pero no quemados. Colóquelos en un recipiente y vierta más de 450 ml / 16 fl oz de agua hirviendo para cubrirlos. Deje remojar durante 15-20 minutos.", "En la misma sartén, freír los tomates y el ajo hasta que estén blandos y chamuscados. Déjelo a un lado hasta que esté lo suficientemente frío como para manipularlo, luego quítelo y deseche las pieles de ajo y corte los tomates.", "Caliente una cucharada de manteca de cerdo o aceite en una cazuela grande a prueba de llamas y dore un tercio de la carne. Transfiera a un plato y repita hasta que toda la carne se dore, agregando otra cucharada de manteca de cerdo o aceite según sea necesario.", "Agregue la manteca o el aceite restante a la sartén y fría la cebolla durante 3-4 minutos hasta que se ablanden. Agregue el comino, el orégano, la pimienta de Jamaica y la hoja de laurel. Cocine por 2 minutos.", "Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Coloque los chiles empapados y aproximadamente 150ml / 5fl oz de su líquido de remojo en un procesador de alimentos. Agregue el ajo, los tomates, la sal y los chipotles en adobo y mezcle hasta que esté lo más suave posible.", "Incline la pasta en la cazuela. Agregue la carne dorada y agregue el resto del chili en remojo. Llevar a ebullición, luego baje a fuego lento a fuego lento. Cubra y cocine en el horno durante 1½-2 horas hasta que la carne esté tierna. Verifique el nivel del agua un par de veces durante la cocción para asegurarse de que la carne no se seque. Agregue un poco más de líquido si es necesario.", "Caliente las tortillas y sirva el chile con las coberturas laterales. Agregue arroz o frijoles si lo desea."], "url": "www_bbc_co_uk_food_recipes_carne_con_chile_04415", "title": "Carne con chile", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/carne_con_chile_04415_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 cebolla mediana picada", "Pan rallado blanco 40g / 1½ oz", "50ml / 2fl de leche en oz", "Carne picada de pavo 250 g / 9 oz", "1 manzana pequeña, pelada y rallada", "1 cucharadita de hojas frescas de tomillo", "½ cucharadita de sal y pimienta negra recién molida", "1 cucharada de harina, para quitar el polvo", "2 cucharadas de aceite de girasol", "1 cucharada de aceite de oliva", "1 cebolla mediana picada", "1 diente de ajo, aplastado", "400g / 14oz de tomates picados en lata", "100 ml / 3½ fl oz de agua", "1 cucharada de puré de tomate", "2 cucharaditas de azúcar", "¼ cucharadita de orégano seco", "pizca de copos de chile seco", "sal y pimienta negra recién molida", "Espaguetis secos 250 g / 9 oz", "perejil fresco picado o albahaca"], "method": ["Para las albóndigas, caliente el aceite en una sartén y fría la cebolla durante unos 10 minutos hasta que se ablanden.", "Mientras tanto, remoje las migas de pan en la leche durante 10 minutos en un tazón grande.", "Para la salsa, caliente el aceite en una sartén y fría la cebolla por unos 10 minutos hasta que se ablande. Agregue el ajo picado y saltee durante un minuto.", "Agregue todos los ingredientes restantes y cocine a fuego lento, cubierto, durante siete minutos.", "Para las albóndigas, agregue la carne picada de pavo, manzana rallada, tomillo, cebollas salteadas, sal y pimienta negra recién molida a las migas de pan empapadas y mezcle.", "Usando manos enharinadas, forma cucharaditas de la mezcla de pavo en bolitas.", "Caliente el aceite de girasol en una sartén y dore las albóndigas. Transfiera las albóndigas a la sartén de salsa de tomate y cocine a fuego lento, sin tapar, durante 8-10 minutos.", "Cocine los espaguetis según las instrucciones del paquete. Escurra y mezcle con la salsa. Espolvorear con un poco de perejil picado o albahaca y servir."], "url": "www_bbc_co_uk_food_recipes_carolinesturkeymeatb_82302", "title": "Albóndigas de pavo con espagueti y salsa de tomate", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/carolinesturkeymeatb_82302_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Palitos de cereales de salvado 240g / 8½oz", "100 g / 3½ oz de mantequilla, ablandada", "200 g / 7 oz de azúcar en polvo", "2 plátanos maduros, pelados, puré", "2 huevos de gallinas camperas, golpeados", "1 limón, solo jugo", "450ml / 16fl de leche en oz", "Harina normal 300g / 10½ oz", "2½ cucharaditas de polvo de hornear", "½ cucharadita de sal marina fina", "220 g / ½ libra de pasas o sultanas"], "method": ["Precalentar el horno a 190C / 375F / Gas 5.", "Vierta la mitad de los salvados en un tazón grande. Vierta más de 200ml / 7fl oz de agua hirviendo. Déjelo a un lado hasta que los palitos de salvado se hayan suavizado y absorbido la mayor parte del agua y el agua se haya enfriado.", "En un tazón para mezclar por separado, unte la mantequilla y el azúcar. Agregue porciones de puré de plátano y huevo batido poco a poco, batiendo bien después de cada adición, hasta que la mezcla esté suave y bien combinada.", "Mezcle el jugo de limón y la leche, luego agregue la mezcla a la masa de muffins poco a poco, golpeando después de cada adición, hasta que todo el líquido se haya incorporado a la mezcla.", "Agregue la mezcla de salvado fría y suavizada a la mezcla y revuelva bien para combinar. (Nota: en este punto, la mezcla se verá como si se hubiera cuajado, pero no se preocupe).", "Tamizar la harina y el polvo de hornear en la mezcla de la mezcla y revuelva hasta que se combinen.", "Agregue la sal, luego agregue las pasas o sultanas y los palitos de salvado restantes hasta que estén bien combinados.", "Coloque una caja de muffin de papel o un cuadrado grande de papel antigrasa en cada pocillo de una lata de muffin de 24 orificios. Divida la masa de panecillos por igual entre las cajas de muffins.", "Transfiera las magdalenas al horno y hornee por 25-30 minutos, o hasta que se levanten, doradas y cocidas. (NB: Los muffins se cocinan cuando una brocheta insertada en el centro sale limpia)."], "url": "www_bbc_co_uk_food_recipes_carolsbranmuffins_91964", "title": "Magdalenas de salvado de Carol", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 20-24", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 limón, solo jugo", "1 lima, solo jugo", "1 cucharada de vinagre balsámico", "100 g / 3½ oz de atún crudo muy fresco, en rodajas finas", "2 tomates, en rodajas finas", "1 cucharada de perejil fresco picado", "1 cucharada de semillas de sésamo", "sal y pimienta negra recién molida"], "method": ["Coloque el aceite de oliva, el jugo de limón y lima y el vinagre balsámico en un bol y mezcle bien.", "Agregue el atún al tazón y deje que el pescado se mase en el tazón durante diez minutos.", "Para servir, coloque las rodajas de tomate en un plato limpio y coloque el atún en la parte superior del tomate. Espolvoree el perejil fresco y las semillas de sésamo en la parte superior y sazone con sal y pimienta negra recién molida."], "url": "www_bbc_co_uk_food_recipes_carpacchiooftunaandt_84780", "title": "Carpaccio de atún y tomate con limón y sésamo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filete de res 300 g / 10½ oz cortado", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "200 g / 7 oz de azúcar en polvo", "200ml / 7fl oz de vinagre de vino blanco", "pizca de sal", "1 manojo de remolachas del patrimonio del bebé, cortado en una mandolina", "1 chalote de plátano, finamente picado", "3 cucharadas de menta fresca picada", "3 cucharadas de albahaca fresca rasgada", "3 cucharadas de perejil de hoja plana aproximadamente picado", "1 chalote, finamente picado", "1 diente de ajo, finamente picado", "1 limón sin cebar, solo cáscara", "2 cucharadas de alcaparras, escurridas", "4 anchoas, aproximadamente picadas", "3 cucharadas de aceite de oliva virgen extra", "1/2 masa fermentada de pan pequeño, en rodajas", "1 diente de ajo, pelado y dejado entero", "2 cucharadas de aceite de oliva", "10g / ½ oz de sangre de toro hojas", "5g hojas de sangre de toro bebé", "½ manojo de berros", "½ cebolla roja, finamente picada", "1-2 cucharadas de aceite de oliva virgen extra"], "method": ["Para la carne, sazone el filete de carne con sal y pimienta negra recién molida. Calentar una sartén hasta que se fume, agregar el aceite de oliva y dorar la carne durante 2-3 minutos en todos los lados, hasta que se dore.", "Retire la carne de la cacerola y cúbrala con film transparente y enrolle en forma de barril, girándola firmemente en ambos extremos para sellarla. Refrigere por 1 hora, o hasta que esté firme.", "Para los encurtidos, ponga el azúcar, el vinagre, la sal y 400 ml / 14 onzas de agua en una bandeja no reactiva y deje que hierva. Vierta la mitad del licor decapante en una sartén por separado. Agregue la remolacha en una sartén y la chalota en la otra, luego retírela del fuego y déjela enfriar. Escurrir bien.", "Para la salsa verde, ponga todos los ingredientes en un mortero y machaque hasta que tenga una pasta espesa.", "Caliente una sartén hasta que esté caliente. Frote la masa fermentada en rodajas con el ajo y rocíe con un poco de aceite de oliva. Tueste el pan en la sartén durante 1-2 minutos en cada lado, o hasta que esté chamuscado.", "Para servir, corte la carne y colóquela en un plato grande para servir en forma de abanico. Ponga salsa verde alrededor del plato y adorne con la sangre del toro y las hojas de berro y la cebolla roja. Rocíe con el aceite de oliva virgen extra y sirva con los pepinillos y el pan."], "url": "www_bbc_co_uk_food_recipes_carpaccio_of_beef_with_48203", "title": "Carpaccio de ternera con remolacha baby pickled y salsa verde", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Sirve 2-3", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de sésamo", "1 cucharada de salsa de soja", "½ lima, solo jugo", "Filete de salmón de 85 g / 3 oz, sin piel, en rodajas finas", "1 cucharada de hojas de cilantro fresco picado", "1 cucharadita de semillas de sésamo"], "method": ["Combine el aceite de sésamo, la salsa de soja y el jugo de lima en un recipiente para hacer un aderezo de soya.", "Coloque el salmón en rodajas finas en un plato y vierta sobre el aderezo de soja.", "Coloque el salmón a un lado para marinar en el aderezo durante 5-10 minutos.", "Para servir, adornar el salmón con las hojas de cilantro y las semillas de sésamo."], "url": "www_bbc_co_uk_food_recipes_carpaccioofsalmonwit_92459", "title": "Carpaccio de salmón con salsa de soja y semillas de sésamo", "time": {"preparation": "", "preparationMins": 0, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 0}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]