[{"ingredients": ["100 g / 3½ oz de azúcar en polvo", "Castañas al vacío 100g / 3½oz", "pizca de sal", "200ml / 7¼fl oz de crema doble", "150g / 5½oz de queso crema", "1 naranja, pelada y finamente picada", "mantequilla, para engrasar", "pizca de chile en polvo", "pizca de pimienta negra"], "method": ["Coloque el azúcar en una sartén y cocine a fuego medio hasta que el azúcar se haya tornado de un color dorado, agitando la sartén para ayudar a que el azúcar se disuelva.", "Agregue las castañas a la sartén y revuelva la mezcla para cubrir las castañas en azúcar caramelizada.", "Vierta las castañas en una estera de silicona antiadherente y deje enfriar.", "En un tazón grande, mezcle la crema doble, el queso crema y la naranja picada.", "Engrase dos anillos de 6cm / 2½in en cocineros con mantequilla y colóquelos en un plato para servir. Coloque la mezcla de crema en los anillos de los cocineros.", "Use un soplete para calentar el exterior de los anillos de los cocineros; esto ayudará a liberar la tarta de queso: podrá deslizar cada una de los anillos de los chefs fácilmente.", "Cubra con las castañas caramelizadas y espolvoree con chile en polvo y un chorro de pimienta negro.", "Sirva inmediatamente o guárdelo en el refrigerador hasta que esté listo para servir."], "url": "www_bbc_co_uk_food_recipes_caramelisedchestnutc_84940", "title": "Tarta de queso de castaña caramelizada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 cucharadas de azúcar moreno", "55 g / 2 oz de mantequilla", "150 g / 5½ oz de calabaza, pelada y picada", "100g / 3½oz de piñones, aplastados", "100 g / 3½ oz de harina natural, más extra para espolvorear", "85g / 3oz de mantequilla fría, cortada en cubos", "1 huevo de gallinas camperas, golpeado", "salpicar leche", "2 cucharadas de yogur al estilo griego", "1 cucharada de cebolletas frescas picadas"], "method": ["Precalentar el horno a 180 ° C / 250 ° F / Gas 4.", "Para la calabaza caramelizada, coloca el azúcar en una sartén pequeña a prueba de horno y calienta suavemente hasta que se derrita y color caramelo. Agregue la mantequilla y revuelva para combinar.", "Agregue las piezas de calabaza, mezcle bien y cocine suavemente durante 3-4 minutos, hasta que se ablanden.", "Para la masa, coloque los piñones triturados, la harina común y la mantequilla fría en un procesador de alimentos y pulse hasta que la mezcla se asemeje a pan rallado.", "Agregue el huevo batido y un chorrito de leche si la mezcla todavía está demasiado seca y mezcle para combinar.", "Convierta la masa en una superficie enharinada y extiéndala al grosor de una moneda de una libra.", "Coloque la masa sobre la calabaza cocida en la sartén, presionando hacia abajo alrededor de los bordes para encerrar el relleno y recortar cualquier exceso de masa.", "Transfiera al horno y hornee por 12-14 minutos, o hasta que estén doradas.", "Retire la tarta del horno y deje que se enfríe un poco. Deslice un cuchillo alrededor de los bordes de la sartén y gire la tarta en un plato de servir.", "Para servir, mezcle el yogur y el cebollino en un bol y coloque una cucharada de yogur de cebollín encima de la tarta."], "url": "www_bbc_co_uk_food_recipes_caramelisedbutternut_87223", "title": "Tarta de calabaza caramelizada con pasta de piñones y yogur de cebolleta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 bistec de cordero", "2 cucharadas de aceite de oliva", "1 cucharada de harina normal", "3-4 cucharadas de vino tinto", "2 cucharadas de azúcar moreno", "aceite para freír", "½ batata", "2 ramitas de romero", "2 dientes de ajo", "manojo de zanahorias", "puñado de mangetout", "3-4 cucharadas de aceite de oliva", "3 calabacines para bebés", "2-3 cucharadas de leche", "55g / 2 oz de harina común", "1 huevo, ligeramente batido"], "method": ["Caliente la freidora a 190C / 375F / Gas 5 o llene una bandeja grande con aceite vegetal por tercera vez. Para probar si el aceite está a la temperatura correcta, deje caer un pequeño cubo de pan en el aceite. Si chisporrotea y se vuelve dorado, el aceite está listo para usar. (PRECAUCIÓN: el aceite caliente es muy peligroso. No lo deje sin supervisión).", "Cortar el filete de cordero en tiras.", "Sear el cordero en el aceite de oliva por un minuto.", "Agregue la harina y fría por un minuto.", "Agregue el vino y cocine a fuego lento durante un minuto.", "Agregue el azúcar y cocine a fuego lento durante dos minutos.", "Pele la batata y hierva de una sola pieza hasta que esté tierna.", "Cortar en rebanadas gruesas de 1.5cm /..", "Sazonar y saltear con el romero y el ajo durante cinco o seis minutos hasta que estén dorados.", "Lave y recorte las zanahorias y el mangetout.", "Rocíe en aceite de oliva y la plancha durante dos o tres minutos hasta que estén tiernos.", "Para hacer los calabacines fritos, corte los calabacines por la mitad a lo largo.", "Revuelva la leche y el huevo en la harina para hacer un batido.", "Sumerja el calabacín en la mezcla y fríalos durante dos o tres minutos hasta que estén dorados.", "Sirve con la salsa del cordero."], "url": "www_bbc_co_uk_food_recipes_caramelisedlambwitha_72111", "title": "Cordero caramelizado con un popurrí de verduras", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["25g / 1oz de mantequilla", "Achicoria de 4 cabezas, cortada y cortada a la mitad longitudinalmente", "2 cucharaditas de miel clara", "½ naranja grande, solo jugo", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Frote la mitad de la mantequilla gruesa sobre el fondo de un plato resistente al horno, luego empaquete las mitades de achicoria, en una sola capa, en el plato. Rocíe la miel y el jugo de naranja y sazone con sal y pimienta negra recién molida. Punto con la mantequilla restante.", "Transfiera al horno y tueste, sin tapar, durante aproximadamente una hora, volteando e hilvanando la achicoria cada 15 minutos. Esté atento a los procedimientos hacia el final del tiempo de cocción y saque el plato del horno cuando los jugos se hayan reducido a unas cucharadas de jarabe espeso y la achicoria se vea adecuadamente caramelizada. Sirve caliente."], "url": "www_bbc_co_uk_food_recipes_caramelisedchicory_85616", "title": "Achicoria caramelizada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 cucharadas de azúcar glas", "½ mango, piel, piedra removida, cortada en cuñas a lo largo"], "method": ["Espolvorear el azúcar glas en un plato y dragar los lados cortados del mango en el azúcar hasta que se cubra.", "Usando una soplete de cocineros, caliente las rodajas de mango recubiertas de azúcar hasta que estén doradas y caramelizadas. (Alternativamente, precaliente la parrilla a su nivel más alto y caliente las rebanadas de mango durante 2-3 minutos, o hasta que estén doradas). Sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_caramelisedmangowedg_92733", "title": "Cuñas de mango caramelizado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 200g / 7oz, más extra para quitar el polvo", "100 g / 3½ oz de mantequilla", "1 huevo de gallinas camperas", "30g / 1oz de mantequilla", "30 g / 1 oz de azúcar en polvo", "½ mango, pelado y rebanado", "Crema doble de 150 ml / 1/4 de pinta", "2 cucharadas de azúcar glas"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Coloque la harina y la mantequilla en un procesador de alimentos y pulse hasta que la mezcla se asemeje a pan rallado.", "Agregue el huevo y vuelva a pulsar hasta que la mezcla se una para formar una masa blanda pero no pegajosa.", "Haga rodar la masa sobre una superficie ligeramente enharinada a 0.5cm / ¼ de grosor y recorte los bordes.", "Coloque la masa en una bandeja para hornear espolvoreada con harina y hornee en el horno durante 8-10 minutos, o hasta que estén crujientes y doradas.", "Para el mango, caliente la mantequilla y el azúcar juntos en una sartén pequeña antiadherente hasta que el azúcar se derrita.", "Agregue el mango y cocine por 2-3 minutos, o hasta que el mango esté bien cubierto y caramelizado.", "Para la crema de Chantilly, bate la crema y el azúcar glas juntos en un bol hasta que la crema forme picos suaves cuando se quita la batidora.", "Para armar la tarta, acomode el mango en rebanadas superpuestas encima de la masa cocida y rocíe sobre los jugos de la sartén.", "Para servir, corte la tarta en trozos y sirva con una cucharada de crema de Chantilly."], "url": "www_bbc_co_uk_food_recipes_caramelisedmangotart_86915", "title": "Tarta de mango caramelizado con crema de Chantilly", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["225 g / 8 oz de harina, más extra para quitar el polvo", "100 g / 3½ oz de mantequilla", "25 g / 1 oz de azúcar", "1 huevo de gallinas camperas", "dash milk, opcional, para ayudar a unir los pasteles", "50g / 2oz de mantequilla", "1 cucharada de aceite vegetal", "4 cebollas españolas grandes, en rodajas", "1 diente de ajo, aplastado", "sal y pimienta negra recién molida", "2 huevos de gallinas camperas", "2 yemas de huevo de gallinas camperas", "50g / 2oz de mostaza integral", "150ml / 5fl oz de crema doble", "sal y pimienta negra recién molida", "Frijoles Borlotti de 150g / 5oz de una lata, enjuagados y escurridos", "150 g / 5oz de mantequilla de lata, enjuagada y escurrida", "Habas de 150 g / 5oz de una lata, enjuagadas y escurridas", "Frijoles cannellini de 150g / 5oz de una lata, enjuagados y escurridos", "1 cucharada de menta fresca picada", "2 cucharaditas de mostaza Dijon", "1 limón, solo jugo", "1 cucharada de vinagre de vino blanco", "sal y pimienta negra recién molida", "100ml / 3½fl oz de aceite de oliva virgen extra"], "method": ["Para la masa, coloque la harina, la mantequilla, el azúcar y el huevo en un procesador de alimentos y pulse hasta que se unan como una masa (agregue un poco de leche si es necesario para unir la masa).", "Junta la masa en una bola, envuélvela en una película adhesiva y colócala en la nevera para que se enfríe durante al menos una hora.", "Desenvuelva y extienda la masa en una superficie de trabajo enharinada para caber en una caja de tarta de 20 cm / 8 in. Presione los pasteles en la caja y colóquelos en la nevera para enfriar durante 45 minutos.", "Precalentar el horno a 200F / 400F / Gas 6.", "Coloque la caja agria refrigerada en el horno para hornear durante 10-15 minutos, hasta que se dore. Sacar del horno y dejar enfriar.", "Reduzca la temperatura del horno a 180C / 355F / Gas 4.", "Mientras tanto, para el relleno, caliente la mantequilla y el aceite en una cacerola grande y de fondo grueso a fuego lento.", "Agregue las cebollas y el ajo y sazone bien con sal y pimienta negra recién molida. Cocine las cebollas muy suavemente durante aproximadamente 30-40 minutos hasta que estén muy suaves y doradas, pero no doradas.", "Batir los huevos, las yemas de huevo, la mostaza y la crema en un tazón limpio.", "Agregue las cebollas cocidas lentamente a la mezcla de huevo, luego mezcle la mezcla en la caja de tarta cocida. Transfiera al horno para hornear por 20-25 minutos, o hasta que el relleno esté dorado.", "Para la ensalada de frijoles, coloque todos los frijoles y la menta picada en un tazón limpio grande y mezcle para combinar.", "Para el aderezo, coloque la mostaza, el jugo de limón y el vinagre de vino blanco en un tazón limpio. Sazonar, al gusto, con sal y pimienta negra recién molida y verter lentamente el aceite, batiendo constantemente.", "Vierta el aderezo sobre la mezcla de frijoles y mezcle bien.", "Para servir, corte cuatro rodajas de tarta de cebolla caliente y colóquelas en los platos. Coloque una cucharada de ensalada de frijoles al lado de cada uno."], "url": "www_bbc_co_uk_food_recipes_caramelisedonionandm_85435", "title": "Cebolla caramelizada y tarta de mostaza", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["30g / 1oz de mantequilla", "2 cucharadas de azúcar moreno", "1 naranja, cáscara y médula eliminados, cortados en rodajas", "½ botella de brandy en miniatura", "2 cucharadas de galletas amaretti, aplastadas", "1 cucharada de chocolate negro rallado", "ramita de menta fresca, para adornar", "crema doble, para servir"], "method": ["Caliente la mantequilla y el azúcar juntos en una sartén pequeña hasta que el azúcar se haya disuelto.", "Agregue las naranjas rebanadas y cocine por 2-3 minutos, hasta que estén cubiertas y caramelizadas.", "Agregue el brandy y deje que se caliente.", "Cuando las llamas se hayan extinguido, retírelas del fuego y coloque las rodajas de naranja alrededor de un plato para servir de poca profundidad.", "Vierta la salsa de la sartén sobre las naranjas.", "Espolvorear sobre los bizcochos triturados, el chocolate rallado y adornar con una ramita de menta.", "Para servir, rocíe sobre una crema doble."], "url": "www_bbc_co_uk_food_recipes_caramelisedorangeswi_86870", "title": "Naranjas caramelizadas con amaretti y crema", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["6-8 naranjas grandes", "250 g / 9 oz de azúcar blanco o azúcar granulada", "200ml / 7fl oz de agua caliente", "Ricotta 400 g / 14 oz", "1 cucharada de miel líquida", "azúcar glas (opcional)", "Almendras en copos de 50g / 2oz, ligeramente tostadas en una bandeja para hornear en un horno moderado durante diez minutos"], "method": ["Cortar la ralladura de dos naranjas y cortar en trozos muy finos (o usar un zester). Dejar de lado.", "Pele todas las naranjas cortando la piel y la médula blanca, para revelar la carne naranja desnuda.", "Con un cuchillo pequeño y muy afilado, corte el primer segmento de la naranja, deslice el cuchillo hacia abajo entre su fina capa de papel y su carne a cada lado, y luego aliéntelo. Sigue trabajando alrededor de la naranja, cortando los segmentos.", "Coloque los segmentos y cualquier jugo de las naranjas en un recipiente para servir poco profundo. Repita el proceso con las naranjas restantes hasta que todas estén segmentadas.", "Calentar una olla pequeña de agua hasta que hierva. Cuando hierva, deje caer la ralladura de naranja en el agua, cocine a fuego lento durante dos minutos y luego escurra bien a través de un colador en un recipiente pequeño. Dejar de lado.", "Caliente una sartén ancha de base pesada (preferiblemente una que tenga un fondo de color pálido) a fuego moderado. Agregue el azúcar y déjelo por unos minutos, vigilándolo cuidadosamente, hasta que el azúcar comience a derretirse. No te muevas Constrúyase y no haga más que inclinar e inclinar la sartén para que el azúcar se derrita de manera uniforme.", "Una vez que el azúcar esté líquida, déjela burbujear suavemente, luego con más fuerza, hasta que comience a dorarse (esto puede demorar entre 2 y 3 minutos), inclinándose y agitando la olla de vez en cuando.", "Una vez que el azúcar se haya caramelizado hasta obtener un color marrón avellana, vierta el agua caliente medida en la sartén. Haga esto con el brazo extendido, usando un guante de horno. Tenga mucho cuidado, ya que el caramelo escupirá y silbará cuando agregue el agua por primera vez.", "Agite y revuelva el jarabe de caramelo y baje el fuego a bajo. Deja caer los trozos escaldados de la ralladura de naranja y deja hervir a fuego lento durante 5-10 minutos, hasta que la ralladura sea translúcida. Es posible que necesite agregar un poco más de agua si el caramelo se espesa demasiado.", "Vierta el almíbar caliente y triture sobre los segmentos de naranja y deje enfriar.", "Mientras tanto, haz la ricotta con miel. En un tazón limpio, bata la ricota con la miel, luego prueba. Si quieres más dulce agrega un poco de azúcar glas, si la miel tiene un sabor fuerte o un poco más de miel si es suave. Dobla dos tercios de las almendras en la mezcla y esparce el resto encima.", "Sirva las naranjas caramelizadas con ricota honeyed en el lado."], "url": "www_bbc_co_uk_food_recipes_caramelisedorangeswi_90379", "title": "Naranjas caramelizadas con ricotta con miel", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/caramelisedorangeswi_90379_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["55 g / 2 oz de mantequilla", "3 cucharadas de azúcar moreno", "4 mitades de melocotón enlatadas, escurridas", "2 cucharadas de crema doble", "2 huevos de gallinas camperas", "150ml / 5fl oz de crema doble", "2 cucharadas de azúcar en polvo", "1 rebanada de pan blanco", "2 cucharadas de crema doble"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para los melocotones, derrita la mantequilla y el azúcar en una sartén y agregue las mitades de melocotón. Cocine por 4-5 minutos, volteando una vez, o hasta que los melocotones estén caramelizados. Retire los melocotones de la sartén y agregue la crema para hacer una salsa de caramelo.", "Para la tostada, mezcle los huevos, la crema y el azúcar hasta que quede suave y cremoso y empape la rebanada de pan en la mezcla. Coloque el pan en una bandeja para hornear y hornee en el horno durante 6-7 minutos, o hasta que estén dorados y crujientes.", "Sirva las mitades de melocotón en la parte superior de la tostada, con la salsa de caramelo batida en la parte superior y una llovizna de crema."], "url": "www_bbc_co_uk_food_recipes_caramelisedpeacheswi_90485", "title": "Melocotones caramelizados con pan tostado y crema", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50g / 1¾oz de mantequilla", "½ piña, núcleo removido y cortado en tres cuñas", "50g / 1¾oz de azúcar moreno", "1 vaina de vainilla, partida por la mitad, semillas raspadas", "1 yema de huevo de gallinas camperas", "3 cucharadas de vino blanco", "50 g / 1 oz de azúcar en polvo"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4.Para hacer la piña caramelizada, derrita la mantequilla durante 2-3 minutos en una olla a prueba de horno. Agregue las cuñas de piña, el azúcar moreno y la vainilla.", "Coloque en el horno precalentado durante cuatro minutos.", "Para hacer el sabayón, sobre una fuente de agua hirviendo, coloque los ingredientes del sabayón en un tazón. Batir constantemente a fuego medio hasta que la luz y el doble de tamaño, durante 3-4 minutos.", "Sirva la piña caramelizada con salsa de sabayón en un lado."], "url": "www_bbc_co_uk_food_recipes_caramelisedpineapple_75831", "title": "Piña caramelizada con sabayón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["½ piña, pelada y cortada en rodajas 5mm¼en grosor", "75ml / 3fl oz de ron", "50 g / 2 oz de azúcar en polvo", "50 ml / 2 fl oz de agua", "½ cucharadita de pimienta negra agrietada", "115 g / 4oz de pasas", "Ron de 115ml / 4fl oz", "8 yemas de huevo de gallinas camperas", "200 g / 7 oz de azúcar en polvo", "400ml / 14fl oz de leche entera", "400 ml / 14 fl oz crema doble", "½ piña, pelada y cortada en rodajas de 3 mm de grosor"], "method": ["Para la piña caramelizada, corte el núcleo central de la piña. Caliente una sartén hasta que esté caliente y coloque la piña en la sartén.", "Freír la piña en cada lado durante 1-1½ minutos hasta que comience a dorarse. Retire la piña de la sartén y colóquela en un plato. Dejar de lado.", "Agregue el ron a la sartén y cuidadosamente incline la sartén hacia la llama de la olla, de modo que el alcohol se prenda. Cuando la llama se haya calmado, agregue el azúcar y el agua y cocine hasta que tenga un color caramelo y espese un poco. Agregue la pimienta negra y luego reserve.", "Para el helado de ron y pasas, coloque las pasas en una cacerola pequeña y vierta sobre el ron. Coloque en el calor para calentar. Retire del fuego y deje reposar durante 15 minutos para que las pasas se llenen.", "Coloque las yemas de huevo y el azúcar en un bol y mezcle hasta que se combinen.", "Coloque la leche en una cacerola y llévela a ebullición. Vierta la leche hirviendo en las yemas de huevo y bata bien, luego vuelva a verter en la cacerola y vuelva al fuego.", "Agregue la crema, el ron y las pasas empapadas y continúe cocinando, a fuego lento, hasta que espese, pero no hierva. Enfríe y luego transfiera la crema pastelera a una máquina de helados para batir (de acuerdo con las instrucciones del fabricante).", "Para la piña secada al horno, caliente el horno a 180 ° C / 350 ° F / Gas 4. Coloque las rodajas de piña en una bandeja para hornear y colóquelas en el horno.", "Hornee durante 20 minutos y luego apague el fuego. Deja en el horno durante 1-1½ horas, dando vuelta una vez.", "Retire la piña del horno y colóquela sobre una rejilla para enfriarla.", "Para servir, coloque tres rodajas de piña cocida en el plato, superpuestas. Cubra con una cucharada de helado y coloque la piña secada al horno sobre el helado. Rocíe la salsa sobre la parte superior y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_caramelisedpineapple_87936", "title": "Piña caramelizada con ron y helado de pasas y piña secada al horno", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 100 g / 3½ oz", "55 g / 2 oz de mantequilla", "55g / 2oz anacardos, aplastados", "2 cucharadas de azúcar en polvo", "1 melocotón, en rodajas", "75ml / 2½fl oz de vino tinto", "1 cucharada de azúcar en polvo", "3 cucharadas de yogur al estilo griego", "½ lima, solo jugo"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para la cobertura de crumble, coloque la harina y la mantequilla en un procesador de alimentos y pulse hasta que la mezcla se asemeje a pan rallado. Agregue las nueces trituradas y el azúcar.", "Para el relleno, caliente el melocotón rebanado, el vino tinto y el azúcar en una sartén y cocine a fuego lento durante 4-5 minutos, hasta que el líquido se reduzca ligeramente.", "Vierta la mezcla de melocotón en un plato resistente al horno y cubra con la mezcla de crumble.", "Hornee en el horno durante 8-12 minutos, o hasta que la migaja esté tostada y dorada.", "Para el yogur de lima, coloque el yogur en un tazón y agregue el jugo de lima.", "Sirva el crumble caliente en el plato con una cucharada de yogur de lima."], "url": "www_bbc_co_uk_food_recipes_caramelisedpeachandc_86994", "title": "Crumble caramelizado de melocotón y anacardo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "¼ cebolla roja, finamente rebanada", "1 diente de ajo, picado", "1 cucharadita de azúcar morena suave", "2 cucharaditas de vinagre balsámico", "25g / 1oz Stilton, desmenuzado", "2 rebanadas de baguette, tostadas"], "method": ["Calentar el aceite de oliva en una sartén, agregar la cebolla roja y freír a fuego lento durante cinco minutos hasta que se ablande.", "Agregue el ajo y el azúcar y cocine durante 1-2 minutos. Agregue el vinagre balsámico y cocine durante tres minutos.", "Para servir, coloque las rebanadas de baguette tostadas en un plato de servir. Cubra con las cebollas caramelizadas y revuelva con Stilton desmenuzado."], "url": "www_bbc_co_uk_food_recipes_caramelisedredoniona_88008", "title": "Cebolla roja caramelizada y Stilton crostini", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["75ml / 2¾fl oz de aceite vegetal", "Vientre de cerdo 800g / 2lb, cortado en cuadrados de 7.5cm x 10cm / 3in x 4in", "Jengibre fresco de la raíz de los 7.5cm / 3in, juliado", "125ml / 4½fl oz de vino de arroz", "6 cucharadas de salsa de soja ligera", "250 g / 9 oz de roca amarilla o azúcar de palma", "Anís de 4 estrellas", "150ml / 5fl oz de caldo de pollo caliente (opcional)", "600g / 1lb 5½oz de papas harinas, como King Edward o Maris Piper, cortadas en trozos de igual tamaño", "150g / 5½oz de mantequilla picada", "8 hebras de azafrán, empapadas en 1 cucharadita de leche", "sal y pimienta negra recién molida", "8 cebolletas, cortadas, finamente picadas"], "method": ["Cocine los cuadrados de la barriga de cerdo en una olla con agua hirviendo durante cinco minutos, luego escurra, seque con papel de cocina y deje enfriar.", "Caliente el aceite vegetal en una sartén grande a fuego medio a alto. Agregue los cuadrados de la panceta de puerco hervida, con la piel hacia abajo, en tandas, y fríe durante 6-8 minutos, o hasta que estén crujientes y doradas. Voltee los cuadrados del vientre de cerdo y fríalos por 3-4 minutos o hasta que estén crujientes. Retire de la sartén con una espumadera y déjela a un lado para escurrir sobre papel de cocina. Repita el proceso con los lotes restantes de panza de cerdo.", "Traiga todos los ingredientes restantes a ebullición en una cacerola de base pesada. Cuando la mezcla esté hirviendo, agregue la panceta de cerdo frita y reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento. Continúe cocinando a fuego lento durante 45-50 minutos, agregando un poco del caldo de pollo a la sartén, según sea necesario, si la mezcla comienza a secarse.", "Mientras tanto, para el puré de papas, hervir las papas en una sartén de agua con sal durante 15-20 minutos, o hasta que estén tiernas. Escurra bien, luego machaque hasta que quede suave usando un triturador de patatas o ricer.", "Mezcle la mantequilla y la leche infusionada con azafrán en el puré de papas hasta que se combinen bien, luego condimente, al gusto, con sal y pimienta negra recién molida. Revuelva en las cebollas de primavera.", "Para servir, vierta una porción del puré de cebolla en el centro de cada una de las cuatro placas para servir. Coloque dos o tres cuadrados de panza de cerdo en la parte superior de cada porción, luego cuchara sobre la salsa."], "url": "www_bbc_co_uk_food_recipes_caramelisedporkbelly_92578", "title": "Vientre de cerdo caramelizado con puré de cebolla de primavera", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["25g / 1oz de mantequilla", "2 satsumas, peladas", "2 cucharadas de azúcar en polvo", "2 cucharadas de yogur al estilo griego", "1 cucharada de miel", "2 cucharadas de menta fresca picada", "1 cucharadita de ralladura de limón rallado, para servir"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Derrita la mantequilla en una sartén a prueba de horno a fuego medio, luego agregue las satsumas enteras y espolvoree sobre el azúcar. Freír suavemente durante 2-3 minutos, hasta que el azúcar se haya disuelto, luego transferir al horno para asar durante 4-5 minutos, o hasta que las satsumas se hayan caramelizado.", "En un tazón para servir, combine el yogur, la miel y la menta picada.", "Para servir, coloque las satsumas caramelizadas sobre el yogur, rocíe sobre los jugos de la sartén y espolvoree la ralladura de limón rallado."], "url": "www_bbc_co_uk_food_recipes_caramelisedsatsumasw_88935", "title": "Satsumas caramelizadas con yogur de menta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "½ cebolla roja, pelada y rebanada", "2 cucharadas de vinagre balsámico", "3 cucharadas de azúcar morena", "llovizna de miel", "1 cucharada de aceite de oliva", "½ paquete de tofu orgánico", "1 rodaja de queso Stinking Bishop", "1 cucharada de aceite de oliva", "gran puñado de hojas de espinaca", "sal y pimienta negra recién molida"], "method": ["Para las cebollas, caliente el aceite en una sartén antiadherente. Agregue la cebolla y saltee durante 1-2 minutos.", "Agregue el vinagre balsámico, el azúcar y la miel. Reduzca el fuego para cocinar a las cebollas suavemente durante 5-6 minutos, revolviendo ocasionalmente hasta que esté caramelizado.", "Mientras tanto, para el tofu, calienta el aceite en una sartén. Agregue el tofu y cocine por 2-3 minutos en cada lado, hasta que estén dorados.", "Coloque la rebanada de queso encima del tofu y transfiéralo a la parrilla para que se cocine hasta que el queso se derrita y esté dorado.", "Para las espinacas, caliente el aceite en una sartén. Agregue la espinaca y la sal y la pimienta negra recién molida, revuelva bien hasta que se marchite.", "Para servir, transfiera la espinaca cocida al centro de un plato caliente. Cubra con el queso de soja tofu y luego cuchara sobre las cebollas caramelizadas."], "url": "www_bbc_co_uk_food_recipes_caramelisedredonionw_79252", "title": "Cebolla roja caramelizada con tofu frito", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Azúcar en polvo de 55 g / 2 oz", "botón de mantequilla", "1 melocotón, cortado en cuñas", "salpicadura de kirsch (licor de cereza)", "crema batida, para servir"], "method": ["Suavemente derrita el azúcar en una sartén con la mantequilla hasta que se forme un caramelo. Agregue las cuñas de melocotón y saltee durante unos minutos, agitando la sartén para cubrir con el caramelo.", "Agregue el kirsch, enciéndalo cuidadosamente, flamee y caliente por un minuto. Apaga la llama.", "Transfiera a un plato de servir y sirva la crema batida en la parte superior."], "url": "www_bbc_co_uk_food_recipes_caramelisedpeaches_74751", "title": "Melocotones caramelizados", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 naranja, pelada, médula eliminada y cortada en tres rebanadas redondas iguales", "1 cucharada de azúcar glas", "Crema doble 250ml / 9fl oz", "100g / 3½ oz de Toblerone (u otro chocolate), derretido", "50 g / 1¾oz de galletas de amaretti listas para usar, trituradas", "100 g / 3½ oz de azúcar en polvo", "100 g / 3½ oz de almendras, picadas"], "method": ["Para hacer las naranjas caramelizadas, coloque las naranjas en una bandeja para hornear. Polvo con azúcar glas y utilizando un mini soplete, caramelizar las rodajas azucaradas.", "Para hacer la mousse, coloca la crema doble en un bol y licúa hasta que espese, luego dobla la Toblerone derretida y tritura las galletas amaretti.", "Para hacer el caramelo de almendras, coloca el azúcar en una sartén a fuego alto. Agregue las almendras y cocine hasta que el azúcar se haya convertido en un caramelo marrón y esté cubriendo las almendras.", "Vierta las almendras caramelizadas en papel resistente a la grasa y deje enfriar durante dos minutos y listo.", "Usando un rodillo, rompa el caramelo de almendras en pedazos.", "Para servir, coloque las rodajas de naranja caramelizadas en un plato. Coloque una porción de mousse de chocolate en cada rodaja de naranja y adorne con algunas de las piezas de almendra caramelizada."], "url": "www_bbc_co_uk_food_recipes_caramelizedorangeswi_80871", "title": "Naranjas caramelizadas con mousse de chocolate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["125g / 4½oz de mantequilla sin sal", "175g / 6¼oz de azúcar mascabado ligero", "1 cucharadita de extracto de vainilla", "Crema doble de 200 ml / 4½ fl oz", "25 g / 1 oz de mantequilla sin sal, más extra para engrasar", "3 manzanas grandes para comer, peladas, sin núcleo, picadas", "150g / 5oz de mantequilla sin sal", "130g / 4½oz de azúcar morena suave", "3 huevos de gallinas camperas, golpeados", "150g / 5¼ oz de harina de auto crianza", "150ml / 5¼fl oz de leche entera", "275ml / 9¾fl oz de crema doble", "1 vaina de vainilla, partida, semillas raspadas con un cuchillo", "6 yemas de huevo de gallinas camperas", "Azúcar en polvo de 110 g / 4 oz"], "method": ["Engrase ligeramente un recipiente para pudín de 1.5 litros / 12¾ flúor con mantequilla.", "Para la salsa de caramelo, derretir la mantequilla, el azúcar y el extracto de vainilla en una sartén a fuego medio, revolviendo bien para combinar. Continúe calentando hasta que la mezcla se haya caramelizado.", "Agregue la crema y revuelva hasta que la mezcla esté suave. Deje que la mezcla hierva a fuego lento y continúe cocinando a fuego lento hasta que el volumen del líquido se haya reducido ligeramente. Retire la sartén del fuego y déjela enfriar por completo.", "Para las manzanas, caliente la mantequilla en una sartén separada a fuego medio. Cuando la mantequilla esté espumosa, agregue los trozos de manzana y fría durante 3-4 minutos, o hasta que estén tiernos y comience a caramelizar. Dejar enfriar un poco.", "Para la esponja, en un bol, bata la mantequilla y el azúcar hasta que esté pálida y esponjosa.", "Poco a poco agregue los huevos batidos, poco a poco, batiendo bien para incorporar cada adición de huevo antes de agregar el siguiente.", "Cuando todos los huevos se hayan combinado bien en la mezcla, mezcle cuidadosamente la harina hasta que esté bien combinada.", "Espolvoree las manzanas caramelizadas en el fondo del cuenco de budín preparado. Vierta más de tres cuartas partes de la salsa de caramelo fría (reserve la salsa restante). Cuchara sobre la masa de esponja en una capa uniforme.", "Cubra el recipiente de budín con una hoja plisada de pergamino para hornear, luego envuélvalo en papel de aluminio y asegúrelo con una cuerda.", "Coloque el recipiente en un recipiente grande y agregue suficiente agua hirviendo para que el agua llegue a la mitad de los lados del recipiente. Cubra la olla con una tapa y deje que hierva durante al menos 1 hora y media, llenando la bandeja con más agua hirviendo según sea necesario.", "Mientras tanto, para la crème anglaise, lleve la crema, la leche y la vaina de vainilla y las semillas a ebullición en una sartén. Retire del fuego y deje a un lado durante 15 minutos para infundir. Después de 15 minutos, deseche la vaina de vainilla (puede enjuagarse y reutilizarse en otra receta).", "En un tazón, mezcle los huevos y el azúcar hasta que estén pálidos y bien combinados. Verter sobre la mezcla de leche y crema sobre la mezcla de huevo y azúcar, batiendo continuamente hasta que la mezcla esté bien combinada.", "Cuele la mezcla a través de un tamiz en una olla limpia y coloque el líquido tamizado a fuego lento. Caliente, revolviendo continuamente, hasta que la mezcla de crème anglaise sea lo suficientemente espesa como para cubrir la parte posterior de una cuchara. Retire del fuego y colóquelo en un recipiente con agua fría para evitar que se espese más.", "Para servir, coloca el pudín de manzana al vapor en un plato para servir y córtalo en rebanadas. Coloque una rebanada en el centro de cada una de las cuatro placas de servir. Rocíe la salsa restante de caramelo y la crema inglesa."], "url": "www_bbc_co_uk_food_recipes_caramelisedsteamedap_91186", "title": "Pudín de manzana al vapor caramelizado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]