[{"ingredients": ["25g / 1oz de mantequilla", "Cebolla 50g / 2oz, finamente picada", "110 g / 4 oz champiñones, finamente en rodajas", "Tocino de 25 g / 1 oz, finamente picado", "1 diente de ajo al horno, pelado y puré", "30g / 1¼ oz de jamón de Cumbria, finamente picado", "10g / ½oz de perifollo fresco picado", "1½ cucharadita de vinagre de melaza", "4 pechugas de perdiz francesa", "4 rebanadas de jamón secado al aire", "4 rebanadas de pan blanco, sin costras", "50g / 2oz de mantequilla", "Cebollas 150g / 5oz, picadas", "10g / ½ oz de mantequilla", "150ml / 5fl oz Madeira", "600 ml / 1 pinta de caldo de pollo", "1 cucharadita de harina de patata, mezcle con unas gotas de agua antes de agregar a la salsa para espesar", "½ granada, semillas retiradas", "1 calabaza, cortada a la mitad, sin semillas, anotado", "3 dientes de ajo, aplastados", "2-3 cucharadas de aceite de oliva", "150 g / 5oz pequeñas coles de Bruselas", "1 cucharadita de grasa de tocino", "Castañas 110g / 4oz, peladas y en rodajas", "25g / 1oz de mantequilla"], "method": ["Para el relleno, caliente la mantequilla en una sartén de base pesada y fría las cebollas, el tocino, los champiñones, el ajo y el jamón de Cumbria durante 3-4 minutos. Agregue el vinagre de melaza. Cocine hasta que todo el líquido se haya evaporado. Retire la sartén del fuego y déjela enfriar. Una vez que la mezcla se haya enfriado, agregue el perifollo y condimente, al gusto, con sal y pimienta negra recién molida.", "Retire el pequeño filete de la perdiz (este es el filete en la parte inferior de los senos) y haga una pequeña incisión en el lado más grueso del seno para formar una pequeña bolsa.", "Coloque el relleno cuidadosamente en cada bolsa y doble el pequeño filete hacia atrás para cerrar la bolsa y luego envuélvala en el jamón secado al aire.", "Alimente el pan, una rebanada a la vez, a través de la máquina de pasta. Repita el proceso varias veces hasta que el pan esté delgado. Coloque el pan en una tabla y cepille con la mantequilla derretida y espolvoree con salvia y cebolla seca.", "Coloque la pechuga de perdiz rellena sazonada en la parte inferior del pan, doble los lados del pan y cepille con la mantequilla derretida, doble el pan para formar un paquete y selle bien.", "Precalentar el horno a 180C / 350F / Gas 4.", "Calentar la mantequilla en una sartén pequeña y freír la perdiz hasta que se dore por todos lados. (Esto puede ser necesario por lotes.) Retire de la sartén y cocine en el horno durante 6-8 minutos. Retire la perdiz del horno y déjela reposar durante 2 o 3 minutos.", "Para la salsa de Madeira, caliente la mantequilla en una sartén a fuego medio y fría las cebollas hasta que estén suaves y doradas. Vierta en Madeira y reduzca la salsa en dos tercios.", "Agregue el caldo de pollo y reduzca la mezcla a 300 ml / 10 fl oz. Agregue la mezcla de harina de papa y cuele la salsa a través de un colador fino y en una olla limpia. Mezcle la salsa con una batidora de mano. Sazone al gusto con sal y pimienta negra y agregue las semillas de granada.", "Para el enamoramiento, marque la calabaza con un cuchillo afilado. Frote con el ajo y rocíe sobre el aceite de oliva. Sazonar con sal y pimienta negra recién molida. Hornee en el horno durante 30-40 minutos o hasta que estén tiernos. Retire la carne y aplastar con la parte posterior de un tenedor. Dejar de lado.", "Prepare los brotes eliminando las hojas exteriores. Retire la base del brote, y luego con un cuchillo afilado haga una cruz en la base. Coloque en agua hirviendo y cocine por 3-4 minutos, luego quite los brotes y sumérjalos en agua helada. Drene y reserve.", "Calentar la grasa de tocino en una sartén y freír las castañas dos minutos, o hasta que estén doradas. Retire de la sartén, coloque sobre un trozo de papel de cocina y déjelo a un lado. Vuelva a calentar los brotes en un poco de mantequilla, sazone con sal y pimienta negra recién molida, y luego agregue las castañas.", "Divida el enamoramiento de butternut entre cuatro platos. Recorte los extremos de las mantas de perdiz y colóquelas al lado del enamoramiento del nogal. Agregue los brotes al costado y cuchara sobre la salsa."], "url": "www_bbc_co_uk_food_recipes_french_partridge_in_a_31092", "title": "Perdiz francesa en una manta de pan, butternut crush y coles de Bruselas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50ml / 2fl oz de leche entera", "2 huevos de gallinas camperas", "2 rodajas gruesas ligeramente brioche rancio", "2 perillas de mantequilla sin sal", "1 cucharada de azúcar en polvo", "pizca - ½ cucharadita de canela molida, al gusto", "1 plátano maduro, pelado y en rodajas", "jarabe de arce, al gusto"], "method": ["Batir la leche y los huevos en un recipiente grande y poco profundo.", "Sumerja las rebanadas de brioche en la mezcla de huevo y leche durante un minuto, asegurándose de que el líquido se empape en el brioche en ambos lados.", "Caliente un poco de mantequilla en una sartén grande y antiadherente a fuego medio-alto. Una vez que la mantequilla se derrita, freír las rodajas de brioche durante dos minutos en cada lado hasta que estén doradas y crujientes. Retire de la sartén y coloque en un plato de servir.", "Combine el azúcar impalpable y la canela en un tazón pequeño y reserve.", "Agregue otro botón de mantequilla a la sartén a fuego alto. Una vez derretido, agregue el plátano rebanado a la sartén, mezcle la mantequilla derretida y fría por dos minutos, o hasta que esté ligeramente caramelizado por fuera.", "Sirva la tostada francesa con el plátano caramelizado, una pizca de azúcar de canela (cualquier extra se puede guardar y usar de nuevo) y una llovizna de jarabe de arce."], "url": "www_bbc_co_uk_food_recipes_french_toast_with_52720", "title": "Tostadas francesas con plátanos y jarabe de arce", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/french_toast_with_52720_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 manzanas Bramley, peladas, sin núcleo, picadas", "2 cucharadas de agua", "450 g / 1 libra de hojaldre confeccionado", "1 yema de huevo de gallinas camperas, golpeada", "2 manzanas Bramley, peladas, sin núcleo, en rodajas finas", "75g / 3oz de mantequilla, derretida", "4 cucharadas de azúcar en polvo", "helado de vainilla", "azúcar en polvo, para quitar el polvo"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Coloque las manzanas toscamente picadas con dos cucharadas de agua en un recipiente con tapa y cubra. Colocar a fuego medio y llevar a fuego lento. Cocine durante 3-4 minutos hasta que las manzanas se hayan vuelto livianas y suavizadas.", "Batir las manzanas hasta obtener un puré suave, luego reservar para enfriar.", "Mientras tanto, enrolle la masa en un círculo de aproximadamente 30 cm de diámetro. Marque ligeramente un círculo interior de 1 cm / ½ pulg dentro del borde de la masa.", "Cepille la masa con el huevo batido. Espere un minuto, luego cepille la masa nuevamente con más huevo.", "Cuando el puré de manzana esté frío, extiéndalo sobre el círculo interior de la masa.", "Coloque las finas rebanadas de manzana sobre el puré de manzana.", "Cepille las rebanadas de manzana con la mantequilla derretida y espolvoree el azúcar impalpable.", "Transfiera al horno para hornear durante 25-30 minutos, hasta que la masa esté dorada y las manzanas estén caramelizadas.", "Para servir, corte las rebanadas y colóquelas en el centro de las placas con una bola de helado colocada al costado. Polvo con azúcar glas y servir."], "url": "www_bbc_co_uk_food_recipes_frenchappletartwithv_87178", "title": "Tarta de manzana con helado de vainilla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["½ chica", "4 cucharadas de mantequilla", "½ cebolla, en rodajas", "3 cucharadas de estragón fresco, picado", "1 cucharada de hojas frescas de romero, picadas", "5 cucharadas de vino blanco", "Crema doble de 70 ml / 2½ fl oz", "150 g / 5¼ oz de patatas nuevas cocidas", "3 cucharadas de mantequilla, derretida", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 390F / Gas 6.", "Coloque el poussin en la bandeja de hornear y cocine durante 10-15 minutos, o hasta que esté cocido y dorado.", "Para hacer la salsa, derrita la mantequilla en una olla. Agregue la cebolla y ablande durante 2-3 minutos.", "Agregue el estragón, el romero, el vino blanco y la crema, y ​​reduzca durante 4-5 minutos.", "Para las papas nuevas, mezcle las papas nuevas con la mantequilla derretida y sazone.", "Para servir, coloque el poussin en un plato para servir y vierta sobre la salsa. Sirve con las papas nuevas."], "url": "www_bbc_co_uk_food_recipes_frenchchickenwithnew_76870", "title": "Pollo francés con patatas nuevas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 cucharadas de aceite de oliva", "1 cucharada de vinagre de vino", "1 cucharadita de mostaza francesa", "pizca de azúcar en polvo", "sal y pimienta"], "method": ["Coloque todos los ingredientes en un frasco limpio con una tapa segura. Agite bien para emulsionar el aderezo y servir. Si el vendaje se separa, solo agítelo.", "Agregue un diente de ajo triturado o 1 cucharada de hierbas frescas para variar."], "url": "www_bbc_co_uk_food_recipes_frenchdressing_1314", "title": "aderezo francés", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Vodka de 50ml / 2fl oz", "Licor de frambuesa 15ml / ½fl oz", "35ml / 1½fl oz de jugo de piña fresco"], "method": ["Coloque el vodka, el licor de frambuesa, el jugo de piña en una coctelera con hielo y agite vigorosamente.", "Cuele la mezcla en un vaso de Martini y sirva."], "url": "www_bbc_co_uk_food_recipes_frenchmartini_91740", "title": "Martini francés", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/frenchmartini_91740_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50 g / 1¾oz de mantequilla sin sal", "1 cebolla grande, finamente rebanada", "100 ml / 3½ fl oz de vino tinto", "300 ml / 10 fl oz de caldo de carne caliente (los vegetarianos pueden sustituirlo con caldo de verduras)", "sal y pimienta negra recién molida", "2 rebanadas de pan", "1 cucharadita de aceite de oliva", "Queso cheddar de 25 g / 1 oz, rallado", "1 cucharadita de mostaza Dijon", "sal y pimienta negra recién molida"], "method": ["Para la sopa, derrita la mantequilla en una cacerola mediana a fuego lento.", "Agregue la cebolla rebanada, cubra y cocine suavemente hasta que se ablande.", "Aumente el fuego, agregue el vino y el caldo y cocine a fuego lento hasta que se reduzca en un tercio.", "Para hacer los crotones, precaliente la parrilla a la configuración más alta.", "Rocíe el pan con el aceite de oliva y sazone, al gusto, con sal y pimienta negra recién molida.", "En un tazón pequeño, mezcle el queso cheddar rallado, Dijon y la temporada, al gusto, con sal y pimienta negra recién molida.", "Caliente una sartén hasta que fume. Agregue el pan y la plancha por un minuto en cada lado, o hasta que estén ligeramente tostados.", "Coloque la tostada en una bandeja pequeña para hornear, extienda sobre la mezcla de queso y transfiera a la parrilla para cocinar durante dos minutos, o hasta que la mezcla de queso se haya derretido.", "Retirar de la parrilla y cortar el queso en una tostada en trocitos de pan frito.", "Para servir, vierta la sopa en un recipiente tibio y cubra con algunos panqueques con queso."], "url": "www_bbc_co_uk_food_recipes_frenchonionsoupwithc_79449", "title": "Sopa de cebolla francesa con croûtons cursi", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["25g / 1oz de mantequilla", "2 cucharadas de aceite de oliva", "1kg / 2lb 2 oz cebollas blancas, finamente en rodajas", "3 dientes de ajo, finamente picados", "2 ramitas de tomillo fresco, solo hojas", "50ml / 2fl oz de jerez seco", "Brandy 75ml / 3fl oz", "250ml / 9fl oz de vino blanco", "1 cucharadita de azúcar morena suave", "1 litro / 1¾ pintas de caldo de carne fresca", "sal y pimienta negra recién molida", "1 cucharada de vinagre balsámico", "1 baguette pequeño, cortado en rodajas en diagonal", "Queso gruyere 110g / 4oz, rallado", "1 cucharada de aceite de oliva", "1 cebolla roja, finamente rebanada", "½ cucharadita de azúcar moreno", "1 cucharada de vinagre balsámico", "½ limón, solo jugo", "sal y pimienta negra recién molida", "aceite vegetal, para freír", "2 chalotes, cortados en anillos", "2 cucharadas de harina natural, condimentada con sal y pimienta negra recién molida"], "method": ["Para la sopa, caliente la mantequilla y el aceite de oliva en una sartén grande y profunda y agregue las cebollas, el ajo y el tomillo. Freír durante 20-25 minutos a fuego medio-bajo, o hasta que estén suaves y dorados.", "Agregue el jerez, dos tercios del brandy y el vino y flamee cuidadosamente.", "Cuando las llamas se hayan extinguido, agregue el azúcar y el caldo de carne a la sartén. Llevar a ebullición, luego reduzca el fuego y cocine a fuego lento durante diez minutos.", "Sazonar, al gusto, con sal y pimienta negra recién molida y agregar el vinagre balsámico y el brandy restante.", "Precalentar la parrilla a alto.", "Para los croûtes de queso, a la parrilla las rebanadas de baguette en un lado, luego gire, espolvorear con gruyère y grill hasta dorar y burbujear.", "Para la compota, caliente el aceite en una sartén y agregue la cebolla roja. Freír durante 5-8 minutos, o hasta que estén suaves pero no demasiado dorados.", "Agregue el azúcar, el vinagre y el jugo de limón y sazone, al gusto, con sal y pimienta negra recién molida.", "Para los anillos de chalota, coloque el aceite vegetal en una olla profunda de fondo grueso y caliente hasta que un pequeño cubo de pan chisporrotea y se dore cuando se deja caer en él. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Coloque los anillos de chalote en un recipiente con la harina sazonada y mezcle bien para cubrir los anillos.", "Coloque con cuidado los anillos de chalota en el aceite caliente y fríalos durante 1-2 minutos, o hasta que estén dorados y crujientes. Retirar del aceite con una cuchara ranurada y escurrir sobre papel de cocina.", "Para servir, ponga la sopa en cuencos para servir y cubra con los croûtes de queso. Cubra los croûtes con una cucharada de compota de cebolla y algunos anillos de chalota."], "url": "www_bbc_co_uk_food_recipes_frenchonionsoupwithc_87385", "title": "Sopa de cebolla francesa con croute de queso, compota de cebolla roja y anillos de chalote", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["5 cebollas", "3 dientes de ajo", "20 g / oz de mantequilla", "2 o 3 copas de vino tinto", "750ml / 1¼ pinta de caldo de res fresco", "4 cucharadas de vinagre balsámico", "8 gruesas rebanadas de pan", "284g / 10oz Gruyère, rallado", "2 disparos de brandy (opcional)", "sal y pimienta", "10 g / ½ oz de perejil de flatleaf"], "method": ["Pele y corte finamente la cebolla y el ajo. Luego, utilice la mantequilla para saltear en una sartén grande durante 15-20 minutos, hasta que se dore. Revuelva bien antes de agregar el vino tinto, caldo, vinagre y brandy. Llevar a ebullición y cocine a fuego lento durante unos 10 minutos.", "Tueste el pan y cubra con el queso rallado y colóquelo debajo de la parrilla hasta que el queso se derrita.", "Sazone la sopa con sal y pimienta.", "Mantenga la sopa en la sartén, cubra con el pan rebanado y una pizca de queso. Coloque debajo de la parrilla hasta que se ponga marrón y el queso se haya derretido.", "Dispensar con perejil fresco picado y servir de la sartén en la mesa."], "url": "www_bbc_co_uk_food_recipes_frenchonionsoupwithg_7922", "title": "Sopa de cebolla francesa con tostadas de Gruyère", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/frenchonionsoupwithg_7922_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 cebolla, finamente rebanada", "1 diente de ajo, finamente cortado", "200ml / 8fl oz de caldo de pollo", "1 cucharadita de salsa de soja", "½ cucharadita de salsa Worcestershire", "1 cucharadita de azúcar en polvo", "1 pequeña rebanada de chapata a la parrilla", "25 g / 1 oz de queso Gruyère, en rodajas"], "method": ["Precalentar la parrilla a su configuración más alta.", "Caliente el aceite en una cacerola, agregue la cebolla y el ajo y cocine por cinco minutos, a fuego lento, luego suba el fuego durante 2-3 minutos, para dorar los bordes de la cebolla.", "Agregue el caldo, la salsa de soja, la salsa Worcestershire y el azúcar en polvo, deje cocer a fuego lento, hasta que espese.", "Mientras tanto, cubra la rebanada de ciabatta con el queso y póngalo debajo de la parrilla para cocinar por 1-2 minutos, hasta que hierva y se dore.", "Para servir, ponga la sopa en un bol y cubra con el pan rallado."], "url": "www_bbc_co_uk_food_recipes_frenchonionsoupwithg_83969", "title": "Sopa de cebolla francesa con croutón de Gruyère", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 yemas de huevos de gallinas camperas", "Crema doble 150ml / 6fl oz", "½ vaina de vainilla, partido, semillas raspadas", "1 cucharada de azúcar en polvo", "½ limón, solo ralladura", "2 rebanadas gruesas de brioche listo, cortado en rondas de 10cm / 4in", "botón de mantequilla", "15g / ½ oz de mantequilla", "2 cucharadas de azúcar en polvo", "1 manzana, sin corazón y rebanada en 8", "Pizca de canela", "2 cucharadas de sultanas"], "method": ["Para la tostada francesa, coloque las yemas de huevo, la crema, las semillas de vainilla, el azúcar y la ralladura de limón en un tazón grande y mezcle bien. Sumerja el brioche en la mezcla de huevo.", "Calentar la mantequilla en una sartén hasta hacer espuma. Agregue el brioche y fría por 2-3 minutos en cada lado, o hasta que estén doradas. Coloque el brioche a un lado y manténgalo caliente.", "Para la salsa, derrita la mantequilla y el azúcar en una sartén hasta que estén dorados. Agregue la manzana, canela y pasas sultanas a la sartén y fría durante 3-5 minutos, revolviendo ocasionalmente para cubrir las manzanas.", "Para servir, coloque la tostada francesa en un plato calentado y rocíe con la salsa."], "url": "www_bbc_co_uk_food_recipes_frenchtoastwithcaram_84155", "title": "Tostadas francesas con manzanas caramelizadas y pasas sultanas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["85g / 3oz de guisantes frescos, fuera de sus vainas", "½ cebolla, finamente rebanada", "1 cucharada de vino blanco", "sal y pimienta negra recién molida", "30 g / 1 oz de mantequilla, ablandada", "Harina normal de 30g / 1oz", "pequeño puñado de menta fresca picada", "Harina de auto crianza de 200g / 7oz", "1 cucharadita de hojuelas de chile seco", "2 cucharadas de cebolletas frescas picadas", "sal y pimienta negra recién molida", "150ml / 5½fl oz de agua fría y brillante", "300ml / 10½fl oz de aceite vegetal, para freír", "1 gamba de tigre cruda, pelada, picada", "ramitas de menta fresca, para adornar"], "method": ["Para los guisantes de estilo francés, coloque los guisantes, la cebolla y el vino blanco en una cacerola pequeña y cubra con un poco de agua hirviendo. Cocine a fuego lento durante 5-6 minutos, o hasta que la cebolla y los guisantes estén tiernos y el líquido se haya reducido a la mitad.", "Mezcle la mantequilla y la harina juntas hasta que se forme una pasta (esto se llama roux), luego revuelva en la sartén con los guisantes cocidos para espesar la salsa. Agregue la menta picada.", "Para los \"arañazos\" de gambas, coloque la harina, los copos de chile, el cebollín, la sal y la pimienta negra recién molida en un tazón grande y luego bata gradualmente con agua fría y chispeante hasta que la mezcla esté suave y tenga la consistencia de crema doble. (Puede que no necesite toda el agua).", "Vierta el aceite vegetal en una cacerola y caliente hasta que un pequeño cubo de pan caiga en chispas y se vuelva dorado en 30 segundos. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Sumerja las piezas de gambas picadas en la masa y luego con cuidado en el aceite caliente. Freír por 2-3 minutos, o hasta que estén dorados y crujientes. Retire con una espumadera y escurra sobre papel de cocina.", "Para servir, coloque los guisantes en un plato para servir y cubra con los crujientes \"rasguños\" de gambas. Adorne con las ramitas de menta y sirva."], "url": "www_bbc_co_uk_food_recipes_frenchstylepeaswithm_89051", "title": "Guisantes de estilo francés con menta, cebolla y gambas 'scratchings'", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["30 g / 1 oz de azúcar en polvo", "1 vaina de vainilla, dividida abierta", "splash brandy", "Albaricoques secos 110 g / 4 oz, finamente picados", "100ml / 3½ fl oz crema doble", "6 rollos de brioche listos, divididos a la mitad por el centro", "2 huevos de gallinas camperas, golpeados", "1 cucharada de azúcar en polvo"], "method": ["Para la salsa, derrita el azúcar con la vaina de vainilla en una sartén a fuego alto.", "Una vez que el azúcar se pone dorado, agregue el brandy a la sartén y deje que hierva durante 1-2 minutos.", "Agregue los albaricoques y la crema a la sartén, lleve a ebullición, luego reduzca el fuego a fuego lento durante 3-4 minutos.", "Para la tostada francesa, bata el azúcar y los huevos juntos en un tazón limpio. Luego sumerge el brioche en la mezcla, para cubrir bien.", "Caliente una sartén hasta que fume. Agregue el brioche y la plancha durante 2-3 minutos en cada lado.", "Para servir, apile el brioche en un plato y rocíe con la salsa."], "url": "www_bbc_co_uk_food_recipes_frenchtoastwithcaram_84241", "title": "Tostada francesa con albaricoques caramelizados y brandy", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1-2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200 g / 7 oz harina 00, más extra para quitar el polvo", "2 huevos de gallinas camperas", "pizca de sal", "Brócoli Tenderstem de 200g / 7oz, cortado en florecillas", "2 cucharadas de aceite de oliva", "1 diente de ajo, finamente picado", "gran cantidad de espinacas", "50g / 1¾oz de gorgonzola, o un queso azul vegetariano similar (como dolcelatte)", "1 cucharada de menta fresca picada", "Nueces de 25g / 1oz, rotas en pedazos"], "method": ["Para la pasta, en un procesador de alimentos mezcle la harina, los huevos y una pizca de sal juntos hasta que la mezcla comience a mantenerse unida. Si la masa está demasiado seca agrega un poco de agua.", "Polvore una tabla de madera o limpie la superficie de trabajo con un poco de harina y amasar la mezcla hasta que se forme una masa. Envuelva la masa en una película adhesiva y colóquela en la nevera durante 30 minutos.", "Espolvoree la pasta con un poco de cuatro, luego gírela a través de una máquina de pasta hasta que tenga aproximadamente 2 mm de grosor (alrededor de la configuración número cinco en la máquina de pasta). Alternativamente, extienda la masa con un rodillo.", "Cortar la masa de pasta en rectángulos de aproximadamente 5x2.5cm / 2x1in. Pellizca los rectángulos en el medio para formar una forma de arco. (Esto se puede hacer hasta 24 horas antes de cocinar el plato).", "Espolvoree el brócoli en una cacerola con agua hirviendo y luego revuelva en un tazón con agua fría y escúrralo.", "Caliente una cucharada de aceite en una sartén y agregue el ajo. Después de un minuto agregue la espinaca y el brócoli. Rompa el queso en trozos pequeños y agregue a la espinaca.", "Mientras tanto, seca las nueces en una sartén por separado.", "Cocine la pasta en una olla de agua hirviendo durante dos minutos. Escurrir bien", "Agregue la pasta drenada a la espinaca, revuelva a través de la menta y cubra con las nueces."], "url": "www_bbc_co_uk_food_recipes_fresh_farfalle_with_55621", "title": "Farfalle fresco con espinacas, gorgonzola y nueces", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fresh_farfalle_with_55621_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["35 g / 1½ oz de avena", "Harina integral de 35g / 1½oz", "25 g / 1 oz de azúcar en polvo", "25g / 1oz de mantequilla, más extra para engrasar", "80 g / 3¼ oz de arándanos u otras bayas o frutas suaves, trituradas"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase una lata de pan con un poco de mantequilla.", "En un tazón, frote la avena, la harina, el azúcar y la mantequilla con las yemas de los dedos, hasta que la mezcla se desmenuce.", "Vierte la mitad de la mezcla en el molde de pan preparado y aplástala en una capa uniforme con una espátula. Extiende los puré de arándanos en la parte superior.", "Con una cuchara, vierta la mezcla que queda sobre los arándanos, luego presione hacia abajo para aplanar para formar una capa uniforme.", "Transfiera el flapjack al horno y hornee durante 18-20 minutos, o hasta que se doren. Poner a un lado para enfriar completamente, luego cortar en rodajas y quitar de la lata."], "url": "www_bbc_co_uk_food_recipes_fresh_fruit_flapjacks_38970", "title": "Flapjacks de frutas frescas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Rinde 4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["225g / 8oz de arándanos frescos", "150 g / 5½ oz de azúcar en polvo", "1 naranja pequeña y delgada, cortada en cuartos, sin pepitas", "½ cucharadita de especias mixtas", "pizca de nuez moscada recién rallada"], "method": ["Mezcle todos los ingredientes de salsa de arándano en un procesador de alimentos hasta que quede suave.", "O servir frío o calentar suavemente. Sirve con pavo asado o fiambres sobrantes."], "url": "www_bbc_co_uk_food_recipes_fresh_cranberry_sauce_88244", "title": "Salsa de arándano crudo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 8-10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fresh_cranberry_sauce_88244_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 rebanada gruesa de pan blanco crujiente", "1 huevo de gallinas camperas, golpeado", "25g / 1oz de mantequilla", "2 cucharadas de azúcar glas", "1 naranja, pelado y rebanado", "cariño, para lloviznar", "hojas de menta fresca, para adornar", "crema doble, ligeramente azotada, para servir"], "method": ["Sumerja el pan en el huevo batido y cubra bien todo. Derrita la mantequilla en una sartén, agregue el pan eggy y fría por 1-2 minutos en ambos lados, o hasta que esté ligeramente dorado por todos lados.", "Espolvorea la mitad del azúcar glas sobre un lado y voltea para freír durante 1 o 2 minutos más o hasta que se dore. Espolvorea sobre el resto del azúcar glas y voltea la tostada otra vez y freír durante 1-2 minutos, o hasta que la tostada esté dorada por todas partes.", "Coloque la tostada francesa en un plato para servir, cubra con las rodajas de naranja, rocíe sobre la miel y adorne con las hojas de menta. Servir con una cucharada grande de crema doble en el lateral."], "url": "www_bbc_co_uk_food_recipes_frenchtoastwithhoney_89138", "title": "Tostadas francesas con miel, crema y menta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 pomelo rosado", "1 naranja", "1 granada", "1 plátano", "racimo pequeño uvas blancas", "racimo pequeño uvas negras", "1 kiwi", "1 pera", "1 manzana", "ramita de menta, para decorar (opcional)", "jugo de cítricos (desde arriba)", "1 lima", "100g / 3½ oz de azúcar", "1 tallo de limoncillo, cortado por la mitad", "1 pedazo de jengibre, en rodajas finas"], "method": ["Para la ensalada de fruta, segmente la toronja y la naranja, atrapando los jugos en un tazón. Exprima más jugo de los cítricos restantes en el tazón. Ponga a un lado los segmentos de naranja y pomelo.", "Para el jarabe, mida el jugo y agregue agua para hacer 100 ml / 3½ fl oz.", "Pele una gran tira de cáscara de limón de la lima, evitando cualquiera de la médula blanca. Reserve el resto de lima.", "Combine la mezcla de jugo / agua cítrica y el azúcar en una olla pequeña. Caliente hasta que el azúcar se haya disuelto, revolviendo una o dos veces. Agregue el lemongrass, la ralladura de lima y el jengibre y luego hierva. Inmediatamente reduzca el fuego a fuego lento.", "Cocine a fuego lento durante 10 minutos. Apague el fuego y deje enfriar el almíbar.", "Para la ensalada de frutas, retire las semillas de la granada y corte el plátano.", "Pele otra rebanada de cáscara de la lima con un pelador de verduras, evitando cualquier parte blanca. Rebana muy finamente y reserva esto para la decoración. Aparte la lima restante ya que necesitarás el jugo.", "Corte las uvas a la mitad y corte el kiwi.", "Finalmente pica la pera y la manzana, vertiendo un poco de jugo de lima sobre la manzana para conservar su color.", "Combine toda la fruta en un tazón grande o en platos individuales o vasos de Martini. Vierta sobre el jarabe, al gusto. Es posible que no necesite usar todo el jarabe, cualquier jarabe restante puede usarse en cócteles o agregarse como edulcorante al té de hierbas. Decorar con tiras de lima y una ramita de menta."], "url": "www_bbc_co_uk_food_recipes_fresh_fruit_salad_61942", "title": "Ensalada de fruta fresca", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 4--6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fresh_fruit_salad_61942_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina blanca fuerte de 250g / 9oz, tamizada", "40 g / 1½ oz de azúcar en polvo", "1 x 7 g bolsita de levadura de acción rápida", "1 cucharadita de sal", "1 huevo de gallinas camperas, ligeramente golpeado", "150ml / 5fl oz de leche, calentada a unos 38C", "50 g / 1¾oz de mantequilla sin sal, derretida y enfriada ligeramente", "aceite vegetal, para freír", "50 g / 1¾oz de azúcar de vainilla o azúcar en polvo", "Atasco de 350 g / 12 oz, sabor que elijas"], "method": ["Coloque la harina en un bol, con el azúcar y la levadura en un lado y la sal en el otro. Mezcle para combinar.", "Coloque el huevo, la leche tibia y la mantequilla en una jarra y mezcle bien. Haga un pozo en el centro de los ingredientes secos y vierta el líquido. Mezcle con una cuchara, luego tráigala con sus manos en una masa suave.", "Engrase ligeramente una superficie de trabajo limpia con aceite vegetal y amasar la masa durante 10 minutos. La masa está lista cuando es lisa, brillante y elástica.", "Engrase el interior de un tazón grande con un poco de aceite, coloque la masa y cubra con una película adhesiva. Déjelo en un lugar cálido para duplicar su tamaño. Esto puede demorar aproximadamente una hora, a veces más, a veces menos, realmente depende de la calidez de la habitación.", "Una vez duplicado en tamaño, amasar la masa durante un minuto para eliminar el aire. Divida en 12 piezas iguales y forme bolas. Coloque en una bandeja para hornear engrasada y cubra con una pieza de película adhesiva engrasada. Déjalo durante 30 minutos a 1 hora hasta que la masa duplique su tamaño y salte cuando presionas con el dedo.", "Llene una freidora con grasa o una sartén grande, profunda y de fondo grueso con aceite dos tercios lleno. Caliente a 190 ° C: un cubo de pan se pondrá marrón en un minuto cuando lo deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Freír las rosquillas por lotes, cocinar por 3 minutos en cada lado, moviéndolos en el aceite. Escurra brevemente sobre papel de cocina, luego tírelos con el azúcar de vainilla. Usa un cuchillo para hacer un corte pequeño a través del costado y muevelo para hacer un agujero en el centro. Cuidadosamente canalice en el atasco, teniendo cuidado de no llenar en exceso. Delicioso."], "url": "www_bbc_co_uk_food_recipes_fresh_jam_doughnuts_72122", "title": "Rosquillas recién hechas", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Rinde 12 rosquillas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500g / 1lb 2oz de harina de pan blanco fuerte, más extra para espolvorear", "10g / ¼ de sal fina", "7g bolsita instantánea de levadura", "2 cucharadas de aceite de oliva, más extra para engrasar y lloviznar", "350ml / 12fl oz de agua tibia", "2 cucharaditas de romero fresco picado, más extra para terminar", "2 cucharaditas de tomillo fresco picado", "2 cucharaditas de salvia fresca picada", "sémola fina, para quitar el polvo", "½ cucharadita de orégano seco", "copos de sal marina, triturados, para terminar"], "method": ["Engrase un recipiente grande de plástico con un poco de aceite de oliva. Alinee dos bandejas de hornear grandes con papel de hornear o pergamino de silicona.", "Ponga la harina, la sal y la levadura en el cuenco de una batidora eléctrica independiente equipada con un gancho de masa. (No coloque la sal directamente encima de la levadura). Agregue el aceite de oliva y tres cuartas partes del agua. Comience a mezclar a baja velocidad. A medida que la masa comienza a unirse, agregue el agua restante muy lentamente, luego mezcle por otros 8 minutos a velocidad media. Agregue el romero, la salvia y el tomillo y mezcle por un minuto hasta que las hierbas se distribuyan uniformemente en la masa. Cuando esté listo, la masa será muy elástica y podrá estirarla lejos del tazón.", "Incline la masa en el recipiente engrasado. Cúbralo y déjelo levantarse hasta que al menos duplique su tamaño, aproximadamente una hora. La masa debe ser hinchable y brillante.", "Mezcle cantidades iguales de harina blanca y sémola juntas y use para quitar el polvo de la superficie de trabajo. Cuidadosamente inclina la masa. Será bastante suelto y fluido, pero no te preocupes. Divide la masa por la mitad.", "Levante cada pedazo de masa en las bandejas preparadas para hornear y extiéndalo en óvalos planos. Usando un cortador de pizza haga dos cortes en una línea en el medio de los óvalos con un espacio entre ellos, deteniéndose a 2 cm por cada extremo. Luego haga 12 cortes diagonales en la masa, 6 a cada lado de los cortes centrales, formando un diseño de hoja, luego estire la masa ligeramente para enfatizar los agujeros.", "Coloque las bandejas para hornear dentro de bolsas de plástico grandes y déjelas en un lugar cálido durante 20 minutos. Precalentar el horno a 220C / 200C Fan / Gas 7.", "Rocíe un poco de aceite de oliva sobre la parte superior de los panes con una botella de spray de agua, o simplemente rocíe sobre el aceite. Espolvorea sobre el orégano y hornea por 15-20 minutos, o hasta que la fougasse suene hueca cuando se golpea en la base. Retire del horno y mientras aún esté caliente, cepille con más aceite de oliva y espolvoree con sal marina."], "url": "www_bbc_co_uk_food_recipes_fresh_herb_fougasse_70351", "title": "Hierba fresca fougasse", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Hace 2 panes grandes", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fresh_herb_fougasse_70351_16x9.jpg", "isVegetarian": true, "recommendations": 0}]