[{"ingredients": ["1 cucharada de aceite de oliva", "25g / 1oz de mantequilla", "1 cebolla, finamente rebanada", "Zanahorias de 400g / 14oz, más o menos picadas", "1 cucharada de cilantro molido", "500ml / 18fl oz de caldo de verduras", "2 cucharadas de hojas de cilantro toscamente picadas", "sal y pimienta negra recién molida", "aceite vegetal, para freír", "50g / 1¾oz de mantequilla, cortada en cubitos", "Harina simple de 75g / 2¾oz", "½ cucharadita de pimienta de cayena", "2 huevos de gallinas camperas", "75g / 2¾oz de carne de cangrejo blanca", "30g / 1oz de carne de cangrejo marrón", "llovizna de aceite de oliva", "2 cucharadas de cilantro bebé"], "method": ["Para la sopa, caliente el aceite de oliva y la mantequilla en una olla grande con tapa. Agregue la cebolla, tape y fría por 3-4 minutos. Agregue las zanahorias y el cilantro molido y fría a fuego lento durante 2-3 minutos más.", "Añadir el caldo y hervirlo. Reduzca a fuego lento y cocine durante 5 minutos, o hasta que las zanahorias estén tiernas. Agregue el cilantro picado y luego ponga la sopa en una licuadora y pulse hasta que quede suave. Condimentar con sal y pimienta.", "Caliente el aceite en una freidora a 180 ° C. Alternativamente, caliente el aceite en una sartén profunda y de base pesada hasta que la miga de pan chisporrotee y se ponga marrón cuando la deje caer en ella.", "Caliente la mantequilla y 125ml / 4fl de agua en una olla hasta que hierva, luego hierva durante 1 minuto. Retire la sartén del fuego y bata en la harina y la pimienta de cayena con una cuchara de madera hasta que quede suave, o hasta que la mezcla se desprenda del costado de la sartén. Regrese la sartén al fuego y cocine por 1-2 minutos, revolviendo continuamente.", "Retire la sartén del fuego y bata en los huevos, uno a la vez, batiendo bien antes de agregar el segundo huevo.", "Agregue la carne de cangrejo blanca y marrón y mezcle hasta que esté bien combinada, luego sazone con sal y pimienta.", "Coloque la mezcla en una bolsa para tubos con una boquilla grande y lisa. Con cuidado, canalice secciones largas de 1½ cm / ½ en el aceite caliente y fría durante 1-2 minutos o hasta que estén doradas y crujientes. Retire los beignets de la sartén con una espumadera, escurra sobre papel de cocina y sazone con sal.", "Para servir, poner la sopa en cuencos, esparcir sobre algunos beignets de cangrejo. Rocíe con aceite de oliva y decore con el cilantro bebé."], "url": "www_bbc_co_uk_food_recipes_carrot_and_coriander_40102", "title": "Sopa de zanahoria y cilantro con beignets de cangrejo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filetes de solomillo de 4 x 7oz", "8 rebanadas de panceta o tocino rayado", "8 ostras, agua reservada", "mantequilla para freír", "300 ml / ½ pinta / 1¼ tazas de aceite de oliva", "Papas nuevas de 400g / 13oz frotadas y cortadas en trozos de 1in / 2.5cm", "Tomates de 200g / 7oz cortados en trozos de 2cm / ¾in", "200g / 7oz cebollas pequeñas, partidas a la mitad de arriba a abajo", "2 dientes de ajo, finamente picados", "2 ramitas de tomillo", "2 ramitas de salvia", "sal marina", "pimienta negra recién molida", "60g / 2oz / ½ taza de aceitunas negras sin hueso", "60 g / 2 oz de perejil de hoja plana, tallos eliminados"], "method": ["Corta los filetes para hacer una bolsa, rellena con un par de ostras mojadas y luego envuelve dos trozos de panceta o tocino rayado.", "Caliente 50 g / 1¾ oz de mantequilla en una sartén pesada, a fuego medio y ponga los filetes.", "Para medio raro, cocine por aproximadamente 3 minutos en cada lado, luego retírelo de la sartén.", "Saque la olla del fuego, vierta el agua de ostra reservada y raspe cualquier trozo desde el fondo hasta la superficie.", "Finalmente, vierta el líquido resultante sobre los filetes.", "Para hacer que las papas precalienten el horno a 190C / 375F / Gas 5.", "Caliente el aceite de oliva en una cacerola pesada a fuego medio.", "Agregue las papas, los tomates, las cebollas, los dientes de ajo, el tomillo y la salvia y deje que hierva.", "Sazonar bien y cocinar a fuego lento durante 8-10 minutos, luego cubrir y cocinar en el horno durante media hora, o hasta que las papas estén cocidas (no revuelva ya que esto romperá las verduras).", "Deje que se enfríe un poco, luego agregue las aceitunas y el perejil. Finalmente, sirva con los filetes de mochila."], "url": "www_bbc_co_uk_food_recipes_carpetbagsteakwithpo_70663", "title": "Filete de moqueta con patatas y aceitunas negras", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharadita de semillas de comino", "1 cucharadita de semillas de cilantro", "2 x 400 g / 14 oz latas de garbanzos, escurridos", "sal y pimienta negra recién molida", "1½ cucharadita de polvo de hornear", "1 cucharada de harina normal", "Zanahoria 100g / 3½ oz, finamente rallada (humedad exprimida)", "1 chile rojo, finamente picado", "1 cucharada de cilantro fresco picado", "1 diente de ajo, aplastado", "2 cucharadas de perejil fresco picado", "1 limón, ralladura solamente", "aceite vegetal, para freír", "semillas de sésamo, para adornar", "100ml / 3½fl oz de yogur griego", "1 cucharada de cilantro fresco picado", "1 cucharada de menta fresca picada", "1 lima, solo jugo", "1 cucharada de tahini", "pan tostado de pitta"], "method": ["Para los falafels, tuesta las semillas de comino y cilantro en una sartén seca durante 1-2 minutos, o hasta que estén fragantes. Moler las semillas en un almirez y mortero.", "Mezcle las especias tostadas con los ingredientes restantes del falafel en el procesador de alimentos hasta que estén bien combinados.", "Forme cucharadas de la mezcla de falafel en bolas y reserve en un plato.", "Mientras tanto, caliente 1cm / ½ en aceite vegetal en una sartén y fría los falafels durante 1-2 minutos en cada lado. Retire el falafel de la sartén con una espumadera y déjelo a un lado para escurrirlo sobre papel de cocina. Espolvorea con las semillas de sésamo.", "Para la salsa de yogur, mezcle el yogur griego, el cilantro, la menta, la lima y el tahini en un procesador de alimentos hasta que quede suave.", "Sirva los falafels con pan de pitta tostado y el aderezo de yogur al lado."], "url": "www_bbc_co_uk_food_recipes_carrot_and_coriander_72724", "title": "Falafel de zanahoria y cilantro", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 24", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/carrot_and_coriander_72724_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 huevo de gallinas camperas", "¼ de calabacín (aproximadamente 20 g / ¾oz), recortado, rallado", "¼ zanahoria (aproximadamente 20 g / ¾oz), pelada, rallada", "1 pasas de uva apiladas", "2 cucharadas de leche", "1 cucharada de aceite de girasol", "Harina normal de 75g / 3oz", "15g / ½ oz de azúcar moreno suave", "1 cucharadita de polvo de hornear"], "method": ["Precaliente el horno a 220C / 450F / Gas 7. Forre una bandeja de mini muffins de nueve hoyos con fundas de muffin.", "Batir el huevo en un tazón, luego incorporar el calabacín rallado, la zanahoria rallada, las pasas, la leche y el aceite de girasol.", "En un recipiente aparte, mezcle la harina, el azúcar y el polvo de hornear.", "Revuelva gradualmente la mezcla húmeda en la mezcla seca hasta que esté pegajosa y bien combinada.", "Divida la mezcla de pastel entre las cajas de muffins en la bandeja del muffin. Hornee en el horno durante 12-15 minutos, o hasta que un pincho insertado en el centro de los muffins salga limpio. Retire cada panecillo de la bandeja y déjelo a un lado para que se enfríe en una rejilla de alambre."], "url": "www_bbc_co_uk_food_recipes_carrot_and_courgette_63594", "title": "Magdalenas de zanahoria y calabacín", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Rinde 9", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/carrot_and_courgette_63594_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["9 zanahorias medianas, peladas, ralladas gruesas", "2 cucharaditas de copos de sal marina", "125 g / 4½ oz de pistachos pelados, más o menos picados", "1 cucharadita de canela molida", "½ naranja, jugo y ralladura", "½ limón, jugo y ralladura", "3 cucharadas de almendras molidas", "Anís de 3 estrellas", "150g / 5oz de miel clara", "250 g / 9 oz de azúcar en polvo", "150g / 5oz de mantequilla sin sal, derretida", "500g / 1lb 2oz de pasta filo lista para usar"], "method": ["Reúna la zanahoria rallada en una toalla de té limpia, espolvoree con sal y déjela a un lado durante al menos una hora, o idealmente durante la noche, para que la sal pueda absorber la humedad de las zanahorias.", "Exprima las zanahorias en la toalla de té para eliminar el exceso de humedad, luego transfiera la zanahoria a un tazón y mezcle los pistachos, canela molida, naranja y ralladura de limón y almendras molidas hasta que estén bien combinados. Dejar de lado.", "Caliente el anís estrellado, la miel y el azúcar en una cacerola de base pesada hasta que el azúcar se disuelva y la mezcla esté a punto de hervir.", "Agregue los jugos de limón y naranja, y 200 ml / 7 fl oz de agua, revuelva bien, luego retire la sartén del fuego y déjela enfriar por completo.", "Cuele el jarabe enfriado a través de un tamiz fino en un recipiente, luego cubra y enfríe en el refrigerador hasta que lo necesite.", "Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Engrase el interior de la bandeja de horno con un poco de la mantequilla derretida. Trabajando rápidamente, cepille cada hoja de masa de filo con mantequilla derretida. Disponga un tercio de las hojas de filo en capas en el fondo de la bandeja de horno.", "Extienda la mitad de la mezcla de zanahoria en una capa uniforme sobre la masa de filo. Coloque la mitad de las hojas de filo con mantequilla restantes sobre la mezcla de zanahoria.", "Repita el proceso con la mezcla de zanahoria restante y cubra con las hojas restantes de pasta filo untada con mantequilla. Recorte los bordes del bloque de repostería con un cuchillo afilado.", "Corte el baklava en forma de rombos del mismo tamaño, aproximadamente 5 cm / 2 pulgadas de ancho, luego transfiera la lata de hornear al horno y hornee el baklava durante 35-40 minutos, o hasta que la masa esté crujiente, hinchada y dorada.", "Retire el baklava del horno y vierta más de la mitad del jarabe frío. Déjelo a un lado durante 5 minutos para remojar, luego vierta sobre el resto del jarabe. Déjelo enfriar un poco, luego sirva."], "url": "www_bbc_co_uk_food_recipes_carrot_and_pistachio_18331", "title": "Baklava de zanahoria y pistacho", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Sirve 8-10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharadita de aceite de colza", "1 cebolla pequeña (75 g / 2½ oz de peso pelado), finamente picada", "1 diente de ajo, finamente picado", "20 g / oz de raíz de jengibre fresco, pelado y finamente picado", "200 g / 7 oz de zanahorias, aproximadamente picadas", "300ml / 10fl oz de caldo de verduras", "pimienta negra recién molida", "1 cebolla tierna, finamente picada, para servir"], "method": ["Caliente el aceite en una cacerola pequeña a fuego medio. Agregue la cebolla y cocine por 2-3 minutos. Agregue el ajo, el jengibre y las zanahorias y cocine durante 5 minutos, revolviendo ocasionalmente.", "Agregue el caldo y sazone con pimienta al gusto. Llevar a ebullición, luego reduzca el fuego, cubra y cocine a fuego lento durante 20 minutos, o hasta que las zanahorias estén suaves.", "Vierta la sopa en un procesador de alimentos y mezcle hasta que quede suave. Regrese a la sartén y vuelva a calentar suavemente.", "Para servir, vierta la sopa en un recipiente caliente y decore con las cebolletas."], "url": "www_bbc_co_uk_food_recipes_carrot_and_ginger_soup_64093", "title": "Sopa de zanahoria y jengibre", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/carrot_and_ginger_soup_64093_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["6 zanahorias medianas, peladas, ralladas (ver consejo)", "1 limón pequeño, solo jugo", "4 cucharadas de aceite de oliva", "1 cucharadita de azúcar en polvo", "1 cucharadita de semillas de amapola"], "method": ["Coloque todos los ingredientes en un bol, sazone con sal y pimienta y mezcle bien."], "url": "www_bbc_co_uk_food_recipes_carrot_and_poppyseed_72665", "title": "Ensalada de zanahoria y poppyseed", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/carrot_and_poppyseed_72665_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina de auto crianza de 200g / 7oz", "75g / 3oz sultanas", "Pacanas de 75g / 3oz, rotas en pedazos ásperos", "½ naranja grande, solo ralladura", "1 cucharadita de canela molida", "½ nuez moscada entera, finamente rallada", "1 cucharadita de polvo de hornear", "½ cucharadita de bicarbonato de soda", "pizca de sal marina fina", "3 huevos de gallinas camperas", "175ml / 6fl oz de aceite de girasol, más extra para engrasar", "175g / 6oz azúcar moreno claro y suave", "200 g / 7 oz de zanahorias, ralladas", "100g / 3½oz de azúcar glasé", "100g / 3½oz de mantequilla sin sal, ablandada", "1 cucharadita de jugo de naranja fresco", "200g / 7oz de queso crema con toda su grasa", "½ naranja, solo ralladura", "Nueces de pacana 25g / 1oz, rotas aproximadamente"], "method": ["Precaliente el horno a 180 ° C / 160 ° C (ventilador) / Gas 4. Engrase y forme una lata cuadrada de 20 cm / 8 pulg. De fondo suelto.", "Coloque la harina, pasas, nueces, ralladura de naranja, canela, nuez moscada rallada, polvo de hornear, bicarbonato de soda y sal en un tazón grande y mezcle hasta que estén bien combinados.", "Batir los huevos hasta que estén suaves. Agregue el aceite de girasol y el azúcar y bata hasta que estén bien combinados.", "Haga un pozo en el centro de la mezcla de harina y bata en la mezcla de huevo hasta que quede suave. Agregue las zanahorias. Vierta la mezcla en la lata de torta preparada y alise la superficie. Hornee en el centro del horno durante 35-40 minutos, hasta que el pastel esté bien levantado y se sienta elástico al tacto. (Pruebe el pastel insertando un pincho en el centro. Si el pincho sale limpio, el pastel está hecho).", "Retire la torta del horno y déjela enfriar en la lata durante cinco minutos. Retire la torta de la lata y déjela a un lado para que se enfríe en una rejilla de alambre.", "Para la formación de hielo, tamice el azúcar glas en un tazón grande y agregue la mantequilla y el jugo de naranja. Batir junto con una cuchara grande de madera hasta que quede ligero y cremoso. Agregue el queso crema y la ralladura de naranja y bata hasta que quede suave. Cubra y enfríe en la nevera durante 30 minutos o hasta que esté lo suficientemente firme como para extenderse.", "Extiende la guinda sobre el pastel y espolvorea con las pacanas. Cortar en cuadrados para servir."], "url": "www_bbc_co_uk_food_recipes_carrot_and_sultana_cake_49411", "title": "Tarta de zanahoria y sultana con glaseado de naranja cremoso", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/carrot_and_sultana_cake_49411_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 huevos de gallinas camperas", "200g / 7oz de azúcar moreno claro", "pizca de sal", "85g / 3oz de aceite vegetal, más extra para engrasar", "250 g / 9 oz de zanahorias, ralladas", "35 g / 1¼ oz de nueces picadas", "125g / 4½ oz de harina fuerte, tamizada", "½ cucharadita de polvo de hornear", "½ cucharadita de bicarbonato de soda", "1 cucharadita de canela molida", "200g / 7oz de queso crema", "100 g / 3½ oz de azúcar en polvo", "50 g / 1¾oz de pasta de pistacho (disponible en línea)", "algunas gotas de colorante de comida verde", "Mazapán 250 g / 9 oz", "algunas gotas de colorante de comida naranja", "algunas gotas de colorante de comida roja", "20 g / oz de cacao en polvo", "6 cucharadas de semillas de cacao"], "method": ["Precaliente el horno a 180C / 350F / Gas 4 y engrase seis moldes rectangulares desechables de 10x5cm / 4x2 en una lata de muffin de seis tazas.", "Para hacer la torta, mezcle los huevos, el azúcar, la sal y el aceite en un tazón grande. Agregue las zanahorias, las nueces, la harina, el polvo de hornear, el bicarbonato de soda y la canela y dóblelos para combinar.", "Coloque la masa en los moldes o muffin y hornee durante 25 minutos.", "Mientras tanto, haz el topping. En un recipiente, combine el queso crema, el azúcar y la pasta de pistacho. Agregue colorante de comida verde, revolviendo a través de una gota a la vez, hasta que obtenga un color verde claro uniforme. Dejar de lado hasta que esté listo para usar.", "Cuando estén cocidos, retire los pasteles del horno y déjelos a un lado para que se enfríen. Cuando esté completamente frío, extiende la cobertura sobre los pasteles.", "Para decorar, masajee el mazapán para suavizar. Reserve un tercio del mazapán. Amase el naranja y coloque un poco de comida roja en el mazapán restante hasta que tenga un color naranja brillante como el de la zanahoria. Molde en mini zanahorias. Amasar el colorante vegetal verde en el mazapán reservado, moldearlo en la parte superior de las zanahorias y adjuntarlas a las \"zanahorias\" de color naranja.", "Colóquelos sobre la torta y espolvoréelos con cacao en polvo.", "A lo largo de la parte superior de cada pastel, rocíe una hilera de semillas de cacao para que parezca tierra con las puntas verdes de las zanahorias sobresaliendo."], "url": "www_bbc_co_uk_food_recipes_carrot_and_walnut_cake_50535", "title": "Pastel de zanahoria y nuez", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 6 pasteles pequeños", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["140ml / 4¾fl oz de aceite vegetal, más extra para engrasar", "2 huevos de gallinas camperas", "200g / 7oz de azúcar moreno claro", "Zanahorias ralladas 300g / 10½oz, (peso rallado)", "100g / 3½oz de uva", "75g / 2½oz de nueces o nueces picadas (opcional)", "180g / 6oz de harina de auto crianza", "1 pizca de sal", "½ cucharadita de bicarbonato de soda", "1 cucharadita de canela molida", "½ cucharadita de nuez moscada recién rallada", "½ cucharadita de especias mixtas", "250 g / 9 oz de queso crema, refrigerado", "50g / 1¾oz de mantequilla, a temperatura ambiente", "1 cucharadita de extracto de vainilla", "275g / 9¾oz de azúcar glas, tamizado", "1 naranja, solo ralladura"], "method": ["Precaliente el horno a 150C / 300F / Gas 2. Engrase y forre una bandeja de 13 x 23 cm / 5 x 9 pulgadas con papel resistente a la grasa.", "Para el pastel de zanahoria, bata los huevos en un tazón grande, luego agregue el aceite, el azúcar morena, la zanahoria rallada, las pasas y las nueces picadas.", "Tamice el resto de los ingredientes secos y junte la mezcla con una cuchara de madera o de metal grande hasta que estén bien combinados.", "Vierta la mezcla en el molde de pan preparado, alise la superficie y hornee en el horno durante 1 hora 15 minutos, o hasta que un pincho insertado en el medio salga limpio.", "Retire del horno y deje que la torta se enfríe en la lata durante unos cinco minutos antes de retirarla. Enfríe completamente en una rejilla de alambre antes de servir.", "Para la formación de hielo, bata el queso crema y la mantequilla en un tazón hasta que estén bien combinados. Agregue el extracto de vainilla, el azúcar glas y la ralladura de naranja y mezcle hasta que la formación de hielo sea suave y espesa. Usando una espátula, extienda la formación de hielo sobre la torta enfriada, sumerja la cuchilla en un recipiente con agua caliente si la formación de hielo es difícil de extender. Cortar en rodajas para servir."], "url": "www_bbc_co_uk_food_recipes_carrot_cake_29800", "title": "Pastel de zanahoria", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Sirve 12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Cereal de salvado triturado de 75 g / 2½ oz", "225ml / 8 fl oz de leche", "1 naranja mediana, solo ralladura", "120g / 4oz de queso crema", "1 cucharada de azúcar en polvo", "3 zanahorias grandes, peladas", "125g / 4½oz de azúcar morena mascabado", "Harina de auto crianza de 200g / 7oz", "1 cucharadita de polvo de hornear", "1½ cucharadita de canela molida", "1 cucharadita de jengibre molido", "2 huevos de gallinas camperas", "4 cucharadas de aceite de girasol"], "method": ["Coloque el cereal de salvado y la leche en un tazón grande y revuelva para mezclar. Déjalo en remojo durante 15 minutos. Mientras tanto, precaliente el horno a 220C / 425F / Gas 7. Forre una bandeja para muffins de 12 agujeros con fundas de muffin de papel.", "Agregue la mitad de la ralladura al cereal y la leche y colóquela a un lado. En un tazón pequeño, agregue el queso crema y el azúcar impalpable a la ralladura restante y mezcle bien; este será su relleno.", "Usando el lado del orificio grueso de un rallador, ralla las zanahorias en una tabla. Pesar 150 g / 5½ oz de zanahoria rallada y agregar al tazón grande. (Guarde las zanahorias sobrantes para una ensalada).", "Por ahora, el cereal será muy blanda. Agregue el azúcar moreno y mezcle bien con una cuchara de madera. Tamice la harina, el polvo de hornear, la canela y el jengibre, pero no los mezcle por el momento.", "Rompa los huevos en otro recipiente y agregue el aceite. Batir con un tenedor hasta que las yemas de huevo se rompan y se mezclen con los blancos. Incline en el tazón grande y mezcle todo junto con la cuchara de madera.", "Con una cuchara de tamaño mediano, vierta una cucharada de la mezcla de zanahoria en cada caja de muffins de papel en la bandeja. Coloque una cucharada pequeña de queso crema en el centro.", "Cubra el relleno con el resto de la mezcla de zanahoria, dividiéndolo de manera uniforme entre las cajas. Coloque en el horno caliente y hornee por unos 20 minutos hasta que estén dorados. Comprueba que las magdalenas estén cocidas presionando suavemente el centro de un panecillo con el dedo; si se suelta hacia atrás, está listo.", "Retire la bandeja del horno y déjela durante cinco minutos, luego transfiera con cuidado las magdalenas a una rejilla para que se enfríen. Almacene en un recipiente hermético y coma dentro de las 24 horas."], "url": "www_bbc_co_uk_food_recipes_carrot_cake_muffins_57211", "title": "Muffins de zanahoria", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 12 muffins", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/carrot_cake_muffins_57211_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["40g / 1½ oz de avena avena o avena arrollada", "40 g / 1½ oz de zanahoria, finamente rallada", "½ manzana, finamente rallada", "pequeñas pasas", "½ cucharadita de especias mixtas", "1 cucharadita de azúcar moreno", "150ml / 5fl oz de leche o leche de soja"], "method": ["Coloque todos los ingredientes en un recipiente, revuelva, coloque la tapa y guárdelos en la nevera durante la noche."], "url": "www_bbc_co_uk_food_recipes_carrot_cake_overnight_28085", "title": "Pastel de zanahoria avena noche", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 0}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Jugo de zanahoria 500ml / 18fl oz", "gran pizca de sal marina", "1 cucharadita de comino molido", "6 zanahorias (idealmente Early Nantes), con piel, fregadas, cortadas a la mitad a lo largo y luego cortadas en 1cm / ½ en rodajas en ángulo", "2 cucharadas de aceite de colza", "80g / 2¾oz de cebolla blanca (alrededor de ½ cebolla mediana) picada", "2 chiles Pasilla Bajio, sin semillas y finamente picados", "150g / 5½oz de cebada perlada", "1 cucharadita de comino molido", "1 mazorca de maíz, cocida en agua hirviendo durante 20 minutos, cubierto", "4 hojas de acelgas arcoiris, enrolladas y picadas; tallos cortados en piezas de 3cm / 1¼in", "3 cebollas tiernas, en rodajas finas", "cilantro de racimo pequeño, picado", "½ limón, solo jugo", "sal y pimienta negra recién molida", "1½ cucharada de aceite de colza", "micro cilantro (opcional)"], "method": ["Para las zanahorias, en una cacerola grande a fuego medio, ponga a hervir el jugo de zanahoria y 100 ml / 3½ fl oz de agua, luego agregue la sal y el comino. Agregue las zanahorias y cocine a fuego lento durante 10 minutos o hasta que estén cocidas. Retire del fuego, retire las zanahorias y reserve el licor de cocción.", "Para la cebada, en una cacerola mediana tapada a fuego medio, caliente el aceite y fríe con cuidado las cebollas y los chiles durante 5 minutos, tapados con una tapa, hasta que se ablanden. Agregue la cebada y el comino y continúe freír durante un minuto. Agregue 500ml / 18fl oz del licor de cocina de zanahoria a la sartén. Llevar a fuego lento a fuego lento, luego cubrir con la tapa y cocinar durante 50-55 minutos, revolviendo de vez en cuando, hasta que la cebada se hinche y se firme con una buena mordida. Verifique la textura, el sabor y sazone con sal y pimienta. Cocine por unos minutos más, si es necesario. Dejar de lado en la sartén.", "Para terminar el risotto de cebada, con un cuchillo largo, corte con cuidado los granos de la mazorca de maíz pasando un cuchillo a lo largo del núcleo central. Mantenga 4 de las longitudes más grandes intactas para usar como guarnición. Ponlos a un lado y luego suelta los granos del resto. Agregue los tallos de acelga y las hojas, cebollas de primavera y granos de maíz sueltos a la bandeja de cebada y revuelva. Vuelva a colocar la sartén a fuego medio y cocine durante 12 minutos. Agregue el cilantro y cocine por un minuto más hasta que se marchite. Finalmente, pruebe y ajuste el condimento si es necesario, luego agregue el jugo de limón para agudizar el sabor.", "Para terminar, en una sartén a fuego medio, fría los trozos de zanahoria cocida en aceite de colza durante 6-7 minutos, hasta que estén caramelizados. Agregue las piezas reservadas de maíz en rodajas a la sartén y cocine durante 3 minutos, o hasta que comiencen a dorarse.", "Para servir, quite las zanahorias caramelizadas, agréguelas al risotto de cebada y divida el risotto en partes iguales entre cuatro platos. Termine con una rebanada de maíz rebanado y cilantro micro, si lo usa. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_carrot_cumin_and_barley_69308", "title": "Guiso de verano de zanahoria, comino y cebada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/carrot_cumin_and_barley_69308_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 zanahorias grandes, cortadas, cortadas en bastones largos y delgados (deben parecer papas fritas en tamaño y forma)", "sal al gusto", "50 g / 2 oz de almendras molidas", "30g / 1¼ oz de queso parmesano, rallado", "1/2 cucharadita de orégano seco", "pizca de cayena pequeña pizca", "1 huevo de gallinas camperas, golpeado"], "method": ["Precalentar el horno a 250C / 220C Fan / Gas 9.", "Sazonar los bastones de zanahoria con sal.", "En un tazón grande, mezcle las almendras molidas, el parmesano, el orégano y la pimienta de cayena hasta que estén bien combinados.", "Sumerja cada bastón en el huevo batido, luego drague en la mezcla de hierbas y especias hasta que esté uniformemente cubierto.", "Coloque las papas fritas de zanahoria en una sola capa en una bandeja para hornear. Hornee durante 10-12 minutos, volteándolo durante la cocción, hasta que esté tierno y dorado por todas partes. Servir caliente."], "url": "www_bbc_co_uk_food_recipes_carrot_parmesan_and_88443", "title": "Zanahoria, parmesano y papas fritas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/carrot_parmesan_and_88443_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 cucharadita de vinagre de vino blanco", "½ manzana, sin núcleo, cortado en tiras finas", "½ zanahoria pelada y cortada en tiras finas", "25 g / 1 oz de puerro, solo parte blanca, finamente rebanada", "25 g / 1 oz de hierbas mezcladas finamente picadas (perejil, cebollín, eneldo)", "sal y pimienta negra recién molida", "1 cucharada de queso cheddar, finamente picado"], "method": ["Coloque el aceite y el vinagre en un tazón grande y mezcle.", "Agregue la manzana, la zanahoria y el puerro y mezcle para cubrir el aderezo.", "Espolvorear sobre las hierbas mixtas y sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, colócalo en un plato y espolvorea sobre las piezas de queso cheddar."], "url": "www_bbc_co_uk_food_recipes_carrotandapplesalad_80267", "title": "Ensalada de zanahoria y manzana", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["275g / 9¾oz de azúcar en polvo", "200ml / 7fl oz de aceite de girasol", "4 huevos medianos de granja", "alrededor de 300g / 10½oz de zanahoria rallada, un poco más o menos está bien", "hasta 150 g / 5½ oz frutos secos o fruta seca (opcional)", "225g / 8oz de harina de espelta o integral", "2 cucharaditas de polvo de hornear", "1 cucharadita de canela molida", "1 cucharadita de especias mixtas", "1 cucharada de cacao en polvo", "125g / 4½oz de mantequilla sin sal, ablandada", "125g / 4½oz de queso crema con toda su grasa", "275g / 9¾oz de azúcar glasé", "decoraciones comestibles (como zanahorias de pasta de azúcar o huevos de Pascua mini-chocolate), para terminar"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4 y alinee los bolsillos de una bandeja de muffins con fundas de muffin.", "Batir el azúcar, el aceite y los huevos en un tazón para mezclar hasta que estén suaves, luego agregue la zanahoria rallada y, si lo desea, hasta 150 g / 5½ oz de nueces picadas, fruta seca o una mezcla de ambos.", "En un recipiente aparte, combine la harina, el polvo de hornear, las especias y el cacao para que estén uniformemente mezclados, luego incline esto en la mezcla de zanahoria y mezcle bien.", "Llene los papeles del panecillo hasta aproximadamente dos tercios llenos, luego hornee durante aproximadamente 25 minutos, o hasta que salga un pincho casi limpio.", "Para el glaseado, asegúrese de que la mantequilla esté suave, luego, con un batidor o batidora eléctrica, bata con el queso crema en un bol hasta que quede suave y liviano.", "Agregue el azúcar glas con una cuchara hasta que comience a juntarse, luego bata de nuevo brevemente hasta que esté suave y liviano. Manchas de tubo o cuchara del glaseado en cada cupcake frío. Decora con zanahorias de pasta de azúcar o, por ejemplo, para Pascua, con mini huevos de Pascua de chocolate."], "url": "www_bbc_co_uk_food_recipes_carrot_spelt_cupcakes_72408", "title": "Magdalenas de pastel de zanahoria con glaseado de queso crema", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace alrededor de 12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/carrot_spelt_cupcakes_72408_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["unas buenas zanahorias, aproximadamente 6, cortadas y lavadas", "3-4 cebollas de primavera, ambas partes verdes y blancas, en rodajas", "un buen puñado de cilantro fresco, toscamente picado, más extra para servir", "2 huevos grandes de gallinas camperas, golpeados", "1 cucharada o más de harina normal", "1 puñado de queso parmesano recién rallado (o queso vegetariano alternativo)", "algunos glugs crema doble", "sal y pimienta negra recién molida", "algunos buenos glugs aceite de oliva con sabor a fruta"], "method": ["Ralla las zanahorias en un procesador de alimentos, luego colócalas en un tazón grande con las cebolletas y todo el cilantro que desees.", "Agregue los huevos y la harina para unir todo, seguido por el queso parmesano (se derretirá y otra vez ayudará a sostener el buñuelo) y, para un toque de lujo, un poco de crema y mezcle bien, condimentar al gusto con sal y pimienta negra recién molida.", "Justo antes de freír, vale la pena apretar un poco de la mezcla en sus manos para asegurarse de que no se rompa al cocinar. Si crees que lo hará, solo agrega un poco más de huevo batido o harina, solo lo suficiente para unirlos.", "Caliente una sartén grande, agregue el aceite y forme la mezcla en buñuelos delgados, para que se cocinen rápidamente. Freír durante 4-6 minutos hasta que estén doradas por ambos lados. Recuerda la regla de oro de freír: no juegues demasiado con la comida, deja que los buñuelos formen una costra antes de voltearse. Servir inmediatamente esparcido con más cilantro."], "url": "www_bbc_co_uk_food_recipes_carrotandcorianderfr_92488", "title": "Buñuelos de zanahoria y cilantro", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "2-3", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/carrotandcorianderfr_92488_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite vegetal", "1 cebolla, en rodajas", "450 g / 1 libra de zanahorias, en rodajas", "1 cucharadita de cilantro molido", "1.2 litresl / 2 pintas de caldo de verduras", "cilantro fresco de manojo grande, toscamente picado", "sal y pimienta negra recién molida"], "method": ["Caliente el aceite en una sartén grande y agregue las cebollas y las zanahorias. Cocine por 3-4 minutos hasta que comience a ablandarse.", "Agregue el cilantro molido y sazone bien. Cocine por 1 minuto.", "Agregue el caldo de verduras y deje que hierva. Cocine a fuego lento hasta que las verduras estén tiernas.", "Whizz con una batidora de mano o en una licuadora hasta que quede suave. Vuelva a calentar en una sartén limpia, agregue el cilantro fresco y sirva."], "url": "www_bbc_co_uk_food_recipes_carrotandcorianderso_1919", "title": "Sopa de zanahoria y cilantro", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/carrotandcorianderso_1919_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["rociar aceite de oliva", "1 cebolla, finamente picada", "1 puerro, finamente picado", "6 zanahorias, finamente picadas", "568ml / 1 pinta de caldo de verduras", "¼ litro de leche semidesnatada", "puñado de hojas de cilantro fresco, picado", "sal y pimienta negra recién molida", "3 rollos crujientes, para servir"], "method": ["Caliente el aceite en una sartén grande a fuego medio. Agregue la cebolla y freír suavemente hasta que esté transparente y ablandada.", "Agregue el puerro y coloque una tapa en la sartén. Reduzca el fuego y cocine por 2-3 minutos, o hasta que el puerro se ablande.", "Agregue las zanahorias y el caldo. Aumente el calor para llevarlo a ebullición, luego reduzca el fuego a fuego lento durante 20 minutos.", "Agregue la leche y cocine a fuego lento por otros cinco minutos.", "Transfiera a un procesador de alimentos. Mezclar hasta que esté suave.", "Dejar enfriar un poco y agregar el cilantro picado y sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, vierta la sopa en tres tazones y sirva con un rollo crujiente al costado."], "url": "www_bbc_co_uk_food_recipes_carrotandcorianderso_81122", "title": "Sopa baja en grasa de zanahoria y cilantro", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 3", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 diente de ajo", "½ cebolla finamente picada", "100 g / 3½ oz de zanahorias picadas", "25g / 1oz de cilantro fresco, picado", "200 ml / 7 onzas de caldo de pollo caliente (los vegetarianos pueden sustituir el caldo de verduras)", "Crema doble 50ml / 2fl oz", "sal y pimienta negra recién molida", "hoja de cilantro fresco, para adornar"], "method": ["Caliente el aceite de oliva en una cacerola a fuego medio. Agregue el ajo y las cebollas y fría por 2-3 minutos, hasta que se ablanden.", "Agregue las zanahorias y el cilantro fresco y cocine por cinco minutos.", "Agregue el caldo y cocine a fuego lento durante cinco minutos.", "Agregue la crema, sazone al gusto con sal y pimienta negra recién molida y mezcle hasta que quede suave con una batidora de mano.", "Para servir, vierta en un tazón tibia y adornar con la hoja de cilantro fresco."], "url": "www_bbc_co_uk_food_recipes_carrotandcorianderso_83322", "title": "Sopa de zanahoria y cilantro", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]