[{"ingredients": ["2 cucharadas de hojas de Romero fresco picado", "½ cucharadita de granos de pimienta negra, agrietada", "Filete de pierna de cordero de 100 g / 3½ oz", "pizca de sal", "1 cucharada de aceite de oliva", "85 g / 3 oz de judías verdes, recortadas y blanqueadas", "¼ de cebolla, pelada, finamente rebanada", "½ limón, solo jugo", "2 cucharadas de aceite de oliva virgen extra", "55 g / 2 oz de queso feta, desmenuzado", "2 cucharadas de nueces de pistacho"], "method": ["Para el cordero a la brasa, caliente una sartén hasta que esté caliente. Frote el romero y la pimienta negra en ambos lados del filete de pierna de cordero, sazone con la sal y rocíe sobre el aceite de oliva.", "Cocine el cordero en la plancha a fuego medio durante 4-5 minutos por cada lado (para el medio), o hasta que se dore por todas partes y cocine a su gusto. Retire la carne de la sartén y déjela reposar en un plato caliente.", "Para la ensalada de frijoles verdes de feta, mezcle suavemente todos los ingredientes de la ensalada en un tazón.", "Para servir, vierta la ensalada de queso feta y frijoles verdes en un plato de servir y coloque el filete de pierna de cordero al costado."], "url": "www_bbc_co_uk_food_recipes_chargrilledlambsteak_92429", "title": "Filete de cordero a la brasa con romero y pimienta negra y una ensalada de frijoles y judías verdes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filete de cordero 200 g / 7 oz", "dash aceite de oliva", "sal y pimienta negra recién molida", "gran puñado de hojas frescas de cohetes", "55 g / 2 oz de queso feta, desmenuzado", "2 cucharadas de semillas de sésamo, tostadas en una sartén caliente", "2 dientes de ajo", "3-4 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "2 tomates frescos de vid, reducidos a la mitad", "dash aceite de oliva", "sal y pimienta negra recién molida", "1 cucharadita de hojas frescas de tomillo", "½ camote, pelado, finamente picado", "2 cucharadas de yogur al estilo griego", "1 cucharada de cilantro fresco picado", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 180 ° C / 360 ° F / Gas 4.", "Para el cordero a la brasa, frote el cordero con aceite de oliva y sazone bien con sal y pimienta negra recién molida. Coloque sobre la bandeja de la plancha caliente a la parrilla durante 2-3 minutos en ambos lados, o hasta que esté cocido a su gusto. Retirar del fuego y dejar reposar en un lugar cálido durante cinco minutos y luego cortar.", "Para el pesto de rúcula, coloque el cohete, el queso feta, el aceite de oliva, las semillas de sésamo, el ajo, la sal y la pimienta negra recién molida en un procesador de alimentos y mezcle hasta que quede suave.", "Para los tomates tostados, coloque los tomates partidos en una bandeja para hornear, rocíe con aceite de oliva y sazone con sal y pimienta negra recién molida. Espolvorear con las hojas de tomillo y colocar en el horno para asar durante 10-12 minutos.", "Para las batatas trituradas, coloque los cubos de batata en una olla pequeña de agua hirviendo con sal y hierva durante cinco minutos, o hasta que estén tiernos. Escurrir y dejar secar al vapor.", "Agregue el yogur y el cilantro y aplaste las papas con un tenedor. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, cuchara la batata triturada en un plato de servir y cubra con las rodajas de cordero. Coloque los tomates tostados al costado y rocíe sobre el pesto de rúcula."], "url": "www_bbc_co_uk_food_recipes_chargrilledlambwitha_88296", "title": "Cordero a la brasa con pesto de rúcula, tomates asados ​​y boniato triturado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["150g / 5¼ oz de calabaza (sección base)", "2 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "50 g / 1¾oz de mantequilla sin sal", "1 cucharada de curry en polvo", "1 diente de ajo, en rodajas", "25 g / 1oz de mantequilla sin sal", "Col 200g / 7oz, rallado", "150 g / 5¾oz de cordero (filete de pierna)"], "method": ["Para hacer curry de calabaza, precalentar el horno a 200C / 400F / Gas 6.", "Dejando la piel puesta, retire las semillas de la calabaza y córtelas en rodajas. Mezcle el aceite de oliva y sazone bien.", "Calentar una sartén de plancha. Coloque las cuñas de calabaza en la plancha, cocinando de cuatro a cinco minutos, girándolas para crear marcas de parrilla.", "Coloque el butternut en una bandeja para hornear. Espolvoree el polvo de curry y distribuya la mantequilla sin sal en pequeños botones. Coloque en el horno y hornee durante diez minutos.", "Para hacer el repollo, caliente una sartén mediana, derrita la mantequilla y agregue el ajo rebanado. Cocine por un minuto.", "Agregue el repollo rallado y cocine por diez minutos, permitiendo que se marchite.", "Para cocinar el filete de cordero, ponga la sartén a fuego alto. Sazonar el filete de cordero por ambos lados, colocar en la sartén y cocinar por un minuto y medio en cada lado o hasta que esté cocido a su gusto.", "Para servir, coloque una base de repollo en un plato caliente. Coloque el curry de butternut encima y sirva los filetes de cordero al costado."], "url": "www_bbc_co_uk_food_recipes_chargrilledlambwithc_77969", "title": "Cordero a la brasa con calabaza al curry y repollo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Mitades de durazno de estaño 400g / 14oz, drenado y secado", "1 cucharada de aceite de oliva", "3 yemas de huevo de gallinas camperas", "1 cucharada de azúcar en polvo", "1 cucharada de vino blanco", "6-8 hojas frescas de albahaca, ralladas"], "method": ["Precalentar la parrilla a su configuración más alta. Caliente una sartén hasta que fume.", "Rocíe los melocotones con el aceite de oliva y coloque el lado del corte hacia abajo en una sartén caliente y déjelos asar durante 2-3 minutos, o hasta que estén dorados. Transfiera a platos para servir y reserve en un lugar cálido.", "Para el sabayon, coloque las yemas de huevo, el azúcar y el vino en un recipiente colocado sobre una olla de agua hirviendo a fuego lento. Batir vigorosamente y constantemente hasta que la mezcla se vuelva espesa y espumosa.", "Agregue la albahaca fresca y doble a través de la mezcla.", "Coloque los melocotones en una bandeja para hornear. Ponga el sabayón sobre los melocotones y colóquelo debajo de la parrilla para que se cocine durante tres minutos, o hasta que esté dorado.", "Coloque los melocotones en un plato y sirva."], "url": "www_bbc_co_uk_food_recipes_chargrilledpeacheswi_84530", "title": "Melocotones a la parrilla con sabayón de albahaca fresca", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 puerros, cortados", "12 cebollas de primavera", "250g / 9 oz de queso halloumi, cortado en rodajas", "1 cucharada de alcaparras, enjuagadas, escurridas y picadas", "20g / ¾oz de tomates secados al sol, toscamente picados", "4 cucharadas de aceite de oliva virgen extra", "1 cucharada de vinagre de vino blanco", "½ limón, solo jugo", "2 lechugas Baby Little Gem, cortadas en cuñas", "Cohete de 75g / 3oz", "1 cebolla, cortada en cuartos", "1 zanahoria, cortada en trozos", "2 ramitas de tomillo fresco", "2 ramitas de perejil fresco de hoja plana", "4 pechugas de pollo, deshuesadas y sin piel", "100g / 4oz de arroz basmati", "2 cucharadas de té de jazmín", "2 cucharadas de azúcar demerara", "aceite, para engrasar"], "method": ["Para la ensalada, caliente una olla de agua hasta que hierva, luego coloque un vaporizador encima. Coloque los puerros y las cebolletas en el vaporizador, cubra con una tapa y deje hervir durante 2-3 minutos, hasta que estén tiernos.", "Mientras tanto, caliente una sartén hasta que esté caliente y cocine el halloumi por un minuto en cada lado, o hasta que esté chamuscado. Retire de la plancha y reserve. Rebana los puerros y cebollines hasta que queden carbonizados por todos lados, luego aparta.", "Coloque las alcaparras y los tomates secados al sol en un bol, agregue el aceite de oliva, el vinagre y el jugo de limón y mezcle bien.", "Corte los vegetales carbonizados y el queso en trozos y colóquelos en un tazón grande. Agregue la lechuga y el cohete, vierta sobre el aderezo y revuelva para cubrir.", "Para el pollo, llena una olla grande con agua y agrega la cebolla, la zanahoria, el tomillo y el perejil. Traiga a fuego lento, luego agregue el pollo. Regrese a fuego lento y cocine por 6-8 minutos, o más para las pechugas de pollo más grandes. Retire del agua y seque con papel de cocina.", "Coloque un pedazo de papel de aluminio en el fondo de un wok, cubra con el arroz crudo, el té y el azúcar y cubra con una tapa. Coloque en el fuego durante 3-4 minutos, hasta que el té comience a fumar. (NB: fumar té genera mucho humo. Asegúrese de abrir las ventanas y obtener la mayor ventilación posible).", "Coloque el pollo escalfado en un pedazo de papel aceitado en un vaporizador, luego coloque el vaporizador dentro del wok. Coloque una tapa sobre el vaporizador y caliéntelo por 2-3 minutos, o hasta que el pollo esté ligeramente ahumado y completamente cocido.", "Para servir, divida la ensalada entre cuatro platos para servir. Cortar el pollo en rodajas y colocar encima de la ensalada en cada plato."], "url": "www_bbc_co_uk_food_recipes_chargrilledleeksprin_86959", "title": "Puerro a la parrilla, cebolleta y ensalada halloumi con pollo ahumado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 melocotones, cortados a la mitad, piedras quitadas", "2 cucharadas de aceite de oliva", "1 cucharada de mantequilla", "3 cucharadas de piñones", "1 cucharada de azúcar morena suave", "3 cucharadas de yogur griego", "2 cucharadas de miel", "1 ramita de menta fresca"], "method": ["Caliente una sartén hasta que esté caliente. Rocíe el lado cortado de los melocotones con el aceite de oliva y fría en la sartén caliente durante 5-6 minutos, o hasta que los melocotones tengan marcas de parrilla en la parte inferior.", "Derrita la mantequilla en una sartén pequeña agregue los piñones y el azúcar y revuelva hasta que el azúcar se derrita y esté burbujeante y dorado. Vierta sobre una silicona o una hoja antiadherente similar y deje que se enfríe por completo. Cuando se enfríe, divida en pequeños pedazos con los dedos.", "Para servir, coloque los melocotones en un plato y cuchara sobre el yogur. Rocíe la miel, espolvoree los piñones glaseados y adorne con la ramita de menta."], "url": "www_bbc_co_uk_food_recipes_chargrilledpeacheswi_92427", "title": "Melocotones a la parrilla con miel, yogur y piñones glaseados con azúcar", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50g / 1¾oz de queso azul", "2 cucharadas de leche", "1 cucharada de aceite de oliva", "1 melocotón, cortado en cuñas", "2 puñados de cohete fresco", "1 cucharada de cebolletas frescas picadas", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "1 rebanada de jamón de Parma, picada", "2 cucharadas de aceitunas negras"], "method": ["Para el aderezo, coloque todos los ingredientes del aderezo en un procesador de mini alimentos y mezcle hasta que quede suave.", "Para la ensalada, caliente una sartén y cocine las piezas de melocotón durante 3-4 minutos en cada lado, o hasta que estén doradas y tiernas.", "Coloque el cohete, las cebolletas y el aceite en un recipiente, mezcle bien y sazone, al gusto, con sal y pimienta negra recién molida.", "Para servir, coloque la ensalada de hierbas en un plato y cubra con las piezas de melocotón a la parrilla, jamón de Parma y aceitunas. Rocíe sobre el aderezo."], "url": "www_bbc_co_uk_food_recipes_chargrilledpeachsala_84862", "title": "Ensalada de melocotón a la brasa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ pera, en rodajas finas", "25g / 1oz de mantequilla", "3 kumquats, solo jugo", "1 yema de huevo", "25ml / 1fl oz puerto", "100ml / 4fl oz de aceite de oliva", "50g / 5oz de queso azul desmenuzado", "1 puñado de cilantro fresco", "1 puñado de perifollo fresco"], "method": ["Para las peras, caliente una bandeja de carbón. Agregue la mantequilla y las rodajas de pera y chargrill durante cuatro minutos hasta que estén doradas.", "Para terminar, exprime el jugo de kumquat en la parte superior.", "En un tazón, mezcle la yema de huevo con el puerto, luego mezcle el aceite de oliva gradualmente. Termine agregando el queso desmenuzado y las hierbas frescas.", "Para servir, coloque las peras en un plato y cubra con ensalada de hierbas y cualquier aderezo adicional alrededor del plato."], "url": "www_bbc_co_uk_food_recipes_chargrilledpearswith_79093", "title": "Peras a la brasa con ensalada de hierbas y aderezo del puerto de Stilton", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 pera, cortada en cuartos, sin corazón y piel dejada en", "4 rebanadas finas de ciabatta cepilladas con aceite de oliva", "100 g / 3½ oz de espinaca de hoja de bebé", "pequeño racimo de cilantro fresco, toscamente picado", "2 rebanadas de pan tostado, cortadas en gruesos trocitos de pan y arrojadas en aceite de oliva", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "¼ de cebolla picada", "1 diente de ajo, finamente cortado", "50g / 1¾oz de azúcar moreno", "150g / 5½oz de tomates cherry, cortados a la mitad", "3 cucharadas de vinagre de vino blanco"], "method": ["Caliente una sartén hasta que fume. Agregue los cuartos de pera y la plancha en ambos lados durante un minuto para crear líneas de parrilla, luego retírelos del fuego y déjelos a un lado.", "Coloque el pan ciabatta en la bandeja de la plancha y cocine por un minuto en cada lado para crear líneas de parrilla. Eliminar y reservar.", "Para hacer la ensalada, toma dos de los cuartos de pera a la plancha y córtalos en dados pequeños.", "Coloque la espinaca, el cilantro, los cuscurrones y la pera en cubos en un tazón grande y mezcle bien.", "Agregue el aceite de oliva, sazone al gusto, con sal y pimienta negra recién molida y reserve.", "Para hacer el chutney, coloque el aceite de oliva en una sartén a fuego medio. Agregue la cebolla y el ajo y fría por un minuto.", "Agregue el azúcar moreno y los tomates cherry y cocine por un minuto más.", "Agregue el vinagre de vino blanco y caliente a fuego lento y cocine para reducir durante cinco minutos.", "Para servir, coloque la ensalada en un plato con las piezas de pera a la brasa restantes y la chapata colocada alrededor de la ensalada. Vierta la salsa picante en un tazón pequeño y sirva junto a la ensalada."], "url": "www_bbc_co_uk_food_recipes_chargrilledpearswith_79476", "title": "Peras a la brasa con ensalada de espinacas y cilantro y chutney de tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Vinagre de sidra 150ml / 5f loz", "5 cucharadas de azúcar en polvo", "60 g / 2½ oz de semillas de mostaza amarillas", "25 g / 1 oz de semillas de mostaza marrón", "2 cucharadas de mostaza inglesa en polvo", "Cerveza de 110ml / 4fl oz", "2 filetes ribeye 2 x 250 g / 9 oz", "2 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "½ pan integral pequeño, cortado en cubos de 1.5cm / 3in", "2 cucharaditas de vinagre de sidra", "1½ cucharada de aceite de colza", "sal y pimienta negra recién molida", "1 manojo de berro, solo hojas"], "method": ["Para la mostaza casera de cerveza, coloque el vinagre y el azúcar en una sartén no reactiva y cocine a fuego lento. Agregue las semillas de mostaza amarillas y marrones y el polvo de mostaza y mezcle bien. Cocine a fuego lento durante tres minutos, hasta que el volumen del líquido se haya reducido a la mitad y las semillas se hayan suavizado un poco.", "Vierta la mezcla de mostaza en el recipiente de un procesador de alimentos y mezcle hasta obtener un puré. Tomará unos minutos para que las semillas se descompongan y la mostaza se vuelva cremosa.", "Agregue la cerveza a la mezcla de mostaza y mezcle una vez más. Sazone al gusto con sal y pimienta negra recién molida. Úselo de inmediato o póngalo en jarras, selle y guárdelo en el refrigerador. (Nota: esta receta produce más mostaza de la requerida para el plato).", "Para el bistec, caliente una sartén hasta que esté caliente. Frote los filetes con una cucharada de aceite de oliva, luego sazone al gusto con sal y pimienta negra recién molida.", "Coloque los filetes en la plancha caliente y cocine sin mover durante 1-2 minutos, luego gire 90 grados con las pinzas y cocine por un minuto más, para dar a los filetes un patrón reticular de las marcas de la plancha. Voltee los filetes y repita el proceso en el otro lado. Retire los filetes de la sartén y colóquelos en un plato para descansar; mantenerse caliente", "Mientras tanto, para la ensalada, caliente el aceite restante en una sartén, agregue los cubos de pan y fría durante 2-3 minutos, volteándolos ocasionalmente, hasta que estén crujientes y dorados. Retire los croûtons con una cuchara ranurada, escurra sobre papel de cocina y sazone al gusto con sal y pimienta negra recién molida.", "Coloque una cucharadita de mostaza casera en un tazón grande. Agregue el vinagre de sidra, mezcle el aceite de colza y sazone al gusto con sal y pimienta negra recién molida. Agregue los croutons y el berro y mezcle bien.", "Para servir, cortar los filetes en rodajas gruesas y cucharear la mostaza en 2 ollas pequeñas. Coloque la ensalada en el centro de cada plato. Coloque el bistec sobre la ensalada y sirva con una olla de mostaza en el lado."], "url": "www_bbc_co_uk_food_recipes_chargrilledribeyeste_91464", "title": "Filete a la brasa con ensalada de cerveza, mostaza y berros", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chargrilledribeyeste_91464_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filete de salmón de 100 g / 3½ oz, sin piel", "dash aceite de oliva", "sal y pimienta negra recién molida", "100g / 3½oz de guisantes frescos", "15g / ½ oz de mantequilla", "1 diente de ajo, finamente picado", "3 cucharadas de crema doble", "1 ramita de tomillo fresco, solo hojas", "sal y pimienta negra recién molida", "3 cucharadas de vinagre balsámico"], "method": ["Para el salmón, frote el salmón con aceite de oliva, sal y pimienta negra recién molida. Caliente una sartén hasta que esté caliente, agregue el salmón y la plancha durante 1-2 minutos en cada lado, o hasta que esté carbonizado por fuera y recién cocido.", "Para los guisantes de ajo con crema, coloque los guisantes en una sartén con agua hirviendo con sal y hierva durante 2 a 3 minutos, o hasta que estén tiernos y luego escurra. Coloque los guisantes cocidos en una sartén pequeña, agregue la mantequilla y el ajo y fría con cuidado durante 1-2 minutos. Agregue la crema, el tomillo, la sal y la pimienta negra recién molida y cocine a fuego lento durante dos minutos.", "Para la reducción balsámica, vierta el vinagre balsámico en una olla pequeña y cocine a fuego lento durante diez minutos, o hasta que esté reducido y pegajoso.", "Para servir, coloca los guisantes en un plato para servir. Cubra con el salmón a la brasa y rocíe la reducción balsámica en el plato."], "url": "www_bbc_co_uk_food_recipes_chargrilledsalmonwit_88191", "title": "Salmón a la parrilla con crema de guisantes y una reducción balsámica", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 filete de lubina, piel anotada", "sal y pimienta negra recién molida", "½ limón, solo jugo", "½ papa roja grande, pelada y rallada", "sal y pimienta negra recién molida", "2 cucharadas de aceite de oliva", "1 cucharada de aceite de oliva", "½ zanahoria, cortada en bastones", "½ calabacín, cortado en bastones", "sal y pimienta negra recién molida", "5 cucharadas de aceite de oliva", "1 tomate, semillas eliminadas, picadas", "1 diente de ajo, finamente picado", "2 cucharadas de vinagre balsámico", "1 puñado de hojas de albahaca fresca, desgarrada"], "method": ["Para la lubina a la parrilla, caliente el aceite en una sartén hasta que esté caliente. Sazonar el pescado con sal y pimienta negra recién molida y freír durante unos tres minutos, con la piel hacia abajo. Voltee el filete y retírelo del fuego. Exprime el jugo de limón y deja que continúe cocinando en el calor residual, hasta que esté cocido.", "Para la patata rösti, coloque la papa rallada en una toalla de té limpia y exprima el exceso de agua. Sazone la papa con sal y pimienta negra recién molida. Caliente el aceite en una sartén pequeña y empaquete la paleta sazonada en la sartén. Deje que se cocine sin agitar, volteándolo una vez, hasta que se dore por ambos lados, alrededor de 4-5 minutos por cada lado.", "Para las verduras salteadas, caliente el aceite en un wok y saltee la zanahoria y el calabacín por unos 4-5 minutos. Sazonar con sal y pimienta negra recién molida.", "Para la vierge salsa, coloque todos los ingredientes en una sartén pequeña y caliente suavemente durante unos 3-4 minutos.", "Para servir, coloque el rösti en el centro de un plato de servir y cubra con el filete de lubina. Coloque las verduras a un lado y coloque la salsa alrededor del borde."], "url": "www_bbc_co_uk_food_recipes_chargrilledseabasswi_88624", "title": "Lubina a la parrilla con rosti de patata, vegetales salteados y vierge de salsa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 crudos de tigre crudos, sin cáscara pero con cabezas y colas dejados en", "1 lima, mitad cortada en rodajas, mitad jugosa", "1 cucharada de salsa de soja", "1 cucharada de miel", "1 cucharada de semillas de sésamo", "½ cabeza de brócoli, cortado en floretes y cocido", "1 pizca de hojuelas de chile", "2 cucharadas de aceite de oliva", "sal y pimienta negra recién molida"], "method": ["Remoje un pincho de madera en agua fría durante 10-15 minutos. Desagüe.", "Para los langostinos, ensarte las gambas en el pincho, alternando con dos rodajas de lima. Caliente una bandeja de carbón hasta que esté humeando y rejilla los pinchos durante 1-2 minutos, luego dé vuelta. Espolvoree el jugo de lima, la salsa de soja, la miel y las semillas de sésamo sobre las gambas y cocine durante 1-2 minutos más, o hasta que las gambas estén rosadas y cocidas.", "Para el brócoli, mezcle el brócoli con las hojuelas de chile y el aceite, y sazone bien con sal y pimienta negra recién molida.", "Para servir, cuchara el brócoli arrabiata en un plato de servir y cubra con el pincho de gambas."], "url": "www_bbc_co_uk_food_recipes_chargrilledsesametig_90507", "title": "Brochetas de langostinos de sésamo a la plancha con brócoli", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["55g / 2oz de parmesano fresco", "4 cucharadas de aceite de oliva", "2 cucharadas de vinagre balsámico", "sal marina y pimienta negra recién molida", "Hojas de cohete de 200g / 7oz", "225 g / 8 oz de salmón ahumado en rodajas"], "method": ["Usando un pelador de patatas, afeite el queso parmesano en tiras finas, déjelo a un lado.", "Mezcle el aceite de oliva junto con el vinagre y un poco de aderezo. Mézclese en las hojas del cohete y colóquelas en los platos.", "Caliente una sartén a fuego alto. Doble cada rodaja de salmón ahumado en tres para hacer una rodaja más gruesa. Sazone con pimienta negra y rocíe de un lado con un poco de aceite de oliva.", "Cuando la sartén esté muy caliente, coloque el salmón sobre ella, con el lado aceitado hacia abajo, y déjela durante unos 15 segundos, luego gírela un cuarto de vuelta y cocínela durante 15 segundos más y luego retírela. No lo voltee, solo cocine en un lado.", "Rocíe el cohete con las virutas de parmesano y coloque el salmón, con el lado carbonizado hacia arriba, en la parte superior. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_chargrilledsmokedsal_10015", "title": "Salmón ahumado a la brasa con rúcula y parmesano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ cucharadita de semillas de cilantro, aplastadas", "½ cucharadita de semillas de comino, trituradas", "sal y pimienta negra recién molida", "Filete de salmón de 100 g / 3½ oz, sin piel", "1 cucharada de aceite de oliva", "1 tomate, piel y semillas eliminadas, cortadas en dados pequeños", "½ limón, solo jugo", "½ lima, solo jugo", "sal y pimienta negra recién molida", "½ cucharadita de semillas de cilantro", "puñado de hojas de albahaca fresca, rasgada", "puñado de brócoli cocido", "1 cucharada de cebolletas frescas picadas"], "method": ["Para el salmón, combine el cilantro y las semillas de comino en un bol con sal y pimienta negra recién molida. Presione los filetes de salmón en la mezcla en ambos lados.", "Caliente el aceite de oliva en una sartén y cocine el salmón durante 5-7 minutos o hasta que esté cocido, volteándolo hasta la mitad. (Nota: el salmón se cocina cuando la carne es opaca).", "Para la salsa vierge, caliente todos los ingredientes suavemente en una sartén durante 1-2 minutos hasta que se caliente.", "Para servir, coloque el salmón con especias en un plato con las flores de brócoli al lado. Rocíe la salsa vierge alrededor de la parte exterior del plato y adorne con las cebolletas picadas."], "url": "www_bbc_co_uk_food_recipes_chargrilledspicedsal_92387", "title": "Salmón especiado a la parrilla con salsa de vierge y brócoli", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ calamar, limpiado", "llovizna de aceite", "apretón de jugo de limón", "pizca de copos de chile", "85g / 3oz de couscous cocido (peso cocido)", "1 limón, solo jugo", "sal y pimienta negra recién molida", "puñado de eneldo", "55g / 2oz de piñones, tostados"], "method": ["Corte las hendiduras en la carne del calamar para hacer un patrón entrecruzado. Rocíe con aceite y el jugo de lima y espolvoree con una pizca de hojuelas de chile. Deje marinar durante unos minutos (o más si el tiempo lo permite).", "Caliente una sartén hasta que esté caliente. Planche el calamar durante 1-2 minutos en cada lado.", "Coloque el cuscús en un tazón y agregue el jugo de limón, el condimento, el eneldo y los piñones.", "Poner en un plato y servir el calamar en la parte superior."], "url": "www_bbc_co_uk_food_recipes_chargrilledsquid_74747", "title": "Calamar a la parrilla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 tubo grande de calamar, piel anotada", "1 cucharada de aceite vegetal", "1 cucharada de hojuelas de chile seco", "sal y pimienta negra recién molida", "1 cucharada de hojuelas de chile seco", "75g / 2¾oz de piña en trozos gruesos", "1 limón, solo jugo", "1 lima, solo jugo", "1 cucharada de azúcar glas", "15g / ½ oz de lechuga borracha (hojas de ensalada mixta de siembra o hojas de temporada)", "15 g / ½ oz de Lazy Blonde lechuga (sustituya las hojas de ensalada mixtas u hojas de temporada)"], "method": ["Para preparar el calamar, córtalo en tres pedazos iguales.", "Coloque una sartén a fuego alto.", "Cubra el calamar con aceite y escamas de chile y sazone con sal y pimienta negra recién molida.", "Coloque sobre la sartén plancha caliente. Apague después de un minuto y quite el calamar del fuego.", "Para hacer la salsa, combine los jugos de chile, piña, limón y lima y el azúcar glas en un tazón mediano.", "Adorne con la lechuga y coloque el calamar encima."], "url": "www_bbc_co_uk_food_recipes_chargrilledsquidwith_75828", "title": "Calamar a la parrilla con aceite de chile y salsa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Calamar de 100 g / 3½ oz, limpiado, anotado para hacer un patrón de diamante", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "100g / 3½oz de aceitunas verdes, hoyos eliminados, picados", "1 tomate, picado", "1 diente de ajo, picado", "pizca de copos de chile", "1 cucharada de alcaparras picadas", "1 cucharada de aceite de oliva"], "method": ["Para el calamar a la parrilla, frote el calamar con el aceite de oliva y sazone con sal y pimienta negra recién molida.", "Caliente una sartén a la plancha y cocine el calamar a fuego alto durante 1-2 minutos hasta que esté ligeramente chamuscado y cocido.", "Para la salsa vierge, coloque todos los ingredientes vierge de salsa en una olla pequeña y caliente.", "Para servir, coloque el calamar a la parrilla en un plato con la salsa en un tazón pequeño al lado."], "url": "www_bbc_co_uk_food_recipes_chargrilledsquidwith_85077", "title": "Calamar a la parrilla con salsa vierge", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filete de grupa 200 g / 7 oz, cortado en cubos grandes", "sal y pimienta negra recién molida", "2 cucharadas de aceite de oliva", "25g / 1oz de mantequilla", "1 cucharada de aceite de oliva", "½ cebolla, finamente picada", "1 diente de ajo, picado", "1 cucharada de vinagre de vino tinto", "1 cucharadita de azúcar en polvo", "1 cucharada de puré de tomate", "1 tomate de ternera, semillas eliminadas, picadas", "sal y pimienta negra recién molida", "1 cucharada de perejil fresco picado", "1 cucharada de cebolletas frescas picadas"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para los kebabs de carne, empape dos brochetas de madera en un recipiente con agua durante unos 20 minutos, para que no se quemen durante la cocción.", "Ensarte los trozos de carne en los pinchos y sazone bien con sal y pimienta negra recién molida, luego frote con aceite. Calentar una sartén hasta que esté caliente y dorar los pinchos hasta que estén dorados por todos lados. Transfiera al horno y hornee durante 5-7 minutos, o hasta que esté cocido a su gusto.", "Para la salsa picante de tomate, caliente la mantequilla y el aceite en una sartén y fríe con cuidado la cebolla y el ajo durante 4-5 minutos.", "Agregue el vinagre, el azúcar, el puré de tomate y el tomate picado y sazone, al gusto, con sal y pimienta negra recién molida. Cocine a fuego lento durante 6 a 8 minutos, o hasta que el tomate comience a descomponerse. Agregue las hierbas picadas.", "Sirva los kebabs en un plato con la salsa picante de tomate en un tazón en el lado para mojar."], "url": "www_bbc_co_uk_food_recipes_chargrilledsteakkeba_88675", "title": "Brochetas de carne a la parrilla con chutney de tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "125 g / 4½ oz de bistec", "sal y pimienta negra recién molida", "½ papa grande para hornear, pelada y cortada en chips", "6 dientes de ajo, en sus pieles, aplastados", "3 cucharadas de aceite de oliva", "1 cucharada de aceite de oliva", "125 g / 4½ oz de champiñones cerrados, descuartizados", "½ cebolla, rodajas gruesas", "puñado de perejil hojas de perejil", "1 cucharadita de aceite de oliva"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para el bistec, caliente una sartén hasta que fume. Frote el aceite sobre el bistec y sazone bien con sal y pimienta negra recién molida. Fría durante 3-4 minutos en cada lado (para raros), o hasta que esté cocido a su gusto, luego retírelo de la sartén y déjelo reposar en un plato caliente.", "Para las patatas fritas, prepare la papa en agua hirviendo durante 4-5 minutos, luego drene y coloque en una bandeja para hornear. Coloque el ajo triturado en la bandeja de horno y rocíe sobre el aceite, luego hornee en el horno durante unos 12-15 minutos, o hasta que las papas estén doradas y crujientes.", "Para los champiñones y la cebolla, caliente el aceite en una sartén a prueba de horno y fría los champiñones y la cebolla durante 3-4 minutos antes de transferirlos al horno para asar durante 4-5 minutos.", "Para obtener el perejil crujiente, frote las hojas de perejil con el aceite y colóquelas sobre un plato cubierto con película adhesiva. Caliente en el microondas a temperatura alta durante 30 segundos, luego quite para enfriar.", "Para servir, apile las patatas fritas y el ajo en el plato con el bistec. Coloque los champiñones y las cebollas asadas en el plato y adorne con el perejil fresco."], "url": "www_bbc_co_uk_food_recipes_chargrilledsteakandc_88816", "title": "Filete a la parrilla y patatas fritas con champiñones asados, cebolla y perejil fresco", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]