[{"isVegetarian": false, "title": "Vietnamese beef and lettuce wraps", "url": "www_bbc_co_uk_food_recipes_vietnamese_beef_and_57283", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/vietnamese_beef_and_57283_16x9.jpg", "ingredients": ["2 rump steaks or flank steaks, around 200g each, trimmed of any fat", "1 red chilli, sliced", "2 sticks lemongrass, bruised and finely chopped", "2 garlic cloves, finely chopped", "2 tbsp dark soy sauce", "1 tsp caster sugar", "2 spring onions, finely chopped", "1-1½ tsp toasted sesame oil, to taste", "50-75ml/2-2½fl oz rice vinegar, to taste", "25g-50g/1-2oz caster sugar, to taste", "1 stick lemongrass, trimmed and very finely chopped", "1 garlic clove, finely chopped", "1 lime, juice only", "1 carrot, cut into fine julienne strips", "150g/5½oz beansprouts", "1 red chilli, finely chopped", "50ml/2fl oz rice vinegar", "flavourless oil (such as groundnut or sunflower oil)", "3 sprigs mint, leaves picked and chopped", "½ small bunch coriander, leaves and stalks roughly chopped", "2 heads Little Gem lettuce, leaves separated", "lime wedges, to serve"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the marinade, put the steak into a large bowl, add the remaining ingredients and mix until coated evenly. Cover the bowl with cling film and leave to marinate in the fridge for at least two hours, or overnight if possible.", "When you’re ready to prepare the meal, add the dipping sauce ingredients to a small pan over a medium heat. Stir until the sugar dissolves. Taste and adjust the flavours as necessary – adding a little more sugar if it’s too sour, or more rice vinegar or lime juice if too sweet. Set aside.", "For the wraps, mix the carrots, beansprouts and chilli in a bowl. Pour over the rice vinegar, mix well and set aside while you cook the steaks.", "In a large heavy-based frying pan, heat a dash of oil.  Shake off any excess marinade from the steaks and cook for 2-3 minutes on either side - depending on their thickness and how rare you like your steak. Remove and rest on a plate for five minutes.", "Add the mint and coriander to the carrot mixture and mix to combine. ", "To serve, arrange the Little Gem leaves on a serving plate. Slice the rested steak, tipping any resting juices over the carrot mixture. Fill the lettuce leaves with spoonfuls of the carrot mixture. Top each leaf with a slice of steak and serve with the dipping sauce and lime wedges on the side."]}, {"isVegetarian": false, "title": "Vietnamese pork", "url": "www_bbc_co_uk_food_recipes_vietnamese_pork_05148", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp vegetable or coconut oil (you may need a dash more)", "600g/1lb 5oz pork belly, skin and fat removed, cut into fairly small chunks", "4 shallots, finely chopped", "3 garlic cloves, finely chopped", "2 lemongrass stalks, white inner stem only, finely chopped", "75g/2¾oz palm sugar or light soft brown sugar", "3 star anise", "1 tsp Chinese five-spice powder", "1 tbsp fish sauce", "steamed jasmine rice", "3-4 spring onions, cut in half and shredded lengthways, to garnish", "few sprigs coriander, to garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a wok if yours has a lid, otherwise use a large casserole. Add half of the pork belly and fry for several minutes until well browned. Remove from the wok and add the rest of the pork belly and repeat. Remove the pork and set aside.", "If necessary, add a little more oil and then add the shallots. Fry on a medium heat for a few minutes until lightly golden, then add the garlic and lemongrass. Stir fry for another minute or two, then add the palm sugar (or brown sugar), star anise and Chinese five-spice powder along with 200ml/7fl oz water and the fish sauce. Return the pork to the wok.", "Bring to the boil, then turn down to a simmer and cover. Cook for around 1.5 hours, or until the pork is tender. Uncover, turn up the heat slightly and cook for a further 10-15 minutes to reduce the sauce.", "Serve with steamed jasmine rice, garnished with spring onions and coriander."]}, {"isVegetarian": false, "title": "Vietnamese beef and spinach soup", "url": "www_bbc_co_uk_food_recipes_vietnamesebeefandspi_71363", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb fresh spinach", "175g/6oz lean fillet steak, cut into thin slices about 5cm (2 in) long", "2 shallots, finely sliced", "2 tbsp finely chopped garlic", "1 tbsp fish sauce", "freshly ground black pepper", "1.2 litres/2 pints homemade chicken stock or good quality bought stock", "2 tbsp fish sauce", "1 tbsp lemon juice", "1 tsp sugar", "1 small, fresh red chilli, seeded and chopped"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 70, "preparationMins": 60}, "recommendations": 0, "method": ["Remove the stalks from the spinach and wash the leaves well. ", "Blanch the leaves for a few seconds in a large pan of boiling water until they are just wilted, then drain well and refresh in cold water to prevent further cooking. Drain again, squeezing out excess water.", "Combine the steak with the shallots, garlic, one tablespoon of the fish sauce and some freshly ground black pepper, then set aside. (The soup can be prepared in advance up to this point.)", "Just before you are ready to eat, bring the chicken stock to a simmer in a saucepan and season it with the remaining fish sauce, the lemon juice, sugar and chilli.", "Add the blanched spinach and stir in the beef and its marinade. Bring the soup back to simmering point, add a few grindings of freshly ground black pepper to taste and serve at once."]}, {"isVegetarian": false, "title": "Vietnamese crab salad with rice noodles", "url": "www_bbc_co_uk_food_recipes_vietnamesecrabsaladw_83679", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/2oz sugar", "50ml/2oz fish sauce (nam pla)", "50ml/2fl oz lime juice", "1-2 small chillies, seeds removed, finely sliced", "2 garlic cloves, crushed to a paste with a pinch of salt in a pestle and mortar", "2 tsp finely grated fresh ginger", "125g/4oz thin ready-made rice noodles, softened by placing them in a bowl of boiling water for five minutes, then rinsing and draining", "300g/10½oz cooked crabmeat (brown and white meat if possible)", "300g/10½oz cucumber, seeds removed, chopped", "150g/5oz radishes, sliced", "75g/3oz unsalted peanuts, toasted under a hot grill until golden, then any skin rubbed off, roughly chopped", "2 tbsp chopped fresh coriander"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place all the ingredients for the dressing into a bowl and mix well.", "Place the drained noodles into a large clean bowl and add the dressing. Toss to coat, then add the brown crab meat (if using), the cucumber and the radishes and toss to mix again.", "To serve, place onto a serving plate or bowl and sprinkle over the white crab meat, the toasted peanuts and chopped coriander."]}, {"isVegetarian": false, "title": "Vietnamese grilled chicken wings", "url": "www_bbc_co_uk_food_recipes_vietnamesegrilledchi_74809", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["15 chicken wings", "3 lemongrass stems, finely chopped", "60ml/2fl oz oyster sauce", "60ml/2fl oz chilli sauce", "2 tbsp water", "2 tsp honey", "1 cucumber, cut into ribbons using a potato peeler", "3 carrots, cut into ribbons using a potato peeler"], "serves": "Serves 5", "time": {"preparation": "over 2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["Place the chicken wings in a bowl with the lemongrass. Cover with cling film and leave to marinate for three hours.", "Whisk the oyster and chilli sauces together with the water and honey, then set aside.", "Place the chicken wings on a barbecue and grill for five minutes on each side until just cooked.", "Score the wings with a knife, then brush with some of the oyster sauce mixture. NB: It is important not to put the sauce on at the beginning as the sugar content is high and you will burn the wings.", "Place the cucumber and carrot ribbons on a plate and top with the chicken wings.", "Serve with a drizzle of the remaining sauce."]}, {"isVegetarian": false, "title": "Vietnamese-style scallops with papaya salad", "url": "www_bbc_co_uk_food_recipes_vietnamesescallopswi_91368", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["110g/4oz green papaya, peeled, seeds removed, julienned", "4 spring onions, trimmed, julienned", "2 pomelos, peeled, segmented, roughly chopped", "2 tbsp fresh mint leaves, shredded", "2 tbsp chopped fresh coriander leaves", "2 tbsp chopped fresh holy basil leaves (available from some supermarkets and Asian grocers)", "1 tbsp palm sugar", "½ lime, juice only", "½ garlic clove, crushed to a paste with the edge of a knife", "1 tsp finely grated ginger", "1 tbsp nuoc nam (Vietnamese fish sauce)", "1 red chilli, finely chopped", "12 scallops, cleaned", "1 tbsp vegetable oil", "1 tbsp uncooked basmati rice, toasted in a dry frying pan until pale golden-brown, crushed", "1 x 20g/¾oz punnet cress"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the papaya salad, in a bowl, mix together the green papaya, spring onions, pomelos, mint, coriander and holy basil until well combined.", "For the dressing, grind the palm sugar, lime juice, garlic and ginger in a pestle and mortar until they form a smooth paste. Add the nuoc nam (Vietnamese fish sauce) and chilli and stir well to combine.", "For the Vietnamese scallops, brush the scallops all over with vegetable oil.", "Heat a frying pan over a high heat until smoking, then add the scallops and cook without moving them for 20-30 seconds, or until the bottom half of each scallop has turned opaque.", "Turn the scallops and repeat the process until the scallops are completely opaque (do not overcook the scallops or they will be chewy). Remove from the pan and set aside. ", "To serve, add the toasted, crushed rice to the salad, then drizzle over half of the dressing. Mix together until well combined, then pile into the centre of three serving plates. Place four of the scallops on top of each salad and garnish with the cress. Spoon over the remaining dressing."]}, {"isVegetarian": false, "title": "Vietnamese prawns on sugar cane", "url": "www_bbc_co_uk_food_recipes_vietnameseprawnsonsu_81503", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz raw prawns, peeled and cleaned", "50g/2oz pork fat (or use streaky bacon)", "100g/3½oz dried shrimp, soaked for an hour in hot water", "50g/2oz shallot, finely chopped", "1 tbsp fish sauce, plus extra for dipping", "½ chilli, finely chopped, to taste", "½ tsp freshly ground black pepper", "10 sticks sugar cane (available in some Asian and Caribbean speciality shops)", "black and white sesame seeds, for coating", "groundnut oil, for deep frying", "salad leaves, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the prawns and pork fat in a food processor and blend to a paste.", "Add the dried shrimp, shallot, fish sauce, chilli and black pepper to the mixture and blend again.", "Cut the sugar cane into sticks the size of lolly sticks. Wet your hands and mould a ball of the mixture around the broad end of the cane. Smooth it, so it looks like an egg-shaped lolly. Roll the mixture roughly in the sesame seeds.", "Heat the oil in a deep, heavy-bottomed pan. It is ready when a breadcrumb that is dropped in will sizzle gently in it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Deep fry the prawn sticks in the oil for about 5 minutes or until coloured. If possible finish them off over a charcoal fire or grill to crisp up. ", "Serve on a bed of crisp salad leaves using more fish sauce as a dipping sauce. The sugar cane can be chewed at the end to extract the juice."]}, {"isVegetarian": false, "title": "Vietnamese-style crispy pork and citrus salad", "url": "www_bbc_co_uk_food_recipes_vietnamesestylecrisp_85517", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 x 150g/5½oz pork fillet, cut into thin strips", "salt and freshly ground black pepper", "1 tbsp sesame seeds", "½ red onion, chopped", "1 tbsp clear honey", "2 tbsp olive oil", "1 tbsp cider", "1 tbsp sesame seeds", "1 tbsp balsamic vinegar", "pinch chilli powder", "salt and freshly ground black pepper ", "100g/3½oz cheddar, grated ", "½ red onion, finely sliced", "1 orange, peeled and segmented", "handful fresh mixed herbs (such as parsley, dill, chives)", "1 lime, cut into wedges, to garnish", "2 slices ciabatta, toasted"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the crispy pork, heat the oil in a frying pan over a medium-high heat. Season the pork strips on both sides with salt and freshly ground black pepper and fry for 8-10 minutes.", "Add the sesame seeds and red onion and fry for a further five minutes. Add the honey, stir well and cook for one minute, or until the pork is completely cooked through.", "Meanwhile, for the dressing, place all the dressing ingredients into a bowl and mix well.", "For the salad, place the cheese, onion, orange and herbs into a bowl and mix well. Pour over the dressing and stir to coat.", "To serve, place the salad onto a plate and top with the crispy pork. Serve with lime wedges and toasted ciabatta."]}, {"isVegetarian": false, "title": "Vietnamese-style pork and noodle soup", "url": "www_bbc_co_uk_food_recipes_vietnamesestyleporka_86050", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp vegetable oil", "2 pork ribs", "salt and freshly ground black pepper", "½ red chilli, chopped", "1 garlic clove, chopped", "150ml/¼ pint hot beef stock", "100g/3½oz dried egg noodles, cooked according to packet instructions", "2 tsp sesame oil", "handful fresh coriander, chopped, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a pan. Season the pork ribs with salt and freshly ground black pepper and fry for 2-3 minutes on each side, or until lightly browned.", "Add the chilli and garlic and stir fry for one minute.", "Add the beef stock and bring to the boil. Reduce the heat and simmer for ten minutes, or until the pork is completely cooked through.", "Add the cooked noodles and sesame oil and stir.", "To serve, pour the soup into a serving bowl and sprinkle over the chopped coriander."]}, {"isVegetarian": false, "title": "Vietnamese style prawn coleslaw", "url": "www_bbc_co_uk_food_recipes_vietnamesestyleprawn_12154", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["vegetable or peanut oil", "75g/3oz raw peanuts", "300g/10½oz Chinese cabbage leaves, sliced thinly", "1 carrot, peeled and julienned", "½ Spanish onion, sliced thinly ", "8 large cherry tomatoes, sliced", "12 king prawns, peeled, de-veined and halved lengthwise", "1 cup mixed fresh herbs such as coriander leaves, mint leaves, Thai basil leaves or Vietnamese mint leaves", "150ml/¼pt rice wine vinegar", "1 tbsp caster sugar, or to taste", "1 tsp dried chilli flakes, or to taste"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a little vegetable or peanut oil in a frying pan, add the peanuts and roast over a medium heat, stirring regularly until golden brown. Drain on absorbent paper and cool.", "Tightly roll the cabbage leaves together, then slice thinly and place in a large bowl.", "Using a mandolin, if possible, thinly slice the carrot lengthwise, then using a sharp knife, thinly slice the carrot lengthwise into julienne.", "Add the carrot, onion, tomatoes, prawns and herbs to the cabbage.", "Coarsely crush the peanuts in a mortar and pestle and add to the salad.", "Combine the vinegar, sugar and chilli flakes in a small saucepan, bring to the boil and stir until the sugar dissolves then remove from the heat and cool to room temperature.", "Add enough dressing to generously coat the salad and toss well to combine. Season to taste.", "Spoon the salad on to a serving platter and serve as an accompaniment to stir-fried fish and steamed rice."]}, {"isVegetarian": true, "title": "Vinaigrette potatoes with herbs", "url": "www_bbc_co_uk_food_recipes_vinaigrettepotatoesw_85690", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp olive oil", "1 tbsp red wine vinegar", "1 tsp Dijon mustard", "salt and freshly ground black pepper", "dash Tabasco sauce", "2 tbsp chopped fresh chives ", "1 tbsp chopped fresh flatleaf parsley ", "1 tbsp chopped fresh chervil ", "1 potato, peeled, cut into cubes and boiled until tender"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place all the ingredients except the potato into a large bowl and mix well.", "Add the potato cubes to the bowl while still warm and stir well to coat with the dressing. Leave to marinate for ten minutes.", "To serve, transfer to a serving dish."]}, {"isVegetarian": false, "title": "Vincisgrassi (porcini and prosciutto lasagne)", "url": "www_bbc_co_uk_food_recipes_vincisgrassi_75129", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 tbsp olive oil", "500g/1lb 2oz sliced fresh porcini or a generous handful of dried porcini", "2 garlic cloves, sliced", "150g/5½ oz Parma ham, thinly sliced", "150g/5½oz butter, plus extra for greasing", "60g/2¼oz plain flour", "1.5 litres/2½ pints milk", "200ml/7fl oz double cream", "2 tbsp chopped fresh parsley", "1kg/2lb 4oz fresh pasta dough, rolled out into lasagne sheets ", "400g/14oz Parmesan cheese, grated ", "white truffle oil or a fresh truffle", "100g/3½oz unsalted butter", "salt and freshly ground black pepper, to taste"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4.", "Heat the olive oil and fry the mushrooms with the garlic for two minutes.", "Add the Parma ham, stir and remove from the heat.", "Cook the butter and flour in a pan over a low heat until it lets off a nutty aroma. Stir in the milk, a little at a time until it is combined and thick.", "Add the double cream and bring to the boil. ", "Tip the cooked mushrooms into the sauce, season well with salt and pepper, and add the parsley.", "Butter a 24cm/9½in gratin dish and lay a pasta sheet inside it.", "Spoon over the sauce and add a generous handful of Parmesan cheese. Dot with truffle oil or crumble over a little of the fresh truffle.", "Repeat to make six layers, and finish with more Parmesan and dot with butter.", "Bake in the oven for 25-30 minutes, or until bubbling and golden."]}, {"isVegetarian": true, "title": "Vine-baked feta", "url": "www_bbc_co_uk_food_recipes_vine-baked_feta_26601", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/vine-baked_feta_26601_16x9.jpg", "ingredients": ["6–8 large vine leaves (vacuum packed or in brine)", "200g/7oz feta (in one block)", "1 unwaxed lemon", "2 tbsp garlic oil ", "1 tsp pul biber chilli flakes (also known as Aleppo pepper)", "4 sprigs thyme, leaves picked, or 1 tsp dried thyme "], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/200C Fan/Gas 7 and line a baking tray with baking paper.", "Lay out all but one of the vine leaves on a chopping board, ensuring they overlap one another slightly. Place the feta in the centre. Grate the lemon directly over the cheese ensuring it falls evenly over the surface. Gently drizzle over the garlic oil trying to keep it on the same surface of the cheese rather than allowing it to spill over the edges. Sprinkle over the chilli flakes and then the thyme leaves.", "Carefully wrap the feta in the vine leaves to make a neat parcel. Wrap with the remaining vine leaf to secure the parcel. ", "Place on the prepared tray and bake for 22–25 minutes. Serve the parcel whole and share. "]}, {"isVegetarian": false, "title": "Vinegar-glazed pigeon breast on crisp potato cake with peas and spring onions", "url": "www_bbc_co_uk_food_recipes_vinegarglazedpigeonb_86629", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 crowns of pigeon (the two breasts attached to the bone; ask your butcher to prepare these)", "salt and freshly ground black pepper ", "50g/2oz butter", "1 tbsp vegetable oil", "pinch powdered mace", "1 shallot, finely chopped", "2 tbsp sherry vinegar", "2 tbsp white wine vinegar", "150ml/¼ pint chicken stock or pigeon stock", "25g/1oz butter", "salt and freshly ground black pepper ", "1 tbsp fresh flatleaf parsley, chopped", "1 tbsp fresh chervil, chopped", "450g/1lb potatoes, peeled, cut into cylinders, then finely sliced into discs", "110g/4oz clarified butter", "salt and freshly ground black pepper ", "8 spring onions", "50g/2oz butter", "225g/8oz peas, cooked"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 180C/365F/Gas 4.", "For the pigeon, season the pigeon crowns well with salt and freshly ground black pepper, then rub each crown all over with the butter and mace and set aside for 30 minutes.", "Heat a large ovenproof frying pan until hot, add the oil and sear the pigeon crowns on each side, until golden-brown all over, then place into the oven and roast for 12-15 minutes, or until cooked to your liking. Remove from the oven, remove from the pan and leave to rest in a warm place for five minutes.", "For the sauce, pour out the excess fat from the pan, then add the shallots and fry over a medium heat for 2-3 minutes.", "Add the sherry vinegar and white wine vinegar. Bring to the boil and reduce the liquid by half.", "Add the stock and boil again to reduce the liquid by a third.", "Add the butter and season, to taste, with salt and freshly ground black pepper.", "Meanwhile, carefully cut the pigeon breasts away from the bone.", "Strain the sauce into a clean pan and use half to baste the pigeon breasts.", "Add the parsley and chervil to the remaining sauce in the pan and stir.", "For the potato cake, increase the oven temperature to 200C/400F/Gas 6.", "Place the potatoes into a bowl and add the clarified butter and season well with salt and freshly ground black pepper.", "Heat four 15cm/6in diameter ovenproof frying pans and arrange the potato slices into the base of the pans, so that they cover the base of each pan, overlapping each other slightly. Repeat for three layers of potato discs in each pan, then transfer to the oven to cook for 10-15 minutes, or until the potatoes are golden-brown and cooked through. (You can use one larger pan to create a single, larger potato cake. NB: this may take longer to cook.)", "For the peas, place the spring onions into a pan of boiling water and blanch for one minute. Drain the spring onions and refresh in iced water, then drain again.", "Heat a frying pan, until just warm, then add the butter, peas and blanched spring onions. Cook for two minutes over a low heat.", "To serve, carefully turn the potato cakes out into the centre of each of four plates. Place a spoonful of the peas and spring onions into the centre of each potato cake. Place three pigeon breasts on top of each pile of spring onions/peas and pour the remaining sauce over."]}, {"isVegetarian": true, "title": "Violet artichoke risotto with artichoke salad", "url": "www_bbc_co_uk_food_recipes_violetartichokerisot_87983", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "2 onions, roughly chopped", "3 carrots, roughly chopped", "½ celery head, roughly chopped", "½ celeriac, roughly chopped", "2 leeks, roughly chopped", "½ fennel, roughly chopped", "1 head garlic, cut in half", "4 white peppercorns", "1 small bunch fresh thyme", "1 small bunch fresh rosemary", "1 small bunch fresh flatleaf parsley", "2 tbsp olive oil", "75g/3oz butter", "1 shallot, finely chopped", "1 garlic clove, crushed", "1 tsp thyme leaves, finely chopped", "250g/9oz carnaroli risotto rice", "50ml/2fl oz white wine", "1 litre/1¾pint vegetable stock", "2 baby violet artichokes, trimmed", "25g/1oz mascarpone", "50g/2oz parmesan, freshly grated (or vegetarian hard cheese alternative) ", "salt and freshly ground black pepper", "2 baby violet artichokes, trimmed ", "½ lemon, juice only", "1 tbsp white wine vinegar", "1 tsp English mustard", "3 tbsp extra virgin olive oil", "salt and freshly ground black pepper", "½ head curly endive"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["For the stock, heat a large pan until hot and then add the olive oil. Add the onions, carrots, celery, celeriac, leeks, fennel, garlic and peppercorns and cook for about five minutes until coloured, but not browned.", "Cover with water and bring to the boil, before turning the heat down and simmering for 15 minutes.", "Add the thyme, rosemary and parsley and cook for a further five minutes. Turn off the heat and allow the stock to cool in the pan.", "Transfer the stock to a large bowl (or keep it in the pan if you have space in your fridge) and place in the fridge to chill overnight, covered. Strain the stock the next day, when you are ready to cook.", "For the risotto, pour 1 litre/1¾ pints of the homemade vegetable stock into a saucepan and place onto the heat. Bring to a simmer.", "Heat a frying pan until hot. Add the olive oil and half of the butter. Add the shallots and garlic and sweat for two minutes.", "Scatter over the thyme leaves and add the rice to the pan. Cook for one minute until just starting to toast.", "Add the white wine and cook until almost all the wine has been absorbed. Gradually add the stock several ladlefuls at a time, stirring all the time.", "When each addition of stock is absorbed, add more stock, stirring once more.", "Continue to cook until the rice is just tender and nearly all the stock is absorbed. When the rice has reached this point, finely slice the artichokes (either by hand or on a mandoline).", "Add the artichokes to the risotto and cook for 2-3 minutes with the remaining stock.", "Add the mascarpone, remaining butter and the parmesan and stir to combine. Season with salt and freshly ground black pepper.", "For the salad, slice the artichokes very thinly and place in a bowl with half of the lemon juice.", "Whisk the white wine vinegar, mustard and olive oil together to make a dressing. Season with salt and freshly ground black pepper. Drain the artichokes and place them in a salad bowl. Add the dressing and curly endive to the bowl and mix well.", "To serve, spoon some of the risotto onto each plate and top with the salad."]}, {"isVegetarian": false, "title": "Virgin Mary", "url": "www_bbc_co_uk_food_recipes_virginmary_78294", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/virginmary_78294_16x9.jpg", "ingredients": ["200ml/7fl oz tomato passata", "2 spring onions, finely chopped", "1 lemon, juiced", "½ tsp Tabasco sauce", "½ tsp Worcestershire sauce", "55g/2oz ice cubes ", "1 tbsp chives, chopped"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["In a blender, mix the passata, spring onions, lemon juice, Worcestershire sauce, Tabasco sauce and ice cubes. Blend for two minutes, or until smooth.", "Pour into a tall glass and garnish with chopped chives."]}, {"isVegetarian": false, "title": "Virgin Mary", "url": "www_bbc_co_uk_food_recipes_virginmary_84288", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200ml/7oz passata", "1 lime, juice only", "½ tsp Tabasco sauce", "½ tsp Worcestershire sauce", "1 tsp Dijon mustard", "handful ice cubes", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place all the ingredients into a food processor and blend.", "To serve, pour into a glass filled with ice cubes and season, to taste, with  salt and freshly ground black pepper."]}, {"isVegetarian": false, "title": "Vodka and tonic battered cod with chips and tomato ketchup", "url": "www_bbc_co_uk_food_recipes_vodka_and_tonic_battered_64040", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1litre/1¾ pints vegetable oil", "1kg/2lb 4oz beef dripping", "400g/14oz chipping potatoes, peeled, cut into batons", "15g/⅔oz fresh yeast", "pinch salt", "pinch sugar", "175ml/6fl oz tonic water", "200g/7oz plain flour", "25ml/1fl oz vodka", "1 tsp cider vinegar", "4 x 175g/6oz cod (or other white fish such as coley or pollack) fillets, skinned, pin boned", "250ml/9fl oz red wine vinegar", "1 bay leaf", "½ tsp ground coriander", "½ tsp ground cinnamon", "75g/3oz light soft brown sugar", "1.6kg/3lbs 8oz chopped tinned tomatoes", "1 tsp salt", "1 tbsp English mustard powder", "1 garlic clove, crushed", "Tabasco sauce", "2 tbsp tomato purée", "1-2 tbsp cornflour"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the cod, heat the vegetable oil and beef dripping in a deep fat fryer to 170C/325F. (CAUTION: Hot oil can be dangerous. Do not leave unattended.)", "Fry the chipped potatoes in the oil for 2-3 minutes, or until tender, but not coloured. (You may need to do this in batches.) Drain the potatoes onto kitchen paper and increase the oil temperature in the pan or deep fat fryer to 190C/375F/Gas5.", "Meanwhile, mix the yeast, salt and sugar in a bowl until well combined. ", "Pour the tonic water into the yeast mixture and whisk in the the flour, vodka and vinegar. Leave to the mixture to ferment – it is ready to use when the mixture starts to bubble. ", "Coat the cod fillets in the batter and fry in the oil for 3-4 minutes, or until golden-brown and crisp. Remove the battered cod with a slotted spoon and drain on kitchen paper.  ", "Fry the semi-cooked chips in the oil for a second time for 2-3 minutes, or until golden-brown and crisp.", "For the tomato ketchup, heat the vinegar, spices and sugar in a heavy-based pan until simmering.", "Add the remaining ingredients, bring to the boil and stir to prevent the mixture from sticking to the side of the pan. ", "Once the mixture has reached boiling point, reduce the temperature to a simmer and cook for a further 30 minutes, stirring occasionally.", "Blend the mixture in a blender until smooth, then push the ketchup through a sieve.", "Serve the cod alongside the chips with a good dollop of tomato ketchup."]}, {"isVegetarian": false, "title": "Vodka and tonic soft shell-crab with saffron aioli and seasonal salad", "url": "www_bbc_co_uk_food_recipes_vodka_and_tonic_soft_10369", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp fresh yeast", "pinch salt", "pinch sugar", "175ml/6fl oz tonic water", "200g/7oz plain flour", "25ml/1fl oz vodka", "1 tsp cider vinegar", "8 soft-shell crabs", "6 garlic cloves, peeled and left whole", "250ml/9fl oz white wine", "2 medium free-range egg yolks", "1 tbsp white wine vinegar", "1 tbsp Dijon mustard", "pinch salt", "125ml/4fl oz rapeseed oil", "½ tsp saffron, soaked in 25ml/1fl oz hot water", "1 lemon, juice only (to taste)", "25g/1oz bull's blood salad leaves", "25g/1oz lamb's lettuce ", "2 heads Little Gem lettuce, leaves separated", "3 tbsp olive oil", "1 tbsp white wine vinegar", "1 lemon, juice only", "2 spring onions, finely chopped, to garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the vodka and tonic soft shell crab, preheat a deep fat fryer to 190C/370F. (CAUTION: do not leave unattended. Hot oil can be dangerous.)", "Mix the yeast, salt and sugar in a bowl until well combined. Pour in the tonic water and whisk in the flour, vodka and vinegar. Set aside to ferment – it is ready to use when the mixture starts to bubble.", "Dip the crabs in the batter and place in the deep fat fryer for 3-4 minutes, turning two or three times, until golden-brown and crisp. Carefully remove the crabs from the hot oil using a slotted spoon, place on a plate lined with kitchen paper and season with salt.", "For the saffron aioli, place the garlic and white wine in a pan and cook for a few minutes. Drain and reserve the garlic.", "Place the egg yolks in a food processor, add the vinegar, Dijon mustard and salt. Blend until smooth, then with the motor running, gradually add the oil in a slow trickle until the mixture resembles mayonnaise. Add the saffron and garlic and blend to combine. Add lemon juice to taste.", "For the seasonal salad, place all the leaves in a large bowl and mix. Place the oil, vinegar and lemon juice in a small bowl and whisk. Pour over the salad and mix.", "To serve, place the crab on serving plates with the salad next to it and the saffron aioli in a small dish. Scatter the spring onions over the crab."]}, {"isVegetarian": true, "title": "Vodka strawberry cheesecake", "url": "www_bbc_co_uk_food_recipes_vodka_strawberry_89729", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/vodka_strawberry_89729_16x9.jpg", "ingredients": ["100ml/3½fl oz vodka", "1 tbsp caster sugar", "1 tsp vanilla bean paste", "400g/4oz strawberries, quartered and pricked all over with a fork", "knob of butter, for greasing", "300g/10½oz biscuits, such as digestive biscuits", "pinch of salt", "½ tsp cinnamon", "150g/5½oz unsalted butter, melted", "500g/1lb 2oz curd cheese (available from some large supermarkets)", "375ml/13fl oz double cream ", "1 lemon, juice and zest only", "200g/7oz caster sugar", "1 tsp vanilla bean paste", "50g/1¾oz cornflour", "5 free-range eggs, beaten", "100g/3½ oz strawberry jam", "200g/7oz strawberries, halved", "whipped cream, to serve"], "serves": "Serves 10-12", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the vodka strawberries, pour the vodka into a large bowl, add the sugar and vanilla bean paste. Stir in the strawberries and leave to infuse for about 4 hours.", "Preheat the oven to 180C/160C Fan/Gas 4. Generously butter a deep 23cm/9in springform tin. ", "Meanwhile break the biscuits into crumbs in a food processor, or put them in a bag and bash with a rolling pin. Mix in the salt and cinnamon. Then add the melted butter.  Stir well and pack evenly into the prepared baking tin. Bake in the oven for 10 minutes. Leave to cool. ", "In a bowl beat together the curd cheese, double cream, lemon juice and zest, caster sugar, vanilla bean paste, cornflour and eggs. ", "Drain the vodka strawberries using a sieve, reserving the vodka strawberry juice. Fold the strawberries into the cheesecake mixture. ", "Pour the mixture on top of the biscuit base. Cover the bottom of the baking tin with two layers of tin foil and place in a deep roasting tin. Pour in boiling water to come up to about 2cm/¾in of the cheesecake tin. Bake in the oven for 1 hour and 15 minutes, or until the cheesecake is browned in the top and cooked just solid. Set aside to cool completely, preferably overnight.", "Meanwhile, in a pan heat the strawberry jam. Add half of the vodka strawberry juice, and mix together. Leave to cool. With a pastry brush paint a coating of the vokda-infused jam onto the cheesecake and stick on the halved strawberries cut-side down in a lovely pattern. Leave in the fridge until ready to serve. Serve with whipped cream. "]}, {"isVegetarian": false, "title": "Vodka and cranberry jelly", "url": "www_bbc_co_uk_food_recipes_vodkaandcranberryjel_89316", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["vegetable oil, for greasing", "250ml/9fl oz water", "250g/9oz caster sugar", "250ml/9fl oz cranberry juice", "25ml/1fl oz vodka", "3 gelatine leaves, soaked in 3 tbsp cold water", "100g/3½oz blueberries", "8 fresh basil leaves", "200ml/7fl oz Marsala wine", "125g/4oz icing sugar", "1 vanilla pod, seeds scraped out", "250g/9fl oz blackberries", "double cream, to serve"], "serves": "Makes 8", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Grease eight small jelly moulds of your choice and line with cling film.", "Place the water, sugar and cranberry juice into a pan and bring to the boil. Reduce the heat and simmer for five minutes, then remove from the heat. ", "Add the vodka and stir to combine. ", "Remove the gelatine leaves from their soaking water and place into the pan with the cranberry mixture.", "Stir the cranberry mixture until it begins to thicken, then pour the mixture into a bowl.", "Place a few blueberries into the bottom of each lined jelly mould. ", "Top up the moulds with the jelly mix, then place a basil leaf on top of each.", "Transfer the jellies to the fridge to chill overnight and set.", "For the sauce, mix the Marsala, sugar and vanilla seeds in a clean bowl. Add the blackberries and leave for two hours.", "To serve, turn out each jelly onto a small serving plate. Spoon equal amounts of the marinated fruit around each jelly and drizzle with a little double cream."]}, {"isVegetarian": true, "title": "Vodka Martini", "url": "www_bbc_co_uk_food_recipes_vodkamartini_88568", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/vodkamartini_88568_16x9.jpg", "ingredients": ["15ml/½fl oz vermouth", "60ml/2fl oz Tyrrells potato vodka, or other potato vodka", "twist lemon peel, to garnish"], "serves": "1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Pour the vermouth and vodka into a mixing glass and fill with ice cubes. Stir well and then strain into a small Martini glass.", "Garnish with a twist of lemon peel and serve."]}, {"isVegetarian": false, "title": "Vodka-soaked cherry tomatoes", "url": "www_bbc_co_uk_food_recipes_vodkasoakedcherrytom_70018", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 punnet cherry tomatoes", "¼ pint/150ml chilli-flavoured vodka", "½ lemon, juice of", "1 tbsp dry sherry", "6 drops Tabasco sauce", "1 tsp Worcestershire sauce", "celery salt, to taste"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 60, "preparationMins": 60}, "recommendations": 0, "method": ["Prick the tomatoes all over with a cocktail stick.  Soak the tomatoes in a mixture of the next seven ingredients.  ", "Chill until ready to eat. When eating, sprinkle with celery salt. The remaining liquid can be drunk as shots - or used as a base for an excellent Bloody Mary."]}, {"isVegetarian": true, "title": "Vodka, sultana and poppy seed cheesecake", "url": "www_bbc_co_uk_food_recipes_vodkasultanaandpoppy_85437", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz sultanas", "100ml/3½fl oz lemon vodka", "225g/8oz charcoal crackers (available from large supermarkets and cheese suppliers)", "150g/5oz butter, melted", "30g/2oz icing sugar", "750g/1½lb ricotta cheese", "400g/13oz cream cheese", "6 free-range eggs", "150g/5oz sugar", "1 vanilla pod, seeds scraped out", "30g/1½oz poppy seeds", "whipped cream, mixed with a shot of vodka"], "serves": "Serves 12", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Soak the sultanas in the lemon vodka overnight. ", "For the base, crush the crackers into a bowl. Add the melted butter and icing sugar and stir to combine.", "Press the biscuit mixture into the base of a 23cm/9in spring-form cake tin.", "Preheat the oven to 180C/355F/Gas mark 4.", "For the topping, place the ricotta, the cream cheese, eggs, sugar and vanilla seeds into a food processor and blend until combined and smooth.", "Transfer the cheese mixture to a clean bowl. Drain the sultanas from the vodka and add the sultanas to the cheese and mix well.", "Spoon the cheese mixture onto the biscuit base and sprinkle over the poppy seeds to completely cover the top.", "Transfer to the oven to bake for one hour. The surface should still be a little wobbly in the very centre of the cheesecake when it is done. It will firm up as it cools.", "Once it is cooled, serve slices of the cheesecake onto plates with a dollop of vodka whipped cream."]}, {"isVegetarian": true, "title": "Wafer-thin membrillo and apple tart with honey and walnut cream", "url": "www_bbc_co_uk_food_recipes_waferthinmembrilloan_81024", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb ready-made puff pastry", "6 eating apples, such as Golden Delicious, peeled, cored, and halved", "50g/2oz butter, melted in a saucepan, plus extra for greasing", "110g/4oz membrillo or quince paste (available in Continental food shops or in some supermarkets)", "runny honey, for drizzling", "25g/1oz caster sugar", "sprig of mint, to garnish", "150ml/5fl oz double cream", "25g/1oz walnuts, chopped", "3 tbsp runny honey"], "serves": "Serves", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["On a floured surface, roll out the puff pastry thinly (to about 3-4mm) and prick the surface all over with a fork. Cut out four 20-23cm/8-9in discs. Place in the fridge to rest.  ", "Preheat the oven to 200C/400F/Gas 6.", "Cut the apples thinly with a sharp knife. Remove the pastry from the fridge and place on a non-stick buttered baking tray. Lightly brush the edges of the pastry discs with melted butter and spread the membrillo in the middle of each disc. Arrange the apple slices on top.", "Drizzle the apple with a little honey and scatter over the sugar and bake in the oven for 5-6 minutes, until golden brown.  ", "Meanwhile, make the honey and walnut cream. Whip the double cream until thick, then fold in the walnuts and honey.", "Remove the tarts from the oven and glaze with a little of the remaining butter. Serve with a spoonful of the walnut cream mixture and garnish with a sprig of mint."]}, {"isVegetarian": true, "title": "Wafer thin red onion and crème fraîche tart", "url": "www_bbc_co_uk_food_recipes_waferthinredonioncre_79305", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz puff pastry, ready to roll", "1 free-range egg", "25g/1oz butter", "3 large red onions, thinly sliced", "6 garlic cloves, peeled", "4 sprigs fresh thyme", "salt and freshly ground black pepper", "250g/9oz full fat crème fraîche", "2 tbsp olive oil, for drizzling", "2 tbsp balsamic vinegar", "5 tbsp olive oil", "salt and freshly ground black pepper", "100g/3½oz fresh rocket"], "serves": "Makes 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["If using frozen pastry, allow it to defrost.", "Preheat the oven to 220C/430F/Gas Mark 7.", "Roll the puff pastry outto a thickness of 3mm. Cut into four round circles, each the size of a side plate.", "Using a sharp knife, cut a small edge from around the pastry and lay this piece around the outer edge of the tart, to make a double-layered frame.", "Break the egg into a bowl and whisk with a fork. Brush the pastry circles with the egg wash around the edges.", "Using a fork, pierce the pastry bases a few times and then place in the oven to bake for 15-20 minutes, until the pastry bases are golden-brown and cooked.", "Meanwhile, melt the butter in a large pan. Add the onions, garlic and thyme and cook gently for 15 minutes, until deep brown and caramelised.", "Season to taste with salt and freshly ground black pepper.", "Remove the cooked pastry bases from the oven and spread with the crème fraîche.", "Top with the caramelised onions, drizzle with olive oil and return to the oven for a few minutes.", "Meanwhile, in a large clean bowl, mix the balsamic vinegar with the olive oil and some salt and freshly ground black pepper. Add the salad leaves and toss well to coat.", "To serve, remove the tarts from the oven and place on a large serving plate. Drizzle with a little olive oil and serve with a small pile of the dressed salad in the middle of each tart."]}, {"isVegetarian": true, "title": "Waffles", "url": "www_bbc_co_uk_food_recipes_waffles_82356", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/waffles_82356_16x9.jpg", "ingredients": ["450ml/16fl oz full-fat milk ", "3 large free-range eggs, separated ", "125ml/4fl oz vegetable oil ", "1 tsp vanilla extract ", "225g/8oz plain flour ", "2 tsp baking powder ", "3 tbsp caster sugar ", "¼ fine sea salt ", "maple syrup, blueberries, or other berries, to serve "], "serves": "Makes 20 waffles", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the waffle iron according to instructions (some need to be lightly oiled before you start). ", "Pour the milk into a large measuring jug add the egg yolks, oil and vanilla and beat together. Combine the flour, baking powder, sugar and salt in a large bowl. Pour the jug of wet ingredients into the bowl of dry ones, and whisk together, making sure there are no lumps.", "Put the egg whites into a clean bowl and whisk to stiff peaks.  Slowly fold the egg whites into the batter, until a thick, smooth and airy consistency.", "Fill one side of your heated waffle iron with 250ml/9fl oz batter, close and cook for 1 minute, then turn the waffle iron over and cook on the other side for 2 minutes. If you’re using an electric waffle iron, you will obviously not be turning it over, so you may need to cook for a minute or so longer. Just follow the instructions that come with the iron in all cases. ", "Ease the cooked waffle out of the waffle iron. Repeat until all the batter is used up. If you’re not keeping the waffles warm in the low oven (see recipe tip) each waffle should be eaten as soon as it comes out of the iron. Generously pour maple syrup over your waffle, and tumble a few berries alongside if wished."]}, {"isVegetarian": true, "title": "Waffles with hot chocolate sauce, fried bananas and ice cream", "url": "www_bbc_co_uk_food_recipes_waffles_with_hot_14908", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/waffles_with_hot_14908_16x9.jpg", "ingredients": ["260g/9½oz plain flour", "1 tbsp baking powder ", "1 tsp sea salt flakes", "1 tbsp granulated sugar", "3 free-range eggs, lightly beaten", "425ml/15fl oz full-fat milk", "110g/4oz unsalted butter, melted", "175g/6¼oz plain chocolate, broken into pieces", "50g/1¾oz caster sugar", "4 bananas, peeled and halved lengthways", "50g/2oz butter", "50g/2oz caster sugar", "4 scoops vanilla ice cream, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the waffles, preheat a waffle maker to a medium setting and preheat the oven to 140C/275F/Gas 1. Place a large wire rack onto a baking tray and keep it warm.", "Mix the flour, baking powder, salt and granulated sugar in a large mixing bowl. Whisk in the eggs, milk and butter until well combined.", "Ladle some of the batter into each well of the waffle maker, close the lid and cook for five minutes, or until golden-brown and crisp. Repeat the process until the batter is used up. Keep the waffles warm on the baking tray in the oven.", "For the hot chocolate sauce, melt the chocolate in a bowl set over a pan of simmering water (ensure the bottom of the bowl does not touch the water). ", "In another pan, heat the sugar and 100ml/3½oz water, stirring until the sugar dissolves. Bring to the boil. ", "Stir the sugar syrup into the chocolate until smooth and shiny. ", "For the fried bananas, heat a frying pan until hot, then melt together the butter and sugar.", "Add the bananas and fry for 1-2 minutes on each side, or until golden-brown all over.", "Place the waffles on a plate and top with chocolate sauce and serve the bananas and ice cream on the side."]}, {"isVegetarian": false, "title": "Waffles with hollandaise, poached eggs and bacon", "url": "www_bbc_co_uk_food_recipes_waffles_with_hollandaise_19899", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz plain flour", "1 tbsp baking powder", "1 tsp salt", "1 tbsp caster sugar", "3 free-range eggs, lightly beaten", "425ml/15fl oz full-fat milk", "115g/4oz unsalted butter, melted", "125g/4½oz butter, melted", "2 tsp lemon juice", "2 tsp white wine vinegar", "2 large free-range eggs, yolks only", "sea salt and freshly ground black pepper", "2 tbsp white wine vinegar", "4 free-range eggs", "12 slices streaky bacon", "2-3 tbsp chives, finely chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the waffles, preheat a waffle maker to a medium setting. Preheat the oven to 140C/275F/Gas 1. Place a large wire rack onto a baking sheet and place in the oven to warm.", "Mix the flour, baking powder, salt and sugar in a large mixing bowl. Whisk in the eggs, milk and butter until well combined.", "Ladle some of the batter into each well of the waffle maker, close the lid and cook for five minutes or until golden-brown and crisp. Repeat the process until the batter is used up, keeping the cooked waffles warm on the wire rack in the oven.", "For the hollandaise, melt the butter in a saucepan and bring to a simmer.", "Place the lemon juice and vinegar into a separate small pan and heat until just boiling.", "Place the egg yolks into a food processor with a pinch of salt. With the motor running, add the hot lemon and vinegar in a steady stream then slowly add the melted butter until it is all incorporated. Remove the sauce from the processor and season with sea salt and freshly ground black pepper.", "For the poached eggs, bring a pan of salted water to the boil and add the vinegar. Whisk the water to create a whirlpool and once settled, carefully crack an egg into the water. Simmer for 2-3 minutes, remove the poached egg with a slotted spoon and place onto a plate to drain. Repeat the process with the remaining eggs.", "Heat a frying pan until hot, add the bacon and cook until crisp on both sides. Drain the bacon on kitchen paper.", "To serve, place the waffles onto the serving plates, top with the poached eggs and bacon and finish with a drizzle of hollandaise sauce and the chopped chives."]}, {"isVegetarian": true, "title": "Waffles with strawberry compôte and ice cream", "url": "www_bbc_co_uk_food_recipes_waffles_with_strawberry_51757", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz plain flour", "1½ tsp baking powder", "1 tsp salt", "1 tbsp caster sugar", "3 free-range eggs, lightly beaten", "425ml/¾ pint full-fat milk", "110g/4oz melted butter, plus extra for greasing ", "75g/3oz caster sugar", "25g/1oz butter", "250g/9oz strawberries, hulled", "1 lemon, zest only", "500ml/18fl oz vanilla ice cream, to serve", "4-8 tbsp maple syrup, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the waffles, preheat a waffle maker to a medium setting and preheat the oven to 140C/275F/Gas 1. ", "Mix the flour, baking powder, salt and sugar in a large mixing bowl. Whisk in the eggs, milk and butter until well combined.", "Brush the waffle maker with a little melted butter and then ladle some of the batter into each well of the waffle maker. Close the lid and cook for five minutes, or until golden-brown and crisp. Remove and place on a tray in the oven to keep warm, while you use the rest of the batter.", "For the strawberry compôte, place the sugar and five tablespoons of water with the butter in a saucepan. Add the strawberries and lemon zest. Simmer for five minutes. ", "To serve, stack the waffles onto each of four plates, top with some strawberry compôte and a dollop of vanilla ice cream. Finish with a drizzle of maple syrup."]}, {"isVegetarian": true, "title": "Wakame seaweed salad with miso dressing", "url": "www_bbc_co_uk_food_recipes_wakame_seeweed_salad_26514", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz dried wakame seaweed, soaked in cold water for 20 minutes, then drained and rinsed", "20g/¾oz dried wood ear mushrooms, soaked in warm water for 20 minutes, then drained, rinsed and finely shredded", "½ Granny Smith apple, cored and cut into matchsticks", "1 small carrot, cut into matchsticks", "1 small handful of coriander roots, thinly sliced", "1 handful of coriander leaves, to garnish", "1 tbsp white sesame seeds", "½ tsp red miso paste", "3 tbsp mirin", "1 tbsp apple cider vinegar", "pinch sea salt", "pinch soft brown sugar"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Toss all the salad ingredients together in a bowl.", "To make the dressing, grind the sesame seeds in a pestle and mortar. Add the miso paste and mix well. Put in a small bowl and add the remaining dressing ingredients. Whisk well to combine.", "Add the dressing to the salad just before serving, and stir to combine. Garnish with the coriander and serve immediately."]}, {"isVegetarian": false, "title": "Wagyu sirloin and slow-cooked brisket, sprouting broccoli, wagyu tartare on puffed heel tendon", "url": "www_bbc_co_uk_food_recipes_wagyu_sirloin_and_slow_80459", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 egg yolks", "sea salt, for curing", "2 braised and dried beef heel tendons ", "1litre/1¾ pints flavourless vegetable oil, for deep frying ", "100g/3½oz Wagyu sirloin", "1 tsp finely chopped banana shallot", "10 leaves flatleaf parsley, thinly shredded", "1 tbsp vegetable oil, for frying", "200g/7oz onions, roughly chopped", "1kg/2lb 4oz Wagyu brisket", "250ml/9fl oz light bitter ale", "500ml/18fl oz brown chicken stock", "50g/1¾oz clear honey", "cabernet sauvignon vinegar, to taste", "6 smoked garlic cloves ", "100ml/3½fl oz white wine vinegar ", "50g/1¾oz caster sugar", "50ml/2fl oz parsley oil", "1 tbsp vegetable oil, for frying", "200g/7oz Wagyu sirloin", "50g/1¾oz butter", "200g/7oz sprouting broccoli, trimmed, florets, leaves and stalks separated", "50g/1¾oz butter"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the tartare, first cure the egg yolks. Put a layer of salt in the bottom of a small container, lay the egg yolks on top and cover with more salt. Cover and put in the fridge for 12 hours. ", "Wash the egg yolks gently in cold water and place in a dehydrator set as 40C for 24 hours.", "Boil the beef heel tendons for 4 hours until very soft. Place on a tray and leave to cool and firm up. Slice thinly and dehydrate until hard.", "Fill a deep-fat fryer with oil and heat to 180C. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Add the beef heel tendons and fry until light and fluffy. Remove the beef using a slotted spoon and drain on kitchen paper. Season with sea salt and set aside. ", "Chop the Wagyu sirloin into 5mm/¼in squares. Mix with the shallot and parsley and season with sea salt. Set aside until needed.", "For the brisket, preheat the oven to 140C/120C Fan/Gas 1. Heat the oil in a large casserole. Add the onions and brisket and fry for a few minutes, until the meat is browned all over and the onions are soft. Pour in the ale, stock and honey. Cover with a lid and bake for 2-3 hours, or until the meat is tender. Carefully remove the brisket from the casserole and keep warm. ", "Pass the cooking liquid through a fine sieve into a saucepan. Cook over a medium heat until reduced to a glaze. Season, to taste, with sea salt and cabernet sauvignon vinegar. ", "For the dressing, fry the smoked garlic in a hot pan in a splash of oil until golden-brown, then reduce the heat and cook until soft. Add the vinegar and sugar and bring to the boil. Remove from the heat.", "Transfer the garlic to a blender, add most of the cooking liquid and blend until smooth. Add a little more cooking liquid if needed to achieve a smooth dressing (it should be fairly thick as you will add the parsley oil at the last minute). Set aside until needed.", "For the Wagyu sirloin, heat the oil in heavy-based frying pan. When hot, add the Wagyu sirloin and fry for 15-20 seconds. Turn and fry the other side for 15-20 seconds. Repeat this process for 2-3 minutes, adding the butter for the final minute. (This will keep the heat in the pan and build up a nice crust while keeping the centre moist and pink.) Set aside on a wire rack to rest for 5 minutes.", "For the sprouting broccoli, blanch the stalks for 2 minutes, the florets for 1 minute and the leaves for 30 seconds. Dress with butter and season with sea salt.", "To serve, glaze the brisket in the reduced cooking liquor. Carve the Wagyu steak and season with salt. ", "Divide the brisket, steak and broccoli between four serving plates. Mix the parsley oil with the smoked garlic dressing and drizzle over the steak.", "Spoon the tartare onto the puffed beef heel tendon, grate over the cured egg yolks and serve on the side. "]}, {"isVegetarian": false, "title": "Wagyu beef in XO sauce with oysters, pickled mushrooms basil and mint", "url": "www_bbc_co_uk_food_recipes_wagyu_beef_in_xo_sauce_06331", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz shiitake mushrooms, sliced", "150ml/5fl oz soy sauce", "150ml/5fl oz sherry vinegar", "50g/1¾oz fresh ginger, finely chopped", "100g/3½oz caster sugar", "5 fresh oysters, shells discarded", "100ml/3½fl oz rapeseed oil ", "squeeze lemon juice", "salt, to taste", "2 tbsp flavourless oil", "300g/10½oz wagyu beef fillet, cut into 1cm thick slices", "100ml/3½fl oz XO sauce", "2 steamed sesame milk buns", "¼ iceberg lettuce, leaves separated", "handful mint leaves", "few basil leaves", "few oyster leaves", "few edible flowers"], "serves": "", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the pickled mushrooms, put the mushrooms in a heatproof bowl. Bring the other ingredients to the boil and pour over the sliced mushrooms.", "For the oyster emulsion, put the oysters in a blender and blend until smooth, slowly adding the oil. Season with lemon juice and salt.", "For the beef, heat frying pan until hot and add the oil. Once hot, seal the beef on each side for 1 minute. Transfer to a plate and allow to rest. Add the XO sauce to the pan and deglaze, scraping the cooked on parts from the pan into the sauce.", "To serve, cut or break the bun in half and assemble the bun with the steak, sauce, mushrooms, emulsion, lettuce, mint and basil with the lid on top. Garnish with oyster leaves and edible flowers."]}, {"isVegetarian": false, "title": "Waldorf salad with grilled mackerel", "url": "www_bbc_co_uk_food_recipes_waldorf_salad_with_19251", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/waldorf_salad_with_19251_16x9.jpg", "ingredients": ["2 large free-range egg yolks", "1 tbsp white wine vinegar", "2 tsp Dijon mustard", "½ tsp caster sugar", "¼ tsp flaked sea salt", "freshly ground black pepper", "150ml/5fl oz sunflower oil", "100ml/3½fl oz crème fraîche", "65g/2¼oz shelled walnut halves", "3 large sticks of celery, plus celery leaves", "2 eating apples, quartered and finely sliced", "250g/9oz seedless red grapes, halved", "around 2 tsp fresh lemon juice", "8 fresh mackerel fillets", "4 tsp olive oil ", "4 tsp lemon juice ", "2 tbsp flatleaf parsley, finely chopped", "flaked sea salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["To make the mayonnaise put the egg yolks, vinegar, mustard and sugar into the small bowl of a food processor, or if you don’t have a food processor with a small bowl, you can use a stick blender. Season with salt and some ground black pepper. ", "Blend until smooth, then with the motor running, gradually add the oil and blend until smooth and thick. Add the crème fraîche and 1-2 tablespoons of cold water. Blend for a few seconds more until the sauce has a soft dropping consistency. Transfer to a bowl, cover and chill in the fridge.", "For the salad, place the walnut halves into small non-stick frying pan over a medium-high heat for 3-4 minutes, or until toasted all over. Leave to cool. Finely slice the celery, keeping the leaves for later. Add the sliced celery to a large bowl together with the sliced apples and halved grapes. Pour over the lemon juice and toss well. This will keep the apples from going brown. Mix in the mayonnaise, toasted walnut halves and celery leaves.", "Preheat the grill to the highest temperature setting. Add the mackerel fillets to a large mixing bowl and pour over olive oil and lemon juice. Sprinkle over the parsley and season with flaked sea salt and freshly ground black pepper. Toss well, ensuring the fillets are well coated. Transfer the mackerel to a baking tray, skin-side up, and grill for 2-3 minutes, or until the skin is crisp. Serve the mackerel fillets immediately, with the Waldorf salad and a wedge of lemon."]}, {"isVegetarian": false, "title": "Waldorf salad", "url": "www_bbc_co_uk_food_recipes_waldorfsalad_85781", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ red apple, sliced", "½ stalk celery, chopped", "100g/3½oz cooked chicken, chopped", "50g/1¾oz walnuts", "handful fresh rocket", "2 free-range egg yolks", "1 tsp Dijon mustard", "290ml/10¼ fl oz vegetable oil", "1 lemon, juice only", "salt and freshly ground black pepper"], "serves": "1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["For the salad, put all the salad ingredients into a large bowl and mix well.", "For the mayonnaise dressing, put the egg yolks and mustard into a mixing bowl and whisk together. ", "Gradually add the vegetable oil, whisking continuously until all the oil is mixed in. ", "Whisk the lemon juice into the mixture and season with salt and freshly ground black pepper.", "To serve, mix the mayonnaise with the salad and spoon into a serving bowl."]}, {"isVegetarian": false, "title": "Walnut-crusted pork chops with figs", "url": "www_bbc_co_uk_food_recipes_walnut-crusted_pork_79537", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/walnut-crusted_pork_79537_16x9.jpg", "ingredients": ["6 large thick-cut pork chops", "1 tsp ground cinnamon", "1 tsp freshly grated nutmeg", "100g/3½oz  walnuts, finely chopped", "2 tbsp olive oil", "70g/2½oz butter, softened", "125ml/4fl oz white wine", "16 dried figs, finely chopped", "125ml/4fl oz chicken stock", "1 tbsp roughly chopped flatleaf parsley", "1 lemon, juice only", "salt and freshly ground black pepper"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Season the pork chops with salt and pepper and score the flesh with a sharp knife.", "In a shallow roasting tin, mix the cinnamon, nutmeg and walnuts. Add the olive oil to make a paste. Roll the chops in the nuts, pushing the crumb into the flesh.", "Melt 40g/1½oz of the butter in a large non-stick lidded frying pan and brown the chops two at a time, being careful not to burn the walnuts. This will take a few minutes each side. ", "Return all the chops to the pan, cover with a lid and cook for 10 minutes over a medium heat, or until cooked through. Transfer the pork chops to a warmed plate and cover with foil to keep warm.", "Deglaze the pan with the white wine, continue to cook until the volume of the liquid has reduced by half. Add the chopped figs and chicken stock, season to taste. Whisk in the remaining butter, the parsley and lemon juice. ", "Serve the pork chops with the sauce spooned over."]}, {"isVegetarian": false, "title": "Walnut and Stilton soda bread", "url": "www_bbc_co_uk_food_recipes_walnut_and_stilton_soda_33324", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz Stilton cheese", "75g/2½oz shelled walnuts, roughly chopped", "50g/1¾oz sultanas", "300g/10½oz plain white flour, plus extra for dusting", "200g/7oz wholemeal flour", "1 tsp bicarbonate of soda", "1 tsp table salt", "400ml/14fl oz buttermilk"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the flavourings, crumble the Stilton into a bowl and add the walnuts. Stir in the sultanas and set aside.", "For the soda bread, preheat oven to 200C/180C Fan/Gas 6. Line a baking tray with parchment paper.", "Tip the flours, bicarbonate of soda and salt into a bowl. Add the flavourings.", "Pour in the buttermilk and mix to a soft dough. Tip out onto a floured surface and gather into a ball. Cut deep slits in the loaf to mark out quarters and dust with flour.", "Place the bread on the baking tray and bake for 30 minutes, or until golden-brown and cooked through. The loaf should sound hollow when tapped on the base.", "Remove from the oven and cool on a wire rack."]}, {"isVegetarian": true, "title": "Walnut fleur loaf", "url": "www_bbc_co_uk_food_recipes_walnut_fleur_loaf_84772", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400g/14oz malted grain bread flour  ", "200g/7oz strong white flour; plus extra for kneading and shaping dough on kitchen work surface", "2 tsp salt ", "2 x 7g/⅛oz sachets fast-acting dried yeast", "30ml/1fl oz walnut oil", "2 tbsp black treacle ", "150g/5½oz chopped walnuts", "1 free-range egg, lightly beaten "], "serves": "Serves 8-10", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Combine the dry ingredients in the bowl of a free-standing electric mixer fitted with a dough hook.", "Add all the remaining ingredients apart from the egg, with 250ml/9fl oz tepid water and begin kneading on a slow speed. Add up to 100ml/3½fl oz more water a little at a time to make a soft, but not wet dough. ", "Knead on a slow speed for approximately two minutes, then increase the speed and knead for four minutes on a medium speed. ", "Turn the dough out onto a lightly floured work surface and knead by hand, breaking any large walnut pieces that remain, until the dough is smooth and pliable. Set aside in a large, lightly oiled bowl, covered with a tea towel to prove for approximately one hour, or until the dough has doubled in volume.", "Knock back the dough and separate 200g/7oz off from the rest. Set aside, covered while you shape the loaf.", "Form the larger portion of the dough into a smooth cob flattened slightly into a circle approximately 30cm/12in in diameter and place onto the lined baking tray. ", "Place a 7.5cm/3in round cutter in the middle of the dough. Cut the dough around the periphery using a knife to create 16 segments (petals). ", "Twist each petal  90 degrees. Cut out the circle of dough from the centre and shape into a ball. Set aside, covered with a tea towel. ", "Divide the reserved 200g/7oz of bread dough into two balls. Roll these out thinly into circles.  Divide each circle into eight triangles. Place the short ends of each triangle within the central hole and fold back the points into the centre to create inner petals of the flower. ", "Place the reserved ball of dough back in the centre of the flower. Cover with oiled cling film and prove again until the dough has doubled in size.", "Preheat the oven to 210C/fan oven 190C/Gas 7 and line a baking tray with baking parchment", "Brush the inner petals with the beaten egg and dust the outer petals with a little white flour ", "Using the tip of a sharp knife cut the central boule to mimic the appearance of the centre of a flower.", "Bake for 30-35 minutes until the loaf sounds hollow when the base is tapped."]}, {"isVegetarian": false, "title": "Walnut and apple-stuffed rolled loin of pork with roasted honey and walnut parsnips", "url": "www_bbc_co_uk_food_recipes_walnutandapplestuffe_85163", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5oz walnuts, shells removed, roughly chopped", "2 green apples, chopped", "2 sprigs fresh thyme, roughly chopped", "200g/7oz butter, softened", "salt and freshly ground black pepper ", "1kg/2¼lb boneless loin of pork", "1-2 tbsp vegetable oil", "6 parsnips, peeled, quartered", "3 tbsp olive oil", "4 tbsp clear honey", "salt and freshly ground black pepper ", "2 sprigs fresh thyme", "100g/3½oz walnut halves, shells removed", "ready-made gravy, to serve"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the pork, place the walnuts, apples, thyme and two-thirds of the butter into a bowl, season with salt and freshly ground black pepper and mix to make a chunky paste.", "Lay the pork, flesh-side up, on a chopping board with the belly flap facing away from you. With a sharp knife, make an incision in the meat halfway down running parallel to the board, cutting almost all the way through. Open the loin up, stuff with the butter mixture and season with salt and freshly ground black pepper.  ", "Generously grease a piece of foil large enough to wrap the pork and place the pork on top. Rub the remaining butter all over the pork, then roll up in the foil. Twist the ends of the foil so that the parcel is very tight and tie with some string.", "Heat a large roasting tin on the hob until hot and add the vegetable oil. Place the foil parcel into the tin and cook, turning every 2-3 minutes, until all parts of the parcel have had contact with the heat - this will colour the outer layer of the meat. ", "Transfer the pork to the oven and roast for 1-1½ hours, or until golden-brown and completely cooked through. ", "Meanwhile, for the parsnips, place the parsnips into a roasting tin. Drizzle over the olive oil and honey and stir well to coat the parsnips. Season with salt and freshly ground black pepper, add the thyme sprigs and mix well.", "Place into the oven and roast for 35-40 minutes, or until tender and golden-brown.", "Add the walnut halves and return to the oven for five minutes, until lightly toasted.", "To serve, unwrap the pork parcel, discarding the foil, and slice the pork into thick slices. Place the slices onto six plates with the parsnips and a drizzle of gravy."]}, {"isVegetarian": true, "title": "Walnut and pistachio baklava with almond and ginger ice cream", "url": "www_bbc_co_uk_food_recipes_walnutandpistachioba_88634", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5oz butter, melted", "200g/7oz filo pastry ", "110g/4oz walnuts, finely chopped", "110g/4oz pistachio nuts, finely chopped", "250g/9oz caster sugar", "200ml/7fl oz water", "½ lemon, juice only", "½ tsp ground ginger ", "250ml/9fl oz double cream", "50ml/2fl oz syrup from a jar of stem ginger", "¼ tsp ground ginger ", "2 tbsp honey", "50g/2oz almonds, roughly chopped", "50g/2oz stem ginger, finely chopped"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/360F/Gas 4.", "For the baklava, brush a 25cm/10in x 18cm/7in baking tray with some of the melted butter.", "Trim the filo pastry to fit the baking tray if necessary.", "Place one of the filo sheets into the tray. Brush with butter then place another filo sheet on top and brush with butter. Repeat to use up half of the filo sheets in this way.", "Meanwhile, mix the walnuts and pistachio nuts together thoroughly in a bowl.", "Pour the nut mixture onto the buttered filo pastry stack and spread out evenly.", "Brush one sheet of filo with butter then place it, butter-side down onto the layer of nuts. Brush the sheet with butter, then repeat the layering process with the remaining filo sheets, again buttering each sheet before adding the next.", "Using a large sharp knife, score the top of the layered stack in a diamond pattern.", "Place into the oven and bake for 20-25 minutes, until golden and cooked through.", "Meanwhile, place the caster sugar, water, lemon juice and ground ginger into a pan over a medium heat and bring to the boil. Boil for 5-6 minutes, until just thickened to a syrup.", "When the baklava comes out of the oven, pour the warm syrup over and set aside to cool.", "For the ice cream, place the cream, ginger syrup, ground ginger and honey into a freezer-safe bowl and whisk until soft peaks are formed when the whisk is removed.", "Add the chopped almonds and ginger and fold together gently.", "Place into the freezer for two to four hours, or until set solid. Remove the ice cream from the freezer ten minutes before serving.", "To serve, separate the baklava diamonds and place two onto each plate. Top with a scoop of ice cream and serve."]}, {"isVegetarian": true, "title": "Walnut and Stilton crostini", "url": "www_bbc_co_uk_food_recipes_walnutandstiltoncros_88009", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["40g/1½oz watercress", "30g/1oz Stilton", "2 tbsp shelled walnuts", "2 tbsp olive oil", "freshly ground black pepper", "2 slices baguette, toasted"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the watercress, Stilton, walnuts, olive oil and black pepper into a mini food processor and blend until smooth.", "Place the baguette slices onto a serving plate. Spread over the walnut and Stilton mixture and serve."]}, {"isVegetarian": true, "title": "Walnut and sultana bread with almonds", "url": "www_bbc_co_uk_food_recipes_walnutandsultanabrea_67847", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400g/14oz strong wholemeal flour", "110g/4oz strong white flour", "30g/1oz fresh yeast", "15g/½oz salt", "255ml/9oz water", "85g/3oz sultanas", "85g/3oz walnuts", "handful flaked almonds", "Stilton, to serve"], "serves": "Makes 1 loaf", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. Mix the flour, yeast, salt and water in a bowl with your hands until it becomes a soft, pliable dough.", "Place the dough on to a lightly floured, flat surface and knead for five minutes. Put the dough back in the bowl and leave to rise for an hour.", "Bring the dough out and mix the sultanas and walnuts into it.", "Shape the dough into a loaf, and roll the loaf in flaked almonds.", "With a sharp knife, cut a line down the centre of the loaf.", "Bake for 30 minutes, or until golden brown. Cool on a wire rack, serve toasted or with Stilton on the side."]}, {"isVegetarian": true, "title": "Walnut and winter vegetables salad", "url": "www_bbc_co_uk_food_recipes_walnutandwinterveget_87826", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 parsnip", "6 baby carrots", "2 cooked beetroot (not in vinegar) ", "1 tbsp olive oil", "salt and freshly ground black pepper", "1 tbsp butter", "1 garlic clove, finely chopped", "1 sprig thyme", "1 tbsp clear honey", "1 tbsp red wine vinegar", "bunch watercress", "100g/3½oz shelled walnuts", "1 garlic clove, finely chopped", "50ml/1¾fl oz olive oil", "salt and freshly ground black pepper", "squeeze lemon juice, to taste", "4 tbsp crème fraîche ", "1 tsp Dijon mustard", "1 tbsp grated fresh horseradish root", "½ lemon, juice only"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/390F/Gas 6. ", "For the winter vegetables, peel the parsnip and chop each one into six lengthways. Trim out the core with a sharp knife. ", "Peel the carrots and chop each one into six lengthways. Peel the beetroot and chop into quarters.  ", "In a large pan, heat the olive oil, then add the parsnips and carrots and fry for two minutes until the vegetables begin to colour.", "Add salt and freshly ground black pepper, to taste, along with the butter, garlic and thyme. Fry for a further 5-6 minutes, or until the vegetables are tender all the way through. Add the beetroot, honey and vinegar to the pan and warm the beetroot through. Set aside, keeping the vegetables warm.", "For the walnut paste, place the walnuts on a baking tray and roast them in the oven for five minutes. Remove the walnuts from the oven and rub them with a clean cloth to remove the skins. In a pestle and mortar, grind the peeled walnuts together with the garlic and olive oil. Season, to taste, with salt, freshly ground black pepper and lemon juice.", "For the horseradish dressing, mix together the crème fraîche, mustard, grated horseradish and lemon juice and season, to taste, with salt and freshly ground black pepper.", "To serve, spread the walnut paste on two plates and arrange the vegetables on top. Garnish with watercress and drizzle the horseradish dressing over."]}, {"isVegetarian": true, "title": "Walnut Bakewell tart with roasted medlars", "url": "www_bbc_co_uk_food_recipes_walnutbakewelltartwi_87482", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 packet ready-made sweet shortcrust pastry, rolled out to 0.5cm/¼in thick", "175g/6oz butter", "175g/6oz caster sugar", "4 free-range eggs", "175g/6oz ground walnuts", "110g/4oz breadcrumbs", "300g/11oz damson jam", "12 walnut halves", "250ml/9fl oz double cream", "50g/2oz butter", "400g/14oz medlars", "75g/3oz caster sugar", "1 cinnamon stick"], "serves": "Serves 10-12", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5.", "For the tart, line a deep 23cm/9in tart tin with the sweet shortcrust pastry. Place a sheet of baking paper or foil over the pastry and weigh down with baking beans or rice.", "Place the tart tin onto a baking sheet, transfer to the oven and bake for 15 minutes.", "Remove the paper or foil and baking beans from the tart tin, then return to the oven for a further ten minutes until the pastry is lightly golden-brown. Remove from the oven and allow to cool slightly.", "Place the butter and sugar into a bowl and beat together until light and fluffy.", "Crack in the eggs, one at a time, mixing well between each addition.", "Add the ground walnuts and breadcrumbs and fold together until well combined.", "Spread two thirds of the damson jam over the base of the pastry case. Cover with the walnut filling mixture and smooth the top using a wet palette knife. Place the walnut halves around the edge of the filling.", "Transfer to the oven and bake for 25-30 minutes, or until risen and golden-brown. Remove from the oven and allow to cool slightly.", "Meanwhile, in a bowl, whip the cream until soft peaks form when the whisk is removed. Fold in the remaining damson jam.", "Preheat the oven to 200C/400F/Gas 6.", "For the roasted medlars, heat the butter in an ovenproof frying pan and fry the medlars for 1-2 minutes.", "Add the sugar and cinnamon stick, then transfer the pan to the oven and roast for 10-15 minutes, or until the medlars are soft and the skins have split.", "To serve, cut the tart into slices and place onto serving plates with a spoonful of damson cream and some roasted medlars."]}, {"isVegetarian": true, "title": "Walnut, pear and goats' cheese salad", "url": "www_bbc_co_uk_food_recipes_walnutpearandgoatsch_85246", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 pear, peeled and chopped into 1cm/½in cubes", "55g/2oz walnuts, shells removed, roughly chopped", "55g/2oz goats' cheese, crumbled", "handful fresh parsley", "handful fresh coriander", "handful fresh chervil ", "2 tsp extra virgin olive oil", "1 tsp balsamic vinegar", "squeeze lemon juice", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["For the salad, place the pear pieces, walnuts, cheese and herbs into a large bowl and mix well.", "For the dressing, place the oil, vinegar and lemon juice into a bowl. Season with salt and freshly ground black pepper and mix well.", "To serve, pour the dressing over the salad and stir well to coat the salad ingredients. Place the salad onto a serving plate."]}, {"isVegetarian": false, "title": "Walnut chicken and Waldorf salad", "url": "www_bbc_co_uk_food_recipes_walnutchickenandwald_84654", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["110g/4oz walnuts, roughly chopped", "2 tbsp Dijon mustard", "2 boneless, skinless chicken breasts, sliced thickly", "salt and freshly ground black pepper ", "4 tbsp olive oil", "1 head celery", "2 tbsp olive oil", "1 tbsp fresh thyme leaves", "110g/4oz walnut halves", "2 green apples, cut into wedges", "2 red apples, cut into wedges", "1 lemon, zest and juice only", "2 free-range egg yolks ", "1 tsp English mustard", "1-2 tbsp white wine vinegar", "150ml/5fl oz sunflower oil", "150ml/5fl oz olive oil", "salt and freshly ground black pepper"], "serves": "Serves    4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the walnuts into a food processor and blend to fine crumbs.", "Brush the Dijon mustard onto the chicken fillet slices and season with salt and freshly ground black pepper.", "Place the ground walnuts into a large bowl. Add the chicken slices and roll in the walnuts to coat completely.", "Heat a frying pan until hot then add the olive oil. Place the chicken into the frying pan and fry for 3-4 minutes on each side, or until golden and completely cooked through. Remove from the pan and drain onto kitchen paper.", "For the salad, chop half of the celery into small chunks, and slice the remainder into 5cm/2in long strips.", "Place the olive oil and thyme leaves into a bowl, then add the celery strips. Toss the celery to coat in the thyme oil and season, to taste, with salt and freshly ground black pepper.", "Heat a griddle pan until smoking. Place the celery strips onto the griddle and char for 1-2 minutes, until marked by the griddle and heated through.", "Place the celery chunks and remaining salad ingredients into a bowl and mix well.", "For the mayonnaise, place the egg yolks, mustard and white wine vinegar into a food processor and blend.", "With the processor still running, slowly pour in the sunflower oil and olive oil, drop by drop at first, then faster as the mixture thickens, alternating between the two oils as you go. Continue blending until all the oil is incorporated and a thick mayonnaise is formed. Transfer the mayonnaise to a clean bowl and season, to taste, with salt and freshly ground black pepper.", "To serve, add the mayonnaise to the bowl of salad and mix well. Place the salad mixture into the centre of each of four plates, top each with pieces of the walnut chicken and pieces of griddled celery."]}, {"isVegetarian": false, "title": "Warm anchovade with radishes, Caesar salad and devilled deep-fried whitebait", "url": "www_bbc_co_uk_food_recipes_warm_anchovade_with_47400", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 garlic bulb", "2 tbsp white wine", "1 tbsp Chardonnay vinegar", "1 tsp Dijon mustard", "1 egg, yolk only", "¼ tsp Worcestershire sauce", "50g/2oz marinated anchovies in oil", "35g/1¼oz parmesan cheese, grated", "75ml/2¾fl oz rapeseed oil", "1 thick slice country bread, cut into 5mm/¼in cubes", "2 tbsp extra virgin olive oil ", "1 sprig rosemary, leaves picked and finely chopped", "2 baby little gem lettuces, leaves separated", "50ml/2fl oz extra virgin olive oil", "4 garlic cloves, roughly chopped", "2 shallots, roughly chopped", "110ml/4fl oz white wine", "60g/2¼oz marinated anchovy fillets in oil, roughly chopped", "1 egg, yolk only", "110ml/4fl oz double cream", "freshly ground black pepper", "2 bunches English radishes, washed and trimmed", "vegetable oil, for deep-fat frying", "200g/7oz whole fresh anchovies", "300ml/½ pint milk", "75g/3oz plain flour", "1 tsp cayenne pepper, plus extra for seasoning", "sea salt", "1 lemon, juice only"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For Caesar salad, preheat the oven to 180C/360F/Gas 4½.", "Cut the top off of the garlic bulb and discard. Wrap the garlic bulb in aluminium foil and bake for about 20 minutes until the garlic is very soft.", "Remove from the oven and set aside until cool enough to handle.  Squeeze the roasted garlic into a small food processor.", "Add the white wine, Chardonnay vinegar, mustard, egg yolk, half the marinated anchovies, Worcestershire sauce and parmesan and blend to a fine purée.", "With the blender running, gradually trickle in the rapeseed oil until the mixture thickens and emulsifies. Season with salt and freshly ground black pepper.", "Place the bread cubes into a bowl with the olive oil, rosemary, salt and black pepper and toss well to combine.", "Heat a frying pan until hot, add the croutons in batches and cook for 2-3 minutes, turning frequently, until golden-brown and crisp.", "Toss the baby gem lettuce leaves with the hot croutons, the remaining marinated anchovies and a drizzle of dressing.", "For the anchovade, heat a frying pan over a medium heat until warm, then add the olive oil, garlic, shallots and white wine and cook for 1-2 minutes.", "Add the anchovies to the pan and cook for a further 1-2 minutes until the anchovies soften.", "Remove from the heat and blend the anchovy mixture with the egg yolk and cream in a food processor until it becomes a puree. Season with black pepper. ", "For the devilled anchovies, heat a deep fat fryer to 190C/375F, or alternatively heat some vegetable oil in a deep-sided, heavy-based pan, until a breadcrumb sizzles and turns golden-brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended).", "Rinse the anchovies then pat dry with kitchen paper.", "Soak the anchovies in the milk for a few minutes then drain.", "Mix the flour, cayenne and salt together in a bowl then toss the anchovies, a few at a time, in the flour.", "Place into the fat fryer in batches and fry for 1-2 minutes until crisp and golden-brown.", "Remove from the hot fat with a slotted spoon and drain onto kitchen paper. Season with salt, a little extra cayenne pepper, and a squeeze of lemon.", "To serve, pile the devilled anchovies onto a board. Spoon the warm anchovade into a small bowl and place alongside the anchovies, with the radishes. Finish with a little pile of Caesar salad on the same board."]}, {"isVegetarian": true, "title": "Warm cherry soup", "url": "www_bbc_co_uk_food_recipes_warm_cherry_soup_15890", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["900g/2lb cherries, stoned, half the stones reserved", "200ml/7fl oz water", "200ml/7fl oz red wine", "50ml/2fl oz port", "1 cinnamon stick", "1 strip lemon peel", "2 tbsp caster sugar", "2 tbsp cherry jam", "sea salt and freshly ground black pepper, for seasoning", "lemon juice, for seasoning"], "serves": "Serves 6 - 8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Crush the reserved cherry stones with a hammer or rolling pin and wrap them in a muslin bag. Place all the ingredients apart from the seasonings in a pan with the bag of cherry stones, bring to a boil and simmer for 5-6 minutes. ", "Remove the pan from the heat and set aside until just warm then remove the bag of cherry stones.", "Place the cherry mixture in a food processor and pulse until smooth. Pass the soup through a fine sieve into a bowl. Season with sea salt, freshly ground black pepper and lemon juice. The soup is best eaten just warm with a swirl of sour cream on top and a slice of walnut bread alongside."]}, {"isVegetarian": false, "title": "Warm chicken salad", "url": "www_bbc_co_uk_food_recipes_warm_chicken_salad_03629", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/warm_chicken_salad_03629_16x9.jpg", "ingredients": ["2 small chicken breasts, boned, skinned and cut in half", "calorie controlled cooking oil spray", "1 large orange or red pepper, deseeded and cut in to chunks", "1 little gem lettuce, leaves separated", "50g/1¾oz watercress, tough stalks removed", "2 ripe medium tomatoes, cut into small chunks", "⅓ cucumber, sliced", "1 tsp thick balsamic vinegar", "½ small lemon, juice only", "sea salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Season the chicken pieces on both sides with salt and pepper. Spray a large non-stick frying pan with oil and place over a high heat. Cook the chicken pieces for three minutes on each side or until lightly browned and cooked through. Transfer to a plate.", "Spray the pan with a little more oil and cook the pepper for three minutes on each side or until lightly charred and beginning to soften.", "Arrange the lettuce leaves, watercress, tomatoes, cucumber and pepper on two plates. ", "Slice the chicken breasts and scatter on top of salad. Drizzle with the balsamic vinegar and squeeze the lemon juice over. Season with black pepper and serve."]}, {"isVegetarian": false, "title": "Flambéed chicken liver salad", "url": "www_bbc_co_uk_food_recipes_warm_chicken_liver_salad_76381", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 slice white bread", "7 slices dry-cured streaky bacon", "400g/14oz chicken livers, sinews trimmed", "50ml/2fl oz brandy", "50ml/2fl oz double cream", "50g/1¾oz mangetout, sliced", "1 tbsp sherry vinegar", "2 handfuls rocket leaves", "salt and freshly ground black pepper"], "serves": "Serves 2-3", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a griddle pan over a high heat. Drizzle the oil all over the bread and toast on the griddle until golden-brown on both sides.", "Heat a frying pan over a medium heat. Add the bacon and dry-fry until golden-brown and crisp. Remove from the pan using tongs and set aside on a warm plate.", "Use the toast to soak up the bacon fat in the frying pan. Set the toast aside.", "Return the frying pan to a medium heat, add the chicken livers and fry for 2-3 minutes, or until browned and caramelised. ", "Increase the heat and pour the brandy over the livers, scraping any burned bits from the base and sides of the pan with a wooden spoon to deglaze (CAUTION: Keep your face and hair away from the flames. Do not leave unattended.) .", "Reduce the heat until the brandy is simmering. Add the cream, mangetout and sherry vinegar. Stir well and simmer for 1-2 minutes, or until the livers are cooked through. Season, to taste, with salt and freshly ground black pepper.", "To serve, pile the rocket into serving bowls, then cut the toast into croûtons and sprinkle them over the rocket. Chop the bacon and sprinkle it on top. Spoon over the chicken livers and their sauce. Serve immediately."]}]