[{"ingredients": ["6 papas nuevas, preferiblemente Charlotte, Ratte y trufa", "sal", "30ml / 1¼fl oz de aceite de oliva, más extra para lloviznar", "1 chalote de plátano, muy finamente picado", "25ml / 1fl oz de vinagre chardonnay", "2 ramitas de tomillo, solo hojas", "1 porción de hojas de verano (p. Ej., Cohete, acedera, hoja de diente de león, hoja de acelga roja)"], "method": ["Coloque las papas en una sartén con agua hirviendo con sal y cocínelas durante 15 minutos o hasta que estén tiernas al perforarlas con la punta de un cuchillo. Escurrir y dejar enfriar durante 2-3 minutos.", "Calentar 10 ml del aceite de oliva en una sartén y freír la chalota por unos minutos hasta que esté suave y transparente. Agregue el vinagre. Cocine hasta que se haya reducido a la mitad. Retire la sartén del fuego y agregue el aceite de oliva restante y las hojas de tomillo.", "Para servir cortar las papas y esparcirlas en un plato grande. Vierta las hojas de la ensalada con un poco del aderezo de chalota y vierta el resto sobre las papas. Coloque las hojas de ensalada encima de las papas."], "url": "www_bbc_co_uk_food_recipes_warmpotatosaladwiths_86599", "title": "Ensalada de papas calientes con aderezo de chalota", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/warmpotatosaladwiths_86599_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["pan de ciabatta", "1 pimiento rojo", "1 pimiento amarillo", "1 berenjena", "1 calabacín", "registro de queso de cabra", "aceite de oliva virgen extra", "albahaca fresca", "290ml / ½ pinta de aceite de oliva virgen extra", "100ml / 3½fl oz de vinagre balsámico", "1 diente de ajo, rebanado", "3 ramitas de tomillo", "10 hojas de albahaca"], "method": ["Mezcle todos los ingredientes del adobo en un tazón grande.", "precaliente el horno a 160 ° C / 325 ° F / Gas 3. Tome una bandeja de asar y cúbrala con un trozo de papel de aluminio lo suficientemente grande para cubrir y cubrir los pimientos.", "Coloque los pimientos en la bandeja, sazone con sal y pimienta y vierta un poco de aceite de oliva sobre los pimientos. Ciérrelos en papel de aluminio y colóquelos en el horno durante 20 minutos, volteándolos de vez en cuando.", "Una vez cocinado, retíralo de la bandeja, colócalo en un recipiente y cúbrelo con una película adhesiva. Una vez frío, pela y lava las semillas. Cortar en triángulos grandes, pero parejos y colocar en el adobo.", "Cortar los calabacines y las berenjenas en rondas de 5 mm / ¼ de grosor (si las berenjenas son muy gruesas, primero córtelos por la mitad).", "Usando una sartén de plancha caliente, rehogar los calabacines y las berenjenas con un poco de aceite de oliva y sazonar con sal y pimienta. Cocine ambos lados y luego colóquelos en el adobo con los pimientos.", "Cortar el pan de chapata en rebanadas gruesas. Cepille con aceite de oliva y tueste por ambos lados hasta que estén dorados. Ahora cubra con verduras provenzales y rebanadas de queso de cabra.", "Coloque bajo una parrilla moderada y cocine hasta que el queso se haya derretido y coloreado ligeramente. Retire la piel exterior si lo desea y sírvala con una ensalada."], "url": "www_bbc_co_uk_food_recipes_warmprovencalvegetab_13151", "title": "Cálidas verduras provenzales con queso de cabra derretido sobre pan tostado de chapata", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 4 como entrante", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 calabaza pequeña, como Baby Bear o calabaza de cebolla, pelada, sin semillas, cortada en cubos", "50ml / 2fl oz de aceite vegetal", "1 cucharada de semillas de nigella", "sal y pimienta recién molida", "100ml / 3½ fl oz de miel clara", "75ml / 2¾fl oz de vinagre de sidra", "Nueces 150g / 5½oz picadas", "puñado de hojas frescas de berro", "1 chalote, pelado, finamente cortado", "125 g / 4½ oz de queso feta, desmenuzado, para servir"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Coloque la calabaza en una bandeja de asar. Rocíe el aceite vegetal, espolvoree sobre las semillas de nigella, y sazone al gusto con sal y pimienta negra recién molida. Asar durante 20-25 minutos o hasta que estén blandos.", "Mientras tanto, caliente la miel y el vinagre de sidra en una sartén pequeña a fuego medio, o hasta que se disuelva. Agregue las nueces hasta que estén bien combinadas.", "Mezcle las hojas de berro, chalote, calabaza asada y semillas de calabaza hasta que estén bien combinadas. Rocíe la mezcla de miel y vinagre y revuelva hasta que las hojas estén cubiertas con el aderezo. Espolvorea sobre el queso feta desmenuzado."], "url": "www_bbc_co_uk_food_recipes_warmpumpkinandwalnut_92834", "title": "Ensalada templada de calabaza y nuez", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Pan rallado blanco de 110g / 4oz", "50g / 2oz de Pecorino Romano, finamente rallado (o parmesano)", "25g / 1oz de mantequilla, derretida", "pimienta negra recién molida", "3 huevos, golpeados", "225g / 8oz de cuajada media de queso", "110g / 4oz de queso fresco", "175g / 6oz Roquefort", "1 cucharada de cebollines, cortados", "4 cebolletas, finamente cortadas en cubitos", "sal y pimienta negra recién molida (al gusto)", "4 peras, firmes pero maduras", "1 diente de ajo, pelado", "1 cucharadita de sal marina", "1 cucharadita de mostaza en polvo", "1 cucharada de vinagre balsámico", "4 cucharadas de aceite de oliva virgen extra", "pimienta negra recién molida"], "method": ["Precaliente el horno a 190 ° C / 375 ° F / Gas 5. Primero, haga la base de la tarta de queso mezclando las migas de pan y el queso Pecorino Romano, luego vierta la mantequilla y agregue una buena molienda de pimienta.", "Presione la mezcla de migas con firmeza por toda la base de la lata, luego cocine en el horno precalentado durante 10-15 minutos. (Esta vez variará levemente, por lo que se necesita una observación cuidadosa; el objetivo es que la base esté crujiente y tostada. Si no está bien cocida, no tiene la deliciosa textura crujiente tan necesaria para la tarta de queso terminada). Luego quítela de la base. el horno y baje el fuego a 180C / 350F / Gas 4.", "Ahora haz el relleno. Primero, mezcle los huevos y el queso cuajado en un tazón, luego agregue el queso fresco y el condimento. Después de eso, desmenuzar el Roquefort bastante toscamente y mezclarlo con las cebolletas. Vierta la mezcla en la lata y esparza la cebolla picada sobre la parte superior, luego colóquela en el estante alto del horno y hornee durante 30-40 minutos o hasta que el centro se sienta elástico al tacto. Permita que la tarta de queso se enfríe y caliéntese durante unos 20 minutos antes de servir cortado en rodajas.", "Las peras en vinagreta balsámica se pueden preparar hasta dos horas antes de servir. Corta suavemente las pieles de las peras usando un pelador de patatas y teniendo cuidado de dejar los tallos intactos. Ahora coloque cada pera de lado con el tallo plano sobre una tabla, luego tome un cuchillo muy filoso y haga una incisión a través de la punta del tallo. Gire la pera hacia arriba y suavemente córtela por la mitad, primero deslice el cuchillo por el tallo y luego a través de la pera.", "Ahora retire el núcleo central de cada mitad, luego, con el lado del núcleo de pera hacia abajo, corte en rodajas finas pero deje las rodajas unidas en la parte superior. Presione suavemente y las rebanadas se desplegarán.", "Prepare la vinagreta aplastando el diente de ajo y la sal del mar junto con un mortero y un mortero hasta que se convierta en una pasta cremosa. Ahora agregue la mostaza y varias moliendas de pimienta negra. Trabaja estos en el ajo, luego, con un batidor pequeño, agrega el vinagre balsámico y luego el aceite, batiendo todo el tiempo para amalgamar. Sirva una mitad de pera con cada porción de la tarta de queso, con un poco de vinagreta."], "url": "www_bbc_co_uk_food_recipes_warmroquefortcheesec_67093", "title": "Tarta de queso roquefort caliente con peras en vinagreta balsámica", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva, más extra para lloviznar", "2 rebanadas de pan blanco, desgarrado", "sal y pimienta negra recién molida, al gusto", "85g / 3oz de queso feta, desmenuzado", "100g / 3½oz de brócoli, cortado en florecillas", "70g / 2½oz de tomates cherry", "1 cucharada de vinagre balsámico"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Calentar el aceite de oliva en una sartén. Agregue el pan desmenuzado y fríalos durante cinco minutos o hasta que estén dorados. Sazone con sal y pimienta negra recién molida, al gusto, y coloque en un tazón grande con el queso feta.", "Hervir los floretes de brócoli en agua hirviendo con sal durante cuatro minutos, o hasta que estén recién cocidos. Escurrir y agregar a la mezcla en el tazón grande.", "Para los tomates, coloque los tomates cherry en una bandeja para hornear con una pizca de aceite de oliva. Sazone con sal y pimienta negra recién molida y tueste en el horno durante diez minutos.", "Agregue los tomates al tazón con una cucharada de vinagre balsámico y un chorrito de aceite de oliva. Mezcle bien y luego cuchara sobre un plato de servir."], "url": "www_bbc_co_uk_food_recipes_warmsaladofbroccolic_86840", "title": "Ensalada templada de brócoli, tomates cherry, queso feta y crujientes croûtons", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 pimiento rojo", "aceite de oliva", "1 cucharada de vinagre balsámico", "sal y pimienta negra recién molida", "225 g / 8oz de papas nuevas cocidas", "1 cucharada de mostaza de grano", "1 ramita de romero fresco, picado", "85g / 3oz gruyère (o raclette) queso, rallado", "½ cabeza de lechuga rizada", "Cinta adhesiva de 60g / 3oz", "unas ramitas de albahaca fresca", "1 x 400/14 oz tarro de tomates secados al sol en aceite", "1 cucharada de alcaparras", "filetes de anchoa en conserva", "1 cucharada de pesto", "1 cucharada de granos de pino", "sal y pimienta negra recién molida", "aceite de oliva, si es necesario"], "method": ["Precalentar el horno a 200c / 400F / Gas 6.", "Corte el pimiento rojo por la mitad, quite las semillas y el tallo y coloque el corte hacia abajo en una bandeja para hornear.", "Rocíe con aceite de oliva y hornee hasta que se doren, alrededor de 15-20 minutos.", "Retire de la sartén y colóquelo en un recipiente. Cubra con una película adhesiva y déjela enfriar.", "Cuando esté frío, quítele la piel y corta la carne.", "Mezcle los dados con seis cucharadas de aceite de oliva, el vinagre y un poco de aderezo para hacer el aderezo.", "Cortar las papas en dados (mantener las pieles) y colocar en un bol con la mostaza, un poco más de aderezo y el romero fresco picado.", "Coloque en un microondas durante aproximadamente 30 segundos.", "Presione la mezcla en anillos redondos de acero de 4 x 5 cm / 2 pulgadas y colóquela en una bandeja para hornear.", "Cubra con el queso y colóquelo debajo de la parrilla para dorar la parte superior. (Si no tiene un microondas, coloque las albóndigas llenas de papas en un horno tibia para calentar las papas y lentamente derrita el queso).", "Para tapenade, coloque todos los ingredientes en un procesador de alimentos, excepto el aceite de oliva (incluya el aceite de los tomates); si necesita más para unir la mezcla, agregue más aceite de oliva.", "Coloque una pequeña pila de hojas de frisée en el medio de cada plato.", "Coloque el anillo de papa en la parte superior y agregue la tapenade.", "Cuchara alrededor del aderezo de pimiento rojo y servir."], "url": "www_bbc_co_uk_food_recipes_warmsaladofnewpotato_74710", "title": "Ensalada templada de patatas nuevas y queso gruyere", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ pimiento rojo, semillas eliminadas, descuartizado", "aceite de oliva, para lloviznar", "Tocino pancetta 70 g / 2½ oz", "1 aguacate, piedra removida, pelada y picada", "2 cucharaditas de vinagre balsámico", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "2 rebanadas de pan blanco rústico, toscamente cortadas en trozos del tamaño de un bocado", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para el pimiento rojo asado, coloque el pimiento rojo en una bandeja para hornear y rocíe con aceite de oliva. Transfiera al horno y tueste durante 8-10 minutos, o hasta que esté ligeramente chamuscado. Retire del horno y pique aproximadamente.", "Para la ensalada, caliente una sartén y fríe los pancetta lardons hasta que estén dorados y crujientes. Retire de la sartén con una espumadera y escurra sobre papel de cocina.", "Coloque la panceta fresca en una ensaladera con los trozos de aguacate picado y pimienta asada. Rocíe el vinagre balsámico y el aceite de oliva, sazone al gusto con sal y pimienta negra recién molida y revuelva.", "Para los crotones, coloque el pan en un tazón grande, rocíe sobre el aceite y revuelva para cubrir. Sazonar bien con sal y pimienta negra recién molida.", "Extienda las piezas de pan en una bandeja para hornear, transfiéralas al horno y hornee durante cinco minutos, o hasta que estén doradas y crujientes.", "Para servir, espolvoréalos sobre la ensalada."], "url": "www_bbc_co_uk_food_recipes_warmsaladofpancettaa_85989", "title": "Ensalada templada de panceta, aguacate y pimiento rojo asado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cabeza de achicoria grande", "1 cucharada de vinagre de Jerez", "30g / 1oz de mantequilla", "sal y pimienta negra recién molida", "2 cucharaditas de azúcar en polvo", "pequeñas avellanas o nueces, sin cáscara", "4 x pechos de paloma de madera", "sal y pimienta negra recién molida", "25g / 1oz de mantequilla", "¾ cucharada de aceite de nuez", "1 cucharada de vinagre de Jerez", "1 cucharadita de mostaza Dijon", "sal y pimienta negra recién molida", "1 pequeño puñado de lechuga de hoja de roble y lechuga frisée", "2 nueces en escabeche, finamente rebanadas"], "method": ["Precalentar el horno a 230C / 445F / Gas 8.", "Alinee una bandeja para hornear con un pergamino para hornear.", "Recorte la achicoria, quitando las hojas marrones, pero no corte el tallo en la parte inferior, porque esto mantiene unida la achicoria. Cortar la achicoria por la mitad a lo largo, luego cortar cada mitad en cuatro partes iguales a lo largo. Coloque la achicoria en la bandeja para hornear y rocíe con el vinagre de jerez.", "Apunte la achicoria generosamente con pequeños panecillos de mantequilla y sazone bien con sal y pimienta negra recién molida.", "Espolvoree la achicoria con azúcar en polvo y cocine en el horno durante 15 minutos.", "Controle la achicoria después de 15 minutos. Si ha empezado a dorarse, voltéela en la mantequilla derretida y vuelva a colocarla en el horno. De lo contrario, deje cocinar durante 4-5 minutos más antes de encender.", "Cuando la achicoria esté casi dorada por todas partes, coloque las avellanas o nueces para la ensalada en una bandeja para hornear y tueste durante 3-4 minutos. Retire y deje enfriar, luego corte aproximadamente.", "Sazonar los pechugas de paloma con sal y pimienta negra recién molida.", "Derrita la mantequilla en una sartén a fuego medio. Agregue las pechugas de paloma y cocínelas durante 2-3 minutos, hasta que se doren, luego voltéelas y cocine por otros 2-3 minutos, o hasta que estén cocidas a su gusto. Reserve para descansar durante 3-4 minutos, luego talle cada pechuga de paloma en cuatro rebanadas.", "Para el aderezo, coloque el aceite de nuez, el vinagre y la mostaza en un tazón y mezcle bien. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, coloque las hojas de lechuga mezcladas en un recipiente y agregue la achicoria. Mezcle suavemente, luego agregue la misma cantidad de ensalada en cada plato.", "Coloque una rebanada de pechuga de paloma en cada ensalada y rocíe con el aderezo. Espolvoree cada ensalada con la misma cantidad de nueces encurtidas en rodajas y las nueces tostadas picadas."], "url": "www_bbc_co_uk_food_recipes_warmsaladofpigeonroa_89885", "title": "Ensalada templada de paloma, achicoria tostada y nueces encurtidas", "time": {"preparation": "", "preparationMins": 0, "cooking": "", "cookingMins": 0, "totalMins": 0}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ pimienta romero, sin semillas", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "1 cucharada de mostaza integral", "2 cucharadas de vinagre de vino tinto", "100g / 3½oz Tentedtem brócoli, blanqueado y escurrido", "½ tomate de ciruela en rodajas", "2 cucharadas de perifollo fresco picado"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Coloque la mitad de la pimienta en una bandeja para hornear, rocíe con aceite de oliva y sazone bien con sal y pimienta negra recién molida.", "Transfiera la pimienta al horno y tueste durante diez minutos o hasta que esté tierna.", "Mezcle la mostaza y el vinagre en un tazón grande. Pique el brócoli en trozos de 2cm / 1in y agregue al tazón.", "Cortar el pimiento picante en rodajas y agregar al tazón, junto con el tomate y el perifollo en rodajas. Mezclar bien.", "Para servir, coloque la ensalada en un plato de servir."], "url": "www_bbc_co_uk_food_recipes_warmsaladofroastedpe_87209", "title": "Ensalada templada de pimiento asado, brócoli y tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["175g / 6oz demerara azúcar", "Arroz de grano largo de 175g / 6oz", "hojas de 14 bolsitas de té", "aceite de oliva, a llovizna", "4 x 330-350 g / 11½-12½ oz de trucha fresca, sin cabeza", "sal y pimienta negra recién molida", "100ml / 3½fl oz de caldo de pescado", "100ml / 3½ fl oz crema doble", "2 cucharadas de salsa de rábano picante a la crema, de un tarro", "100ml / 3½fl oz de sidra", "sal y pimienta negra recién molida", "Tocino rayado ahumado de 225 g / 8 oz, sin corteza", "25g / 1oz de mantequilla", "1 manzana Golden Delicious, en rodajas finas", "200g / 7oz de lechuga rizada, desgarrada", "4 cucharadas de perejil picado", "2 cucharadas de cebollines picados", "aceite de oliva virgen extra, a llovizna"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para la trucha ahumada con té, coloque el azúcar, el arroz y las hojas de té en un tazón y mezcle. Alinee un wok con papel de cocina de alta resistencia y vierta la mezcla en la parte superior. Cubra con otra capa de papel de aluminio, rocíe sobre aceite de oliva y coloque la trucha encima. Sazonar con sal y pimienta negra recién molida, luego cubrir con otra hoja de papel de aluminio, sellando herméticamente alrededor de los bordes. Coloque sobre la placa a fuego moderado y deje la trucha para que fume por unos minutos. Dejar de lado. (PRECAUCIÓN: fumar té genera mucho humo. Cocine en un área bien ventilada).", "Para el aderezo, lleve el caldo a ebullición en una cacerola y continúe hirviendo, sin tapar, hasta que se reduzca a la mitad. Deja enfriar.", "Batir la crema hasta que se formen picos duros, luego incorporar el rábano picante a la crema, el caldo de pescado y la sidra enfriados. Sazone al gusto con sal y pimienta negra recién molida.", "Para la ensalada, coloque el tocino en una bandeja para hornear y cocine en el horno hasta que estén crujientes.", "Mientras tanto, caliente la mantequilla en una sartén y cocine las rebanadas de manzana hasta que estén suaves y doradas.", "Retire el tocino del horno y, cuando esté suficientemente frío para manipularlo, divídalo en trozos del tamaño de un bocado.", "Arregle la lechuga frisée en platos para servir. Extienda el tocino encima, rocíe sobre el aderezo y luego espárzalos sobre las rodajas de manzana y las hierbas picadas. Ponga una cuchara sobre el resto del aliño y cubra con la trucha ahumada. Rocíe con un poco de aceite de oliva y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_warmsaladofteasmoked_81088", "title": "Ensalada templada de trucha ahumada con tocino crujiente, frisée y rábano picante", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite vegetal liviano, más un poco más para cepillar", "1 budín negro, cortado en 1cm / ½ en rodajas gruesas", "12 vieiras de rey", "sal y pimienta recién molida", "55g / 2oz de mantequilla sin sal", "6 cebollas de primavera, finamente rebanadas", "175g / 6oz de guisantes congelados", "1 cucharadita de azúcar en polvo de oro", "300ml / ½ pinta de caldo de verduras", "2 cucharadas de hojas de menta fresca, picadas", "150ml / 5¼fl oz de crema doble", "ramitas de menta fresca, para adornar", "vinagre de Jerez, hervido hasta reducir a la mitad, para decorar"], "method": ["Para el puré de guisantes y menta, caliente una sartén mediana antiadherente y derrita la mitad de la mantequilla hasta que esté caliente y espumosa. Agregue las cebolletas y cocine hasta que estén suaves.", "Agregue los guisantes, el azúcar impalpable, el caldo y la mantequilla restante y mezcle. Coloque un círculo de papel resistente a la grasa sobre la parte superior de la mezcla y deje que sude durante aproximadamente 4-5 minutos.", "Retire el papel y agregue las hojas de menta y la crema. Cocine por otro minuto hasta que todo el líquido se haya evaporado.", "Transfiera a un procesador de alimentos y mezcle hasta que quede casi liso, dejando algo de textura en la mezcla. Dejar de lado hasta que esté listo para usar.", "Para las vieiras y la morcilla, caliente el aceite vegetal en una sartén y fríe con cuidado las rodajas de morcilla hasta que estén crujientes. Sacar de la sartén y mantenga caliente.", "Cepille ligeramente una sartén de base pesada con un poco de aceite vegetal extra y colóquelo a fuego alto hasta que esté muy caliente.", "Sazone las vieiras con un poco de sal y luego colóquelas en la sartén caliente y cocínelas durante un minuto en cada lado, hasta que se doren. Retire de la sartén.", "Coloque una cucharada generosa del puré de menta en cada uno de los cuatro platos calientes.", "Coloque las vieiras y las rebanadas de pudín negro en capas superpuestas sobre el puré.", "Rocíe la reducción de vinagre de jerez sobre la ensalada de vieiras templadas y sirva inmediatamente, espolvoreado con menta fresca."], "url": "www_bbc_co_uk_food_recipes_warmsaladofscallopsb_79287", "title": "Ensalada templada de vieiras, morcilla y puré de menta y guisantes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 rebanadas de pan blanco", "2 cucharadas de hojas de perejil fresco picado", "sal y pimienta negra recién molida", "Filete de salmón de 85 g / 3 oz, sin piel", "1 cucharada de aceite de oliva", "1 cucharada de mantequilla", "1 limón, solo jugo", "3 cucharadas de aceite de oliva", "3 cucharadas de hierbas frescas mezcladas picadas", "sal y pimienta negra recién molida", "3 lanzas de espárragos, extremos leñosos retirados, divididos longitudinalmente y blanqueados", "1 zanahoria, rallada", "1 puñado de piñones, tostados"], "method": ["Para el salmón, coloque el pan, el perejil, la sal y la pimienta negra recién molida en un procesador de alimentos y pulse hasta que la mezcla se asemeje a pan rallado. Transfiera a un plato, luego enrolle el filete de salmón en la mezcla hasta que esté bien cubierto. Pat ligeramente para asegurar las migas de pan al pescado, luego sacuda suavemente cualquier exceso.", "Calentar el aceite de oliva y la mantequilla en una sartén y freír el salmón durante 3-4 minutos en ambos lados, o hasta que se dore por todas partes y cocinar a su gusto.", "Para el aderezo, combine todos los ingredientes del aderezo en un tazón y condimente, al gusto, con sal y pimienta negra recién molida.", "Para servir, coloque la zanahoria rallada en un plato de servir y coloque el salmón encima. Coloque los espárragos blanqueados al lado, rocíe sobre el aderezo y espolvoree sobre los piñones."], "url": "www_bbc_co_uk_food_recipes_warmsaladofwildsalmo_90017", "title": "Ensalada templada de salmón salvaje con una hierba y aderezo de limón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 pechos regordetes de paloma de madera, desollados", "Larrones de cerdo ahumado a la barriga de 200g / 7oz (pancetta o incluso Ayrshire)", "2 patatas nuevas, cocidas, peladas y en rodajas", "3 puñados de una selección de hojas de ensalada (por ejemplo, roccolla, mache, endibia)", "Aceite de nuez 100ml / 3½ oz", "1 cucharada de vinagre de vino tinto", "1 cucharadita de mostaza dijon", "50ml / 2oz de aceite de oliva virgen extra", "algunas ramitas de tomillo", "unos dientes de ajo", "sal marina y pimienta negra recién molida", "100ml / 3½ oz de aceite de oliva para cocinar"], "method": ["Freír los lardon en la mitad del aceite de oliva hasta que estén crujientes y luego dejar de lado.", "En la misma sartén, agregue un poco más de aceite y fríe las papas, reservar con los lardons en un lugar cálido.", "En un tazón, combine la mostaza con el aceite de oliva virgen extra, el aceite de nuez y el vinagre de vino tinto.", "En la sartén, caliente el resto del aceite de oliva y cocine los pechugas con el ajo y el tomillo, revolviéndolos y condimentándolos mientras cocinan. Los senos no toman mucho tiempo, 2-3 minutos por cada lado máximo. Cúbralo y déjelo descansar.", "Combine las hojas de ensalada, ¾ del aderezo, lardons, papas y condimentos en un tazón grande y sirva en cuatro platos grandes.", "Corte las pechugas de paloma en rodajas finas y coloque la ensalada. Espolvorea un poco de sal marina y el resto del aderezo. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_warmsaladofwoodpigeo_12132", "title": "Ensalada templada de paloma torcaz, tocino, papas y aderezo de aceite de nuez", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["25g / 1oz de mantequilla", "Filete de salmón 150 g / 5½ oz", "1 naranja, descuartizado", "1 limón, solo jugo", "Pizca de canela", "pizca de copos de chile", "1 cucharadita de azúcar moreno", "1 cucharadita de vinagre balsámico", "sal y pimienta negra recién molida", "150 g / 5½ oz espinacas", "2 cucharadas de aceite de oliva", "½ limón, solo jugo"], "method": ["Para el salmón, derrita la mantequilla en una sartén pequeña, coloque el salmón en la sartén junto con todos los demás ingredientes de salmón y cocínelo durante 3-4 minutos por cada lado, o hasta que esté completamente cocido. Retire el salmón de la sartén y haga copos en pedazos.", "Regrese la sartén al fuego y cocine a fuego lento la salsa que queda en la sartén durante 4-5 minutos, hasta que se reduzca, exprimiendo el jugo de los cuartos de naranja con el reverso de una cuchara.", "Para la ensalada, coloque la espinaca, el aceite de oliva y el jugo de limón en un tazón grande y mezcle bien.", "Para servir, coloque la ensalada en un plato, cubra con el salmón copos y vierta sobre la salsa de la sartén."], "url": "www_bbc_co_uk_food_recipes_warmsalmoncitrussala_85523", "title": "Ensalada de cítricos de salmón caliente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["250 g / 9 oz de espinaca baby", "½ chile rojo, sin semillas y en rodajas", "1 chalote pequeño, pelado y finamente picado", "3 cucharadas de aceite de oliva virgen extra", "½ limón, solo jugo", "4 rebanadas de tocino rayado, picadas", "1 cucharada de semillas de sésamo"], "method": ["Coloque la espinaca, el chile, la chalota, el aceite de oliva y el jugo de limón en un tazón grande y mezcle bien para cubrir todas las hojas de espinaca.", "Calentar una sartén hasta que esté caliente y agregar el tocino picado. Cocine por 2-3 minutos hasta que estén crujientes y doradas. Retire el tocino de la sartén y escurra sobre papel de cocina.", "Para servir, agregue el tocino caliente y las semillas de sésamo al bol de ensalada de espinacas y mezcle bien. Coloque la ensalada en un plato limpio."], "url": "www_bbc_co_uk_food_recipes_warmspinachandbacons_84604", "title": "Ensalada caliente de espinaca y tocino", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["125 g / 4½ oz de espinaca", "100g / 3½oz de queso de cabra", "2 cucharaditas de pimienta negra molida", "2 cucharadas de piñones, tostados", "Frambuesas 55g / 2oz", "1 cucharada de vinagre balsámico", "3 cucharadas de aceite de oliva"], "method": ["Precalentar la parrilla a mediano.", "Coloque la espinaca en una sartén tibia y revuelva a fuego lento hasta que se marchite. Drene el exceso de agua y luego apile en un plato para servir.", "Corte el queso de cabra a la mitad por el medio. Ruede cada círculo de queso en la pimienta negra molida.", "Coloque el queso de cabra en una hoja de papel de aluminio en una bandeja para hornear. Coloque debajo de la parrilla durante 3-4 minutos o hasta que comience a derretirse.", "Coloque el queso de cabra caliente encima de la espinaca y esparza sobre los piñones tostados.", "Para el aderezo, coloque las frambuesas, el vinagre balsámico y el aceite de oliva en un mini procesador de alimentos y mezcle hasta que quede suave.", "Vierta el aderezo sobre el queso de cabra y sirva."], "url": "www_bbc_co_uk_food_recipes_warmspinachandgoatsc_88004", "title": "Ensalada templada de espinacas y queso de cabra con vinagreta de frambuesa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["85g / 3oz de espinaca", "1 cucharada de vinagre balsámico", "3 cucharadas de aceite de oliva", "2 lonchas de tocino rayado ahumado, picado", "85 g / 3 oz de champiñones castaños", "2 rebanadas de chapata tostada", "70g / 2½oz Port Hi queso"], "method": ["Precalentar la parrilla a mediano.", "Para la ensalada, coloque las espinacas en un tazón grande, rocíe sobre el vinagre balsámico y el aceite de oliva y revuelva para cubrir las hojas.", "Calentar una sartén y freír el tocino durante 3-4 minutos, hasta que estén crujientes. Agregue los champiñones y fría por 3-4 minutos. Agregue el tocino y los champiñones al tazón con la espinaca y mezcle bien.", "Para la tostada de queso, coloque las rebanadas de pan ciabatta tostado en una bandeja para hornear, cubra con el queso y la parrilla hasta que el queso burbujee y se derrita.", "Para servir, coloque la ensalada en un plato para servir y cubra con la tostada de queso."], "url": "www_bbc_co_uk_food_recipes_warmspinachmushrooma_86241", "title": "Ensalada templada de espinacas, champiñones y tocino con tostadas de queso y aderezo de vinagre balsámico", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["85g / 3oz de chorizo, en rodajas", "85g / 3oz de patatas nuevas cocidas en conserva, reducidas a la mitad", "100 g / 3½ oz de espinaca", "2 cucharaditas de mostaza integral", "dash vinagre de vino blanco", "sal y pimienta negra recién molida", "3 cucharadas de aceite de oliva"], "method": ["Para la ensalada, caliente una sartén y fría el chorizo ​​hasta que se dore por todos lados. Retire de la sartén con una espumadera y déjelo a un lado.", "Agregue las papas a la sartén y freír hasta que estén doradas por todos lados. Regrese el chorizo ​​a la sartén y caliente suavemente.", "Mientras tanto, para el aderezo, coloque todos los ingredientes del aderezo en un tazón pequeño y agítelos para combinarlos.", "Coloque la espinaca en un tazón grande y espolvoree sobre el chorizo ​​caliente y las papas. Vierta sobre el aderezo y revuelva bien.", "Para servir, coloca la ensalada en platos para servir."], "url": "www_bbc_co_uk_food_recipes_warmspinachchorizoan_85888", "title": "Ensalada templada de espinacas, chorizo ​​y patatas con aderezo de mostaza", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6 cucharadas de aceite de oliva", "½ batata, pelada y en cubos", "1 tomate de vaca, cortado por la mitad", "sal y pimienta negra recién molida", "Hojas de espinaca 115 g / 4 oz", "2 cucharadas de vinagre balsámico", "2 cucharadas de frijoles cocidos (enjuague y escurra si usa frijoles enlatados)"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Caliente dos cucharadas de aceite en una sartén a fuego medio. Agregue los cubos de batata y fríalos durante aproximadamente 3-4 minutos, o hasta que comiencen a colorear.", "Agregue las mitades de tomate a la sartén, revuelva para cubrir con aceite, sazone bien con sal y pimienta negra recién molida, y transfiera al horno. Cocine por 7-10 minutos.", "Calienta dos cucharadas más de aceite en la sartén a fuego suave. Agregue la espinaca y cocine por 1-2 minutos hasta que se marchite.", "Rocíe una cucharada de vinagre sobre la espinaca cocida y revuelva.", "Ponga el vinagre y el aceite restante en una sartén por separado, no reactiva a fuego medio. Agregue los frijoles y cocine por 2-3 minutos hasta que estén calientes.", "Para servir, coloque la espinaca marchita en el centro de un plato para servir y coloque las mitades de tomate asadas y los cubos de batata en la parte superior. Coloque los frijoles y la salsa balsámica en el borde."], "url": "www_bbc_co_uk_food_recipes_warmspinachsaladwith_89338", "title": "Ensalada de espinaca caliente con tomates a la parrilla, batatas asadas y frijoles balsámicos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["mantequilla, para engrasar", "harina común, para quitar el polvo", "500g / 1lb 2oz de masa dulce lista para usar", "400ml / 14fl oz de jarabe dorado", "125g / 4½oz de pan rallado fresco", "2 huevos de gallinas camperas, ligeramente golpeados", "1 limón, ralladura y jugo", "150ml / 5fl oz de crema doble, ligeramente azotada", "ramitas de menta fresca"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para la caja de pastelería, engrase ligeramente una lata agria de fondo suelto de 25 cm / 10 pulgadas.", "Sobre una superficie ligeramente enharinada, extender la masa y utilizar para revestir la lata de tarta.", "Cubra la masa con una película adhesiva y colóquela en la nevera para que repose durante 15 minutos.", "Retire la masa de la nevera y retire la película adhesiva. Alinee la caja de pastelería con papel resistente a la grasa y llénela con alubias para hornear.", "Transfiera al horno y hornee por 10-15 minutos.", "Retire la caja de pastelería del horno y retire el papel a prueba de grasa y los frijoles para hornear. Vuelva al horno por 3-5 minutos más.", "Retire la caja de repostería del horno y baje la temperatura del horno a 140C / 275F / Gas 1.", "Para el relleno, coloque el almíbar dorado, las migas de pan, los huevos batidos y el jugo de limón y la ralladura en un bol y mezcle bien.", "Vierta la mezcla de relleno en la caja de tartas, transfiérala al horno y hornee por 50 minutos a 1 hora o hasta que se dore. Retirar del horno y dejar enfriar un poco.", "Para servir, coloque las rodajas de la tarta en platos para servir con una cucharada de crema batida y menta fresca, para adornar."], "url": "www_bbc_co_uk_food_recipes_warmtreacletartwiths_85139", "title": "Tarta de mela caliente con crema batida", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]