[{"ingredients": ["1 cucharada de aceite de oliva", "1 cebolla, finamente picada", "1 diente de ajo", "3 tallos de apio, finamente picados", "200g / 7oz de hongos portobello / shiitake, picados", "2 chiles verdes, picados", "100g / 3½ oz de puré de tomate", "1 cucharadita de cacao en polvo (opcional)", "150ml / 5fl oz de caldo de verduras", "2 x 400 g de alubias en conserva, o frijoles mezclados, enjuagados y escurridos", "sal y pimienta negra recién molida", "12 conchas de taco listas para usar, calentadas", "Queso Monterey Jack de 150 g / 5oz (o queso cheddar suave), rallado", "2 cucharadas de cilantro fresco picado (opcional)", "200 ml / 7 fl oz oz yogur"], "method": ["Calentar el aceite en una sartén a fuego medio. Freír la cebolla, el ajo y el apio hasta que estén suaves.", "Agregue los champiñones y los chiles y cocine por un minuto. Agregue el puré de tomate y cocine durante 2-3 minutos más. Cuando los champiñones estén blandos, agregue el polvo de cacao (si está usando) y caliéntelos y deje que hiervan.", "Reduzca el fuego y cocine a fuego lento durante 15 minutos, luego agregue los frijoles y cocine durante 10-12 minutos más, o hasta que la salsa se haya reducido y los frijoles estén bien calientes.", "Para servir, coloque 2-3 cucharadas de chile en cada taco. Cubra con el queso rallado, el cilantro picado (si se usa) y una cucharada de yogur y ponga los platos."], "url": "www_bbc_co_uk_food_recipes_vegetarianchillitaco_86478", "title": "Tacos de chile vegetariano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/vegetarianchillitaco_86478_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500g / 1lb 2oz de patatas harinas, como King Edward o Maris Piper, peladas, cortadas en pedazos", "300g / 10½ oz chirivías o colinabo, peladas, cortadas en trozos, hervidas hasta que estén tiernas, escurridas", "botón de mantequilla", "salpicar leche", "sal y pimienta negra recién molida", "1 cucharada de aceite de colza o de cacahuete", "1 cebolla, pelada, finamente picada", "1 diente de ajo, pelado, aplastado hasta formar una pasta con el filo de un cuchillo", "1 zanahoria grande, pelada, finamente picada", "1 puerro, cortado, en rodajas finas", "2 cucharaditas de hojas de tomillo fresco picado", "300g / 10½oz Quorn", "1 x 400 g / 14 oz pueden frijoles cannellini, drenados y enjuagados", "1 x 400 g / 14 oz pueden cortar tomates", "1 cucharada de puré de tomate", "sal y pimienta negra recién molida", "azúcar, al gusto (opcional)", "vegetales verdes al vapor, para servir"], "method": ["Precalentar el horno a 190C / 375F / Gas 5.", "Para el relleno, coloque las papas y las chirivías o el colinabo en una olla grande de agua. Llevar a ebullición y cocinar por 12-15 minutos, o hasta que estén tiernos. Escurrir bien.", "Agregue la mantequilla a las verduras cocidas y haga puré usando un triturador de patatas o ricer. Agregue la leche, poco a poco, y continúe macerando hasta que quede suave. Sazonar, al gusto, con sal y pimienta negra recién molida. Dejar de lado.", "Para el relleno, caliente el aceite en una sartén grande a fuego medio o bajo. Agregue la cebolla y fría por 8-10 minutos, o hasta que se ablanden.", "Agregue el ajo, la zanahoria, el puerro y el tomillo y continúe freír durante 4-5 minutos o hasta que se ablanden.", "Agregue la carne picada vegetariana a la sartén y fría por 2-3 minutos más, revolviendo continuamente o hasta que se dore.", "Agregue los frijoles cannellini escurridos, los tomates picados y el puré de tomate y revuelva bien para combinar. Deje que la mezcla hierva a fuego lento y continúe cocinando durante otros 4-5 minutos o hasta que la salsa se espese. Sazonar, al gusto, con sal y pimienta negra recién molida. Pruebe y agregue un poco de azúcar a la mezcla si es necesario.", "Vierta la mezcla de relleno en un plato grande a prueba de horno. Extienda la mezcla de puré de patata y chirivía (o colinabo) sobre el relleno en una capa lisa y uniforme.", "Transfiera al horno y cocine durante 18-20 minutos, o hasta que el relleno esté dorado y el relleno esté bien cocido.", "Sirve con vegetales verdes al vapor."], "url": "www_bbc_co_uk_food_recipes_vegetariancottagepie_92035", "title": "Pastel de cabaña vegetariana", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 pimientos rojos", "2 pimientos anaranjados", "2 pimientos amarillos", "2 cebollas rojas", "2 dientes de ajo", "½ paquete de hojaldre confeccionado", "2 x 150g / 5oz de queso de cabra suave, en rodajas", "pequeño racimo de tomillo fresco", "1 huevo de gallinas camperas, golpeado"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Cortar aproximadamente los pimientos, las cebollas rojas y el ajo y colocar en la bandeja para hornear. Hornee en el horno durante aproximadamente 30 minutos hasta que estén suaves y bien dorados.", "Estirar la masa en un rectángulo de aproximadamente 25 cm / 10 pulgadas x 20 cm / 8 pulgadas.", "Coloque las verduras cocidas en el centro de la masa. Coloque las rodajas de queso de manera uniforme por el centro. Dispersión con pequeñas ramitas de tomillo.", "Con un cuchillo afilado, corte las hendiduras a 3cm / 1pulg, a 1cm / ½pulgada de la mezcla de pimientos hasta el borde de la masa, inclinándose hacia usted. Pincelar con huevo batido.", "Comenzando por el extremo más cercano a usted, doble los pasteles alternativamente uno encima del otro, para dar un efecto de \"trenza\". Cepille la parte superior con huevo batido.", "Transfiera a una bandeja para hornear y hornee en el centro del horno durante 30 minutos, reduciendo la temperatura a 150 ° C / 300 ° F / Gas 2 después de 20 minutos. Servir en rebanadas frías o calientes."], "url": "www_bbc_co_uk_food_recipes_vegetarianplait_83742", "title": "Vegetariano agrada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 cebolla roja grande, picada", "1 pimiento rojo, finamente picado", "1 400 g / 14 oz pueden cortar tomates", "puñado de perejil recién hecho", "sal y pimienta negra recién molida", "espagueti, cocinado de acuerdo con las instrucciones del paquete", "2 cucharadas de aceite de trufa"], "method": ["Caliente el aceite en una sartén grande a fuego medio. Agregue las cebollas y freír suavemente hasta que estén suaves.", "Agregue el pimiento rojo y fría por 4-5 minutos para ablandarlo.", "Agregue los tomates, deje hervir a fuego lento y continúe calentando suavemente durante 20-30 minutos.", "Arranca el perejil y agrégalo a la mezcla de tomate. Sazonar bien con sal y pimienta negra recién molida.", "Agregue los espaguetis cocidos a la salsa de tomate y mezcle bien.", "Servir en platos calientes y rociar generosamente con aceite de trufa."], "url": "www_bbc_co_uk_food_recipes_vegetarianspaghettib_83908", "title": "Espaguetis vegetarianos a la boloñesa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "2 salchichas vegetarianas", "3 cucharadas de harina normal", "1 huevo pequeño", "6 cucharadas de leche entera", "sal y pimienta negra recién molida", "1 gránulos de salsa de verduras de cucharadita colmada, para servir", "55g / 2oz de guisantes congelados, para servir"], "method": ["Precalentar el horno a 240C / 220 Ventilador / Gas 9.", "Caliente el aceite en una sartén pequeña y fría las salchichas hasta que se doren por todos lados, aproximadamente de 3 a 5 minutos.", "Pon la harina en un bol, sazona con sal y pimienta y haz un pozo en el centro. Agriete el huevo y vierta la leche, luego mezcle hasta que estén combinados y sin grumos.", "Precalentar una bandeja de cupcake en el horno. Cuando esté caliente, coloque las salchichas en los agujeros de cupcake separados. Vierta la mezcla alrededor de las salchichas y hornee durante 15-18 minutos, o hasta que estén doradas y se hayan levantado.", "Mientras tanto, prepare la salsa y hierva los guisantes de acuerdo con las instrucciones del paquete. Servir inmediatamente con el sapo en el hoyo."], "url": "www_bbc_co_uk_food_recipes_vegetariantoadintheh_88420", "title": "Veggie sapo en el agujero", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/vegetariantoadintheh_88420_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["400 g de garbanzos de hojalata o frijoles como borlotti, riñón o butterbeans, escurridos y enjuagados", "300 g / 10½ oz cocidas, puré de verduras como zanahoria, calabaza, patata, batata o chirivía", "1 diente de ajo, aplastado por un adulto o con una prensa de ajo", "1 cucharada de aceite de girasol, vegetal o de oliva", "exprimir jugo de limón", "pellizcar comino molido, cilantro o pimentón, copos de chile templado, al gusto", "pimienta negra recién molida", "1 cucharada de tahini (opcional)", "4 cucharadas de semillas de sésamo, pan rallado o galletas molidas (opcional), para el recubrimiento"], "method": ["Trabajo para adultos: precaliente el horno a 200C / 180C Fan / Gas 6.", "El trabajo de los niños: mastique los frijoles o los garbanzos tanto como sea posible, ya sea con un machacador de papas en un tazón o con un mezclador manual (supervisado). Alternativamente, puede hacer la mezcla en un procesador de alimentos si tiene uno.", "El trabajo de los niños: agregue las verduras machacadas y el ajo y las hierbas, especias o tahini que quiera usar.", "El trabajo de los niños: mezclar bien y los niños pueden probar y agregar jugo de limón, especias o pimienta a su gusto.", "El trabajo de los niños: la mezcla necesita ser enrollada en cuatro bolas del tamaño de una hamburguesa con las manos mojadas, o hacer 12 \"falafels\" más pequeños: los niños tienen las manos de tamaño perfecto para esto. Aplane las bolas ligeramente. Si lo desea, puede cubrirlos con semillas de sésamo, galletas molidas o migas de pan para obtener una mayor consistencia.", "El trabajo de los niños: rocíe una cucharada de aceite de oliva en una bandeja para hornear y coloque las \"falafels\" o hamburguesas de frijoles en la parte superior y luego gírelas para que tengan una capa de un poco de aceite en cada lado.", "Trabajo para adultos: coloque la bandeja para hornear en el horno y cocine durante 20-30 minutos, volteando las hamburguesas hasta la mitad de la cocción. Deje que se enfríe un poco antes de servir."], "url": "www_bbc_co_uk_food_recipes_veggie_bean_burgers_for_53280", "title": "Hamburguesas de frijoles vegetarianos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Rinde 4 hamburguesas o 12 bolas del tamaño de falafel", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/veggie_bean_burgers_for_53280_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Aproximadamente 600 g / 1 lb 5 oz de verduras mezcladas que te gustan, como", "Zanahoria", "chirivía", "squash", "patata", "batata", "cebolleta", "parecía", "seta", "pimienta", "otro", "guisantes (congelados o frescos)", "maíz dulce (congelado o fresco)", "100 g / 3½ oz de pollo o jamón asado (opcional), picado", "1 x 400g / 14oz de frijoles o legumbres (opcional), escurridos y enjuagados", "200g / 7oz de harina natural o integral", "100 g / 3½ oz de mantequilla, ablandada", "50g / 1¾oz de queso rallado", "puñado de avena avena", "pimienta negra recién molida", "2 cucharadas de semillas de girasol o calabaza (opcional)", "2 cucharadas de mantequilla", "1 diente de ajo, aplastado", "2 cucharadas de harina normal", "400ml / 14fl oz de leche o caldo de verduras", "pizca de sal", "puñado de queso rallado (opcional)"], "method": ["Trabajo para adultos: precaliente el horno a 200C / 400F / Gas 6.", "El trabajo de los niños: picar o cortar todas las verduras en trozos de aproximadamente igual tamaño y reservarlas.", "El trabajo de los niños: para el crumble, pon la harina en un tazón. Pica la mantequilla en pequeños grumos y agrégala a la harina. Usando sus dedos frote la harina y la mantequilla juntas. Continúe hasta que se vea como pan rallado (¡algunos bultos están bien!). Agregue la avena, el queso, el pimiento y las semillas (si está usando). Dejar de lado.", "Trabajo de un adulto: Mientras tanto, caliente una sartén grande y derrita la mantequilla hasta que burbujee un poco. Agregue el ajo y revuelva por un minuto. Agregue la harina y mezcle bien por otro minuto. La mantequilla y la harina se espesarán y cambiarán de color ligeramente. Poco a poco agregue el caldo o la leche un poco a la vez, revolviendo mientras vierte. La salsa debe espesarse y no tener grumos. Si es así, tendrás que mezclarlo muy rápido para eliminar los grumos.", "El trabajo de un niño: prueba tu salsa. (Cuidado: hace calor). Es posible que desee agregar sal y pimienta, queso rallado o simplemente un chorrito de jugo de limón.", "Trabajo de un adulto: Agregue las verduras frescas picadas (pero no las congeladas) a la salsa y cocine suavemente durante cinco minutos, revolviendo con frecuencia. A continuación, agregue las verduras congeladas y cualquiera de los extras opcionales como la carne cocida o los frijoles enlatados y revuelva.", "Trabajo para adultos: vierta los vegetales picantes en una fuente cuadrada para hornear de 20 cm / 8 pulgadas y deje que se enfríe un poco.", "El trabajo de los niños: espolvorea la migaja sobre la parte superior de las verduras. Deberías cubrirlos a todos y tener un buen relleno de crumble grueso.", "Trabajo de un adulto: coloque el plato en una bandeja para hornear (para atrapar cualquier derrame) y hornee en el horno durante 30-40 minutos o hasta que la migaja se dore por todas partes.", "Trabajo de un adulto: retire la migaja del horno y deje que se enfríe un poco antes de servir."], "url": "www_bbc_co_uk_food_recipes_veggie_crumble_28446", "title": "Crumble de vegetales", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/veggie_crumble_28446_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cebolla pequeña", "1 barra de apio", "1 zanahoria mediana", "1 cucharada de aceite vegetal o un buen pomo de mantequilla", "2 cucharaditas de hierbas frescas picadas (como perejil, salvia, tomillo, romero o una combinación de todas) o 1 cucharadita de hierbas secas mezcladas", "1 hoja de laurel", "1 cucharada de puré de tomate", "1 cucharada de harina normal", "500ml / 18fl oz de caldo de verduras, hecho en casa o hecho de 1 cubo en existencia", "50 ml / 2 fl oz de jerez dulce, brandy o vino de elección", "1 cucharadita de extracto de levadura o 1 cucharada de salsa de soja", "sal y pimienta"], "method": ["Picar finamente las verduras y freír en el aceite a fuego medio junto con las hierbas durante unos 10 minutos o hasta que comiencen a dorarse.", "Agregue el puré de tomate y fría por 30 segundos.", "Agregue la harina, friendo durante 1 minuto, luego vierta el caldo. Agregue el alcohol, mezcle bien para disolver la harina y evite los grumos.", "Cocine a fuego lento durante 5 minutos hasta que tenga una salsa espesa. A continuación, agregue el extracto de levadura o la salsa de soja.", "Vierta a través de un tamiz en una sartén limpia. Sazonar con sal y pimienta antes de servir."], "url": "www_bbc_co_uk_food_recipes_veggie_gravy_37512", "title": "Salsa de vegetales", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/veggie_gravy_37512_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500g / 1lb 2 oz de harina natural, más extra para espolvorear", "7g bolsita de levadura seca de acción rápida", "8 cucharadas de agua tibia", "1 cucharada de aceite de oliva extra virgen", "sal", "2 cucharadas de aceite de oliva", "2 dientes de ajo, en rodajas finas", "400 g de tomates de hojalata", "1 cucharada de orégano fresco finamente picado", "pimienta negra recién molida", "2 calabacines, cortados en palitos de fósforos", "2 dientes de ajo, en rodajas finas", "Feta de 150 g / 5½ oz, desmenuzado", "1 limón no encerado, muy finamente cortado", "2 ramitas de romero fresco, hojas recogidas", "30g / 1oz de mantequilla sin sal", "2 cebollas rojas, finamente cortadas", "pizca de azúcar en polvo", "500g / 1lb 2 oz de calabaza, peladas, sin semillas y cortadas en tiras finas", "1 cucharada de aceite de oliva", "150g / 5½oz Stilton, desmenuzado", "puñado de hojas frescas de salvia"], "method": ["Para hacer la masa de pizza, mida la harina y la levadura en un recipiente y agregue sal al gusto. Haga un pozo en el centro y agregue el agua tibia y el aceite de oliva virgen extra. Mezcle hasta que se una. Extienda la masa sobre una superficie de trabajo y amasar durante 3 minutos, o hasta que se vuelva elástica y elástica. Colóquelo en un recipiente con aceite y cúbralo con una película adhesiva. Dejar crecer durante 45 minutos o hasta que duplique su tamaño.", "Para hacer la salsa de tomate, caliente el aceite de oliva en una sartén a fuego medio y agregue el ajo. Cocine durante 1-2 minutos, luego agregue los tomates y el orégano, rompiendo los tomates con una cuchara de madera. Sazone con sal y pimienta y cocine a fuego lento durante 30 minutos, o hasta que espese. Mash los tomates con un triturador de patata para obtener una salsa más suave, si es necesario.", "Precalentar el horno a 200C / 180C Fan / Gas 6.", "Para hacer el relleno de calabacín, espolvorear los calabacines con sal y dejar en un colador por 30 minutos. Enjuague bien, luego apriételos con papel de cocina.", "Para hacer la cobertura de calabaza, derrita la mantequilla en una sartén a fuego lento y agregue las cebollas rojas, el azúcar y un poco de aderezo. Cubra con una tapa y cocine por 30 minutos, revolviendo ocasionalmente, hasta que esté caramelizado y suave.", "Coloque la calabaza en una lata para asar y rocíe con el aceite de oliva. Asar durante 20 minutos o hasta que estén tiernos.", "Retire la calabaza del horno y suba la temperatura tan alto como sea posible. Coloque dos bandejas de hornear grandes en el horno.", "Una vez que la masa de pizza ha subido, divídala en cuatro bolas y enrolle cada una en una superficie ligeramente enharinada para hacer 25-30 cm / 10-12 en bases de pizza.", "Caliente una sartén de base pesada a fuego alto y, de a una por vez, coloque las bases de pizza en la sartén para dorar y cocine los fondos. Retire las hojas para hornear calientes del horno y coloque las bases doradas en las hojas.", "Organiza los calabacines en dos de las bases. Cubra con el ajo, el queso feta, el limón y el romero.", "Arregle las rodajas de calabaza para que irradien desde el centro de las dos bases restantes. Extiende las cebollas caramelizadas por encima y cúbrelas con Stilton y hojas de salvia.", "Hornee las pizzas durante 8-10 minutos, o hasta que el queso se haya derretido y estén cocidas. Servir."], "url": "www_bbc_co_uk_food_recipes_veggie_pizzas_63934", "title": "Pizzas vegetarianas", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/veggie_pizzas_63934_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Pan integral de 175g / 6oz sin costra, desgarrado en pedazos", "10 g de mantequilla, para freír", "2 puerros (150 g / 5½ oz de peso recortado), en rodajas finas", "6 hojas de salvia, finamente picadas", "2 cucharaditas de hojas frescas de tomillo", "3 huevos de gallinas camperas, 1 batido para lavar huevos", "120g / 4oz de parmesano (o queso vegetariano vegetariano alternativo), rallado", "Queso manchego 100g / 3½ oz (o queso vegetariano vegetariano alternativo), rallado", "500g / 1lb 2oz pack de hojaldre con mantequilla", "1 cucharadita de harina normal, para quitar el polvo", "50g / 1¾oz de arándanos congelados", "sal y pimienta negra recién molida"], "method": ["Precaliente el horno a 200 ° C / 180 ° Ventilador / Gas 6. Coloque dos bandejas para hornear con papel de hornear.", "Gire el pan en un procesador de alimentos hasta que tenga migas de pan finas. Transfiera a un tazón para mezclar.", "Derrita la mantequilla en una sartén a fuego medio. Agregue los puerros y fría con cuidado durante 4-5 minutos. Agregue la mitad de la salvia y el tomillo y fría por 2 minutos, o hasta que estén suaves pero no coloreados. Agregue los puerros al pan rallado y sazone con sal y pimienta.", "En un recipiente aparte, mezcle tres huevos, agregue los quesos y la salvia restante y el tomillo, sazone con sal y pimienta. Incline en la mezcla de migas de pan y mezcle bien. Usando sus manos, forme la mezcla en dos bolas de tamaño uniforme. Ruede estas bolas entre sus palmas en dos salchichas de 30cm / 12 pulgadas.", "Estirar la masa sobre una superficie ligeramente enharinada hasta que tenga un cuadrado de 30x30 cm / 12x12 pulgadas. Corta el cuadrado por la mitad a lo largo para formar dos rectángulos. Coloque una de las salchichas en cada rectángulo. Espolvorea sobre los arándanos. Toma el primer rectángulo y dobla un lado hacia arriba sobre el relleno. Cepille el huevo batido por el otro borde y dóblelo sobre la parte superior y presione ligeramente para sellar la unión. Repite con el segundo rectángulo de masa.", "Gire los dos largos rollos de salchicha con la costura hacia abajo. Usando un cuchillo afilado, corte cada longitud de la masa en ocho rollos de salchicha de tamaño uniforme. Haga dos pequeñas ranuras en la parte superior de cada una, teniendo cuidado de no cortarlas completamente. Cepille todos los rollos de salchichas con huevo batido, luego coloque en las bandejas preparadas.", "Hornee durante 30 minutos, o hasta que estén dorados y cocidos."], "url": "www_bbc_co_uk_food_recipes_veggie_sausage_rolls_39930", "title": "Rollitos de salchicha vegetariana", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 16 pequeños rollitos de salchicha", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/veggie_sausage_rolls_39930_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 cucharadas de aceite de oliva", "200g / 7oz de cebolla picada congelada (o 2 cebollas medianas, cortadas aproximadamente)", "4 dientes de ajo, en rodajas finas", "125g / 4½oz de aceitunas negras deshuesadas y deshuesadas, cortadas por la mitad", "2 cucharadas de alcaparras (de un tarro), escurridas", "1 cucharadita de hojuelas de chile seco", "½ cucharadita de sal marina fina", "2 x 400 g de tomates picados", "150ml / 5fl oz de vino tinto o caldo de verduras", "300g / 10½oz de espagueti seco", "pimienta negra recién molida", "puñado de hojas frescas de perejil de flatleaf, más o menos picadas (opcional)"], "method": ["Caliente 3 cucharadas de aceite en una cacerola grande y antiadherente a fuego medio. Agregue las cebollas y el ajo y sofríalos suavemente durante 4-5 minutos, revolviendo regularmente, hasta que estén suaves y ligeramente dorados.", "Agregue las aceitunas, las alcaparras, los copos de chile y la sal, luego agregue los tomates enlatados y el vino tinto (o caldo). Llevar la mezcla a ebullición, luego reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento. Cocine a fuego lento durante 40-45 minutos, revolviendo regularmente, hasta que la salsa se espese.", "Una vez que la salsa ha estado cocinando durante 30 minutos, llene a medias una olla grande con agua hirviendo. Agregue los espaguetis y cocine según las instrucciones del paquete, hasta que estén al dente.", "Cuando la pasta esté cocida a su gusto, reserve 3 cucharadas de agua de cocción en un recipiente, luego vacíe la pasta en un colador y vuelva a colocarla en la cacerola.", "Agregue la mitad de la salsa a los espaguetis cocidos, luego agregue el agua de cocción reservada. Continúe revolviendo la mezcla con cuidado hasta que los espaguetis estén cubiertos en la salsa. Sazonar, al gusto, con pimienta negra recién molida.", "Para servir, transfiera los espaguetis y la salsa a un plato para servir calentado, luego vierta sobre la salsa restante. Rocíe sobre la cucharada restante de aceite y adornar con el perejil, si se usa. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_veggie_tarts_spaghetti_71678", "title": "Veggie puttanesca", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/veggie_tarts_spaghetti_71678_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Espagueti 450 g / 1 libra", "7 cucharadas de crema doble", "1 diente de ajo, aplastado", "100 g / 3½ oz de queso cheddar ahumado rallado", "pimienta negra recién molida", "3 huevos de gallinas camperas, golpeados", "100 g / 3½ oz de espinaca baby", "2 cucharadas de perejil fresco picado", "60g / 2oz de tomates secados al sol o semisecos en aceite, escurridos y picado", "parmesano rallado, o queso de rejilla vegetariano similar"], "method": ["Pon a hervir una olla grande de agua con sal. Agregue los espaguetis y cocine según las instrucciones del paquete.", "Mientras tanto, ponga la crema y el ajo en una olla pequeña y deje que hierva a fuego lento. Agregue el queso cheddar ahumado y deje derretir a fuego lento. Es posible que deba removerlo vigorosamente para hacer una mezcla suave. Retirar del fuego y dejar enfriar ligeramente.", "Agregue el huevo batido a la salsa de queso un poco a la vez, revolviendo constantemente hasta que cada adición se incorpore suavemente. (Si hay algunos trozos de queso, realmente no importa). Sazone con pimienta negra recién molida.", "Cuando esté cocido, escurra los espaguetis en un colador grande. Regrese la fuente de espagueti al fuego y agregue las hojas de espinaca. Revuelva hasta que la espinaca se ablande, agregando un chorrito de agua si comienza a pegarse. Revuelva los espaguetis en la espinaca.", "Vierta la salsa de queso sobre los espaguetis y las espinacas. Agregue los tomates secados al sol y el perejil. Mezcle todo hasta que los espaguetis estén completamente cubiertos. Sirva inmediatamente, preferiblemente con una ensalada verde crujiente y una ralladura de queso parmesano."], "url": "www_bbc_co_uk_food_recipes_veggiecarbonara_87492", "title": "Carbonara vegetal", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/veggiecarbonara_87492_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50g / 2oz de mantequilla sin sal", "1 cebolla, finamente picada", "Arroz Arborio 175g / 6oz, o arroz risotto similar", "750ml / 1¼pint caldo de verduras calientes", "1 cucharadita de curry en polvo", "2 huevos de gallinas camperas, duros, picados", "150 g / 5 oz de morcilla vegetariana, cortada en rodajas y frita hasta que estén crujientes (disponible en línea)", "175g / 6oz de lentejas Puy, lavadas, cocinadas según las instrucciones del paquete", "1 puñado de hojas frescas de cilantro picadas", "1 cucharada de coco desecado", "pellizcar nuez moscada recién molida"], "method": ["Derrita la mantequilla en una sartén a fuego medio. Agregue la cebolla y fría hasta que esté suave.", "Agregue el arroz y revuelva hasta que el arroz se vuelva translúcido.", "Agregue un cucharón grande de caldo y revuelva bien. Cuando la acción se haya absorbido, agregue otra cucharada de acciones. Repita hasta que el caldo se haya absorbido por completo y el arroz esté recién cocido.", "Agregue el polvo de curry y revuelva bien.", "Agregue los huevos duros, la morcilla frita, las lentejas cocidas, el cilantro y el coco y revuelva suavemente hasta que estén combinados y caliente.", "Para servir, coloque porciones iguales de kedgeree en tazones y cubra con un poco de nuez moscada recién rallada."], "url": "www_bbc_co_uk_food_recipes_veggiekedgeree_90344", "title": "Veggie kedgeree", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/veggiekedgeree_90344_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Lentejas rojas 100g / 3½oz", "400 g / 14 oz de berenjenas, cortadas en rodajas finas", "50ml / 2oz de aceite vegetal", "sal y pimienta negra recién molida", "1 cebolla roja, finamente picada", "1 pimiento rojo, finamente picado", "1 diente de ajo, finamente picado", "Puré de tomate 50 g / 2 oz", "400g / 14oz de tomates picados en conserva, escurridos", "1 ramita de canela", "2 cucharadas de perejil fresco picado", "125 g / 4½ oz de ricotta", "125 g / 4½ oz de yogur griego", "3 huevos de gallinas camperas", "nuez moscada recién rallada", "sal y pimienta negra recién molida", "50g / 2oz de pecorino recién rallado o queso duro vegetariano alternativo"], "method": ["Precalentar el horno a 180 ° C / 350 ° F / Gas 4 y cocinar las lentejas de acuerdo con las instrucciones del paquete.", "Para el relleno, mezcle las rodajas de berenjena en el aceite vegetal, luego escurra y sazone, al gusto, con sal y pimienta negra recién molida.", "Calentar una sartén a fuego medio, agregar las rodajas de berenjena en lotes y freír durante 2-3 minutos por cada lado, o hasta que estén doradas por ambos lados. Retire de la sartén con una cuchara ranurada y déjela a un lado para escurrir sobre papel de cocina.", "Agregue la cebolla, el pimiento y el ajo a la sartén y fría por 2-3 minutos, o hasta que se ablanden.", "Agregue el puré de tomate, revuelva para cubrir las verduras en él, luego continúe freír durante 4-5 minutos más.", "Agregue los tomates en conserva picados y la rajita de canela y cocine a fuego lento durante 4-5 minutos.", "Agregue las lentejas y devuelva las berenjenas fritas a la mezcla. Cocine a fuego lento durante 2-3 minutos más, o hasta que se caliente.", "Transfiera la mezcla a un plato resistente al horno y espolvoree sobre el perejil picado.", "Para el aderezo, en un tazón, bata la ricota, el yogur al estilo griego, los huevos y la nuez moscada rallada hasta que estén bien combinados. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Vierta la mezcla de cobertura en el plato a prueba de horno en la parte superior del relleno. Espolvorea sobre el parmesano rallado.", "Transfiera la moussaka vegetal al horno y hornee durante 25-30 minutos, o hasta que la cobertura esté dorada y se haya endurecido y el relleno esté burbujeante. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_veggiemoussaka_90770", "title": "Moussaka de lentejas rojas y berenjena", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/veggiemoussaka_90770_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 huevos de gallinas camperas", "aceite vegetal, para freír", "2 cucharadas de aceite de oliva", "botón de mantequilla", "1 cebolla, finamente picada", "1 zanahoria, rallada", "1 diente de ajo, picado", "½ cucharadita de copos de chile", "Garbanzos enlatados de 400g / 14oz, enjuagados y escurridos, mezclados para pegar en un procesador de alimentos", "1 remolacha cruda, pelada, rallada", "1 cucharadita de hojas frescas de tomillo", "sal y pimienta blanca recién molida", "Harina normal de 100 g / 3½ oz", "2 huevos de gallinas camperas, golpeados", "175g / 6oz de pan rallado", "piccalilli, para servir"], "method": ["Hierva los huevos durante nueve minutos, luego sumérjalos en agua fría para que se enfríen.", "Llene a la mitad una sartén profunda de base pesada con aceite vegetal y caliente hasta que la miga de pan chisporrotee y se ponga marrón cuando se la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Caliente el aceite y la mantequilla en una sartén. Cuando la mantequilla esté espumosa, agregue la cebolla, la zanahoria, el ajo y las hojuelas de chile y fría hasta que la cebolla se ablande.", "Coloque el puré de garbanzo en un recipiente. Agregue los ingredientes fritos y mezcle bien.", "Agregue la remolacha y el tomillo y sazone muy bien con sal y pimienta blanca recién molida.", "Pelar los huevos y luego dragarlos en la harina.", "Envuelva la mezcla de mezcla de garbanzos alrededor de cada uno de los huevos duros, asegurándose de que no haya lagunas y molde en las bolas.", "Ruede los huevos recubiertos en el huevo batido, luego enrolle en las migas de pan para cubrir completamente.", "Con cuidado, agregue los huevos recubiertos al aceite caliente y fría durante 3-4 minutos, o hasta que estén crujientes y dorados. Retire con una espumadera y escurra sobre papel de cocina.", "Sirva los huevos escoceses con una buena porción de piccalilli."], "url": "www_bbc_co_uk_food_recipes_veggiescotcheggs_89967", "title": "Huevos de escocés", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Rinde 4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["450 g / 15 oz de mantequilla sin sal, ablandada más extra para engrasar", "450 g / 15 oz de azúcar en polvo", "8 huevos de gallinas camperas", "4-5 cucharadas de café expreso fuerte", "Harina de auto aumento de 450g / 15oz", "300g / 10½oz de azúcar glas", "3 cucharadas de café negro fuerte", "50g / 1¾oz de azúcar glas"], "method": ["Engrase y forre completamente la base de una lata de savarina de 24 cm / 10 in. Precalentar el horno a 180C / 350F / Gas 4.", "Bata la mantequilla y el azúcar en un tazón hasta que estén pálidos y esponjosos. Agregue los huevos, poco a poco, y agregue el espresso. Doble la harina con una cuchara grande de metal.", "Coloque la mezcla en la lata preparada y nivele con la parte posterior de una cuchara o espátula. Hornee en el horno durante 40-45 minutos o hasta que un pincho insertado en la torta salga limpio. Revise el pastel después de 30 minutos y si siente que el pastel está tomando demasiado color antes de que esté listo, cúbralo con papel pergamino o papel de aluminio.", "Dejar enfriar en la lata. Cuando esté lo suficientemente frío como para manejarlo, sáquelo suavemente de la lata.", "Cuando el pastel está completamente frío. Con un cuchillo para hacer pequeños cortes en la superficie, marque un círculo en la parte superior de la torta a unos 2 cm del borde interior. También marque una línea dentro del borde interno a unos 3 cm hacia abajo desde la parte superior. Ahora corte cuidadosamente de una marca a la otra para crear una pendiente.", "Para hacer el glaseado de café, mezcle el azúcar glas tamizado con el café y bata hasta que quede suave. La consistencia de la formación de hielo debe ser lo suficientemente espesa para cubrir la parte posterior de la cuchara. Si es demasiado fina, agregue un poco más de azúcar glas tamizada, si es demasiado espesa, agregue unas cuantas gotas más de agua. Recuerde hacerlo poco a poco.", "Cuando esté satisfecho con la consistencia de la formación de hielo, comience a tapar su pastel. Desea cubrir por completo el borde interior, pero solo tiene lloviznas en el exterior. Una vez que se ha establecido el glaseado de café, haga que el glaseado blanco se haga de la misma manera que arriba. Ponga una cuchara en una manga pastelera y pique tres líneas alrededor del borde interior para representar los carriles.", "Compre algunas figuras de ciclistas o corredores (disponibles en línea) y fije un ángulo leve para representar la velocidad del velódromo."], "url": "www_bbc_co_uk_food_recipes_velodrome_cake_45072", "title": "Torta Velódromo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 12-15", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/velodrome_cake_45072_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4kg / 4lb 4oz Mejillones Morston (u otros mejillones), limpios, sin barba, enjuagados con abundante agua corriente fría, descartados los mejillones abiertos", "225ml / 8fl oz de vino blanco", "50g / 2oz de mantequilla", "1 cebolla mediana, finamente rebanada", "2 cucharaditas de harina común", "1 cucharadita de polvo de curry mediano", "150ml / 5fl oz de crema doble", "1 paquete de espinaca baby, lavado", "1 manojo de cebollín fresco, picado", "pan crujiente fresco, para servir"], "method": ["Caliente una sartén grande con tapa a fuego alto hasta que esté caliente. Agregue los mejillones y el vino blanco y coloque la tapa sobre la olla. Cocine a fuego alto, sacudiendo la sartén con regularidad, hasta que se hayan abierto todos los mejillones. Deseche los mejillones que no se hayan abierto después de cinco minutos.", "Escurra los mejillones en un colador grande sobre un recipiente para atrapar el líquido de cocción. Deje que se enfríe un poco.", "Una vez que esté lo suficientemente frío como para manejarlo, quite los mejillones de sus caparazones.", "En otra sartén, derretir la mantequilla, agregar las cebollas y freír suavemente hasta que estén blandas pero no coloreadas.", "Agregue la harina y el polvo de curry, revuelva bien y cocine suavemente durante 3-4 minutos.", "Agregue el líquido de cocción reservado y mezcle bien. Llevar a ebullición, luego reduzca el fuego a fuego lento durante diez minutos.", "Agregue la crema y vuelva a hervir.", "Agregue los mejillones y revuelva bien.", "Justo antes de que esté listo para servir, agregue las espinacas y mezcle para reducirlas.", "Para servir, coloca el velouté de mejillón en cuencos calientes. Espolvorear generosamente con cebollino picado y servir con pan crujiente al lado."], "url": "www_bbc_co_uk_food_recipes_velouteofmorstonmuss_87678", "title": "Mejillones Veloute de Morston", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["pizca de sal", "1 calabaza, pelada, cortada a la mitad", "2 zanahorias, peladas y picadas", "1 chalote, picado", "2 dientes de ajo picados", "2 ramitas de tomillo fresco", "1 hoja de laurel", "2 hojas sabias", "1 litro / 1¾ pintas de caldo de pollo (o caldo de verduras)", "pimienta negra recién molida", "4 yemas de huevo de gallinas camperas", "110g / 4oz de queso cheddar afilado inglés", "pequeño racimo de salvia, perejil, perifollo y estragón", "2 dientes de ajo, finamente picados", "2 chalotes de plátano, finamente picados"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Espolvoree un poco de sal en una bandeja para hornear y coloque la calabaza en la parte superior. Asar en el horno durante 30 minutos o hasta que estén suaves. Una vez que se enfríe lo suficiente como para manejarlo, corte la calabaza en dados finos, descartando las semillas. Reserve una cuarta parte de la calabaza picada para adornar.", "Caliente una cacerola hasta que esté caliente, agregue el aceite de oliva, luego la calabaza asada, la zanahoria, el chalote, el ajo, el tomillo, la hoja de laurel y la salvia, y fría por 4-5 minutos. Cubra con el caldo, deje hervir a fuego lento y cocine por 10 minutos, o hasta que las verduras se hayan suavizado.", "Sazonar con sal y pimienta negra recién molida. Mezcle en un procesador de alimentos hasta que quede suave y pase la mezcla a través de un colador fino en una olla limpia.", "Cueza las yemas de huevo en una cacerola de agua hirviendo a 65C-70C / 150F-160F. Retire con una espumadera y déjelo a un lado para escurrir sobre papel de cocina.", "Para la persilla, mezcle las hierbas, el ajo y los chalotes juntos hasta que estén bien combinados.", "Para servir, coloca las yemas de huevo en tazones de sopa. Afeita el queso cheddar con un pelador de patatas. Coloque el queso sobre la yema y espolvoree con la persilla. Coloque la calabaza reservada alrededor de la yema de huevo, luego vierta la sopa alrededor del borde y sirva."], "url": "www_bbc_co_uk_food_recipes_velout_of_butternut_73856", "title": "Sopa de calabaza con huevo escalfado, persillada y queso cheddar", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 papas harinosas, como Maris Piper o King Edward, peladas y cortadas en finas virutas", "aceite de girasol, para freír", "Mejillones de 750 g / 1½ lb, limpios, enjuagados y desecados (deseche los mejillones que no se cierren herméticamente cuando se golpean)", "175ml / 6¼fl oz de vino blanco seco", "50 g / 1¾oz de mantequilla sin sal", "1 cebolla mediana, pelada y finamente cortada", "Harina llana de 2 niveles de cucharadita", "1 nivel de polvo de curry medio en cucharadita", "125ml / 4½fl oz de pescado o caldo de pollo", "Crema doble 125ml / 4½fl oz", "Hojas de espinaca baby 100g / 3½oz, lavadas", "4 cucharaditas de cebolletas frescas picadas, para servir"], "method": ["Para las pommes frites, caliente el aceite a 190 ° C / 375 ° F en una freidora de grasa (o caliente el aceite en una sartén de base pesada hasta que la miga de pan chisporrotee y se ponga marrón cuando la deje caer). (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido.) Con cuidado, baje las papas fritas en el aceite caliente y fría por 4-5 minutos, o hasta que se ablanden pero no se doren. Retire las virutas del aceite caliente con una espumadera y déjelas a un lado para escurrirlas sobre papel de cocina.", "Aumente la temperatura del aceite a 200C / 400F (verifique la temperatura en un termómetro digital si no tiene una freidora de grasa). Vuelva a colocar las virutas drenados en el aceite y freír durante 2-3 minutos más, o hasta que estén crujientes y doradas. Retire las virutas del aceite caliente con una espumadera y déjelas a un lado para escurrirlas sobre papel de cocina. Mantener caliente", "Mientras tanto, para el velouté de mejillones, caliente una sartén grande a fuego alto. (NB. Necesitará usar una olla con una tapa hermética). Cuando la olla esté caliente, agregue los mejillones y vierta sobre el vino blanco. Cubra la olla con la tapa y cocine a fuego alto, sacudiendo la olla de vez en cuando, durante 4-5 minutos, o hasta que se hayan abierto todos los mejillones. Drene bien, reservando el líquido de cocción en un tazón limpio. Coloque los mejillones a un lado para que se enfríen (deseche los mejillones que no se hayan abierto durante la cocción).", "Cuando los mejillones estén lo suficientemente fríos como para manipularlos, retire la carne de mejillón de las conchas y colóquela en un recipiente para mezclar.", "Cuele el líquido de cocción a través de un tamiz fino o tela de muselina en un recipiente y déjelo a un lado.", "Derrita la mantequilla en una sartén por separado a fuego medio. Cuando la mantequilla esté espumosa, agregue las cebollas y fría hasta que se ablanden. Agregue la harina y el polvo de curry y revuelva hasta que estén bien combinados. Continúe freír suavemente durante 1-2 minutos, luego agregue el líquido de cocción reservado y filtrado y el caldo. Revuelva bien para combinar, luego cocine a fuego lento durante 8-10 minutos.", "Cuando el volumen del líquido se haya reducido a la mitad, agregue la crema, revuelva bien y devuelva la mezcla a ebullición. Justo antes de servir, agregue la carne de mejillón y las hojas de espinaca y cocine durante 1-2 minutos para que se caliente.", "Para servir, coloca el velouté de mejillón en tazones para servir calientes. Espolvorea sobre las cebolletas picadas. Sirva las pommes frites al costado."], "url": "www_bbc_co_uk_food_recipes_velouteofmusselswith_91181", "title": "Veloute de mejillones con espinacas y pommes frites", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200g / 7oz de chocolate puro", "100 g / 3½ oz de azúcar en polvo", "4 yemas de huevo de gallinas camperas", "2 cucharadas de aguardiente", "570ml / 1 pinta de crema doble", "azúcar glas, cernida", "12 fresas grandes, en rodajas", "crema individual"], "method": ["Cubra una lata de 20 cm / 8 pulg. Con fondo suelto o en forma de resorte con una película adhesiva y lubrique la película.", "Rompa el chocolate en trozos y colóquelo en un procesador de alimentos. Mezcle durante un minuto o hasta que queden unas pocas piezas en el polvo de chocolate. Alternativamente, rallar finamente el chocolate.", "Mida el azúcar en una olla pequeña con 90 ml / 3 fl oz de agua y caliente suavemente a fuego lento hasta que el azúcar se haya disuelto, revolviendo ocasionalmente. Suba el fuego y hierva rápidamente durante 3-4 minutos, o hasta que se convierta en un almíbar diluido. Ponga en funcionamiento el procesador y vierta el jarabe caliente a través del embudo sobre el chocolate para que se derrita y se vuelva líquido. Agregue un poco más de agua hirviendo si queda chocolate sin fundir. Agregue las yemas de huevo y procese por unos segundos antes de agregar el brandy. Si no está usando un procesador, bata los ingredientes juntos.", "En un recipiente aparte, bata la crema hasta lograr una consistencia blanda, luego dobla la mezcla de chocolate. Extiéndalo en la lata preparada, nivele la parte superior con el reverso de una cuchara, luego cúbralo con una película adhesiva y transfiéralo al congelador por un mínimo de cuatro horas para que se congele.", "Para servir, retire del congelador, suelte del estaño y transfiera a un plato. Permita que se ablande un poco y sirva unos 20 minutos después de salir del congelador. Decorar con las fresas y el azúcar glas y servir con un poco de crema."], "url": "www_bbc_co_uk_food_recipes_velvet_chocolate_torte_42806", "title": "Velvet chocolate torte", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/velvet_chocolate_torte_42806_16x9.jpg", "isVegetarian": true, "recommendations": 0}]