[{"isVegetarian": true, "title": "Maple syrup sponge pudding with almond custard and blueberry compôte", "url": "www_bbc_co_uk_food_recipes_maple_syrup_sponge_37946", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz unsalted butter", "2 tbsp maple syrup", "100g/3½oz flour, sifted", "1½ tsp baking powder", "2 large free-range eggs", "100g/3½oz brown sugar", "85g/3oz margarine", "1 tbsp whisky", "100ml/3½fl oz milk", "200ml/7fl oz double cream", "1 vanilla pod, split lengthways", "3 free-range eggs, yolks only", "55g/2oz caster sugar", "20ml/1fl oz almond liqueur", "150g/5½oz blueberries", "50g/1¾oz sugar", "½ lemon, juice only"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the syrup sponge pudding, generously grease the inside of an 850ml/1½pt pudding basin with the butter and place in the fridge for five minutes. ", "Remove from the fridge and add the maple syrup to the base of the pudding basin.", "Put all the remaining ingredients into a large mixing bowl and mix until well combined. Pour into the basin over the maple syrup. Cover with a doubled piece of buttered foil, making a few pleats in the foil before pressing down firmly around the rim of basin. Secure the foil around the rim with string.", "Place the basin in a steamer over a large pot of boiling water and steam over a moderate heat for one and a half hours, ensuring that the saucepan does not boil dry. If you need to top up, use boiling water. ", "In a heavy-based saucepan heat together the milk, double cream and vanilla pod. ", "In a large bowl, whisk together the egg yolks and caster sugar until light and airy. Whisk in the almond liqueur. ", "Whisk half of the hot milk mixture into the egg mixture, then pour the egg mixture back into the saucepan with the remaining hot milk. ", "Over a very low heat, cook the mixture, stirring constantly, until thickened into a smooth custard.  Set aside.", "For the blueberry compôte, put all the ingredients into a saucepan with four tablespoons (60ml/2fl oz) of water and bring to the boil. Simmer gently for five minutes and remove from the heat.", "To serve, once the puddings are cooked, remove the foil, turn out the pudding and serve in wedges with hot almond custard and blueberry compôte."]}, {"isVegetarian": true, "title": "Maple and chilli roasted parsnips", "url": "www_bbc_co_uk_food_recipes_mapleandchilliroaste_87749", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "2 parsnips, cut lengthways into eight pieces", "pinch dried chilli flakes", "drizzle maple syrup", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7. Drizzle the olive oil into a roasting tin and place in the oven until hot.", "Blanch the parsnips in a pan of boiling salted water for 2-3 minutes, then drain well.", "Remove the roasting tin from the oven, add the parsnips and stir to coat with the hot oil. Season with salt and freshly ground black pepper then add the chilli and maple syrup. Stir until evenly coated, then roast in the oven for 15-20 minutes until tender in the middle and golden brown on the outside.", "Transfer to a warm serving dish and serve at once."]}, {"isVegetarian": true, "title": "Maple, lime and mango syllabub", "url": "www_bbc_co_uk_food_recipes_maplelimeandmangosyl_88335", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125ml/4fl oz double cream, softly whipped", "3 tbsp Greek-style yoghurt", "½ lime, juice only", "1 tbsp maple syrup, plus extra to serve", "½ mango, peeled and chopped", "lime wedges, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["In a bowl, mix the whipped cream, yoghurt, lime juice and maple syrup together.", "To serve, spoon the mixture into a dessert glass. Top with the chopped mango, drizzle with extra maple syrup and garnish with lime wedges."]}, {"isVegetarian": true, "title": "Maple-roast parsnips", "url": "www_bbc_co_uk_food_recipes_mapleroastparsnips_84758", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mapleroastparsnips_84758_16x9.jpg", "ingredients": ["1kg/2¼lb parsnips", "125ml/4fl oz vegetable oil", "80ml/3½fl oz maple syrup"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Peel the parsnips and then halve them crosswise, then halve or quarter each piece lengthwise. ", "Place the parsnips into a roasting tin.  Pour the oil over the parsnips and mix them well so that the oil covers all of the pieces.", "Pour the maple syrup over the parsnips and transfer the roasting tin to the oven.  Roast the parsnips for 35 minutes, or until they are tender and golden-brown.", "To serve place on a clean serving dish."]}, {"isVegetarian": true, "title": "Marble cake", "url": "www_bbc_co_uk_food_recipes_marble_cake_64138", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["175g/6oz butter or baking spread", "175g/6oz caster sugar", "3 free-range eggs, lightly beaten", "½ tsp vanilla extract", "225g/8oz self-raising flour", "pinch salt", "2 tbsp milk", "2 tbsp cocoa powder", "2 tbsp strong black coffee, cooled"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Pre-heat the oven to 180C/350F/Gas 4.", "Grease and line a small loaf tin or 20cm/8in round tin.", "Cream the butter and sugar with an electric whisk in a large mixing bowl until very pale and fluffy. ", "Add the beaten egg, a little at a time, whisking well after each addition.  Then whisk in the vanilla extract.", "Sift the flour and salt into a large bowl, then fold it gently into the butter and egg mixture.", "Divide the cake batter into two equal portions (about 350g each).", "Add the milk to one portion of the mixture, stirring in gently until well combined.", "Mix the cocoa powder and the coffee together in a mug to form a smooth paste. Stir this paste into the other portion of the cake batter until thoroughly combined.", "Spoon large blobs of each cake mixture into the prepared tin, alternating the flavours to give a marble effect.  Bake for 50-60 minutes until the cake is springy to the touch and a wooden skewer inserted into the centre of the cake comes out clean.", "Allow the cake to cool in the tin for ten minutes, then turn out onto a wire rack and cool completely before slicing. "]}, {"isVegetarian": false, "title": "Fideuà", "url": "www_bbc_co_uk_food_recipes_marias_fideu_61565", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/marias_fideu_61565_16x9.jpg", "ingredients": ["6 tomatoes, grated", "3 garlic cloves, skins left on, crushed", "2 onions, roughly chopped", "2 dried ñora peppers", "monkfish head and bones (or other white fish bones)", "1.5 litres/3¼ pints boiling water", "1 lemon, juice only", "pinch salt ", "4 tbsp olive oil ", "1 whole monkfish tail, cut into large chunks", "12 king prawns", "2 onions, finely chopped", "4 garlic cloves, finely chopped", "2 squid, cleaned, spines removed, flesh roughly chopped", "2 dried ñora peppers, finely chopped (available from Spanish delicatessens and online specialists)", "500g/1lb 2oz short vermicelli noodles (called 'fideo' in Spain)", "2 tbsp smoked paprika", "400g/14oz mussels, scrubbed and de-bearded (discard any mussels that do not shut tightly when tapped firmly)", "salt and freshly ground black pepper", "100g/3½oz almonds", "4 tbsp chopped fresh parsley", "2 lemons, cut into wedges, to garnish"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the stock, place the grated tomato skins in a large saucepan, reserving the flesh for later, with the rest of the stock ingredients and bring to the boil. Reduce the heat until the mixture is simmering, then continue to simmer for 30 minutes. Strain the stock and reserve the liquid.", "For the fideuà, heat half of the oil in a paella pan or large, heavy-based, shallow frying pan over a medium heat. Add the monkfish and prawns and fry for 1-2 minutes on each side, until browned on both sides, adding more oil if necessary. Remove from the pan and set aside.", "Heat the remaining oil in the frying pan, add the onions and fry for 3-4 minutes, or until softened. Add the garlic, tomato flesh and squid and continue cook over a low heat for 6-7 minutes, or until the squid is opaque.", "Add the ñora peppers and the noodles, mix well, and continue to cook for a further 2-3 minutes, or until the noodles are covered in the oil. Sprinkle over the smoked paprika.", "Pour in the stock and bring the mixture to a simmer. Simmer for 10 minutes.", "Return the monkfish and the prawns to the pan, then arrange the mussels over the top of the fideuà. Season, to taste, with salt and freshly ground black pepper, then cover the pan tightly with aluminium foil or greaseproof paper and continue to simmer for a further 4-5 minutes, or until the mussels have opened (discard any mussels whose shells do not open during cooking).", "Meanwhile, for the picada, grind the almonds and the chopped parsley in a mortar and pestle as finely as possible.", "To serve, sprinkle the picada over the fideuà, garnish with lemon wedges and spoon onto serving plates."]}, {"isVegetarian": true, "title": "Maple syrup, walnut and buttermilk wholemeal scones", "url": "www_bbc_co_uk_food_recipes_maplesyrupwalnutbutt_89621", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz self-raising flour", "100g/3½oz medium oatmeal, plus extra for dusting", "100g/3½oz wholemeal flour", "50g/2oz caster sugar", "2 tsp baking powder", "½ tsp salt", "160g/5½oz unsalted butter, softened, plus extra for greasing", "100g/3½oz walnuts, roughly chopped", "125ml/4fl oz buttermilk", "150ml/5fl oz maple syrup"], "serves": "Makes 12", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 4.", "Mix the self-raising flour, oatmeal, wholemeal flour, caster sugar, baking powder and the salt in a bowl to combine.", "Add the butter and rub into the flour mixture until it resembles breadcrumbs.", "Fold in the walnuts.", "Place the buttermilk and maple syrup into a separate bowl and mix well.", "Add the buttermilk and maple syrup mixture to the dry mixture and mix well to make a dough.", "Roll the dough out on a floured work surface to 3cm/1½in thick. Using a pastry cutter, cut out 12 scones (or as many as the dough will provide).", "Place onto a greased baking tray and transfer to the oven to bake for 10-12 minutes, or until golden-brown.", "Eat while still warm from the oven."]}, {"isVegetarian": true, "title": "Marchpane petticoat", "url": "www_bbc_co_uk_food_recipes_marchpane_petticoat_07592", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz ground almonds", "200g/7oz icing sugar, plus extra for dusting", "2 tbsp rosewater ", "4-5 tbsp cold water", "200g/7oz icing sugar", "1 tbsp rosewater", "edible gold lustre spray", "edible red lustre spray"], "serves": "Makes 1", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 150C/130C Fan/Gas 2 and line two baking trays with greaseproof paper.", "Combine the ground almonds and icing sugar in a large bowl and whisk using a balloon whisk. Stir in the rosewater with a rubber spatula, then gradually add the water to make a smooth, stiff paste. Lightly dust a clean work surface with icing sugar, turn the dough out and roll out the mixture into a sheet just under 1cm/½in thick.", "Use a 20cm/8in fluted tart tin to cut out a large circle from the dough. Transfer to a prepared baking tray and bake for 20 minutes, or until pale golden and firm. ", "Gather up the scraps of paste, re-roll, then cut out decorative shapes such as hearts, flowers and stars. Transfer to the second baking tray and bake for 15 minutes. Leave the cooked disc and shapes to cool completely.", "Mix together the icing sugar, rosewater and enough water to make a pourable icing in a bowl. Place the disc on a wire cooling rack set over a baking tray, then pour the icing over to completely cover the disc, including the sides. Set a little of the icing aside. Gently shake the wire rack to even the surface then set aside for an hour to set.", "Spray the decorative shapes with the gold and red sprays and then stick them to the surface of the disc with dots of the excess icing. Leave to set for 30 minutes."]}, {"isVegetarian": false, "title": "Beef tartar, tomato jelly and sourdough crisps", "url": "www_bbc_co_uk_food_recipes_marinated_beef_tartare_10869", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["55g/2oz tomato ketchup", "7gm Dijon mustard (about 1 teaspoon)", "few drops Worcestershire sauce", "6 drops Tabasco", "50ml/2fl oz rapeseed oil ", "2 plum tomatoes, skinned, seeds removed and diced", "large pinch finally chopped chives", "175g/6oz aged beef fillet, finely chopped", "1 small banana shallot, peeled and finely chopped", "1 small gherkin, finely chopped", "1 tsp mini capers, washed", "pinch finely chopped flat leaf parsley", "1 tsp of spiced tomatoes (see above)", "1kg/2lb 4oz plum tomatoes ", "20g/¾oz celery, roughly chopped", "5g/⅛ garlic (about 1 clove), roughly chopped", "10g/¼oz shallots, roughly chopped", "sprig thyme", "sprig tarragon", "2 sprigs basil", "pinch of salt", "pinch of sugar", "pinch of cayenne pepper ", "splash of Worcestershire sauce", "4 drops Tabasco", "10g gelatine", "¼ loaf sourdough, finely sliced", "olive oil, for drizzling", "Oscietra caviar", "micro-rocket cress", "baby rocket", "baby lemon balm"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["For the tomato jelly, put all of the ingredients, except the gelatine, in a bowl and mix until well combined. Transfer the mixture to a blender and blitz to a pulp.", "Pour the pulp into a muslin cloth. Tie the cloth and hang it over a bowl overnight. Measure 250ml/8½  of the water collected in the bowl and lightly warm through in a saucepan. Add in the geletine and stir. ", "Line a flat tray with cling film and pour in the water mixture. Place in the fridge to set. ", "For the spiced tomatoes, whisk together the ketchup, mustard, Worcestershire sauce, Tabasco and rapeseed oil until emulsified.  Put the plum tomatoes and chives in a bowl and bind with a little of the ketchup mixture, the remaining mixture can be used to make a sauce.", "For the beef tartar, put the beef fillet in a bowl. Add the shallot, gherkin, capers and parsley. Add a little of the tomato sauce and season with salt and pepper.", "For the sourdough crisps, preheat the oven to 150C/130C Fan/Gas 2.", "Place the sourdough slices on a baking tray and drizzle with the oil. Season with salt and pepper. Bake until crisp, then remove and leave to cool. Meanwhile cut 6 circles from the set jelly.", "To serve, place 3 circles of jelly on a plate and top with the beef tartare and spiced tomatoes. Place the remaining jelly circles on top and spoon over the caviar. Dress the plate with the sourdough crisps, leaves and a drizzle of olive oil. "]}, {"isVegetarian": false, "title": "Marinated eels (anguilla alla scapece)", "url": "www_bbc_co_uk_food_recipes_marinated_eels_anguilla_70975", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2kg/4lb 8oz eels, heads removed, skin and guts removed, cut into 10cm/4in lengths", "plain flour, seasoned with salt and freshly ground black pepper", "150ml/5fl oz olive oil", "4-5 garlic cloves, sliced", "6 tbsp white wine vinegar", "handful fresh mint leaves"], "serves": "Serves 4-6", "time": {"preparation": "overnight", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 10, "preparationMins": 0}, "recommendations": 0, "method": ["Place the eel and seasoned flour into a food bag. Seal and shake the bag to coat the eel in the flour. Remove the eel from the bag and shake off any excess.", "Heat half the oil in a large frying pan over a medium heat. Add the floured eel and fry, in batches if necessary, for 1-2 minutes on each side, or until browned on all sides. Remove from the pan using a slotted spoon and set aside to drain on kitchen paper.", "Wipe the pan clean with a sheet of kitchen paper. Heat the remaining oil over a medium heat, then add the garlic and fry for 1-2 minutes, or until softened but not coloured.", "Add the vinegar to the pan, then season the garlic, to taste, with salt and freshly ground black pepper. Remove the pan from the heat and set aside until the contents have cooled.", "Stir the mint leaves into the cooled vinegar and garlic mixture.", "Place the drained pieces of fried eel into the bottom of a glass serving dish. Pour over the cooled marinade mixture. Cover and chill in the fridge for 5-6 hours, or preferably overnight, turning the pieces of eel in the marinade from time to time.", "Serve cold with a green salad and slices of good-quality crusty bread."]}, {"isVegetarian": true, "title": "Marinated feta, roasted pepper jam and lentil dressing", "url": "www_bbc_co_uk_food_recipes_marinated_feta_roasted_19610", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["350g/12oz feta cheese", "2 garlic cloves, cut into thin slices", "handful mint leaves", "150ml/5fl oz extra virgin olive oil", "freshly ground black pepper", "3-4 tbsp balsamic vinegar", "100-150ml/3½-5fl oz extra virgin olive oil", "freshly ground black pepper ", "55g/2oz Puy lentils, cooked", "2 tbsp olive oil", "2 red peppers, seeds removed, sliced", "2 yellow peppers, seeds removed, sliced", "2 orange peppers, seeds removed, sliced", "1 red chilli (left whole)", "1 bay leaf", "2 garlic cloves, peeled", "1 tbsp caster sugar", "1 lemon, juice and remaining wedges"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the marinated feta cheese, place the cheese in a large shallow bowl and sprinkle over the garlic. ", "Add the mint leaves, drizzle over the olive oil and season with black pepper. Cover and leave to marinate for one hour at room temperature. ", "For the lentil dressing, whisk the balsamic vinegar and extra virgin oil in a bowl. Season with black pepper and stir in the cooked lentils. Set aside.", "For the red pepper jam, heat the olive oil over a medium heat in a large pan. Add the peppers, chilli, bay leaf, garlic, sugar, lemon juice and juiced wedges. ", "Place a piece of wet greaseproof paper over the peppers and cover with a lid. Gently cook for 35-40 minutes, or until the peppers are really soft. ", "Remove the paper and lid from the pan and increase the heat. Simmer to reduce the liquid for about 3-4 minutes, taking care not to allow it to burn. Season to taste. "]}, {"isVegetarian": false, "title": "Marinated goat cutlets with roasted figs and goats’ curd", "url": "www_bbc_co_uk_food_recipes_marinated_goat_cutlets_08411", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 unwaxed lemon, finely grated zest only", "2 tbsp fresh oregano", "2 garlic cloves, finely chopped", "4 tbsp olive oil", "12 goat cutlets or 3 x 4-bone racks of goat cutlets", "75g/2½oz unsalted butter", "12 figs, halved or quartered depending on size", "4 tbsp honey", "1 tsp coarsely ground black pepper", "75g/2½oz unsalted butter", "75g/2½oz fresh nettles, chopped", "75g/2½oz fresh chard, chopped", "200ml/7fl oz chicken stock", "salt and freshly ground black pepper", "150g/5½oz goats’ curd"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the goat cutlets, mix the lemon zest, oregano, garlic and oil in a large bowl. Add the cutlets and marinate in the fridge for at least an hour (return to room temperature before cooking).", "For the figs, preheat the oven to 220C/200C Fan/Gas 7.", "Melt the butter in a large frying pan. Add the figs and toss to coat in the butter. Add the honey and black pepper and toss again. Roast for 4–6 minutes, or until the figs are sticky and glazed.", "Meanwhile, heat a large griddle pan or frying pan, then add the marinated cutlets and cook for 2–3 minutes on each side. Set aside to rest for about 3 minutes.", "For the braised nettles and chard, heat another large frying pan or a sauté pan and add the butter. Once melted, add the nettles and chard and coat in the butter. Pour in the stock and cook for 2–4 minutes, or until the liquid has reduced by half. Season with salt and pepper.", "To serve, put the cutlets and figs on plates and spoon over the braised nettles and chard. Finish with dots of goats’ curd."]}, {"isVegetarian": false, "title": "Marinated Ibérico pork fillet with sautéed potatoes and pimentón", "url": "www_bbc_co_uk_food_recipes_marinated_iberico_pork_50937", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp extra virgin olive oil", "1 tsp bittersweet smoked paprika, plus extra to serve", "2 sprigs fresh oregano, leaves only, chopped", "1 garlic clove, finely chopped", "½ tsp ground cumin", "4 x 250g/9oz pork fillets (preferably Ibérico pork)", "1kg/2lb 4oz waxy potatoes, such as Desirée potatoes, peeled, cut into 7-8mm-thick slices", "2 tbsp olive oil, plus extra to serve", "1 small onion finely sliced", "3 garlic cloves, finely sliced ", "4 sprigs fresh thyme, leaves only, to serve ", "salt and freshly ground black pepper  "], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["For the pork, preheat the oven to 200C/180C Fan/Gas 6.", "Mix together all of the pork ingredients, except for the pork, in a large bowl until well combined. Add the pork fillets and coat them in the mixture. Chill in the fridge for at least 12 hours, to marinate.", "When the meat has marinated, remove it from the fridge and set aside until is has returned to room temperature. ", "Heat an ovenproof frying pan over a medium heat. When the pan is hot, remove the pork fillets from the marinade, shaking off any excess, and fry for 1-2 minutes on each side, or until browned on all sides. ", "Transfer the pan to the oven and cook the pork fillets for a further 5 minutes (if you are using ibérico pork, the fillets will only need cooking in the oven for 2 minutes). Remove the meat from the pan and set aside on a warm plate for 5 minutes, to rest. Reserve the pan juices.", "Meanwhile, for the potatoes, boil the potato slices in a pan of salted water for 1-2 minutes, or until just tender. Drain well.", "Heat the oil in a frying pan over a medium heat, then add the drained potatoes and fry for 2-3 minutes, or until just coloured. ", "Add the onion and garlic and continue to fry for 1-2 minutes, or until golden-brown. Season, to taste, with salt and freshly ground black pepper.", "To serve, divide the potato mixture equally among 4 serving plates. Carve each pork fillet into slices and arrange the slices on top of the potatoes. Drizzle the pan juices and a splash of olive oil around the edge of each plate. Garnish with the thyme leaves."]}, {"isVegetarian": false, "title": "Marinated lamb chops with paneer", "url": "www_bbc_co_uk_food_recipes_marinated_lamb_chops_24406", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 litre/1¾ pints full-fat milk", "2 tbsp lemon juice", "5 large onions, thinly sliced ", "6 tomatoes, roughly chopped", "600ml/1 pint plain yoghurt ", "100g/3½oz fresh root ginger, grated", "8 garlic cloves, grated", "1 tbsp garam masala", "1 tbsp ground cumin", "1–2 tsp chilli powder, to taste", "2 tsp smoked paprika", "2 tsp ground turmeric", "1 tbsp runny honey", "1 unwaxed lemon, juice and finely grated zest", "12 lamb chops", "3 tbsp vegetable oil", "1 dried chilli ", "½ tsp cumin seeds", "5cm/2in piece fresh root ginger, thinly shredded", "3 small onions, thinly sliced", "1 fresh green chill, chopped", "1 tsp salt", "½ tsp ground turmeric", "1½ tsp chilli powder ", "200g/7oz cauliflower, cut into florets", "250g/9oz paneer (from above), cut into 2.5cm/1in cubes", "4 tomatoes, seeds removed, cut into strips", "½ tsp ground cumin", "½ tsp garam masala"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the paneer, line a large sieve with a double layer of muslin cloth. ", "Heat the milk in a large saucepan over a low heat for about 20 minutes, until it comes to the boil. This must be done slowly. As it starts to bubble add 1 tablespoon lemon juice. When the milk starts to split, remove from the heat, add the rest of the lemon juice and stir until the liquid separates from the curds. ", "Pour the mixture into the lined sieve and leave the whey to drain away. Run some cold water over the curd to rinse off any excess whey, then bring the muslin together and squeeze to remove any moisture. ", "Place into a plastic container, place another plastic container on top and use heavy weights such as tins of tomatoes to weigh it down. Leave for 2 hours to set. ", "For the lamb chops, combine all the ingredients apart from the lamb in a bowl. Coat the chops with the marinade, cover and set aside. ", "For the cooked paneer, heat the oil in a saucepan over a medium heat. Fry the chilli, cumin seeds and ginger for 1 minute. Add the onions, green chilli and salt and fry for 5 minutes, or until the onions are soft but not coloured. Add the turmeric, chilli powder and cauliflower and fry for 4 minutes. Lower the heat and add the paneer and tomatoes and cook for 5 minutes. Stir in the ground cumin and garam masala and set aside. ", "For the lamb chops, heat a large griddle pan over a high heat. Cook the chops for 2–3 minutes on each side, depending on how you like your lamb cooked. ", "Place the cooked paneer and cauliflower in the centre of a large serving platter, top with the lamb chops and serve. "]}, {"isVegetarian": false, "title": "Marinated lamb neck with roasted potatoes and tomatoes", "url": "www_bbc_co_uk_food_recipes_marinated_lamb_neck_with_87366", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 garlic clove, finely chopped", "½ tbsp smoked Spanish paprika", "1 tbsp honey ", "5 tbsp olive oil, plus extra to serve", "pinch fresh oregano", "4 x 250-350g/9-12oz lamb neck fillets", "600g/1lb 5oz ripe tomatoes on the vine, halved", "4 garlic cloves, skin on", "olive oil, for drizzling", "1 banana shallot, finely chopped", "2 sprigs thyme ", "250ml/9fl oz chicken stock", "2 waxy potatoes, such as desirée, peeled and sliced into 6–8mm thick rounds", "½ large red pepper, sliced", "1 green pepper, sliced", "olive oil, for roasting", "1 red onion, sliced", "2 fat garlic cloves, thinly sliced", "1 fresh bay leaf", "sea salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the lamb, mix all the ingredients, except the lamb, to make a paste. Rub all over the lamb and leave to marinate in the fridge for at least 12 hours.", "When ready to cook, preheat the oven to 190C/170C Fan/Gas 5.", "For the tomatoes, put the tomatoes on a baking tray with the garlic. Drizzle with lots of olive oil and season generously with salt and pepper. Roast for 45–60 minutes, or until the tomatoes are starting to caramelise. ", "Meanwhile for the potatoes, mix the potatoes, peppers, onion, garlic and bay leaf on a baking tray. Season with sea salt and plenty of black pepper. Pour over about 3 tablespoons olive oil and toss to coat the vegetables.", "Roast on the top shelf of the oven for 15 minutes, then turn the vegetables over. Return to the oven and roast for another 15 minutes, or until the potatoes are golden-brown and the other vegetables are tender and nicely caramelised all over.", "When the tomatoes are ready, heat a little olive oil in a saucepan and gently fry the shallot for 10 minutes. Tip in the roasted tomatoes. Squeeze the roasted garlic from their skins and add to the pan. Add the thyme and stock. Bring to the boil and simmer for 10 minutes.", "Heat a large ovenproof frying pan over a medium heat. Add the lamb necks and fry until golden-brown on all sides (you don’t need any oil in the pan as this will come from the marinade). Transfer to the oven for 2–4 minutes, or until medium-rare. Set aside to rest for 2 minutes.", "To serve, put the roasted potatoes and vegetables in the middle of warmed serving plates. Top with some of the tomatoes. Slice the lamb and arrange on top of the potatoes. Season with salt and pepper and drizzle with a little olive oil."]}, {"isVegetarian": false, "title": "Marinated prawns with roasted lemon mayonnaise and asparagus", "url": "www_bbc_co_uk_food_recipes_marinated_prawns_with_15688", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["12 large raw king prawns, shell removed", "1 red chilli, finely chopped", "1 lemon, zest and juice", "2 garlic cloves, crushed", "3 tbsp olive oil", "3 tbsp chopped fresh coriander", "16 asparagus spears, woody stems trimmed", "2 bunches watercress, leaves picked", "3 lemons, cut in half", "2 free-range egg yolks ", "1 tsp white wine vinegar", "1 tsp dijon mustard", "200ml/7fl oz rapeseed oil or light olive oil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the prawns, mix the prawns, chilli, lemon zest and juice, garlic, two tablespoons of the olive oil and coriander in a bowl until combined. Marinade in the fridge for at least two hours.", "Heat a griddle pan until hot and griddle the prawns for 1-2 minutes on each side, or until pink and just cooked through.", "Blanch the asparagus for 1-2 minutes in a pan of boiling water, or until just tender. Drain and toss in the remaining olive oil then griddle on the griddle pan for 1-2 minutes.", "For the roasted lemon mayonnaise, heat a griddle pan until hot and griddle the lemon halves, cut-side down, for one minute. ", "Blend the egg yolks, vinegar and mustard into a food processor, then squeeze in the juice from one of the charred lemons and blend until well combined. While the motor is running, gradually add the oil. Continue until all the oil has been added and the mayonnaise has thickened. Season with salt and freshly ground black pepper", "To serve, arrange the asparagus on serving plates and top with the prawns. Place the watercress alongside and finish with a spoonful of lemon mayonnaise and half a griddled lemon."]}, {"isVegetarian": false, "title": "Marinated minty lamb kebabs", "url": "www_bbc_co_uk_food_recipes_marinated_minty_lamb_61532", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/marinated_minty_lamb_61532_16x9.jpg", "ingredients": ["1 garlic clove, crushed", "2 tbsp chopped mint", "1 tbsp ready-made mint sauce", "150g/5½oz low-fat natural yoghurt", "375g/13oz lean lamb, cubed", "400g/14oz wholegrain couscous", "2 small onions, cut into wedges", "1 green pepper, cored, deseeded and cut into wedges", "lemon wedges, to serve", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Mix together the garlic, mint, mint sauce and yoghurt in a bowl, add the lamb and stir well. Cover and leave to marinate in a cool place for 10 minutes.", "Meanwhile, place the couscous in a heatproof bowl, pour 500ml/18fl oz of boiling water over the couscous. Leave to stand until the liquid has been absorbed. Season with salt and pepper and fluff the couscous with a fork. Set aside. ", "Preheat the grill to a hot setting. ", "Thread the lamb and onion and pepper wedges on to 8 metal skewers and cook under the grill for 8-10 minutes, or until cooked through.", "Serve the kebabs with lemon wedges and the couscous."]}, {"isVegetarian": false, "title": "Marinated red mullet with okra and pea fritters and fried plantain", "url": "www_bbc_co_uk_food_recipes_marinated_red_mullet_00871", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["40g/1½oz okra, sliced", "10g/⅓oz red onion, finely chopped", "25g/1oz frozen peas, chopped", "1 tbsp roughly chopped flatleaf parsley", "pinch finely chopped garlic", "pinch ground cumin", "40g/1½oz plain flour, sieved", "¼ tsp baking powder", "1 free-range egg, beaten", "2 tbsp whole milk", "2 tbsp crème fraiche", "vegetable oil, for shallow frying", "salt and freshly ground black pepper", "100ml/3½fl oz vegetable oil, plus extra for shallow frying", "100ml/3½fl oz olive oil", "3 lemons, juice only", "1 orange, juice only ", "pinch sugar", "¼ tsp coriander seeds, crushed", "30g/1oz carrots, thinly sliced", "4 small red mullet fillets, scaled and pin-boned", "pinch saffron strands ", "1 green or yellow plantain, peeled and sliced ", "vegetable oil, for deep-frying", "40g/1½oz micro coriander ", "40g/1½oz micro red basil", "40g/1½oz baby watercress", "40g/1½oz nasturtium leaves", "40g/1½oz nasturtium flowers", "20g/¾oz okra, thinly sliced", "¼ red chilli (optional)", "¼ green chilli (optional)", "2 tbsp olive oil", "165g/6oz Greek-style plain yoghurt", "1 lemon, cut into wedges"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/170C Fan/Gas 5.", "To make the fritters, mix together the okra, red onion, peas, parsley, garlic and cumin. Add the flour and baking powder and mix well. Add the egg, milk and crème fraiche and season.", "Heat the oil in a large frying pan and fry tablespoons of the batter (you may need to do this in batches). Once golden-brown on both sides, remove from the pan and drain on a kitchen paper. Finish in the oven for 3–4 minutes.", "To make the red mullet, mix together the two oils, lemon juice, orange juice, sugar, coriander seeds and a little seasoning. Add the carrots and stir well. Place in a small saucepan over a medium heat and warm through to infuse. Set aside to cool. ", "Cut the mullet fillets in half and rub with a little saffron and salt. Heat a little oil in a frying pan and fry the fillets skin-side down for 5 minutes, or until the skin is crisp and golden-brown. Turn over and cook for a few seconds. (The fish should be slightly undercooked.).", "Drain the fillets on kitchen paper and place flesh-side down into the cooled marinating liquid for 5 minutes.", "Meanwhile, fill a deep-fat fryer or a large, deep, heavy-bottomed pan two-thirds full with the oil. Heat to 180C (a cube of bread should turn brown in 1 minute when dropped in.) CAUTION: Hot oil can be dangerous. Do not leave unattended. Deep-fry the plantain for 2 minutes, or until golden-brown on the outside and soft on the inside. Drain on kitchen paper and season with a little salt.", "To serve, mix with the herbs, flowers, okra and chillies, if using, together. Leave to sit for 1 minute. Place the fritters on a serving plate. Drizzle with the olive oil and all but 1 tablespoon of the yoghurt. Put the marinated fish alongside with the fried plantain, remaining yoghurt and lemon wedges. "]}, {"isVegetarian": false, "title": "Marinated ribs with tomatillo salsa, guacamole and tortilla chips", "url": "www_bbc_co_uk_food_recipes_marinated_ribs_with_55287", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/marinated_ribs_with_55287_16x9.jpg", "ingredients": ["4 beef ribs, flanken cut to 1cm/½in thickness", "1 bunch of coriander, stalks and leaves finely chopped", "4 limes, juice only", "2 banana shallots, chopped", "4 tbsp olive oil", "1–2 tsp ground cumin", "½ tsp ground coriander", "3 garlic cloves, chopped", "1 jalapeño chilli, chopped ", "2 corn on the cobs, husks removed", "4 tomatillos (or green tomatoes), finely chopped", "1 garlic clove, finely chopped", "2 tbsp finely chopped coriander", "2 tbsp white wine vinegar", "pinch sugar", "pinch salt", "1 ripe avocado, flesh chopped", "½ green chilli, finely chopped", "½ red onion, very finely chopped", "lime juice, to taste", "2 tbsp chopped coriander", "6 corn tortillas", "2 tbsp vegetable oil"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Put the ribs into a large tray and add the remaining ingredients, reserving half the chilli for the salsa, and stir to combine. Leave to marinade at room temperature for at least 1 hour.", "Meanwhile, for the salsa, place the corn onto a large griddle pan and cook until browned all over. Remove the kernels and place into a large bowl. Add the remaining ingredients with the reserved chilli and mix.", "For the guacamole, put all the ingredients into a pestle and mortar and pound to combine.", "For the tortilla chips, preheat the oven to 200C/180C Fan/Gas 6. Cut the tortillas into triangles, place on a baking tray and drizzle with the oil. Bake for 6–8 minutes.", "For the ribs, heat a large griddle pan over a high heat, add the ribs and cook on each side of 1–2 minutes. Warm through the left over marinade in a small saucepan over a medium heat.", "Place the cooked ribs, salsa, guacamole and tortilla chips onto a large serving plate. Drizzle the warm marinade over the ribs and serve."]}, {"isVegetarian": false, "title": "Marinated salmon gravalax", "url": "www_bbc_co_uk_food_recipes_marinated_salmon_78063", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz caster sugar", "25g/1oz fine salt", "2 lemons, peel removed with a peeler, then finely sliced into julienne", "½ filleted side of salmon, weighing about 500g/1lb 2oz, skinned and pin boned", "300ml/11fl oz olive oil", "10g chopped fresh dill ", "200g/7¼ Greek-style yoghurt", "1 tsp wholegrain mustard", "pinch salt", "10g/½oz muscovado sugar", "1 tsp lemon juice", "freshly grated horseradish, to taste", "1 cucumber", "1 tsp wine vinegar", "salt, to taste", "2 tbsp olive oil", "1 tsp wholegrain mustard ", "5g/¼oz chopped fresh dill", "2 slices rye bread", "olive oil, to taste", "pinch salt", "2 tbsp chopped fresh dill", "1-2 tbsp mixed micro leaves"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Mix the sugar, salt and lemon peel together in a small bowl.", "Lay the salmon in a shallow dish and sprinkle the marinade over.", "Leave to marinate for one hour and then rinse off under cold running water.", "Divide the fish into four portions. ", "Put the olive oil in a large frying pan and heat to 45C/113F using a kitchen thermometer to check. If you don't have a thermometer, place the pan onto the heat, then dip a spoon in after 30 seconds. Feel the spoon to check the heat of the oil – it needs to be just warm. Keep the oil on the heat and keep checking every 30 seconds until the oil feels warm. Add the salmon to the pan, turn off the heat and leave the salmon for about 15-20 minutes.", "Set aside to cool, then transfer to a plate and leave in the fridge until ready to serve. ", "For the mustard sauce, mix all ingredients together in a small bowl and chill until required.", "For the cucumber salad, peel the cucumber and slice it into 1cm/½in cubes.", "Mix the cucumber with the vinegar, salt, olive oil and mustard in a bowl and set aside to marinate.", "Add the dill just before serving.", "For the rye croûtons, drizzle the bread slices with olive oil and sprinkle with salt. ", "Heat a frying pan and fry the rye bread until browned all over. Remove from the heat and transfer to a plate to cool slightly before breaking up into rustic croûtons. Sprinkle with the chopped dill.", "Sprinkle the chopped dill over the salmon and serve it with the rye croûtons, mustard sauce, cucumber salad and mixed micro leaves to garnish."]}, {"isVegetarian": true, "title": "Marinated beetroot", "url": "www_bbc_co_uk_food_recipes_marinatedbeetroot_67843", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/marinatedbeetroot_67843_16x9.jpg", "ingredients": ["650g/1lb 7oz raw beetroot", "500ml/17fl oz white or red wine vinegar", "2 litre/3½ pints water", "pinch of salt", "2 garlic cloves, sliced", "1 tbsp dried oregano", "1 red chilli, finely chopped", "500ml/17fl oz olive oil"], "serves": "Serves 4-6", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Wash and scrub the beetroot under cold running water. Place them in a saucepan with the vinegar, salt and water and bring to the boil. Reduce the heat, cover then pan and simmer for about 1¼ hours until the beetroot is tender. Meanwhile, combine all the marinade ingredients in a bowl and set aside.", "Once the beetroot is cooked, drain, place on a cloth and pat dry. Remove the skins with the help of the cloth. Cut into slices, place in the marinade and mix well. Leave for a day before serving. The beetroot will keep for several days in a covered container in the fridge but should be brought to room temperature before serving.", "Serve with some salami or air dried tuna."]}, {"isVegetarian": false, "title": "Barbecued marinated chicken breast with lime, coriander, ginger and chilli", "url": "www_bbc_co_uk_food_recipes_marinatedchickenbrea_86535", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["small bunch fresh coriander, chopped ", "100ml/3½fl oz olive oil", "2 limes, zest of one only and juice of both ", "20g/¾oz grated ginger", "2 garlic cloves, crushed", "1 fresh chilli, chopped", "smoked cayenne pepper, to taste (if unavailable, substitute smoked hot paprika)", "4 chicken breasts"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the marinade, place the chopped coriander, olive oil, lime zest and juice, ginger, garlic and chili into a bowl.", "Season, to taste, with cayenne pepper and whisk thoroughly. ", "Place the chicken breasts into a deep dish. Pour the marinade over the chicken, covering completely. Cover the dish and leave the chicken to marinate for three hours.", "Preheat the barbecue until the coals are white hot.", "Place the chicken breasts on the barbecue and cook for 15-25 minutes, or until cooked all the way through, turning occasionally."]}, {"isVegetarian": false, "title": "Marinated lamb chops with chargrilled field mushrooms and garlic butter", "url": "www_bbc_co_uk_food_recipes_marinatedlambchopswi_86536", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 tbsp olive oil", "2 garlic cloves, peeled and sliced ", "large sprig fresh thyme", "large sprig fresh rosemary  ", "8 lamb chops ", "salt and freshly ground black pepper ", "150g/5½oz unsalted butter, softened", "2 garlic cloves, peeled and crushed", "1 tbsp fresh flatleaf parsley, chopped", "8 fresh field mushrooms, stalks removed", "salt and freshly ground black pepper, to taste"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["For the marinated lamb chops, pour three tablespoons of olive oil into a deep dish or tray and add the sliced garlic. ", "Rub the thyme and rosemary between your hands to help release the herbs' aromatic oils, before placing into the oiled dish.", "Place the lamb chops on top of the herbs and garlic before covering with the remaining tablespoon of olive oil. Cover and place into a fridge to marinate overnight.", "For the garlic butter, mix the butter and crushed garlic in a bowl with the parsley.", "For the field mushrooms, spoon the garlic butter mix into the underside of the mushrooms. Season with salt and freshly ground black pepper.", "Preheat a barbecue until the coals are white hot. (Alternatively, cook on a very hot griddle pan or under a high grill.)", "Remove the lamb chops from the marinade and drain off any excess oil. Season with salt and freshly ground black pepper. Place onto the barbecue with a sprig of rosemary over each chop and cook to your liking.", "Meanwhile, place the mushrooms onto the barbecue, buttered side up, and cook slowly.", "To serve, place the mushrooms and lamb chops onto a serving plate."]}, {"isVegetarian": false, "title": "Marinated lamb", "url": "www_bbc_co_uk_food_recipes_marinatedlamb_10898", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 lamb neck fillets, get them cleaned by your butcher", "200ml/7fl oz spicy fruit chutney", "50ml/1½fl oz apricot jam", "1 can cola", "2 tbsp masala paste", "2tsp tumeric", "2 heaped tbsp tamarind paste", "malden salt", "freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["Mix all the marinade ingredients in a large bowl.", "Submerge the lamb in the marinade for 2 hours.", "Take the lamb out of the marinade and shake off any excess.", "Place the griddle pan or frying pan on the hob and drizzle with olive oil, ensure the pan is hot.", "Place the neck fillets in the pan and griddle for 8-10 minutes."]}, {"isVegetarian": false, "title": "Marinated mackerel diamonds", "url": "www_bbc_co_uk_food_recipes_marinatedmackereldia_65552", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 mackerel fillets ", "½ lemon ", "10 juniper berries, lightly crushed ", "1 sprig thyme, leaves only ", "1 quantity sweet-sour marinade ", "salt and freshly ground black pepper ", "400ml/14fl oz water ", "110g/4oz caster sugar ", "100ml/3½fl oz lemon juice ", "2 small licorice sticks, lightly crushed ", "4 star anise"], "serves": "Serves 6", "time": {"preparation": "over 2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["Pull out any pin bones from the mackerel using tweezers, cut the fillets into large diamonds and put them in a deep dish. ", "Cut the lemon half vertically through the middle, then slice it into thin semi-circles. Place these in between the mackerel diamonds, then scatter over the crushed juniper berries, salt, pepper and thyme. ", "Combine the water, sugar and lemon juice for the marinade in a saucepan and bring to the boil. Toss in the licorice sticks and star anise and simmer for 1 minute. ", "Pour the marinade over the mackerel diamonds while still hot. Cover with cling film and leave at room temperature until completely cold, then refrigerate for 2-3 hours depending on the size of the fish, a maximum of 2½ hours for small fillets, otherwise the consistency of the fish suffers. ", "Serve the mackerel straight from the dish, allowing everyone to season their own fish."]}, {"isVegetarian": true, "title": "Marinated olives", "url": "www_bbc_co_uk_food_recipes_marinatedolives_498", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz each of black and green olives", "4 tbsp extra virgin oil", "3 small sprigs each of fresh thyme, rosemary and oregano", "4 small fresh bay leaves", "1 large clove of garlic, sliced thinly", "2 lemon slices, quartered"], "serves": "Serves 30", "time": {"preparation": "over 2 hours", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 120, "preparationMins": 120}, "recommendations": 0, "method": ["Simply mix everything together, cover and set aside for 3-4 hours before serving."]}, {"isVegetarian": true, "title": "Marinated mushrooms with grilled goats' cheese, spinach and parsley 'pesto'", "url": "www_bbc_co_uk_food_recipes_marinatedmushroomswi_81826", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75g/3oz button mushrooms, brushed clean", "2 tbsp balsamic vinegar", "1 tbsp honey", "salt and freshly ground black pepper", "2 tbsp olive oil", "100g/3½oz baby leaf spinach", "1 lemon, juice only", "50g/2oz goats' cheese, sliced", "large handful parsley, roughly chopped", "½ clove garlic, finely chopped", "1 tsp sea salt", "freshly ground black pepper", "1 tbsp olive oil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the marinated mushrooms, put the mushrooms into a small bowl, add the balsamic vinegar, honey, salt and freshly ground black pepper. Stir well and leave to infuse for 10 minutes. Drain off the excess marinade and set aside.", "Preheat the grill to its highest setting.", "Heat the olive oil in a large pan, add the spinach, lemon juice, salt and freshly ground black pepper, and toss well. Cook for 1-2 minutes until wilted. ", "Remove from the heat, drain and squeeze out excess juice. Put the spinach into a chefs' ring on a baking tray and put the drained mushrooms on top. Remove the chefs' ring, add the sliced goats' cheese and place under the grill for four minutes or until slightly browned.", "To make the 'pesto', put all the ingredients in a pestle and mortar or mini blender and grind or blend until you have a smooth paste. ", "To serve, slide the mushroom stack onto a small plate and drizzle the pesto round the side."]}, {"isVegetarian": true, "title": "Marinated red cabbage and walnut salad", "url": "www_bbc_co_uk_food_recipes_marinatedredcabbagea_84895", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ red cabbage, thinly sliced ", "3 tbsp balsamic vinegar", "5 tbsp olive oil", "50g/1¾oz walnuts, chopped ", "1 handful fresh coriander, chopped ", "2 oranges, peeled, segmented"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the red cabbage, balsamic vinegar, olive oil, walnuts, and coriander into a bowl. Mix well and leave to marinate for five minutes.", "To serve, place the salad onto a plate and top with the orange slices."]}, {"isVegetarian": true, "title": "Marinated roasted peppers with a toasted cashew dressing", "url": "www_bbc_co_uk_food_recipes_marinatedroastedpepp_89250", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 red pepper, de-seeded, quartered", "4 tbsp olive oil", "1 tbsp balsamic vinegar", "2 cloves garlic, crushed", "6 fresh basil leaves, roughly torn", "100g/3½oz cashew nuts, toasted", "2 tbsp olive oil", "1 handful fresh coriander leaves"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the roasted pepper, place the pepper onto a baking tray and drizzle over one tablespoon of the oil. Place in the oven to roast for 8-10 minutes, or until tender, then remove and mix with the remaining pepper ingredients in a bowl.", "For the toasted cashew dressing, place the cashew nuts and oil into a food processor and blend until smooth.", "To serve, scatter the coriander leaves over a serving plate and pile the roasted pepper on top. Drizzle over the cashew dressing and serve."]}, {"isVegetarian": true, "title": "Marinated strawberries with mint and clotted cream", "url": "www_bbc_co_uk_food_recipes_marinatedstrawberrie_86537", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400g/14oz strawberries, washed and quartered ", "55g/2oz caster sugar ", "½ lemon, juice only ", "pinch of ground white pepper ", "1 tsp finely chopped fresh mint", "clotted cream, to serve"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 60, "preparationMins": 60}, "recommendations": 0, "method": ["Place half of the strawberries into a large bowl with most of the sugar and all of the lemon juice. Using a fork, mash well. Mix the remaining quartered strawberries into the mashed strawberry mix.", "Season the mixture with the pepper and chopped mint and adjust the sweetness to taste with the remaining sugar. Cover and leave to marinate in the fridge for 30 minutes.", "To serve, place the strawberries into bowls and spoon over clotted cream."]}, {"isVegetarian": true, "title": "Strawberries with tarragon and black pepper honeycomb with burnt English cream surprise", "url": "www_bbc_co_uk_food_recipes_marinatedstrawberrie_88476", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7¼oz caster sugar", "35g/1¼oz honey, preferably Solihull Heather ", "70g/2½oz liquid glucose (available in the baking section of some supermarkets)", "2 tbsp water", "10g/½oz bicarbonate of soda ", "freshly ground black pepper", "150g/5¼oz caster sugar", "150ml/5¼fl oz Banyuls sweet red wine", "50ml/2fl oz water", "3 star anise ", "6-7 strawberries per person, cut in half if large", "70g/2½oz caster sugar ", "2 tbsp water", "9 free-range eggs", "85g/3oz sugar, plus extra for sprinkling", "500ml/18fl oz double cream", "2 vanilla pods, split", "1 small bunch fresh tarragon, deep-fried in vegetable oil until crisp (CAUTION: hot oil can be dangerous. Do not leave hot oil unattended.)"], "serves": "Serves 4-6", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the honeycomb, place the sugar, honey, glucose and water into a pan and boil until the liquid reaches 150C/300F on a sugar thermometer. (This amount will double in volume so make sure you have a big enough pan.) Add the bicarbonate of soda and quickly whisk to combine. The mixture will rise up in the pan when the bicarbonate of soda is added so be careful. Immediately pour the mixture into a non-stick tray. Add several grindings of freshly ground black pepper and set aside to cool, uncovered. Break into shards.", "For the marinated strawberries, place the sugar, red wine, water and star anise into a medium saucepan and heat over a low heat until the liquid has reduced by half. Pour the reduced liquid over the strawberries in a small bowl and leave to infuse for 30 minutes.", "For the caramel, boil the sugar and water together in a shallow pan until it turns golden-brown. Brush the side of the pan with water every 40 seconds. Pour onto a greased non-stick baking sheet and leave to cool. When the caramel has set, shatter into shards.", "For the burnt English cream, remove the tops of the eggs with a special egg top remover (available from specialist kitchenware shops) and pour the contents through an egg separator (available from specialist kitchenware shops). Set aside the egg whites for another recipe (such as meringue; they will keep covered in the fridge for two days) and place the egg yolks in a mixing bowl. Remove the membrane and clean and dry the egg shells.", "Add the sugar to the bowl with the egg yolks and whisk together until pale and fluffy. Pour the cream into a small pan, add the vanilla seeds and place over a gentle heat to infuse the cream with the vanilla. When the cream is just below boiling point, remove from the heat, discard the vanilla pods and pour the hot cream over the egg yolks and sugar and whisk until combined. Pour the cream mix into a clean pan, return to a gentle heat and stir until the mix starts to thicken enough to coat the back of a wooden spoon. Set aside and leave to cool slightly.", "Carefully spoon the cream mix into the cleaned egg shells and set aside in an empty egg box to keep them level.", "To serve, sprinkle a little sugar over the custard in each egg and caramelise using a blowtorch. Serve the egg in a small eggcup on a small serving plate. Serve with the infused strawberries and garnish with the black pepper honeycomb, caramel and deep-fried tarragon leaves."]}, {"isVegetarian": true, "title": "Marjolaine", "url": "www_bbc_co_uk_food_recipes_marjolaine_71611", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/marjolaine_71611_16x9.jpg", "ingredients": ["125g/4½oz blanched almonds ", "125g/4½oz blanched hazelnuts ", "300g/10½oz caster sugar ", "25g/1oz cornflour ", "6 large free-range egg whites (reserve the yolks) ", "270ml/9½fl oz double cream ", "360g/12½oz plain chocolate, 46% cocoa solids, broken into pieces", "300g/10½oz caster sugar ", "100g/3½oz blanched almonds ", "225g/8oz caster sugar ", "pinch cream of tartar ", "8 free-range egg yolks ", "350g/12oz unsalted butter, slightly softened, cut into pieces ", "150g/5½oz flaked almonds ", "50g/1¾oz hazelnuts, chopped", "50g/1¾oz pistachios, slivered"], "serves": "Serves 10-12", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. Line two 30x20cm/12x8in Swiss roll tins with baking parchment. ", "For the dacquoise, tip the almonds and hazelnuts into the bowl of food processor and pulse until finely ground. Spread the ground nuts out in a layer on a baking tray and roast for 10 minutes, stirring every 3 minutes until golden-brown. Transfer to a large bowl and leave to cool. When cool, stir in 100g/3½oz of the caster sugar and the cornflour. Reduce the oven temperature to 150C/130C Fan/Gas 2.", " Pour the egg whites into the bowl of a free-standing electric mixer fitted with a whisk attachment and whisk on medium speed for about 2 minutes, until the egg whites are opaque and frothy. Increase the speed and add the remaining 200g/7oz caster sugar, a spoonful at a time, to make a stiff, glossy meringue. Gently fold the toasted nut mixture through the meringue. ", "Divide the meringue equally between the Swiss roll tins and spread out evenly using a palette knife. Bake for 45–60 minutes, until light golden-brown and firm to touch. Turn off the oven and open the oven door so it is just ajar, then leave the dacquoise inside until completely cool. ", "Remove from the oven and carefully invert onto a sheet of baking parchment. Carefully remove the baking parchment from the bottom of the meringues. ", "For the chocolate ganache, Pour the cream into a pan and heat until just simmering. Pu the chocolate in a heatproof bowl and pour over the cream. Stir until the chocolate is melted and the mixture is smooth. Leave to cool and then chill the ganache until thick enough to spread and pipe. ", "For the praline, line a baking tray with non-stick baking paper. Combine the caster sugar and 100ml/3½fl oz water in a pan over a medium heat, stirring until the sugar dissolves. Increase the heat and boil, without stirring, until the caramel turns golden-brown or reaches 170C on a sugar thermometer (CAUTION: boiling sugar is extremely hot. Handle very carefully. Use a deep pan to avoid bubbling over.). Meanwhile, toast the almonds in a dry pan until golden-brown. Remove sugar syrup from the heat and add the almonds, stir well and tip onto the prepared tray. Leave to cool. Break up the praline into pieces and blend to a fine powder in a food processor. ", "For the buttercream, pour 5 tablespoons water into a heavy-based pan with the sugar and cream of tartar. Bring to the boil and boil rapidly until it reaches 115C on a sugar thermometer (soft ball stage). Pour the yolks into the bowl of an electric mixer fitted with the whisk attachment. With the mixer running on medium speed, gradually pour in the sugar syrup, taking care not to splash the syrup onto the beaters. Continue whisking for 5-10 minutes until the mixture is thick and completely cool. Gradually add the butter bit by bit, whisking continuously. Fold in the praline powder and chill until needed. ", "To assemble, toast the almonds and hazelnuts in a dry frying pan until golden-brown. Using a very sharp knife, cut the dacquoise sheets in half lengthways so you have four sheets each measuring 30x10cm/12x4in. Place one sheet of meringue on a serving plate and spread with one quarter of the buttercream. Top with a second sheet of meringue and spread with one third of the ganache. Top with a third sheet of meringue and spread with another quarter of the buttercream. Top with final sheet of meringue. ", "Spread the remaining buttercream over the top and sides and press the toasted flaked almonds onto the sides of the gateau. Spoon the remaining ganache into a piping bag fitted with a small (no 33) star nozzle. Pipe the chocolate ganache around the top edge of the cake and in five diagonal lines, across the top of the cake. Fill the gaps between the diagonal piped lines with alternating hazelnuts and pistachios. "]}, {"isVegetarian": true, "title": "Marinated vegetables", "url": "www_bbc_co_uk_food_recipes_marinatedvegetables_10899", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 butternut, peeled and sliced", "2 large sweet potatoes, peeled and sliced", "¼ kabocha pumpkin, peeled and cubed", "2 green courgette, cubed", "2 yellow courgette, cubed", "1 large aubergine, cubed", "4 lemons, juice only", "50ml/2fl oz balsamic vinegar", "1 tsp ginger powder", "2 tbsp dark soy sauce", "olive oil", "50g/ 2oz fresh ginger, chopped", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["Mix all the marinade ingredients together in a large bowl.", "Peel the butternut and sweet potatoes, then slice in pieces no bigger than ½-¾cm/¼-½in thick.  ", "Dice the remaining vegetables to the same size.", "Submerge all the vegetables in the marinade for 2 hours.", "Take the vegetables out of the marinade and remove any excess liquid.", "Place the griddle pan or frying pan on the hob and drizzle with a little olive oil, ensure the pan is hot.", "Place the vegetables in the pan and grill for 2-3 minutes."]}, {"isVegetarian": true, "title": "Marmalade and almond tart", "url": "www_bbc_co_uk_food_recipes_marmalade_and_almond_20972", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz ready-rolled shortcrust pastry", "250g/9oz unsalted butter", "250g/9oz caster sugar", "4 free-range eggs", "250g/9oz ground almonds", "1 jar marmalade ", "150g/5½ oz flaked almonds ", "250g/9oz clotted cream or crème fraîche, to serve"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 160C/140C Fan/Gas 3 and line a 20cm/8in tart tin with the pastry.", "Make an almond paste by beating together the butter and sugar in a large mixing bowl. Add the eggs one by one, beating well between each addition. Mix in the ground almonds, then place in the fridge to chill for 10 minutes.", "Spread a very generous amount of the marmalade on the base of the tart. Top with the almond paste and scatter over the flaked almonds. Bake for 40–50 minutes, until the pastry is crisp and the filling golden and risen.. ", "Serve the tart in slices with clotted cream or crème fraîche. "]}, {"isVegetarian": true, "title": "Marmalade and almond cake", "url": "www_bbc_co_uk_food_recipes_marmalade_and_almond_75536", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/marmalade_and_almond_75536_16x9.jpg", "ingredients": ["200g/7oz unsalted butter, softened, plus extra for greasing", "200g/7oz caster sugar", "3 tbsp fine-cut marmalade", "2 free-range eggs", "150g/5½oz semolina", "75g/2½oz ground almonds", "½ tsp baking powder", "2 oranges, finely grated zest only", "50ml/2fl oz orange juice", "25g/1oz unsalted butter, softened", "175g/6oz cream cheese", "100g/3½oz icing sugar"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Grease a 20cm/8in springform cake tin and line the base with baking parchment.", "Cream the butter and sugar together until pale and fluffy. Beat in the marmalade then beat in the eggs, one at a time.", "In a separate bowl, thoroughly combine the semolina, almonds and baking powder. Add to the mixture, along with the orange zest, and fold in. Finally, mix in the orange juice to create a mixture with a soft dropping consistency.", "Spoon the batter into the prepared cake tin and smooth the top with the back of a spoon.", "Bake for 35 minutes, or until the cake is golden-brown. Leave in the tin to cool for five minutes, then remove and transfer to a wire rack to cool completely.", "To make the frosting, beat the butter and cream cheese together. Sift in the icing sugar and beat until smooth. Use a palette knife to spread the frosting on top of the cake. Chill before serving, so the icing sets."]}, {"isVegetarian": false, "title": "Marmalade and mustard gammon with parsley sauce", "url": "www_bbc_co_uk_food_recipes_marmalade_and_mustard_13434", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2.5kg/5lb 8oz gammon", "1 lemon, halved", "1 orange, halved", "1 apple, halved", "1 cinnamon stick", "1 onion, halved", "2 dried chillies", "5 star anise", "375g/13oz marmalade", "200g/7oz honey", "2 heaped tsp English mustard", "1 tsp cloves", "1kg/2lb 4oz new potatoes", "50g/1¾oz butter", "400ml/14fl oz milk", "1 onion, halved, each half studded with 2 cloves and 1 bay leaf", "50g/1¾oz butter", "25g/1oz plain flour", "50ml/2fl oz double cream", "squeeze lemon juice", "small bunch fresh flatleaf parsley, finely chopped", "sea salt and freshly ground black pepper"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Place the gammon into a large, heavy-based, lidded saucepan with the lemon, orange, apple, cinnamon stick, onion, chillies and 2 of the star anise. Pour in enough water to cover the gammon.", "Cover the pan with the lid, place onto the heat, bring the water to the boil, then turn the heat down until simmering. Simmer for 2 hours, or until the meat is tender, then set aside to cool in the cooking liquid.", "Preheat the oven to 230C/210C Fan/Gas 7.", "In a small pan, heat the marmalade, honey, mustard, the remaining 3 star anise and the cloves in a small pan until the preserves have melted, then stir and set aside.", "Lift the cooled ham from the cooking liquid and transfer to a roasting tin. Carve the layer of fat on top of the ham in a criss-cross pattern, then spread the marmalade glaze over the top. Return to the oven for a further 20 minutes, basting with the glaze every 5-8 minutes, until the surface of the gammon is golden-brown and just starting to blacken at the edge.", "Meanwhile, boil the potatoes in a saucepan of salted water for 10-15 minutes, or until just tender, then drain and return to the pan. Stir in the butter to coat, then season, to taste, with salt and freshly ground black pepper. Keep warm.", "For the parsley sauce, pour the milk into a saucepan and add the clove-studded onion halves. Heat until just simmering, then turn off the heat and leave to infuse for a few minutes.", "In a separate saucepan, heat the butter until melted, then whisk in the flour until well combined and cook for 30 seconds. Whisk in the infused milk a little at a time, waiting until the sauce thickens before adding each new batch of milk - you should end up with a smooth sauce the consistency of double cream. Stir in the double cream and then cook for further 1-2 minutes. Season with lemon juice, to taste, and salt and freshly ground black pepper, then remove the pan from the heat and stir in the chopped parsley.", "To serve, pile the buttered potatoes onto a serving platter and place the gammon on top. Pour the parsley sauce into a jug to serve alongside. Carve at the table."]}, {"isVegetarian": true, "title": "Marmalade cake", "url": "www_bbc_co_uk_food_recipes_marmalade_cake_63038", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["vegetable oil, for greasing", "100g/3½ oz self-raising flour", "50g/1¾ oz butter, softened", "50g/1¾ oz caster sugar", "½ tsp mixed spice", "1 tbsp marmalade", "1 tbsp orange juice", "2 tbsp raisins", "1-2 tbsp milk", "1 tbsp demerara sugar"], "serves": "", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Grease and line a loaf tin.", "Put the flour and butter into  bowl and rub together until the mixture resembles breadcrumbs. Stir in the caster sugar and mixed spice.", "Mix the marmalade, orange juice, raisins and one tablespoon of milk together in a separate bowl.", "Stir the marmalade mixture into the flour mixture, then spoon into the loaf tin. Sprinkle over the demerara sugar.", "Bake for 30-35 minutes, or until risen and golden-brown and a cake tester inserted into the middle comes out clean."]}, {"isVegetarian": true, "title": "Marmalade yoghurt cake", "url": "www_bbc_co_uk_food_recipes_marmalade_yoghurt_cake_97760", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/marmalade_yoghurt_cake_97760_16x9.jpg", "ingredients": ["125g/4½oz full-fat Greek-style yoghurt", "50ml/2fl oz vegetable oil ", "1 lemon, zest only", "1 orange, zest only ", "3 free-range eggs", "125g/4½ caster sugar", "200g/7oz plain flour", "2 tsp baking powder", "75g/3oz marmalade ", "1 tbsp orange juice", "Greek-style yoghurt"], "serves": "Makes 1 x 450g/1lb loaf cake", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Grease and line a 450g/1lb loaf tin. ", "In a large bowl beat together the yoghurt, vegetable oil, lemon and orange zest and eggs until light and fluffy. Sift in all the dry ingredients and mix until just combined. ", "Spoon the mixture into the loaf tin and bake for about 45 minutes. (Test the cake by inserting a skewer into the centre. If the skewer comes out clean, the cake is done.)", "Remove from the oven and leave to cool a little in the tin.", "Meanwhile for the glaze, warm the marmalade and orange juice until the marmalade melts. Pour the glaze over the cake and set aside to cool completely.", "Remove the cake from the tin and serve with lashings of Greek-style yoghurt."]}, {"isVegetarian": false, "title": "Marmalade and sesame roasted salmon with crushed new potatoes", "url": "www_bbc_co_uk_food_recipes_marmaladeandsesamero_88300", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz salmon fillet, skin removed", "1 tsp orange marmalade", "dash olive oil", "salt and freshly ground black pepper", "1 tbsp sesame seeds, toasted in a hot pan", "85g/3oz new potatoes, cooked, kept warm ", "3 tbsp Greek-style yoghurt", "1 tsp soy sauce", "small handful fresh dill, chopped", "salt and freshly ground black pepper", "½ red chilli, finely chopped", "2 tsp fresh root ginger, grated", "3 tbsp olive oil", "½ orange, juice only", "2 tsp sesame oil", "1 tbsp soy sauce", "1 tbsp sesame seeds, toasted in a hot pan"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the roasted salmon, place the salmon fillet into a hot pan and sear on all sides until golden-brown on the outside but still pink in the middle.", "Brush the salmon with marmalade and olive oil, then roll in the toasted sesame seeds to coat well. Leave to cool and then, with a very sharp knife, slice the salmon thinly.", "For the crushed new potatoes, place the cooked potatoes into a bowl, add the rest of the crushed new potatoes ingredients and crush roughly with the back of a fork.", "For the dressing, place the dressing ingredients into a small bowl and whisk to combine.", "To serve, place the crushed new potatoes onto a serving plate. Arrange the salmon slices alongside and drizzle with the dressing."]}, {"isVegetarian": true, "title": "Marmalade panettone pudding", "url": "www_bbc_co_uk_food_recipes_marmaladepanettonepu_89197", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["butter, for greasing", "5 tbsp marmalade ", "325g/11½oz ready-made panettone, thinly sliced", "4 large free-range eggs", "500ml/18fl oz whole milk", "2-3 drops vanilla extract", "double cream, to serve"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/355F/Gas 5.  Lightly butter a deep ovenproof dish.", "Melt the marmalade in a small saucepan over a low heat. Lay half of the panettone slices in a single layer in the buttered dish, then spoon over half of the marmalade. ", "Beat the eggs together with the milk and vanilla extract. Pour half of the egg and milk mixture over the panettone, then layer over the remaining panettone slices, the rest of the marmalade and the rest of the egg and milk mixture. ", "Bake the pudding in the oven for 35-40 minutes, or until it is puffed and golden-brown. Shake it gently, it should wobble but show no sign of uncooked custard. ", "Serve warm with a drizzle of double cream."]}, {"isVegetarian": false, "title": "Marmalade chicken", "url": "www_bbc_co_uk_food_recipes_marmaladechicken_71450", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 tbsp good marmalade (preferably Seville orange marmalade)", "1 tbsp ginger, finely chopped", "3 garlic cloves finely chopped ", "2 tsp Dijon mustard ", "½ tsp sea salt ", "freshly ground black pepper ", "50ml/1¾fl oz orange juice ", "1 tbsp olive oil ", "8 chicken pieces, legs or thighs ", "4 spring onions, finely chopped", "salad or mashed potatoes, to serve."], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oven to 180C/350F/Gas 4. ", "In a bowl, combine the marmalade, ginger, garlic, mustard, salt, pepper, orange juice and olive oil and mix well.", "Add the chicken and coat well.", "Line a baking tin with kitchen foil and tip the chicken and its marinade into the tin. ", "Cover the top with foil and bake for 30 minutes. ", "Remove the top foil, spoon the marmalade mixture in the bottom of the pan over the chicken and bake uncovered for 15-20 minutes until the chicken is nicely browned (beware of burning). ", "Add spring onions near the end of cooking to warm through, season well, to contrast with the sweetness of the orange juice, and serve with salad or mash."]}, {"isVegetarian": true, "title": "Marmalade sponge pudding with cardamom crème anglaise", "url": "www_bbc_co_uk_food_recipes_marmaladespongepuddi_88298", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["55g/2oz softened butter, plus extra for greasing", "55g/2oz caster sugar", "1 free-range egg", "55g/2oz self-raising flour", "1 tbsp milk", "2 tbsp orange marmalade", "3 tbsp orange marmalade", "squeeze fresh orange juice", "2 free-range egg yolks", "2 tsp cornflour", "30g/1oz caster sugar", "4 cardamom pods, seeds crushed", "300ml/½ pint milk"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the sponge puddings, place the softened butter and sugar into a food processor and blend until smooth and light.", "Add the egg, flour and milk and blend again to a smooth batter.", "Grease two ramekins and add a tablespoon of marmalade into the bottom of each. Divide the sponge batter between the two ramekins making sure that the marmalade bottom is covered completely. Leave a few inches of room at the top for the sponges to rise. Cover with cling film and cook in the microwave at its highest setting for 4-5 minutes. Remove the cling film, loosen the edges of the sponge with a knife, and turn out the sponges onto two serving plates.", "For the orange syrup, place the marmalade and orange juice into a small pan over a low heat and gently warm through.", "For the crème anglaise, place the egg yolks, cornflour, sugar and cardamom into a small pan and stir until combined. Place over a low heat and gradually add the milk, stirring constantly, until thickened.", "To serve, pour the orange syrup over each sponge and serve the cardamom crème anglaise in a jug alongside."]}, {"isVegetarian": false, "title": "Marmitako (Basque fish stew)", "url": "www_bbc_co_uk_food_recipes_marmitako_46210", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["head and bones of the bonito (see below), or you can use hake or cod head and bones (you can get these from the fishmonger)", "2 tbsp olive oil", "1 leek, roughly chopped", "1 carrot, roughly chopped", "1 clove garlic, very finely chopped", "1 onion, roughly chopped", "1 bay leaf", "1 tbsp olive oil", "2 garlic cloves, crushed", "1 onion, very finely chopped", "1 large Italian red pepper (around 200g/7oz) very finely chopped", "200g/7oz padron pepper, very finely chopped", "1 red chilli, finely chopped with seeds removed", "5-6 ripe plum tomatoes, grated, to make a sauce", "2 dried choriceros peppers, soaked in water.  Butterfly the peppers and scrape the paste from the inside with a spoon, leaving the skin (if you can’t get the peppers you can buy the paste)", "200ml/7fl oz Txakoli (a Basque wine), or other dry, slightly sparkling white wine", "1kg/2lb 4oz potatoes, peeled, cut into chunks the same size as the fish", "1 bay leaf", "75ml/2½fl oz extra virgin olive oil", "2kg/4lb 8oz bonito (if you can’t get hold of one, use 1kg/2lb 4oz of fresh tuna) cut into large chunks ", "bunch of parsley, roughly chopped", "150ml/5fl oz extra virgin olive oil", "50ml/2fl oz Moscatel vinegar", "1 shallot, very finely chopped", "small bunch of chives, finely chopped", "3 sweet Basque piquillo peppers (from a jar), cut into strips ", "2 heads of Little Gem, leaves only", "salt and freshly ground black pepper"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the fish stock, clean the gills of the fish, ensure that there is no blood whatsoever. Heat the olive oil in a large pan. Gently cook the vegetables, add the fish head and bones, 3 litres/5¼ pints of water and a bay leaf. Heat the stock so it is steaming, but do not boil, for 20 minutes. Pass through a sieve and set aside.", "For the marmitako, in a large saucepan heat the olive oil. Gently fry the onion and garlic. When half softened, add the red pepper and cook for 2 minutes, then add the padron pepper. When everything is soft add the chilli and tomato sauce. ", "Cook out the acidity and water of the tomato so that it is almost like a paste. Add the choriceros paste and the wine. Cook off the alcohol for a few seconds and then add the potato chunks and season with salt and pepper. Pour in 200ml/7fl oz of the fish stock and add a bay leaf. It should take around 20 minutes for the potatoes to cook. ", "Meanwhile in a separate pan, heat until very hot, add 75ml/2½fl oz of olive oil and quickly flash fry the bonito (or tuna) to caramelise it on the outside but keep it raw in the middle.", "Once the potatoes are cooked, add the fish to the stew, gently mix it in and take the pan off the heat. Put the lid on and leave it to stand for 10 minutes. After ten minutes give it a gentle shake. Mix the chopped parsley into the stew, drizzle with olive oil and serve.", "For the baby gem salad, in a small bowl, mix the olive oil and vinegar until they emulsify, add the shallot and chives and season. Add the piquillo peppers and mix gently so that they don’t break up. ", "To serve, place a few leaves on a plate and drizzle with the dressing. Place some more leaves on top and drizzle again and so on, so that the leaves remain crisp. Season with salt and pepper.", "Serve the marmitako in bowls with the salad alongside."]}, {"isVegetarian": false, "title": "Marsala lamb chops with smothered onions and fried kidneys", "url": "www_bbc_co_uk_food_recipes_marsala_lamb_chops_with_43717", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp sunflower oil", "24 fresh sage leaves, depending on size", "sprigs flatleaf parsley (optional)", "2 large carrots (around 400g/14oz total weight)", "1 large parsnip (around 255g/9oz)", "½ large celeriac (around 500g/1lb 2oz)", "50g/1¾oz butter", "¼ whole nutmeg, freshly grated", "flaked sea salt and freshly ground black pepper", "50g/1¾oz butter, cut into cubes", "2 large onions, halved and finely sliced", "1 tbsp sunflower oil ", "8 lamb chops", "4 lamb’s kidneys", "1 tbsp plain flour ", "150ml/5fl oz Marsala wine (or Madeira or medium sherry)", "flaked sea salt and freshly ground black pepper", "freshly cooked green beans, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["To make the garnish, pour the oil into a small frying pan and place over a medium heat for a couple of minutes. (CAUTION: hot oil can be dangerous; do not leave unattended.) Lower the sage leaves gently into the oil with a slotted spoon or tongs, taking care to avoid any splashes or spits of oil.  ", "Fry the sage leaves for 20-30 seconds, or until they look translucent but don’t start to brown. Quickly lift out of the oil with a slotted spoon or tongs and drain on kitchen paper; set aside. They will crisp up even more as they cool.", "For the three root mash, peel all the vegetables and cut into 2.5cm/1in chunks. Put the vegetables in a large saucepan and cover with cold water. Bring to the boil over a high heat. ", "Reduce the temperature slightly and simmer the vegetables for 25-30 minutes, or until very tender.", "Drain the vegetables in a colander and then return to the saucepan and mash with the butter, grated nutmeg and lots of salt and pepper to taste. For an extra smooth mash, blend with a stick blender until velvety and smooth. ", "For the lamb, melt 25g/1oz of the butter in a large, sturdy non-stick frying pan and fry the onions over a low heat for 10 minutes, stirring occasionally. Increase the heat and cook for a further 3-4 minutes, stirring constantly until golden-brown. Tip the onions onto a plate and put to one side.", "Return the pan to the heat and add the sunflower oil. Season the lamb chops really well with salt and pepper and fry over a medium-high heat for 2½-3 minutes on each side.", "While the lamb is cooking, prepare the kidneys. First give them a good rinse in a colander and then tip onto a board and cut in half right through the middle to give two equal kidney-shaped pieces. Using sharp kitchen scissors, carefully cut out the white central core. ", "Put the plain flour in a bowl, add a couple of good pinches of salt and a few twists of ground black pepper. Toss the kidneys in the seasoned flour until lightly coated. Shake off any excess flour before frying.", "Turn the lamb chops onto their fat side and leave to sizzle for another 2-3 minutes, or until golden-brown. Add the kidneys to the pan with the lamb. Cook the kidneys on one side for three minutes. ", "Transfer the lamb to a warm plate and leave to rest. Turn the kidneys and cook for a further three minutes on the other side, or until lightly browned and cooked through. If in doubt, turn and cook for an extra minute on each side. Put the kidneys on the plate with the lamb. Drain off any excess fat from the frying pan and place it back onto the heat.", "Return the fried onions to the pan and cook for 1-2 minutes, or until hot, stirring with a wooden spoon. Add the Marsala and then quickly stir in the remaining cubes of butter. The sauce will thicken as you stir.", "Arrange the lamb chops and kidneys on four warmed plates and spoon over the Marsala onions. Sprinkle with the fried sage leaves and garnish with sprigs of flatleaf parsley if you like. Serve with three root mash and freshly cooked green beans."]}, {"isVegetarian": false, "title": "Marshmallow brownies", "url": "www_bbc_co_uk_food_recipes_marshmallowbrownies_8128", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/marshmallowbrownies_8128_16x9.jpg", "ingredients": ["240g/8oz butter", "150g/5oz dark chocolate (a spicy one works well)", "60g/2oz cocoa", "150g/5oz plain flour", "500g/1lb 2oz caster sugar", "5 eggs, beaten", "150g/5oz marshmallows, chopped"], "serves": "Makes 24 slices", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oven to 190C/375F/Gas 5. Line a 30cm/12in square tin with baking parchment.", "Melt the butter and the chocolate together very gently.", "Mix the cocoa with the flour and the sugar and, off the heat, mix this mixture into the butter and chocolate. Mix in the eggs and fold in the marshmallows. ", "Turn the brownie mixture into the tin and bake in the oven until the surface has set but still feels squidgy underneath. This will take about 20 minutes. Allow to cool and slice."]}, {"isVegetarian": false, "title": "Marshmallows", "url": "www_bbc_co_uk_food_recipes_marshmallows_93239", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 x 7g sachets powdered gelatine", "450g/1lb caster sugar", "2 tsp vanilla extract (or 1 tsp almond extract)", "1 tbsp sunflower oil", "50g/2oz icing sugar, plus extra for dredging", "50g/2oz cornflour, plus extra for dredging", "finely chopped pistachios, crystallised flower petals, or coloured caster sugar to coat (optional)"], "serves": "36 marshmallows", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Place the gelatine and 100ml/3½fl oz of cold water into a bowl. Set aside for 10 minutes, or until softened.", "Meanwhile, pour the sugar and 175ml/6fl oz of cold water into a heavy-based saucepan and bring to a rolling boil on a medium to high heat, stirring continuously, until the sugar dissolves. ", "Reduce the heat to low and simmer the mixture gently for 15-20 minutes, until a sugar thermometer dipped into the mixture reads 113C/235F. (NB: At this temperature, the sugar syrup will have reached the soft-ball stage.) CAUTION: This mixture is extremely hot and can be dangerous. Do not leave unattended.", "As soon as the sugar syrup reaches the correct temperature, place the softened gelatine and water into the bowl of a food mixer and blend on its lowest setting. Gradually pour in the sugar syrup in a slow, steady stream, avoiding pouring the sugar syrup on the beaters as it may splash. Whisk continuously until all of the syrup has been fully incorporated in the mixture. ", "Add the vanilla extract, then increase the blending speed and blend for 18-20 minutes, or until the mixture has thickened, cooled and is beginning to set.", "Meanwhile, grease a 20cm/8in square, deep-sided cake tin with some of the sunflower oil. Line the tin baking parchment and grease the paper with the remaining oil. Mix together the icing sugar and cornflour and dust the tin with a little of the mixture to evenly coat the base and sides. Reserve the remaining icing sugar and cornflour mixture for later.", "Pour the marshmallow mixture into the prepared tin and smooth the surface with a palette knife or spatula that has been dipped in boiling water. Dust the top of the marshmallows with a little more of the icing sugar and cornflour mixture, then cover the tin with cling film and set aside in a cool, dry place for 1-2 hours or overnight to set. (NB: Do not chill in the fridge.)", "Once the marshmallow mixture has set, turn out the marshmallow slab onto a clean work surface dusted with the remaining icing sugar and cornflour mixture. Peel off the parchment paper and cut the marshmallow into 36 cubes. Dredge the marshmallows in the icing sugar and cornflour mixture to coat, or coat one or more sides in the chopped nuts, flower petals or coloured sugar for decoration. Store in an airtight container in a cool, dry place for up to three weeks."]}, {"isVegetarian": false, "title": "Martinique coconut chicken curry", "url": "www_bbc_co_uk_food_recipes_martiniquecoconutchi_91706", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["¼ tsp ground turmeric", "1 tsp ground coriander", "1 tsp yellow mustard seeds", "3 garlic cloves, roughly chopped ", "½-1 Scotch bonnet chilli, seeds removed", "1 tsp sea salt flakes", "12 chicken pieces (a mixture of thighs and drumsticks)", "salt and freshly ground black pepper", "4 tbsp sunflower or groundnut oil", "2 onions, roughly chopped", "500g/1lb 2oz butternut squash, peeled, seeds removed, cut into 5cm/2in cubes", "2 aubergines, cut into 4cm/1½in cubes", "2-3 large waxy potatoes, peeled and cut into 4cm/1½in pieces", "1 x 400ml/14fl oz can coconut milk", "300ml/½ pint chicken stock", "1 tbsp tamarind paste ", "3 small bay leaves ", "1 large ripe mango, peeled, core removed, chopped into 5cm/2in pieces", "1 large ripe papaya, peeled, seeds removed, sliced", "½ lime, juice only", "1½ tbsp rum (optional)", "330g/¾lb rice, cooked according to packet instructions, to serve"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the spice mix, grind the spice mix ingredients to a paste using a mortar and pestle. Set aside.", "For the coconut chicken curry, season the chicken pieces, to taste, with salt and freshly ground black pepper.", "Heat two tablespoons of the oil in a large, heavy-based saucepan or deep-sided casserole over a medium heat. Add the seasoned chicken pieces and fry for 3-4 minutes, turning regularly, or until browned on all sides. Remove from the pan and set aside (keep warm). ", "Heat the remaining two tablespoons of oil in the same pan, then add the onions, butternut squash, aubergines and potatoes, in batches if necessary, and fry for 4-5 minutes, stirring regularly, or until just softened and pale golden-brown. ", "Add the spice mix to the pan and stir well to coat the vegetables. Continue to cook the mixture for 3-4 minutes, stirring well, or until the spices are fragrant. ", "Return the browned chicken pieces to the pan and add the coconut milk, chicken stock, tamarind paste and bay leaves. Stir well and bring the mixture to the boil, then reduce the heat until the mixture is simmering. Cover the pan with a lid and continue to simmer for 35-40 minutes, or until the chicken pieces are tender and the sauce has thickened. ", "Add the mango, papaya, lime juice and rum (if using), stir the mixture well, then cover and continue to simmer for 4-5 minutes, or until the fruit has warmed through.", "To serve, divide the rice equally among six serving plates. Spoon over the coconut chicken curry."]}, {"isVegetarian": true, "title": "Maru's spiced salsa", "url": "www_bbc_co_uk_food_recipes_maru_dip_46650", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 small carrot, peeled, diced", "1 small onion, chopped", "2 ripe tomatoes, chopped", "1 red chilli, deseeded and finely chopped", "1-2 small handfuls finely chopped fresh coriander", "1 garlic clove, finely chopped", "¼ tsp ground turmeric", "¼ tsp ground cumin", "2-4 tbsp rapeseed oil", "1 tbsp white wine vinegar", "pinch sugar", "1 tbsp tomato ketchup", "pinch salt", "squeeze lemon juice", "1 spring onion, trimmed, thinly sliced, to garnish"], "serves": "Serves 3-4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Put the carrot and onion in a bowl and chop to small pieces using a hand blender.", "In a separate bowl, blend the tomatoes and chilli to a smooth purée. ", "Combine the two mixtures, then stir in the remaining ingredients, adding salt if required. You want the consistency of salsa.", "Season the salsa with lemon juice and garnish with spring onion."]}, {"isVegetarian": true, "title": "Marula fruit liqueur and coffee crème brûlées", "url": "www_bbc_co_uk_food_recipes_marula_fruit_liqueur_and_29614", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500ml/18fl oz whipping cream", "1 vanilla pod, split lengthways, seeds scraped out", "6 egg yolks", "1 tsp good-quality vanilla essence", "50g/1¾oz caster sugar", "50ml/2fl oz marula fruit liqueur (look for Amarula)", "25ml/1fl oz coffee liqueur, such as Tia Maria", "coffee extract, to taste", "6 tsp caster sugar"], "serves": "Makes 6", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Put the cream and vanilla pod in an enamel or stainless steel saucepan and bring very gently to a simmer, stirring occasionally to prevent scorching.", "Put the egg yolks, vanilla essence and sugar in a large bowl. Using a hand-held mixer beat for 4-5 minutes until thick, pale and a ribbon is left when the mixture is trailed back over itself. Remove the vanilla pod and slowly mix small batches of the hot cream into the yolks.", "Add the marula fruit liqueur, coffee liqueur and coffee extract. ", "Preheat the oven to 170C/150C Fan/Gas 3.", "Strain the flavoured custard and then divide equally between 6 ramekins. Place the ramekins in a deep roasting tin and add enough just boiled water to reach halfway up the sides of the ramekins.", "Bake for 45 minutes, or until set but with a slight wobble. Cool thoroughly and chill in the fridge, then clean carefully round the edges.", "For the sugar crust, preheat the grill to its highest setting. Sprinkle a teaspoon of sugar over each crème brûlée and put them under the grill until the sugar melts and caramelises. Alternatively use a chef’s blowtorch to caramelise the sugar. Serve once the caramel has hardened."]}, {"isVegetarian": true, "title": "Mary Berry’s Easter biscuits", "url": "www_bbc_co_uk_food_recipes_mary_berrys_easter_46791", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mary_berrys_easter_46791_16x9.jpg", "ingredients": ["100g/3½oz unsalted butter, softened", "75g/2¾oz caster sugar, plus extra for dusting", "1 free-range egg, separated", "1 small unwaxed lemon, finely grated zest only", "200g/7oz plain flour, plus extra for dusting", "50g/1¾oz currants", "1–2 tbsp milk"], "serves": "Makes 24 x 6cm/2½in biscuits", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven 200C/180C Fan/Gas 6. Line three baking trays with baking paper.", "Put the butter and sugar in a bowl and beat until well combined and fluffy. Add the egg yolk and lemon zest. Sift in the flour and mix well. Stir in the currants and enough milk to make a fairly soft dough.", "Knead the dough on a floured work surface and, using a rolling pin, roll out the dough until 5mm/¼in thick. Using a 6cm/2½in fluted cutter, cut out 24 rounds. Transfer to the baking trays using a palette knife and bake for 8 minutes.", "Lightly beat the egg white using a fork. ", "Remove the biscuits from the oven and brush the tops with the beaten egg white. Sprinkle over caster sugar and return to the oven for 5 minutes, or until pale golden-brown and cooked though. Leave to cool on the trays for a few minutes, then carefully lift onto a wire rack to cool completely."]}]