[{"ingredients": ["150g / 5½oz de arroz basmati", "1 cucharada de aceite vegetal", "1 chile rojo fresco, finamente picado", "Florecillas de brócoli 100 g / 3½ oz", "2 cucharadas de perejil fresco picado", "1 cucharada de salsa de soja", "1 cucharada de aceite vegetal", "1 filete de lubina", "2 cucharadas de vinagre balsámico", "1 cucharadita de semillas de sésamo", "1 cucharadita de miel clara", "1 cucharada de cebolletas frescas picadas, para servir"], "method": ["Para el arroz con brócoli picante, cocine el arroz en agua hirviendo con sal, de acuerdo con las instrucciones del paquete. Desagüe.", "Calentar el aceite vegetal en una sartén. Agregue el chile y el brócoli y saltee durante 2-3 minutos. Agregue el arroz cocido, el perejil y la salsa de soja y mezcle. Coloque el arroz en un plato y manténgalo caliente.", "Para la lubina, caliente el aceite en otra sartén. Coloque el filete de lubina en la sartén, con la piel hacia abajo, y fría por tres minutos. Agregue el vinagre balsámico, las semillas de sésamo y la miel. Voltee el pescado y cocine por otros 2-3 minutos, o hasta que el pescado esté completamente cocido.", "Para servir, coloque la lubina en el plato al lado del arroz y espolvoree sobre el cebollino fresco picado."], "url": "www_bbc_co_uk_food_recipes_blackseabassfilletwi_87434", "title": "Filete de lubina con arroz picante de brócoli", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 diente de ajo, pelado", "2 cebollas tiernas, finamente picadas", "5 cabezas de gambas y caparazones", "75ml / 2½fl oz de vino blanco", "1 cucharadita de puré de tomate", "1 cucharadita de ketchup de tomate", "100ml / 3½fl oz de agua hirviendo", "125ml / 4fl oz de crema doble", "1 cebolleta, picada", "1 tomate, picado", "Espagueti negro de 300 g / 10½ oz (tinta de calamar), cocido de acuerdo con las instrucciones del paquete"], "method": ["Para el caldo de cangrejo de río, coloque el ajo, las cebolletas, las cabezas de gambas y las cáscaras, el vino blanco, el puré de tomate, el ketchup y el agua en una cacerola mediana; colocar sobre el fuego y hervir durante ocho minutos. Cuele sobre un recipiente, reservando el caldo y descartando las cáscaras y las verduras.", "Para la salsa de pasta, vierta el caldo colado nuevamente en la sartén, agregue la crema y la cebolla tierna y cocine a fuego medio durante dos minutos. Agregue el tomate.", "Para servir, ponga los espaguetis en dos tazones de pasta y cubra con la salsa."], "url": "www_bbc_co_uk_food_recipes_blackspaghettiwithwh_85271", "title": "Espagueti negro con salsa de vino blanco, cangrejo de río y tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["5 g / 1 / 8oz de levadura", "125ml / 4fl oz de leche caliente", "75g / 2¾oz de harina de alforfón", "1 huevo, separado", "Pizca de sal", "aceite, cocinar"], "method": ["Disuelva la levadura en la mitad de la leche. Coloque la harina en un recipiente y haga una hendidura en el centro. Agregue la levadura y la mezcla de leche y déjelo en un lugar cálido por 45 minutos.", "Después de este tiempo, caliente un poco la leche restante y bata la yema de huevo. Agregue a la mezcla anterior y mezcle bien, luego déjelo reposar por otros 45 minutos.", "Batir la clara de huevo hasta que quede tieso y doblar en la mezcla.", "Muy ligeramente aceite una sartén grande y calentar suavemente. Agregue cucharadas pequeñas de la mezcla de blini y cocine suavemente durante aproximadamente 1-2 minutos en cada lado, hasta que estén ligeramente doradas."], "url": "www_bbc_co_uk_food_recipes_blinis_9139", "title": "blinis", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina blanca fuerte 280g / 10oz", "180ml / 6fl de leche en oz", "1 cucharada de levadura seca", "2 huevos, separados", "300 ml / 10 fl oz doble crema", "1 cucharadita de sal", "30 g / 1 oz de mantequilla para freír"], "method": ["Caliente la leche en una cacerola hasta que esté tibio. Verter sobre la levadura y dejar actuar durante 10 minutos hasta que la mezcla esté espumosa.", "Tamiza la harina y la sal en un tazón grande. Mezcle las yemas de huevo, la crema y la mezcla de levadura en la harina. Coloque la mezcla a un lado durante aproximadamente 1 hora, hasta que haya duplicado su tamaño.", "Batir las claras de huevo hasta que formen picos suaves y doblar en la mezcla. Agregue un poco más de leche, si es necesario, para que la mezcla tenga una consistencia espesa.", "Calentar la mantequilla en una sartén a fuego medio. Cuando esté caliente, vierta pequeñas cantidades de masa en la sartén.", "Freír los blinis hasta que estén dorados en ambos lados y servir a la vez."], "url": "www_bbc_co_uk_food_recipes_blinis_76", "title": "blinis", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 8-10 blinis", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["12.5 g / ½ oz de levadura", "Harina normal de 350g / 12oz, tamizada", "285 ml / ½ litro de leche, tibio", "2 yemas de huevo de gallinas camperas", "una pizca de sal", "145ml / ¼ litro de leche, tibio", "2 claras de huevo de granja, batidas"], "method": ["Haga una pasta delgada de la levadura y 225 g / 8 oz de la harina tamizada diluida con la leche tibia.", "Deje que esta pasta fermente durante dos horas en un ambiente cálido y luego agregue el resto de la harina (115 g / 4 oz), las yemas de huevo, una pizca de sal, la leche tibia y mezcle todo sin dejar que adquiera ningún cuerpo. Finalmente agregue las claras de huevo batidas.", "Deje que la preparación fermente durante media hora, y cuando esté listo para servir, cocine los blinis rápidamente de la misma manera que los panqueques, en pequeños platillos especiales para tortillas. Llévelos muy calientes en una servilleta."], "url": "www_bbc_co_uk_food_recipes_blinis_3759", "title": "blinis", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 70}, "serves": "Hace aproximadamente 32", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/blinis_3759_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["250g / 9oz de mantequilla seca", "2 cucharadas de vinagre de vino blanco", "35 g / 1¼ oz de mantequilla fría en cubitos", "sal y pimienta negra recién molida", "Filete de solomillo de cerdo 400 g / 14 oz, completamente recortado", "2 cucharadas de aceite de oliva", "1 diente de ajo, pelado, ligeramente triturado", "botón de mantequilla", "3 cucharadas de melaza negra", "150 ml / 5floz de sidra Devon seca, como Ashridge", "275ml / 10fl oz de caldo de carne", "2 cucharadas de salsa de manzana o puré de manzana", "1 manzana Braeburn, pelada, sin núcleo, picada", "35 g / 1¼ oz de mantequilla"], "method": ["Para los frijoles, coloque las habas de mantequilla en un recipiente de acero inoxidable, cúbralas con abundante agua y déjelas en remojo durante la noche.", "Precalentar el horno a 200C / 400F / Gas 6.", "Escurra los frijoles remojados y enjuague con agua dulce, luego colóquelos en una cacerola grande y agregue suficiente agua fresca para cubrir los frijoles. Coloque en el fuego, lleve a ebullición, luego reduzca el fuego y cocine por 20-25 minutos, o hasta que se suavice (no agregue sal en esta etapa, ya que esto hace que los frijoles sean duros).", "Escurrir los frijoles y mezclar en un procesador de alimentos con el vinagre y la mantequilla para formar una pasta firme (alternativamente aplastar con un tenedor y mezclar bien con una cuchara de madera.) Sazonar al gusto con sal y pimienta negra recién molida, y colocar en una cacerola listo para ser calentado justo antes de servir.", "Para el cerdo, condimente el filete de cerdo con sal y pimienta negra y cubra ligeramente con la mitad del aceite de oliva. Caliente una cacerola antiadherente grande a prueba de horno en la cocina hasta que esté caliente, luego agregue el filete de cerdo y espere unos minutos, volteándolo de vez en cuando hasta que el filete se coloree a cada lado.", "Agregue el ajo triturado y una perilla de la mantequilla a la sartén e hilvane el filete, luego colóquelo en el horno durante 8-10 minutos, volteándolo hasta la mitad de la cocción, hasta que el cerdo esté bien cocido. El cerdo se cocina si los jugos se hacen transparentes cuando se inserta un pincho en la parte más gruesa del filete.", "Mientras tanto, para la salsa de manzana, pon la sidra en una cacerola y llévala a ebullición. Cocine por 3-4 minutos, o hasta que el volumen del líquido se reduzca a la mitad.", "Agregue el caldo, lleve a ebullición y cocine durante 5 minutos, o hasta que el volumen del líquido se haya reducido a la mitad nuevamente. Agregue la salsa de manzana, la manzana picada y la mantequilla y revuelva para combinar. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Coloque la melaza en una olla pequeña y caliente a fuego lento.", "Retire la carne de cerdo del horno, deseche el ajo y vierta sobre la melaza tibia. Coloque el cerdo a un lado para descansar por unos minutos.", "Para servir, caliente la manteca y divídala entre 2 platos. Corte la carne de cerdo y mezcle la mitad de las rebanadas sobre cada porción de frijoles, luego rocíe sobre la manzana y la salsa de sidra."], "url": "www_bbc_co_uk_food_recipes_blacktreaclebrushedp_93568", "title": "Cerdo negro cepillado de melaza, judías machacadas y salsa de manzana de sidra de Devon", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal de 200g / 7oz", "7 g de levadura instantánea (una bolsita)", "Leche 250ml / 9 fl oz", "1 cucharadita de sal", "1 cucharadita de azúcar", "2 claras de huevo de gallinas camperas", "50g / 1¾ oz de mantequilla", "175g / 6 oz de salmón ahumado, aproximadamente picado", "Crema doble de 75 ml / 2½ fl oz", "50 g / 1¾ oz de crema fresca", "1 limón, solo jugo", "sal y pimienta negra recién molida", "½ manojo de remolachas heredadas del bebé, limpio, pequeño tallo dejado en", "75g / 2¾oz de mantequilla sin sal", "200 ml de vinagre de vino blanco", "75g / 2¾oz de azúcar en polvo", "1 cucharadita de sal", "½ cucharadita de pimienta negra", "2 chalotes de plátano, en rodajas finas", "4 filetes de caballa, fileteados, pin deshuesados, piel en", "250 g / 9 oz de crema fresca", "2 cucharadas de cebolletas frescas picadas / perifollo", "4 cucharaditas de caviar (opcional)"], "method": ["Para los blinis, mezcle la harina, la levadura, la leche, la sal y el azúcar. Reserve en un lugar cálido para probar durante una hora.", "Batir las claras de huevo en un recipiente aparte hasta que se formen picos rígidos cuando se quite el batidor. Cuando el bateador ha probado ser pliegue en las claras de huevo.", "Para cocinar los blinis, derrita la mantequilla en una sartén grande. Agregue una cucharada de masa al molde por blini y cocine hasta que se dore por la parte inferior. Da la vuelta y cocina el otro lado. Retire el blini y colóquelo en papel de cocina. Repite hasta que hayas usado toda la masa. Mantenga los blinis calientes hasta que estén listos para servir.", "Para el paté de salmón ahumado, mezcle el salmón ahumado, la crema doble y la crème fraiche en un procesador de alimentos con un puré fino.", "Sazone con sal, pimienta y jugo de limón y colóquelo en un tazón en el refrigerador hasta que esté listo para servir.", "Para el encurtido de remolacha y chalote, coloque la remolacha en una olla grande de agua hirviendo y cocine durante 15-20 minutos. Escurrir y dejar enfriar un poco. Con cuidado pele las remolachas y córtelas a la mitad. Derrita la mantequilla en una sartén mediana y agregue las remolachas. Cocine por 2-3 minutos o hasta que esté ligeramente dorado.", "Para los chalotes encurtidos, caliente el vinagre de vino blanco, el azúcar, la sal y los granos de pimienta en una sartén a fuego medio hasta que el azúcar se haya disuelto. Coloque los chalotes en un recipiente y vierta sobre la mezcla de vinagre caliente. Mezcle, cubriendo los chalotes. Déjelo a un lado para que quede en salmuera durante al menos una hora, pero preferiblemente durante 24 horas.", "Para servir, coloque la caballa con la piel hacia arriba sobre una bandeja de horno pesada y use un soplete de chef para carbonizar la piel. Condimentar con sal y pimienta.", "Coloque los blinis en el plato junto a la caballa. Coloque el paté de salmón ahumado en la parte superior de los blinis y la remolacha en escabeche y chalotes en el lado. Adorne con cebollino fresco, crema fresca y caviar (si se usa)."], "url": "www_bbc_co_uk_food_recipes_blinis_with_smoked_06083", "title": "Blinis con paté de salmón ahumado, caballa y remolacha y chalota encurtida", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina de trigo sarraceno / trigo integral 225 g / 4 oz", "225g / 4oz de harina común", "pizca de sal", "2 huevos de gallinas camperas, más 2 claras de huevo de gallinas camperas", "45 g / 1½ oz de levadura fresca", "2 cucharaditas de azúcar en polvo", "700ml / 1 pinta 5fl oz de leche caliente", "1 cucharada de mantequilla derretida", "aceite vegetal, para freír", "4 pimientos rojos, asados, pelados, sin semillas", "Crema agria 225g / 4oz", "1 cucharada de rábano picante a la crema de un tarro", "1 cucharada de estragón fresco picado", "½ limón, solo jugo", "12 aceitunas negras", "pimienta negra recién molida"], "method": ["Para los blinis, tamice la harina de trigo sarraceno (o trigo integral) y la harina común en un bol y mezcle con una pizca de sal.", "Haga un pozo en el centro de la mezcla de harina y agregue los dos huevos enteros y una de las claras de huevo. Batir desde el centro hacia afuera para crear una pasta espesa.", "En un recipiente aparte, combine la levadura, el azúcar y la leche y déjelo reposar por un par de minutos.", "Poco a poco vierta la mezcla de levadura en la mezcla de harina y huevo, batiendo constantemente, para hacer una mezcla suave.", "Agregue la mantequilla derretida y revuelva bien.", "Cubra el recipiente con film transparente y déjelo en un lugar cálido durante una hora.", "Justo antes de cocinar los blinis, bata la clara de huevo restante en un tazón limpio hasta que esté liviana, luego dobla en la masa.", "Calentar un poco de aceite en una sartén a fuego medio. Vierta suficiente masa en la sartén para hacer un blini de 10 cm / 4 pulgadas de diámetro.", "Cuando las burbujas comienzan a aparecer en la superficie de la masa, voltee el blini y cocine el otro lado.", "Retire el blini de la sartén y manténgalo caliente mientras hace el resto de los blinis de la misma manera.", "Para el relleno, corte los pimientos rojos asados ​​en tiras.", "Coloque la crema agria, el rábano picante, el estragón y el limón en un bol y mezcle bien.", "Coloque una cucharada de la mezcla de crema en cada blini y cubra con algunas de las piezas de pimiento rojo.", "Cubra cada blini con una aceituna y sazone con pimienta negra recién molida."], "url": "www_bbc_co_uk_food_recipes_bliniswithhorseradis_85969", "title": "Blinis con crema de rábano picante y pimientos asados", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 blinis confeccionados", "2 yemas de huevo de gallinas camperas", "½ limón, solo jugo", "½ cucharadita de vinagre de vino blanco", "sal y pimienta negra recién molida", "250g / 9oz de mantequilla, derretida en una sartén", "Crema doble 50ml / 2fl oz", "50ml / 2fl oz de agua caliente", "500ml / 18fl oz de agua hirviendo", "50ml / 2fl oz de vinagre de vino blanco", "2 huevos de gallinas camperas a temperatura ambiente", "1 cucharada de rábano picado fino, para adornar"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Coloque los blinis en una bandeja para hornear y hornee durante ocho minutos en el horno.", "Para hacer el holandesa, coloque las yemas de huevo, el jugo de limón y el vinagre en un procesador de alimentos. Sazonar con sal y pimienta negra recién molida y mezclar.", "Muy lentamente agregue la mantequilla derretida mientras licúa.", "Lentamente agregue la crema y luego el agua caliente de la misma manera.", "Para hacer los huevos escalfados, cocine a fuego lento el agua y el vinagre en una cacerola. Haga girar el agua para crear un remolino, luego agregue suavemente los huevos y cocine por tres minutos. Eliminar con una cuchara ranurada.", "Sirve dos pilas de blinis con un huevo escalfado en cada una y una parte de la holandesa con una cuchara. Adorne con rábano picado."], "url": "www_bbc_co_uk_food_recipes_bliniswithpoachedegg_83370", "title": "Blinis con huevo escalfado y holandesa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Nueces de pacana 15 g / ½ oz", "170g / 5¾oz de harina natural, más extra para espolvorear", "pizca de sal", "75 g / 2½ oz de mantequilla sin sal refrigerada, cortada en cubos, más extra para engrasar", "3 huevos grandes de gallinas camperas", "Puré de calabaza 300 g / 10½ oz (disponible en línea y en la sección de hornear de algunos supermercados grandes)", "85g / 3oz de azúcar morena oscura", "1½ cucharadita de canela molida", "1½ naranjas de sangre, cáscara de ambos y jugo de uno", "125 g / 4½ oz de leche evaporada", "2 claras de huevo pasteurizadas", "115 g / 4 oz de azúcar en polvo", "Nueces de pacana 25g / 1oz", "Jugo de naranja y sangre 50ml / 2fl oz (disponible en grandes supermercados)", "100g / 3½fl oz de azúcar granulada"], "method": ["Ponga todas las nueces de pacana para la masa y el merengue en un procesador de alimentos y mezcle hasta que quede bien. Pese 15 g / ½ oz para la masa y reserve el resto.", "Para la masa, agregue la harina, la sal y la mantequilla al procesador de alimentos. Incline las nueces y el pulso hasta que los ingredientes se combinen y se asemejen a pan rallado. Agregue una cucharada de agua fría y vuelva a pulsar. Siga agregando más agua una cucharada a la vez hasta que la mezcla se una como masa.", "Incline la masa sobre una superficie de trabajo ligeramente enharinada y amasar ligeramente hasta que quede suave. Envuelva la película adhesiva y refrigere durante 10-15 minutos.", "Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4. Engrase un plato para pastel de 20 cm / 8 in.", "Para el relleno, bata ligeramente los huevos en un tazón grande. Agregue el puré de calabaza, el azúcar, la canela, la ralladura de naranja y el jugo. Batir hasta que se combine. Vierta la leche evaporada y mezcle todo junto usando una licuadora de mano. Dejar de lado.", "Estirar la masa sobre una superficie de trabajo ligeramente enharinada hasta 5 mm / ¼ de grosor. Alinee el pastel con la masa, teniendo cuidado de empujar la masa en los bordes. Deje cualquier exceso de saliente y pique ligeramente la base con un tenedor (no vaya a la lata). Coloque en una bandeja para hornear.", "Cubra la masa con papel de hornear y llene con bolitas de cerámica o arroz crudo. Hornee en el estante del medio durante 10 minutos o hasta que la masa esté seca. Retire del horno y recorte el exceso de masa para que no queden más altos que el molde para pastel.", "Vierta el relleno de modo que solo se puedan ver 5 mm / ¼ de la masa en la parte superior.", "Aumente la temperatura del horno a 200 ° C / 180 ° Ventilador / Gas 6. Hornee el pastel en el centro del horno durante 15 minutos. Baje el horno a 160C / 140C Fan / Gas 3 y hornee por otros 30 minutos o hasta que el relleno esté firme (un leve bamboleo en el centro está bien).", "Para el merengue, coloque las claras de huevo en el cuenco de una batidora grande independiente equipada con un accesorio batidor (también puede usar un recipiente para mezclar y una batidora manual, pero es mucho más fácil y más seguro agregar el almíbar cuando tiene ambas manos gratis). Coloque el azúcar y 100 ml / 3 ½ oz de agua en una cacerola. Coloque a fuego lento y use un termómetro de azúcar para medir la temperatura del jarabe. Cuando la mezcla de jarabe alcance los 100 ° C, comience a batir las claras de huevo.", "Cuando el jarabe alcanza los 116 ° C, retírelo del fuego. Con el motor en funcionamiento, vierta lentamente el jarabe por el costado del tazón en la mezcladora, teniendo cuidado de no tocar la batidora ya que puede salpicar. Continúa batiendo hasta que se formen picos brillantes y rígidos cuando se quite la batidora.", "Doble las pacanas de tierra reservadas en el merengue con una cuchara grande de metal.", "Después de hornear, deje que la tarta se enfríe en la lata durante 5 minutos. Coloque el merengue en el pastel y use una espátula para suavizar en una cúpula. Use un soplete de chef para dorar la parte superior del merengue.", "Para el almíbar, combine el jugo de naranja y el azúcar en una cacerola y deje que hierva. Mida la temperatura con un termómetro de azúcar y cuando llegue a 114 ° C retírelo del fuego. Para decorar el pastel, sumerja un tenedor en el caramelo y gotee cuidadosamente sobre el pastel en forma de cruz (el azúcar derretido está muy caliente; tenga cuidado de no quemarse). Sirve el pastel caliente."], "url": "www_bbc_co_uk_food_recipes_blood_orange_halloween_70269", "title": "Pastel de calabaza de Halloween de naranja sangrienta", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Hace 1 pie de 20cm / 8 pulgadas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/blood_orange_halloween_70269_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina de auto aumento de 150g / 5oz", "pizca de polvo de hornear", "150g / 5oz de mantequilla, ablandada, más extra para engrasar", "150g / 5oz azúcar moreno claro", "1 cucharada de jarabe de oro", "3 huevos de gallinas camperas", "1 cucharada de arándanos secos", "1 naranja, pelada y cortada en rodajas", "100 g / 3½ oz de azúcar en polvo", "175ml / 6fl oz de agua", "1 cucharada de mermelada de naranja", "1 cucharada de gelatina de arándano rojo de un tarro", "2 naranjas, solo jugo", "crema doble, batida hasta que se formen picos rígidos cuando se quita la batidora"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Tamiza la harina y el polvo de hornear en un bol.", "En un recipiente aparte, bata la mantequilla, el azúcar y el jarabe juntos. Agregue los huevos, uno a la vez, batiendo para incorporar bien antes de agregar el próximo huevo.", "Agregue la mezcla de huevo al tazón de harina y bata bien durante dos minutos, o hasta que esté pálida y ligera.", "Agregue los arándanos secos y dóblelos suavemente.", "Para la salsa, coloque el azúcar, el agua, la mermelada, la mermelada de arándano y el jugo de naranja en una cacerola y caliente suavemente para disolver el azúcar y la mermelada. Llevar a ebullición y cocine a fuego lento durante 5-10 minutos para formar un jarabe espeso.", "Engrase cuatro moldes y coloque un disco de papel resistente a las grasas, cortado para que se ajuste a los moldes, en la base de cada uno. Vierte un poco de la salsa en cada molde, luego siéntate una ronda de naranja en la parte superior.", "Agregue la mezcla de budín para casi llenar los moldes. Cubra cada molde con papel de aluminio y transfiéralo a una bandeja de asar profunda. La mitad llena la bandeja con agua hirviendo para crear un baño maría y transfiere al horno para hornear durante 20 minutos, o hasta que los postres se hayan puesto.", "Para servir, coloca los budines en platos y sirve con una cucharada de crema batida."], "url": "www_bbc_co_uk_food_recipes_bloodorangeandcranbe_85041", "title": "Pudín de arándanos y naranja al vapor", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Rinde 4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cubitos de hielo", "vodka, doble tiro", "½ limón, solo jugo", "6 guiones de salsa Worcestershire", "3 guiones de salsa Tabasco", "150ml / 5fl oz de jugo de tomate", "pizca de sal y pimienta negra recién molida"], "method": ["Coloque el hielo en un vaso alto y agregue el vodka.", "Agregue el jugo de limón, salsa Worcestershire, salsa Tabasco y jugo de tomate. Revuelva bien.", "Ajuste el aderezo, al gusto, con sal y pimienta y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_bloodymary_84135", "title": "Bloody Mary", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bloodymary_84135_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Vodka de 40 ml / 1½ fl oz", "75ml / 3fl oz de jugo de tomate", "dash lemon juice", "½ cucharadita de salsa Worcestershire", "2-3 gotas de salsa Tabasco", "sal y pimienta negra recién molida", "puñado de cubitos de hielo", "cuñas de lima, para servir"], "method": ["Vierta todos los ingredientes, excepto las rodajas de lima, en una coctelera y agite bien para mezclar.", "Colar en un vaso alto sobre cubitos de hielo y adornar con trozos de lima."], "url": "www_bbc_co_uk_food_recipes_bloodymary_88974", "title": "Bloody Mary", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Vodka 150ml / ¼ pinta, refrigerado", "250ml / 9fl oz de jugo de tomate fino, refrigerado", "1 lima, solo jugo", "2 cucharaditas de rábano picante recién rallado", "1 cucharadita de sal de apio", "un buen batido de Tabasco", "1 cucharada de salsa Worcestershire", "1 pepino, pelado, en rodajas y muy finamente cortado en juliana", "1 cucharadita de pimienta negra agrietada", "10 vasos de chupito, refrigerados"], "method": ["Mezcle todos los ingredientes para los tiros juntos. Mantenga refrigerado en una jarra hasta que esté listo para servir.", "Para servir, coloque los vasos en un plato o bandeja y vierta un poco de mezcla de Bloody Mary en cada uno. Termine con un poco de pepino y una pizca de pimienta negra."], "url": "www_bbc_co_uk_food_recipes_bloodymaryshots_68098", "title": "Disparos de Bloody Mary", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Rinde 20", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["10 g / ¼ oz de levadura", "10g / ¼ oz de azúcar", "300ml / 10fl oz de leche caliente", "150 g / 5½ oz de harina", "75g / 2¾oz de harina de alforfón", "1 huevo de gallinas camperas, separado, más 2 claras de huevo adicionales", "aceite vegetal, para freír", "Gelatina de grosella negra 250 g / 9 oz", "Vinagre de vino tinto 250ml / 9floz", "4 dientes", "75g / 2¾oz de mostaza Dijon", "2 remolachas cocidas grandes, peladas y cortadas en cubitos", "200g / 7oz de crema fresca", "1 manojo de cebollín, finamente picado", "4 caballa, fileteada y deshuesada", "aceite de colza, para lloviznar", "4 chalotes, finamente picados", "1 tin Avruga caviar"], "method": ["Para hacer el blini, mezcle la levadura, el azúcar, la leche, las harinas y la yema de huevo en un bol para hacer una pasta.", "Batir las claras de huevo en un recipiente aparte hasta que formen picos rígidos, luego doblarlos en la mezcla de levadura. Cubra el recipiente y déjelo a temperatura ambiente durante 20 minutos.", "Calentar una sartén hasta que esté medianamente caliente, agregar un poco de aceite vegetal y cucharadas pequeñas de la mezcla de blini.", "Cocine los blini en cada lado hasta que queden dorados, luego retírelos y escurra sobre papel de cocina. Repita con la masa restante y mantenga el blini caliente hasta que esté listo para servir.", "Para la remolacha, coloque la jalea de grosella, el vinagre y los clavos de olor en una olla y cocine hasta que se reduzca a un glaseado lo suficientemente grueso como para cubrir la parte posterior de una cuchara.", "Pase la mezcla a través de un colador en un recipiente limpio, mezcle la mostaza, doble la remolacha en la mezcla de salmuera y manténgalo caliente.", "Batir la crème fraîche hasta que se espese, agregar el cebollín y sazonar con sal y pimienta negra recién molida.", "Cortar los filetes de caballa por la mitad a lo largo. Rocíe con aceite de colza, sople suavemente la antorcha por ambos lados hasta que esté cocida y luego sazone con sal y pimienta negra recién molida.", "Para servir, coloque la caballa en los platos de servir con un poco de los chalotes picados, el pickle de remolacha tibia, blini, crème fraîche y un poco de caviar de Avruga."], "url": "www_bbc_co_uk_food_recipes_blow_torched_mackerel_34721", "title": "Caballa encendida con blini, remolacha encurtida caliente y cebolleta crème fraîche", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 hojas de pasta filo (mide 25x25cm / 10x10 en cuadrado)", "un poco de mantequilla derretida", "3 higos maduros", "100g / 3½oz de queso azul cremoso como dolcelatte o roquefort", "1 cucharadita de jugo de limón", "3 hojas de salvia picadas", "espolvoreado de pimentón molido"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Cepille dos hojas de filo con mantequilla y colóquelas una encima de la otra. Cortar en 24 cuadrados iguales. Coloque los cuadrados en pares uno encima del otro en un ángulo de 45 grados para formar una estrella. Presiona en los agujeros de una lata de 12 mini-muffins. Repita con la masa restante para hacer 24 mini tartaletas.", "Hornee en el horno durante unos 5-10 minutos o hasta que estén dorados y crujientes. Transfiera a una bandeja para hornear.", "Picar los higos en trozos pequeños, y dividir entre las cajas de filo. Pon el queso, el jugo de limón y la salvia en un tazón. Mash abajo con un tenedor, sazonar con pimienta, luego cuchara gotas de mezcla de queso en la parte superior de la figura. Espolvorear ligeramente con pimentón.", "Hornee en el horno durante cinco minutos, o hasta que el queso se haya derretido."], "url": "www_bbc_co_uk_food_recipes_blue_cheese_and_fig_34219", "title": "Queso azul y tartas de higos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 24 tartas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/blue_cheese_and_fig_34219_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200 g / 7 oz de azúcar, más extra para quitar el polvo", "3 naranjas de sangre, jugo y ralladura", "1 cucharadita de agua de azahar", "2 huevos de gallinas camperas, más 6 yemas", "200 g / 7 oz de mantequilla, en cubos", "Cáscara de tarta de repostería brisa endulzada de 25cm / 10in, horneado a ciegas (puede usar ready-made)", "3 naranjas de sangre, peladas, cortadas en rodajas", "1 cucharada de azúcar demerara", "crema doble o crema pastelera, para servir"], "method": ["Batir el azúcar, el jugo de naranja y la ralladura, el agua de azahar, los huevos y las yemas de huevo en un tazón hasta que estén bien combinados.", "Agregue la mantequilla y coloque sobre una sartén sobre el agua hirviendo a fuego lento. (No permita que la base del recipiente toque el agua).", "Cocine durante 15-20 minutos, revolviendo regularmente, hasta que la mantequilla se haya derretido y la mezcla se haya espesado.", "Vierta la mezcla en la caja de pastelería cocida, cúbrala con film transparente (para evitar que se forme la piel) y déjela enfriar.", "Coloque las rodajas de naranja sobre la tarta enfriada y espolvoree sobre el azúcar demerara.", "Con un soplete de cocina, caliente el azúcar hasta que esté caramelizado.", "Para servir, cortar la tarta y servir con crema doble o crema pastelera."], "url": "www_bbc_co_uk_food_recipes_bloodorangetart_93766", "title": "Tarta de naranja sanguina", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bloodorangetart_93766_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["600 g / 1 libra de harina blanca fuerte de 5oz, más extra para la elaboración", "1 cucharadita de sal marina, más extra para el relleno", "1 cucharada de azúcar en polvo, más 1 cucharadita de cocción de las cebollas", "1 cucharada de levadura instantánea seca", "100ml / 3½fl oz de aceite de oliva", "50g / 1¾oz de tocino, en rodajas", "2-3 tsbp hojas de romero, más extra para servir", "aceite de oliva virgen extra, a llovizna", "125g / 4½oz de queso azul, como Stilton, desmenuzado", "2 cucharadas de aceite de oliva", "3 cebollas grandes, en rodajas", "1 cucharada de hojas de tomillo", "1 cucharadita de azúcar en polvo", "1 cucharada de vinagre balsámico", "sal y pimienta"], "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Coloque la harina, la sal, el azúcar impalpable y la levadura en un bol y mezcle.", "Crea un pozo en el medio y agrega 300ml / 10fl oz de agua tibia y 100ml / 3½fl oz de aceite de oliva. Lleva la mezcla a una masa suave y déjala sobre una superficie enharinada.", "Amasar durante 10 minutos o hasta que quede suave y elástico. Coloque en un recipiente ligeramente engrasado, cubra y deje que se levante durante una hora.", "Para las cebollas caramelizadas, caliente el aceite de oliva en una sartén y agregue las cebollas y el tomillo. Cocine por 25 minutos o hasta que esté suave y dorado.", "Agregue el azúcar impalpable y el vinagre y cocine por otros tres minutos. Sazone con sal y pimienta, reserve y limpie la sartén.", "Regrese la sartén al fuego, agregue la panceta y el romero y cocine hasta que estén crujientes. Retire y reserve en un recipiente aparte.", "Derriba la masa y luego estírate en una forma ovalada larga.", "Coloque en una bandeja de horno engrasada y cubra por 30 minutos.", "Haga hoyuelos al azar en la superficie de la masa con los dedos. Cubra con las cebollas caramelizadas, una buena llovizna de aceite de oliva virgen extra y sal. Hornee en el horno por 20 minutos, o hasta que estén doradas.", "Retire la bandeja y espolvoree con queso azul, panceta y romero. Hornee durante dos minutos adicionales o hasta que el queso comience a derretirse.", "Vístase con romero extra y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_blue_cheese_and_pancetta_85716", "title": "Pan de queso azul y bandeja de panceta", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 remolachas grandes, con la piel puesta y frotada", "2 dientes de ajo, aplastados", "1 hoja de laurel", "Ramitas de tomillo de 10g / ½oz", "½ cucharadita de pimienta negra", "50 g / 1 oz de azúcar en polvo", "500ml / 18fl oz de vinagre de vino tinto", "1 cucharada de sal marina gruesa", "40 g / 1½ oz de mantequilla sin sal, refrigerador-frío y cortado en cubos de 2 cm / ¾in, más extra, derretido, para engrasar", "50g / 1¾oz de semillas de calabaza, tostadas", "5 galletas digestivas, aproximadamente desmenuzadas", "40 g / 1½ oz de queso parmesano, rallado grueso", "½ cucharadita de sal", "20 g / ¾oz de mantequilla sin sal", "1 puerro, en rodajas finas", "Queso crema de 360g / 12oz", "170g / 6oz de crema fresca", "80g / 3 fl oz crema doble", "2 dientes de ajo, aplastados", "20 g / ¾oz de cebollín, finamente cortado", "1 cucharada de albahaca picada", "½ cucharadita de sal", "100g / 3½oz Stilton, aproximadamente desmenuzado", "4 huevos de gallinas camperas, ligeramente golpeados", "40g / 1½ oz de miel líquida (mezclada, opcionalmente, con unas gotas de aceite de trufa)", "Avellanas 30g / 1oz, tostadas y ligeramente trituradas", "15 g / ½ oz de albahaca bebé"], "method": ["Pon todos los ingredientes para la remolacha en escabeche en una olla mediana con tapa. Vierta más de 800 ml / 1 pinta 8 fl oz de agua. Las remolachas deben sumergirse, así que agregue un poco más de agua si es necesario. Llevar a ebullición, luego reducir el fuego a medio y cocinar, tapado, durante 35-40 minutos, o hasta que la remolacha esté suave. Deje que se enfríe completamente.", "Levante las remolachas del líquido, luego pélelas y córtelas en dados de 1 cm / ½. Ponlo en el tazón. Cuele el líquido decapante y vuelva a colocarlo en la sartén. Cocine a fuego medio durante 25 minutos, o hasta que se reduzca a la mitad a aproximadamente 600 ml / 1 pinta 2 fl oz. Poner a un lado para enfriar, luego verter el líquido sobre las remolachas. Cubra y enfríe en el refrigerador por 24 horas.", "Para las bases, unte ligeramente ocho moldes de 12cm / 6 pulgadas de diámetro o moldes de soufflé con mantequilla derretida y coloque un círculo de papel para hornear en la base de cada uno.", "Coloque todos los ingredientes para la base de la tarta de queso en un procesador de alimentos. Pulse para formar migajas finas, luego divídalas entre los moldes, presionando uniformemente y con firmeza.", "Para las coberturas de la torta de queso, precaliente el horno a 200C / 180C Ventilador / Gas 6. Derrite la mantequilla en una cacerola pequeña a fuego medio durante 7 minutos, revolviendo de vez en cuando, hasta que esté suave. Deje que los puerros se enfríen, luego transfiéralos a un tazón grande.", "Agregue el queso crema, la crème fraîche, la crema, el ajo, el cebollino, la albahaca, la sal y una buena molleja de pimienta negra a los puerros. Mezcle bien para formar una pasta suave. Doble suavemente el queso azul y los huevos, luego vierta la mezcla en los moldes.", "Hornee durante 25-30 minutos, hasta que un pincho insertado en el medio salga limpio.", "Sirva inmediatamente, en los moldes o en latas de soufflé, adornado con una llovizna de miel, las avellanas y la albahaca. La remolacha, colada, se puede poner encima de las tartas de queso antes de las guarniciones, o servir al lado."], "url": "www_bbc_co_uk_food_recipes_blue_cheese_cake_41569", "title": "Tartas de queso azul", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6 naranjas de sangre, solo jugo", "300ml / 10fl oz de vinagre balsámico", "2 cebollas, finamente picadas", "100g / 3½ oz de galanga fresca, pelada y finamente picada", "3 chiles rojos, sin semillas y finamente picados", "4 hojas de laurel", "10 dientes de ajo picados", "Vientre de cerdo 2kg / 4lb 8oz", "1 x 500ml / 18fl oz botella sake", "100 g / 3½ oz de mantequilla, cortada en cubitos", "125ml / 4fl oz de vinagre de arroz", "1 cebolla roja, pelada y descuartizada", "1 manojo de rábanos rosados, tallos eliminados", "1 mooli pequeño, extremos eliminados", "10 g de semillas de mostaza", "25 g / 1 oz de azúcar", "5g de cardamomo negro molido", "5g de copos de pimiento rojo"], "method": ["Para el vientre de cerdo, coloque el jugo de naranja y el vinagre balsámico en un recipiente esterilizado, hermético y hermético. Deje que se infunda en la nevera durante al menos una semana.", "Precalienta el horno a 160 ° C / 140 ° C / Gas 3. Coloca las cebollas, galanga, chiles y hojas de laurel en el fondo de una lata pesada para asar. Frote el ajo picado sobre la barriga de cerdo y coloque la carne encima de las verduras en la lata. Vierte el sake en la lata, agrega 200 ml / 7 fl oz de agua fría, cúbrelo con papel de aluminio y cocina durante 45 minutos.", "Retire la barriga de cerdo del horno y reserve el caldo. Presione el vientre de cerdo cubriéndolo con papel de cocina y dejando un peso pesado encima. Deje por 12 horas o más si tiene tiempo.", "Para las verduras en vinagre, vierta el vinagre y 125 ml / 4 fl oz de agua en una olla. Agregue el resto de los ingredientes a la sartén, coloque a fuego lento y cocine suavemente, revolviendo hasta que el azúcar se haya disuelto. Dejar de lado para enfriar.", "Rallar finamente la cebolla enfriada, rábanos y mooli en una mandolina. Coloque en un tazón y mezcle un poco del licor de decapado.", "Coloque 150ml / 5fl oz del balsámico infundido de naranja y el caldo reservado en una cacerola y reduzca a fuego alto. Agregue la mantequilla y cocine a fuego lento hasta que espese.", "Cortar el vientre de cerdo en rodajas. Freír el cerdo en una sartén o plancha caliente, hasta que se dore por todos lados. Cubra el cerdo en ambos lados con la salsa de naranja.", "Sirva las rebanadas de pan de cerdo con las verduras encurtidas y las verduras de hoja al lado."], "url": "www_bbc_co_uk_food_recipes_blood_orange_pork_belly_88752", "title": "Vientre de cerdo naranja sangre con verduras en vinagre", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]