[{"isVegetarian": true, "title": "Coconut caramel biscuits", "url": "www_bbc_co_uk_food_recipes_coconutcaramelbiscui_85123", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz caster sugar", "150g/5½oz coconut biscuits, crushed", "½ lemon, juice only", "1 tsp vegetable oil"], "serves": "Makes 10", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the caster sugar into a frying pan and melt over a medium heat until beginning to turn golden-brown.", "Add the crushed biscuits and mix well. Stir in the lemon juice.", "Grease a baking sheet with vegetable oil, then pour the mixture onto the baking sheet. Leave to cool, then chop into pieces."]}, {"isVegetarian": false, "title": "Coconut fish curry", "url": "www_bbc_co_uk_food_recipes_coconutfishcurry_89979", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/coconutfishcurry_89979_16x9.jpg", "ingredients": ["1 green chilli, roughly chopped", "pinch dried chilli flakes", "2 tbsp vegetable oil", "½ lemon, juice only", "handful fresh coriander, plus extra for garnish", "1 tbsp vegetable oil", "1 onion, sliced", "1 garlic clove, crushed", "1 large sweet potato, peeled and chopped ", "1 tsp curry powder", "1 tsp cumin ", "150/5oz cod or pollack fillet, skinned and chopped (frozen is fine)", "½ tin coconut milk", "1 handful spinach leaves, or 2 blocks frozen spinach, defrosted and liquid squeezed out", "½ lime, juice only", "salt, to taste"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the spice paste, place all of the spice paste ingredients into a food processor and blend until smooth. (You can use a pestle and mortar for this, too.)", "For the curry, heat the vegetable oil in a wok and gently fry the onion and garlic for 4-5 minutes, or until softened. Add the sweet potato, curry powder and cumin and continue to fry for further 5-10 minutes, until the sweet potato has softened, then add the fish and two tablespoons of the spice paste. Stir to coat the fish in the spices, then add the coconut milk and bring to a gentle simmer.", "Stir in the baby spinach leaves, lime juice and season with salt, to taste. Cook for another 2-3 minutes, then stir in the coriander.", "Spoon the curry into a bowl and serve."]}, {"isVegetarian": true, "title": "Coconut French toast with griddled mango", "url": "www_bbc_co_uk_food_recipes_coconutfrenchtoastwi_85753", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 tbsp coconut cream", "1 free-range egg, beaten", "2 tbsp caster sugar", "1 vanilla pod, seeds only", "¼ tsp ground cinnamon", "2 slices baguette or other bread", "2 tsp vegetable oil", "1 tbsp butter", "1 tsp brown sugar", "½ mango, peeled, stone removed and scored", "½ red chilli, finely chopped", "1 tbsp honey"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Place the coconut cream, egg, sugar, vanilla seeds and cinnamon into a bowl and mix well.", "Dip the bread into the egg mixture to completely coat.", "Heat the vegetable oil and butter in a non-stick frying pan and fry the bread until golden-brown on both sides.", "Meanwhile, for the mango, heat a griddle pan. Sprinkle the brown sugar over the mango and griddle cut-side down for 3-4 minutes until golden. Turn over, then transfer the pan to the oven and cook for 2-3 minutes. Add the chilli and honey and cook for a further 2-3 minutes.", "To serve, place the French toast onto a plate and top with the caramelised mango."]}, {"isVegetarian": true, "title": "Coconut ice cream", "url": "www_bbc_co_uk_food_recipes_coconuticecream_86100", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/coconuticecream_86100_16x9.jpg", "ingredients": ["290ml/½ pint milk ", "85g/3oz caster sugar", "290ml/½ pint double cream ", "1 coconut, flesh only, cut into small pieces ", "2 tbsp vodka ", "1 bunch fresh mint, finely chopped"], "serves": "Serves 4-6", "time": {"preparation": "1-2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["Heat the milk and sugar together in a medium pan over a low heat, until the sugar has dissolved.", "Let the milk cool, before stirring in the cream, coconut pieces, vodka and chopped mint. ", "Transfer the mixture to an ice cream maker and churn according to the manufacturer's instructions.", "Serve once the ice cream is frozen."]}, {"isVegetarian": false, "title": "Coconut prawn soup with toasted sesame oil and chilli", "url": "www_bbc_co_uk_food_recipes_coconutprawnsoupwith_86848", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ lime, juice only", "300ml/10½fl oz hot chicken stock ", "1 tbsp coconut cream", "2 tsp toasted sesame oil", "2 spring onions, chopped", "pinch chilli flakes", "70g/2½oz raw king prawns", "small handful fresh coriander leaves, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put the lime juice, chicken stock, coconut cream, sesame oil, spring onions and chilli flakes into a small saucepan, bring to the boil and cook gently for eight minutes.  ", "Add the prawns and bring back to boiling point, then remove from the heat and leave, covered, for 3-4 minutes, or until the prawns are completely cooked through. Spoon the mixture into a serving bowl, top with fresh coriander and serve."]}, {"isVegetarian": true, "title": "Coconut rice pudding with mango, orange and lime", "url": "www_bbc_co_uk_food_recipes_coconutricepuddingwi_70431", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["55g/2oz short-grain rice", "230ml/8fl oz coconut milk", "110ml/4fl oz milk", "1 tsp orange zest", "2 tsp caster sugar", "1 tsp vanilla essence", "110ml/4fl oz cream", "mango, sliced", "lime wedges", "2 tsp brown sugar"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Place the rice, coconut milk, milk, zest, sugar and vanilla in a saucepan over a medium heat and bring to the boil. Reduce the heat, cover and cook for 1 hour, stirring occasionally. When the rice is cooked, remove from the heat and leave to cool with the lid on.", "When the mixture is cold, stir in the cream. Pour into a serving bowl, top with mango and a sprinkling of brown sugar and serve with wedges of lime on the side."]}, {"isVegetarian": true, "title": "Coconut rice scented with curry and caramelised onions", "url": "www_bbc_co_uk_food_recipes_coconutricescentedwi_87356", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz basmati rice", "100ml/3½fl oz coconut milk", "pinch curry powder", "500ml/18fl oz hot vegetable stock", "1 tbsp grated fresh coconut", "salt and freshly ground black pepper ", "2 tbsp vegetable oil", "½ onion, finely sliced", "salt and freshly ground black pepper", "2 tbsp toasted pine nuts", "1 tbsp chopped fresh chives, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the coconut rice, place the rice, coconut milk, curry powder, vegetable stock and grated coconut into a medium saucepan. Bring to the boil, then reduce the heat and simmer gently for ten minutes. Drain well and season with salt and freshly ground black pepper. ", "For the caramelised onions, heat the vegetable oil in a frying pan, add the onions and cook over a gentle heat for ten minutes, stirring occasionally. Season well with salt and freshly ground black pepper.", "To serve, pile the rice into a serving bowl, top with the onions and pine nuts and garnish with chives."]}, {"isVegetarian": true, "title": "Coconut sponge pudding", "url": "www_bbc_co_uk_food_recipes_coconutspongepudding_91835", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz unsalted butter, at room temperature, plus extra for greasing", "225g/8oz golden caster sugar", "4 free-range eggs", "1 lime, zest and juice", "50g/2oz desiccated coconut, toasted", "200g/7oz self-raising flour", "splash milk (optional)", "6 free-range egg yolks", "125g/4½oz caster sugar", "40g/1½oz plain flour", "400ml/13½fl oz canned coconut milk", "1 vanilla pod, split, seeds scraped out", "200ml/7fl oz double cream, whipped to soft peaks"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/355F/Gas 4. Grease and flour six dariole moulds.", "For the sponge, beat the butter and sugar together in a bowl until pale and fluffy. ", "Crack in the eggs, then add the sugar, then the butter, beating thoroughly between additions. Mix in the lime juice, lime zest, toasted coconut, and flour until the mixture comes together to form a smooth batter. Add a splash of milk if the mixture is too dry. ", "Spoon the sponge mixture into the prepared dariole moulds, then place into the oven and bake for 20-25 minutes, or until the sponge is golden-brown and cooked through (the sponge should be springy to the touch). Remove from the oven and set aside to cool.", "For the custard, whisk the egg yolks and sugar together in a bowl until pale and creamy, then sieve in the flour and mix well until smooth. ", "Place the coconut milk and vanilla pod and seeds into a heavy-based pan and slowly bring to the boil over a medium-low heat. Remove the pan from the heat as soon as the mixture reaches the boil, then remove and discard the vanilla pod. Pour the coconut milk mixture over the egg and sugar mixture, whisking continuously until well combined. ", "Pour the custard mixture back into a clean pan and cook over a medium heat, stirring frequently for 4-5 minutes, or until the custard thickens enough to coat the back of a wooden spoon. ", "To serve, turn the sponge puddings out from their moulds and place onto shallow serving bowls. Spoon the custard over the sponge puddings and serve with dollops of whipped cream."]}, {"isVegetarian": true, "title": "Coconut sorbet with mango tarte tatin and chilli caramel crisp", "url": "www_bbc_co_uk_food_recipes_coconutsorbetwithman_86049", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["110g/4oz caster sugar", "1 x 400ml/14fl oz can coconut milk", "25g/1oz desiccated coconut", "50ml/2fl oz coconut cream", "½ lemon, juice only", "1 tbsp coconut liqueur", "1 free-range egg white", "225g/8oz caster sugar", "50g/2oz butter", "2 mangoes, peeled and cut into cubes", "500g/1lb 2oz ready-made puff pastry", "plain flour, for dusting", "small knob of butter, for greasing", "110g/4oz caster sugar", "pinch crushed chilli flakes"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the coconut sorbet, place the caster sugar, coconut milk and desiccated coconut into a saucepan and bring to the boil.", "When the sugar has dissolved, remove from the heat and stir in the coconut cream, lemon juice and coconut liqueur. Set to one side and cool.", "Place the egg white into a bowl and whisk until soft peaks form when the whisk is removed. ", "Fold the whisked egg white into the coconut mixture. ", "Pour the mixture into an ice cream maker and churn until frozen, according to manufacturer's instructions - or pour into a plastic box and freeze, removing the box from the freezer from time to time to stir. ", "For the mango tatin, preheat the oven to 200C/400F/Gas 6. ", "Divide the caster sugar among four small ovenproof blini pans (or small frying pans) over a low heat.  ", "Cook, without stirring, until the sugar has melted and caramelised, turning golden-brown - take care as the sugar will be very hot.", "Remove the pans from the heat and place a quarter of the butter into each pan. Stir gently to combine. ", "Divide the mango evenly among the four pans and keep warm, while you prepare the pastry.", "Roll the puff pastry to 5mm/¼in thick on a clean, floured surface. Cut out four circles slightly larger than the circumference of the blini pans (or frying pans).", "Cover each pan with a pastry round, pushing the edge down around the mango. ", "Transfer to the preheated oven and bake for 15-20 minutes, until the pastry is golden-brown and cooked through. Remove and allow to cool slightly. ", "For the chilli caramel crisp, lightly grease a baking sheet with butter. Place the sugar into a hot frying pan and cook until melted and caramelised, again taking care.", "Remove the pan from the heat and add the chilli flakes. Pour the caramelised sugar onto the greased baking sheet and cool until hardened. ", "When hard, break into pieces and transfer to a food processor. Blend until fine crumbs are formed. ", "Place a non-stick silicone sheet onto a frying pan.", "Place a 5cm/2in lightly greased chefs' ring onto the sheet and fill with enough of the caramel crumbs to make a thin layer. Heat until the caramel has liquefied; then remove from the heat and cool. ", "Carefully lift off the ring and allow the disc to cool totally. Repeat until you have four discs. Cool.", "To serve, turn each tarte tatin out into the centre of one of four plates. Spoon any residual caramel around the tartes and top with a spoonful of the coconut sorbet and a chilli caramel disc for each serving."]}, {"isVegetarian": true, "title": "Coconut tart with passion fruit cream", "url": "www_bbc_co_uk_food_recipes_coconuttartwithpassi_83977", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 free-range eggs", "2 lemons, juice and zest", "200g/7oz caster sugar", "375ml/13fl oz double cream", "300g/11oz desiccated coconut", "25cm/10in sweetened shortcrust pastry tart shell, blind baked (you can use ready-made)", "250g/9oz mascarpone", "50ml/2fl oz double cream", "2 tbsp icing sugar", "3 passion fruit, sliced in half and pulp removed"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 160C/320F/Gas 2.  ", "For the tart, mix the eggs, lemon zest and caster sugar in a clean bowl throughly, for a minute. ", "Gently mix in the cream, then the lemon juice and finally the desiccated coconut.  ", "Pour into the pastry shell and bake until golden all over. This should take about 40 minutes.  ", "Remove from the oven and leave for one hour to cool and firm up.", "For the cream, let the mascarpone warm to room temperature before putting it into a bowl with the double cream and icing sugar.  ", "Whip until it begins to thicken, then add the passion fruit pulp and beat until firm.", "To serve, simply cut the coconut tart into wedges and place on a serving plate with a spoonful of the passion fruit cream."]}, {"isVegetarian": false, "title": "Cod and parsley stuffed jacket potato", "url": "www_bbc_co_uk_food_recipes_cod_and_parsley_stuffed_30774", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 large baking potatoes (roughly 225g/8oz each)", "olive oil ", "1 litre/1¾ pint whole milk", "2 garlic cloves, crushed", "1 bay leaf", "300g/10½oz cod fillet, skin removed, boneless", "3 tbsp roughly chopped fresh parsley", "55g/2oz Cheddar, grated", "extra virgin olive oil for drizzling", "salt and freshly ground black pepper", "1 lemon, cut into wedges, to serve", "handful watercress, leaves picked, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/185C Fan/Gas 6. Wash the potatoes well, dry them and prick several times with a fork. Pour some olive oil into your hands and rub over the potatoes. Make four small mounds of sea salt on a baking tray and sit a potato on each one. Bake for 50 minutes–1 hour, or until crispy and cooked.", "Meanwhile, for the filling, put the milk, garlic and bay in a saucepan, season and bring to a simmer. Add the cod and cook gently for 4 minutes, then remove from the heat. Lift out the cod using a slotted spoon and place on a plate. Pour the milk mixture into a jug.", "Let the potatoes cool slightly, then cut them in half lengthways. Scoop out the flesh and put it in a bowl. Flake the cod and add to the potato. Mix in the parsley. Add 150ml/5fl oz of the milk and mash using a potato masher. Add a little more milk if the mixture is too stiff, but don’t let it become sloppy.", "Spoon the flesh back into the potato skins and scatter the cheese on top. Place on a baking tray and bake for 25 minutes, or until piping hot and golden.", "Serve immediately, drizzled with a little olive oil, with lemon wedges and watercress. "]}, {"isVegetarian": false, "title": "Almond and parsley crumb fish with a roasted red pepper sauce and nibbles", "url": "www_bbc_co_uk_food_recipes_cod_balls_with_a_roasted_32022", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 300g/10½oz cod fillet, pin boned and diced", "2 x 100g/3½oz red mullet fillets, pin boned and diced", "12 prawns, shells removed", "12 langoustines, shells removed, blanched", "2 tbsp Dijon mustard", "200g/7oz flaked almonds, crushed", "2 tbsp fresh parsley, chopped", "1 slice sourdough bread, cut into cubes", "½ red chilli, finely chopped", "2 garlic cloves, finely chopped ", "50ml/2fl oz extra virgin olive oil", "3 plum tomatoes", "100g/½oz flaked almonds, toasted", "½ tbsp smoked Spanish paprika", "½ jar roasted red peppers ", "1 lemon, juice only", "lemon wedges", "salt and freshly ground black pepper", "Manchego cheese shavings", "Iberico ham", "Membrillo cubes"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the seafood, heat a deep-fat fryer to 180C. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Brush the fish and seafood with the Dijon mustard. Season with salt and pepper. Mix the crushed flaked almonds and chopped parsley together, then press onto the fish and seafood to coat.", "Place in the deep-fat fryer and cook for 2-3 minutes, depending on the size of the seafood. Remove using a slotted spoon and set aside to drain on kitchen paper.", "For the roasted red pepper sauce, gently fry the bread, chilli and garlic in a pan with a little oil until the bread begins to colour. ", "Transfer the pan contents to a blender. Add the tomatoes, almonds, smoked paprika and peppers. Purée the mixture then add the lemon juice and a little olive oil. Season to taste with salt and pepper.", "To serve, place the sauce on a serving platter and put the fish, prawns and langoustines on top. Serve the nibbles alongside."]}, {"isVegetarian": false, "title": "Cod in a rich tomato sauce with courgetti", "url": "www_bbc_co_uk_food_recipes_cod_in_a_rich_tomato_59773", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tsp vegetable oil", "1 very small onion (50g/1¾oz), thinly sliced ", "1 garlic clove, finely chopped ", "½ red pepper (75g/2½oz), roughly chopped ", "pinch smoked paprika  ", "300g/10½oz tinned chopped tomatoes", "1 level tbsp tomato purée ", "175g/6oz cod fillet, boneless, skin on", "150g/5½oz courgetti", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. ", "Heat the oil in small frying pan over a medium heat. Add the onion and fry for 4–5 minutes, or until soft. Add the garlic, pepper and paprika and cook for 2 minutes.   ", "Stir in the tomatoes, tomato purée and salt and pepper, to taste. Cook over a medium heat for 10 minutes, or until the mixture begins to thicken. ", "Transfer the sauce into an ovenproof dish, lay the fish on top of the sauce and bake for 10–15 minutes, or until the fish is cooked. ", "Meanwhile, place the ‘courgetti’ in a microwave and cook on high for 2 minutes. Stand for 1 minute before serving with the fish."]}, {"isVegetarian": false, "title": "Cod in parsley sauce with cockles and mashed potato", "url": "www_bbc_co_uk_food_recipes_cod_in_parsley_sauce_47876", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["350g/12oz centre-cut cod fillet, pin boned and skinned ", "40g/1½oz sea salt", "knob of butter", "2 large potatoes, peeled and cut into chunks", "125g/4½oz unsalted butter", "125ml/4½fl oz double cream", "100g/3½oz cockles, thoroughly washed to remove any sand or silt", "1 large bunch curly parsley, leaves picked, stalks reserved, both chopped ", "2 shallots, chopped", "150ml/5½fl oz glass white wine", "25g/1oz butter", "25g/1oz flour", "150ml/5½fl oz double cream", "150ml/5½fl oz whole milk ", "30g/1oz crème fraîche", "salt", "1 tsp cayenne pepper", "1 lemon, juice only"], "serves": "Serves 2", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the cod, preheat the oven to 330F/450F/Gas 8.", "Lightly salt the cod, wrap in cling film and leave for twenty minutes. Wash the salt off and cut the cod in half.", "For the mashed potato, cook the potatoes in a large pan of boiling water until soft. Drain and return to the pan to dry out a little. ", "For the parsley sauce, give any open cockles a sharp tap on the work surface, discard any that do not close immediately.", "Heat a heavy-based pan until hot. Add the cockles, parsley stalks, shallots and wine. Put the lid on and steam until the cockles open. Drain in a colander, reserving the stock. Discard any cockles that have not opened. Pass the stock through a muslin cloth.  ", "In a clean pan, melt the butter and then stir in the flour to make a roux.  Cook for a few minutes, then gradually add the stock, stirring all the time. Then add the cream, milk and crème fraîche. Season, to taste, with salt, cayenne pepper and lemon juice.", "For the cod, heat the butter in an ovenproof frying pan. Add the cod then transfer to the oven for eight minutes.", "Meanwhile, for the parsley sauce, pick the cockles from their shells and add to the sauce along with the parsley. Keep warm, but do not boil. ", "For the mashed potato, push the potatoes through a potato ricer or a drum sieve (alternatively use a vegetable masher). In a pan, melt the butter and cream together. Fold through the mash and season with salt and white pepper.", "To serve, add the mash to serving bowls. Top with the cod and parsley sauce. "]}, {"isVegetarian": false, "title": "Cod with mango and curry", "url": "www_bbc_co_uk_food_recipes_cod_with_mango_and_curry_37791", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp brown sugar", "4 tbsp chardonnay vinegar", "1 small red onion, finely sliced", "1 firm mango, peeled, roughly chopped, stone discarded", "1 tbsp grated ginger", "1 small red chilli, halved, seeds removed, julienned", "4 x 150g/5½oz cod loin, skin on, pin boned", "sea salt and freshly ground black pepper", "1 tsp mild curry powder", "20g/¾oz butter", "1 tbsp olive oil", "60ml/2fl oz fish stock", "60ml/2fl oz coconut milk", "100ml/3½fl oz whipping cream, lightly whipped, plus 2 tbsp cream", "1 tbsp chopped chervil", "1 tsp lemon juice", "1 baby gem lettuce, cut in four", "½ cucumber, peeled, seeds removed, in large julienne"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Heat a small frying pan until medium hot. Add the sugar and vinegar and cook until the sugar has dissolved - about 1-2 minutes. Add the onion, the mango and ginger and cook over a low heat for about six minutes, or until the mango has softened but still is holding its shape. Add the chilli, stir gently to combine then remove from the heat and set aside to cool while you fry the fish. ", "Season the cod on both sides with salt, black pepper and the curry powder. Heat a medium non-stick frying pan over a medium-high heat. Add the butter and olive oil and, when foaming, add the cod, skin-side down and fry for 3-4 minutes, or until the skin is golden-brown and crisp.", "Put four 46x25cm/18x10in rectangles of greaseproof paper on a clean work surface. Arrange your ingredients on one half of the paper, so that you will be able to fold the other half over them afterwards: start with the mango mixture, dividing it equally between the four sheets, then place the cod, skin-side up on top. ", "Fold the paper over the filling and then fold along the edges to seal securely. Make sure the parcels are well sealed so that none of the liquid is lost. Put the parcels on a baking tray and bake for 8-10 minutes. Remove from the oven and leave to rest for two minutes before opening. ", "While the fish cooks, make the sauce. Heat a small pan over a medium heat, pour the fish stock and coconut milk in and bring to the boil, then reduce the heat and simmer gently until reduced by half, for about 4-5 minutes. By now, the fish should be ready, carefully open one side of each parcel and pour out the cooking juices into the sauce, then place the parcels straight onto serving plates. Whisk the whipped cream into the sauce, return to the boil, then remove from the heat and check the seasoning. Add the chervil and finish with the lemon juice.", "Serve the fish parcels with the sauce, along with the baby gem and cucumber.  "]}, {"isVegetarian": false, "title": "Cod with pesto, roast potatoes and peppers traybake", "url": "www_bbc_co_uk_food_recipes_cod_with_pesto_roast_14470", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cod_with_pesto_roast_14470_16x9.jpg", "ingredients": ["640g/1lb 7oz floury potatoes, preferably Maris Piper, peeled and thinly sliced", "2 red peppers, sliced", "2 bay leaves", "2 garlic cloves, finely chopped", "2 tbsp olive oil", "½ tsp sea salt flakes ", "4 x 120g/4oz cod fillets, skinless and boneless ", "freshly ground black pepper", "½ garlic clove ", "25g/1oz pine nuts ", "50g/1¾oz fresh basil leaves", "5 tbsp olive oil ", "25g/1oz Parmesan, finely grated", "1 tbsp lemon juice ", "½ tsp sea salt flakes"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. ", "Mix the potatoes, peppers, bay, garlic, oil, salt and a good pinch of black pepper in a large roasting tin. Cover tightly with kitchen foil and bake for 1 hour.", "Meanwhile, to make the pesto, blend the garlic and pine nuts in a food processor. Add the basil and pulse until roughly chopped. With the motor still running, add the oil and blend briefly. Stir in the Parmesan, lemon juice and salt. ", "Place the cod on top of the vegetables and spread each fillet with a quarter of the pesto. Bake, uncovered, for 15 minutes, or until the fish is cooked through. Serve immediately."]}, {"isVegetarian": false, "title": "Cod and chips with peas", "url": "www_bbc_co_uk_food_recipes_codandchipswithpeas_86983", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "½ onion, peeled and chopped", "½ red or green chilli, finely chopped", "140g/5oz pancetta cubes or streaky bacon, chopped", "200g/7oz frozen peas, defrosted", "500g/1lb 2oz potatoes, peeled and cut into chips", "1 litre/1¾ pints vegetable oil, for deep-frying", "1 sprig fresh rosemary, leaves only, chopped", "salt, to taste", "100g/3½oz self-raising flour", "100g/3½oz cornflour", "1 tsp Chinese five-spice powder", "1 tsp salt, plus extra to taste", "175-200ml/6¼-7¼fl oz soda water", "2 x 175g/5oz cod or hoki fillets", "lemon wedges, to serve"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the peas, heat the oil in a frying pan over a medium heat and fry the onion for 1-2 minutes. Add the chilli and stir well.", "Add the pancetta or bacon and cook for 8-10 minutes until golden-brown and crisp.", "Add the peas to the pan, give the pan a good shake and cook for a further 2-3 minutes.", "For the chips, place the vegetable oil into a deep, heavy-based saucepan and heat until a small cube of bread sizzles and turns golden when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Carefully place the potatoes into the hot oil. Cook for about ten minutes, until golden-brown and crisp. Remove from the pan using a slotted spoon and drain on kitchen paper.", "Sprinkle with the rosemary and a little salt.", "For the fish, sift the flour, cornflour, five-spice powder and salt into a bowl and stir.", "Gradually pour in the soda water, whisking continuously, to make a smooth batter the consistency of thick double cream.", "Using tongs, dip the fish fillets into the batter to coat completely, shaking off any excess.", "Place the fish into the hot oil that the chips were cooked in. Cook for 4-5 minutes, turning carefully from time to time.", "When golden-brown and crisp, remove the fish from the oil with a slotted spoon and drain on kitchen paper. Sprinkle with salt, to taste.", "To serve, place the fish onto plates with the chips and peas and lemon wedges."]}, {"isVegetarian": false, "title": "Cod and chorizo orzo", "url": "www_bbc_co_uk_food_recipes_codandchorizoorzo_90791", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz orzo pasta", "225g/8oz cod fillet, skinless and boneless", "salt and freshly ground black pepper ", "5 tbsp olive oil", "200g/7oz cooking chorizo, roughly chopped", "½ tsp smoked hot paprika", "90g/3½oz roasted red peppers (from a jar), cut into strips", "3 tbsp chopped fresh flatleaf parsley", "½ lemon, juice only"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/390F/Gas 6.", "Bring a large pan of salted water to the boil, add the orzo and cook for 10-12 minutes, or until just tender. Drain the orzo and set aside.", "Season the cod with salt and freshly ground black pepper. Heat an ovenproof frying pan until smoking, add one tablespoon of the olive oil and fry the cod for 1-2 minutes on both sides, or until golden-brown all over. Transfer to the oven to cook for 3-4 minutes, or until the fish is cooked through. ", "Remove the fish from the pan and flake the flesh onto a plate. ", "Heat a pan until hot, add the remaining olive oil and the chorizo and fry for 2-3 minutes, or until the chorizo is cooked and the oils are released into the pan. Using a slotted spoon, remove the chorizo from the pan and set aside.", "Add the cooked orzo and smoked sweet paprika to the pan, stir well to coat in the oil and cook for 1-2 minutes. Return the chorizo to the pan and add the roasted red peppers and flaked cod. Mix well to combine and season with salt and freshly ground black pepper. Stir in the parsley and lemon juice.", "To serve, spoon onto serving plates."]}, {"isVegetarian": false, "title": "Cod and chorizo with fennel", "url": "www_bbc_co_uk_food_recipes_codandchorizo_79585", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 pieces cod fillet, about 150-200g/5¼-7oz", "100g/3½oz black olive tapenade ", "1 tbsp olive oil", "2 bay leaves", "sprig of thyme", "125g/4oz chorizo, thinly sliced", "a few basil leaves", "1 tbsp basil oil", "50g/2oz aubergine, cut in half", "1 tbsp olive oil", "2 baby banana shallots, blanched and sliced in half", "handful of black olives", "½ lemon, juice only", "salt and cracked white pepper", "2 baby fennel, blanched ", "16-20 cherry tomatoes", "250ml/8¾oz tomato juice"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/430F/Gas 7.", "Make a cut in the side of each cod fillet, and slide the knife around to create a little pocket.", "Spread the tapenade inside. ", "Heat a large ovenproof pan until hot then add the olive oil.", "Add the bay leaves, thyme, chorizo and cod skin-side down and fry for two minutes.", "Turn the fish over so it is skin side up then place the pan into the oven for about five minutes or until the skin is golden and flesh is just cooked.", "For the fennel accompaniment, place the aubergine on a tray in the oven for 10-12 minutes.", "Remove and allow to cool slightly before removing the skin and cut into chunks.", "Heat a frying pan until hot then add the olive oil.", "Add the shallots and aubergine and cook for a couple of minutes.", "Season with salt and cracked white pepper.", "Add the baby fennel, olives, tomatoes and lemon juice and cook for a further two minutes.", "Serve with the cod. Served garnished with basil leaves nad drizzled with basil oil.", "For the tomato juice, place the juice into a small saucepan and gently bring to the boil.", "Serve drizzled around the plate with the cod and chorizo"]}, {"isVegetarian": false, "title": "Cod with parsley sauce and mash", "url": "www_bbc_co_uk_food_recipes_codwithparsleysauce_92631", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300ml/10½fl oz full-fat milk", "½ onion, peeled, finely sliced ", "pinch freshly grated nutmeg", "1 fresh bay leaf", "4 whole white peppercorns", "35g/1½oz butter", "25g/1oz flour", "3 tbsp chopped fresh parsley leaves", "salt and freshly ground black pepper", "200g/7oz new potatoes, cooked until tender, drained", "200g/7oz celeriac, peeled and cut into cubes, cooked until tender, drained", "75g/3oz butter", "1 tbsp double cream", "salt and freshly ground black pepper ", "50g/1¾oz flour", "salt and freshly ground black pepper", "4 x 175g/6oz cod fillets", "1-2 tbsp vegetable oil", "75g/3oz butter", "1 lemon, juice only, plus extra lemon wedges, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the parsley sauce, slowly bring the milk, onion, nutmeg, bay leaf and white peppercorns to a simmer in a pan. Remove the pan from the heat and set aside to cool for 8-10 minutes.", "Meanwhile, melt 25g/1oz of the butter in a heavy-based pan. Whisk in the flour to create a smooth paste (this is called a roux), then cook, whisking continuously, for one minute, or until the paste has thickened. Remove the pan from the heat.", "Strain the milk mixture into the roux mixture, then whisk well until completely incorporated. ", "Return the pan to the heat and gradually bring the mixture to the boil, whisking continuously, until the sauce has thickened enough to coat the back of the spoon.", "Stir in the remaining 10g/½oz of butter until the sauce is glossy, then simmer for 2-3 minutes. Stir in the parsley and season, to taste, with salt and freshly ground black pepper.", "Meanwhile, for the mash, crush the cooked potatoes and celeriac cubes in a pan with the butter and cream until smooth and well combined. Season, to taste, with salt and freshly ground black pepper. Keep warm.", "For the cod, sprinkle the flour onto a plate and season, to taste, with salt and freshly ground black pepper. Dredge the cod fillets in the seasoned flour until completely coated.", "Heat the oil in a frying pan over a medium heat. When the oil is hot, add the coated cod fillets and fry for 2-3 minutes on each side, or until crisp and golden-brown on both sides and cooked through. (NB: The cod is cooked through when the flesh is opaque.) ", "When the cod is almost cooked through, dot the cod fillets with the butter, then squeeze over the lemon. When the butter has melted, remove the pan from the heat. ", "To serve, spoon a portion of the mash into the centre of each of four serving plates. Place one fried cod fillet on top of each serving. Drizzle over the pan juices, then pour over the parsley sauce. Garnish each plate with a lemon wedge."]}, {"isVegetarian": false, "title": "Codfish (klippfisk) soup", "url": "www_bbc_co_uk_food_recipes_codfish_klipfisk_soup_18817", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/codfish_klipfisk_soup_18817_16x9.jpg", "ingredients": ["1kg/2lb 4oz Klippfisk (salt cod) that has been soaked for 24 hours", "1.8 litre/3¼ pints boiling water", "1 medium sprig rosemary", "15 mustard seeds", "5 allspice", "5 white peppercorns", "5 cloves", "1 garlic clove, finely chopped", "1 small leek, finely shredded", "1 onion, sliced", "3 carrots, shredded or sliced", "100g butter ", "700ml/1¼ pints milk", "700ml/1¼ pints soured cream ", "rosemary sprigs, to garnish"], "serves": "Serves 6 - 8", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["Add all the stock ingredients to a pan and let simmer for 20 minutes.", "Strain, reserving the fish meat, carrots, onions and garlic but discarding everything else.", "Crumble the reserved fish into small pieces. Divide into portions of about 50 grams per person, and keep separate.", "Add the remaining soup ingredients (butter, milk and sour cream)  and simmer for 20 minutes. If you feel the soup is too thin, you can thicken with cornflour but this is usually not necessary.", "When the broth is suitably thick, add the reserved carrots, onions and garlic.", "To serve, divide the broth between the bowls, add a portion of crumbled klippfisk to each bowl and decorate with a sprig of rosemary.", "Serve with bread."]}, {"isVegetarian": true, "title": "Coffee and chestnut meringue cake", "url": "www_bbc_co_uk_food_recipes_coffee_and_chestnut_29340", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["12 free-range eggs", "350g/12oz caster sugar", "250g/9oz plain flour", "100g/3½oz cocoa powder", "85g/3oz butter, melted, plus extra for greasing", "400ml/14fl oz double cream", "5 tbsp cold strong coffee", "3 tbsp icing sugar, sieved", "250g/9oz mascarpone, softened", "250g/9oz mascarpone", "225g/8oz sweetened chestnut purée", "300ml/10fl oz double cream", "6-8 tbsp brandy", "4-6 large meringue nests, crumbled", "225g/8oz caster sugar", "100ml/3½fl oz water", "4 free-range eggs, whites only", "holly, to garnish"], "serves": "Serves 8-10", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["For the chocolate cake, preheat the oven to 180C/350F/Gas 4. Lightly grease and line the base of a 25cm/10in loose-bottomed cake tin.", "Whisk the eggs and sugar together in a bowl for 4-5 minutes, or until thick and pale.", "Sift the flour and cocoa powder into a separate bowl then gently fold them into the egg and sugar mixture until just combined and stir in the melted butter.", "Spoon the mixture into the cake tin, lightly smoothing over the top. Place the tin onto a baking sheet and bake in the oven for 35 minutes, or until the cake has risen and is springy to the touch. Remove from the oven, allow to cool briefly then turn out onto a wire rack to cool completely.", "For the coffee mousse, place the cream, coffee and icing sugar into a bowl and whisk to soft peaks.", "Beat the mascarpone in a bowl until very smooth then fold the cream mixture into the mascarpone until just combined.", "For the chestnut mousse, place the mascarpone and chestnut purée into a small processor and blend until smooth.", "Whip the double cream until soft peaks form then fold in the chestnut mixture until just combined.", "For the Italian meringue, place the sugar and water into a pan and slowly bring to the boil until the syrup reaches 110C/230F on a sugar thermometer.", "At this stage, whisk the egg whites in the bowl of an electric mixer until firm peaks form when the whisk is removed.", "Continue heating the sugar syrup and as soon as it reaches 121C/250F remove the pan from the heat.", "Immediately resume whisking the egg whites with the beater at its lowest speed then pour in the sugar syrup in a steady stream. (CAUTION: Ensure the syrup is clear of the beaters to prevent it being splashed on your hands.)", "Continue beating for about five minutes or until the meringue is tepid.", "To assemble, cut the chocolate cake horizontally into five pieces, placing the bottom piece onto the serving plate.", "Spoon over 1-2 tbsp of the brandy then spread over half the coffee mousse then scatter over a quarter of the crumbled meringue nests.", "Place another piece of sponge on top, sprinkle with another 1-2 tbsp brandy then spread with half the chestnut mousse another quarter of the meringue.", "Repeat these layers, finishing with a layer of sponge.", "Spread the Italian meringue over the sides and top of the sponge stack, forking the meringue to make little peaks.", "Using a blow torch, glaze the meringue until just golden-brown and garnish with holly."]}, {"isVegetarian": true, "title": "Coffee and walnut battenberg cake", "url": "www_bbc_co_uk_food_recipes_coffee_and_walnut_88342", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz margarine", "100g/3½oz caster sugar  ", "2 free-range eggs ", "100g/3½oz self-raising flour", "½ tsp baking powder", "50g/1¾oz ground almonds", "few drops vanilla extract", "3 tsp milk", "1½ tsp instant coffee powder", "25g/1oz shelled walnuts, chopped ", "100g/3½oz icing sugar", "40g/1½oz butter, softened ", "½ tsp instant coffee powder ", "1½ tsp milk", "225g/8oz white marzipan", "5 small walnut pieces"], "serves": "Makes 1 cake", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the cake, preheat the oven to 170C/325F/Gas 3. Grease the bottom and sides of a 20cm/8in square, shallow cake tin. ", "Cut out a piece of greaseproof paper that is 7.5cm/3in longer than the length of the tin. Fold the paper in half widthways. Open out the paper and push up the centre fold to make a 4cm/1½in pleat. Line the base of the tin with this, making any adjustments to ensure the pleat runs down the centre of the tin making in effect two rectangular 'tins' within the tin.", "Beat the margarine, sugar, eggs, flour, baking powder and ground almonds in a large bowl for about 2-3 minutes, or until smooth, slightly lighter in colour and glossy looking. (If you put a damp cloth under the bowl, it stops it from moving around.)", "Spoon slightly more than half the mixture into a separate bowl and stir in the vanilla extract and 1½ teaspoons of the milk. Set aside. ", "Mix the coffee in the remaining 1½ teaspoons of milk, stirring until it has dissolved (you don't need to heat the milk), then stir this into the other bowl of mixture along with the chopped walnuts. Spoon the vanilla mixture into one half of the tin and the coffee-walnut mixture into the other half. Level the surface of each half with a knife. Check the paper divider is still straight and in the middle.", "Bake in the oven for 35-40 minutes or until the cake is well risen, springy to the touch and has shrunk slightly from the sides of the tin. Leave to cool in the tin for a few minutes, then loosen the cake from the sides with a round bladed knife, turn it out, peel off the parchment liner and finish cooling on a wire rack. ", "For the butter icing, sift the icing sugar into a medium bowl. Add the butter. Mix the coffee and milk together until the coffee has dissolved, and pour into the bowl. Beat everything together with a wooden spoon until soft and smooth. Set aside.", "Trim the crispy outer edges off the cooled cake with a serrated knife, then cut and trim if necessary into 4 equal strips. Lay one vanilla and one coffee-walnut strip next to each other, then use a little of the butter icing to stick them together. Spread a bit more icing on the top. Stick the remaining two strips together with icing and place them on top to create a chequerboard effect. ", "Spread a little more icing over the top of the assembled cake. ", "Cut two pieces of string, one that is the length of the assembled cake and one that will wrap all around it.", "Roll the marzipan out, on a work surface lightly dusted with sifted icing sugar, into an oblong the length of the cake and sufficiently wide to wrap around the cake, using the pieces of string as your measuring guide. ", "Lay the butter iced side of the cake on the marzipan, positioning it so that when you lift up one long side, it perfectly covers one side of the cake (this way the join will be neatly in the corner). ", "Reserve a teaspoonful of the icing and spread the rest over the remaining three sides of the cake (not the ends). Brush off any crumbs from the marzipan and work surface. Roll the cake over in the marzipan, pressing to neatly cover it, then brush the corner join lightly with water, pressing it to seal. (Try to avoid touching the marzipan with wet fingers as they will mark it.) Turn the cake over so that the join is underneath. Trim a slim slice from each end of the cake to neaten and show off the chequerboard effect. Smooth the marzipan over with your hands so their warmth will give it a smooth finish.", "While the marzipan is still soft, crimp the edges by pinching the marzipan between your thumb and first finger at a slight angle and at regular intervals. Score the top of the cake with long diagonal lines using a sharp knife. Sift over some icing sugar to lightly dust the top, then lay the walnut pieces down the centre, securing with the reserved butter icing. "]}, {"isVegetarian": true, "title": "Coffee and chocolate custard pots", "url": "www_bbc_co_uk_food_recipes_coffee_and_chocolate_52759", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/coffee_and_chocolate_52759_16x9.jpg", "ingredients": ["400g shop-bought low-fat custard", "60g/2¼oz dark chocolate (minimum 70% cocoa solids), broken into pieces", "40ml/1½fl oz strong espresso coffee", "½ orange, finely grated zest only", "¼ tsp ground cardamom", "25ml/1fl oz light squirty cream, to serve", "¼ tsp cocoa powder, to serve"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 10, "preparationMins": 0}, "recommendations": 0, "method": ["Heat the custard in a saucepan over a medium heat. Add the chocolate, espresso, orange zest and cardamom, stirring continuously until the chocolate has melted. Sieve into a jug.", "Divide equally between four 125ml/4½oz pots or serving bowls and refrigerate to firm up for at least 3 hours (it won’t set completely firm).", "When ready to serve, top with light squirty cream and a dusting of cocoa powder."]}, {"isVegetarian": true, "title": "Coffee and chocolate baklava and breakfast baklava", "url": "www_bbc_co_uk_food_recipes_coffee_and_chocolate_14427", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["14 sheets ready-made filo pastry ", "200g/7oz unsalted butter, melted", "50g/1¾oz milled porridge oats, soaked overnight in 100ml/3½fl oz apple juice", "75g/2½oz roasted chopped hazelnuts  ", "75g/2½oz flaked almonds ", "100g/3½oz dried cranberries, cherries and strawberries", "100ml/3½fl oz honey", "10 slices dried apple, chopped", "½ tsp ground star anise", "2 tsp ground ginger ", "2 tsp ground cinnamon", "2 pieces stem ginger, chopped ", "50g/1¾oz demerera sugar", "400ml/14fl oz apple juice ", "200g/7oz caster sugar", "125g/4½oz roasted chopped hazelnuts ", "2 tbsp cocoa powder ", "2 tbsp instant espresso coffee", "50g/1¾oz chocolate chips ", "1 whole star anise", "30g/1oz demerera sugar ", "300ml/10½fl oz orange juice ", "150g/5½oz caster sugar", "1 tbsp orange blossom extract ", "1 orange, zest only"], "serves": "Serves 10", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["For the breakfast baklava, preheat the oven to 180C/350F/Gas 4 and grease a large baking tray with butter. Trim eight sheets of filo so they fit neatly in the tray. ", "Place one sheet of filo in the tray and brush with melted butter then place another sheet of filo on top. Sprinkle a layer of oats, nuts, dried fruits, spices, honey, dried apple and stem ginger over. Repeat this process two more times, brushing the filo with butter as you go, then top with a double layer of filo. ", "Before buttering the final sheet of filo, use a sharp pointed knife to cut the baklava in half lengthways. Then cut it in thirds widthways  to make six pieces. Cut each piece on the diagonal to make 12 triangles. Brush the top with butter then add a sprinkling of demerera sugar. ", "Bake for 25-30 minutes, or until golden-brown.  ", "While the baklava is cooking, make a syrup. In a saucepan, heat the apple juice and sugar over a low heat until the sugar is dissolved then bring to the boil. Using a cook’s thermometer, keep measuring the temperature of the syrup until it reaches 108C/226F, then remove from the heat and allow to cool.", "When the baklava is cooked, pour over the cooled syrup.  Set aside to cool completely before removing from the tin.", "For the coffee and chocolate baklava, combine the chopped hazelnuts, cocoa, coffee, chocolate, star anise and demerera sugar in a bowl to make the filling.", "Preheat the oven to 200C/400F/Gas 6. Grease a large baking tray with butter. ", "Cut the remaining six sheets of filo in half to create 12 squares and brush one piece with melted butter.  Lay another square over the top and brush with more butter.  Spread a third of the filling over the top then add another piece of filo, brush with butter and finish with another piece of filo, buttering as before.  ", "Using a wooden spoon handle as an aid, gently roll the filo into a sausage then squash it slightly and place in the prepared tin.  Repeat to make two more filo rolls.  ", "Cut each roll into quarters to make 12 portions.  Brush butter all over.", "Bake for 15 minutes, then reduce the oven temperature to 180C/350F/Gas 4 and bake for another 10-15 minutes.  ", "Meanwhile, make a syrup. Heat the orange juice and caster sugar in a pan until the sugar is dissolved then bring to the boil.  Using a cook’s thermometer, keep measuring the temperature of the syrup until it reaches 108C/226F, then remove from the heat. Stir in the orange blossom extract and set aside to cool.", "When the baklava is cooked, scatter the orange zest on top and pour over the cooled syrup. Set aside to cool completely before serving."]}]