[{"ingredients": ["250g / 9oz de mantequilla (sin sal o salada dependiendo de su preferencia), en cubos", "4 x 150g-200g / 5½-7oz filetes de merluza, piel en", "copos de sal marina", "1 limón, cáscara y jugo solamente", "1 litro / 1¾ pintas de buena calidad de pollo o verdura", "3 cucharadas de aceite de oliva virgen extra, más extra para servir", "Tocino ahumado o panceta ahumado de 300 g / 10½oz, picado", "1 cabeza de hinojo, picada en cubos de 1cm / ½ en cubitos", "1 cebolla mediana, finamente picada", "3 dientes de ajo, finamente rallados", "2 palitos de apio, pelados y cortados en cubos de 1cm / ½ en cubitos", "100g / 3½oz de espagueti seco, roto en pedazos del tamaño de un bocado", "2 ramitas de romero", "4 ramitas de tomillo", "4 tomates de ciruela maduros en la vid", "copos de sal marina", "6 lanzas de espárragos, extremos leñosos retirados, pelados", "1 manojo de cebollas en rodajas finas", "100g / 3½ oz de guisantes frescos, envasadas", "100 g / 3½ oz de habas", "6 calabacines para bebés, en rodajas finas", "100 g / 3½ oz de judías verdes, finamente picadas", "½ racimo de rábanos, cortados en cuartos", "1 pequeña albahaca fresca", "1 pequeño puñado de cebollín fresco", "pimienta blanca recién molida"], "method": ["Para hacer la mantequilla marrón para la merluza, agrega la mantequilla a una sartén caliente. Revuelva suavemente y deje que la mantequilla se dore. Una vez dorado, pasa a través de un colador fino en un recipiente y déjalo enfriar en la nevera.", "Sazone los filetes de merluza con sal marina y luego coloque los filetes en la nevera durante 1 hora y media. (Esta empresa mejora la textura de los peces y extrae el exceso de agua).", "Para la base de sopa cocida a presión, lleve el caldo a fuego lento en una sartén por separado. Coloque la olla a presión a fuego medio. Agregue el aceite de oliva, cuando esté caliente agregue el tocino y revuelva. Freír hasta que estén doradas (alrededor de 4 minutos). Agregue el hinojo, la cebolla, el ajo, el apio y los espaguetis rotos. Sazone ligeramente con sal marina y cocine por otros 3 minutos, o hasta que las verduras estén ligeramente blandas, pero no coloreadas.", "Ate las ramitas de tomillo y romero usando una cuerda de cocina. Agregue a la olla a presión junto con el caldo caliente. Aplastar los tomates maduros en sus manos y agregarlos a la olla a presión junto con la vid. Coloque la tapa y, siguiendo las instrucciones del fabricante, ponga a presión y cocine durante 10 minutos.", "Precalienta el horno a 160C / 140C ventilador / Gas 2.", "Para la merluza, saca la mantequilla marrón de la nevera y bate hasta que se pegue, debería oler a caramelo. Sazone la merluza ligeramente con sal marina y cepille con mantequilla marrón. Coloque en una bandeja de horno y hornee durante aproximadamente 6-8 minutos.", "Una vez que los 10 minutos estén en la olla a presión, retírela del fuego y deje que se enfríe para que pueda quitar la tapa. El contenido debe estar muy caliente aún, retire con cuidado el paquete de tomillo, las pieles de tomate y la enredadera con pinzas.", "Agregue todos los verdes de primavera, hierbas y sazone con pimienta blanca. Reserve a un lado hasta que los greens de primavera estén ligeramente suaves.", "Servir en tazones con un filete de merluza en la parte superior. Termine con un poco de aceite de oliva, una ralladura de ralladura de limón y un chorrito de jugo. Agregue una pizca de sal marina en la piel de pescado y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_brown_butter_cornish_02807", "title": "Marrón mantequilla Merluza de Cornualles con sopa de primavera 'cocida a presión'", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 pequeñas alcachofas violetas", "pequeño puñado de perejil, hojas escogidas, tallos toscamente picados", "2 cucharadas de aceite de oliva", "1 diente de ajo, aproximadamente picado", "1 ramita de tomillo fresco", "100ml / 3½fl oz de vino blanco", "Tagliatelle fresco de 200g / 7oz", "50 g / 1¾oz de mantequilla sin sal", "Camarones marrones de 150g / 5½oz, pelados", "pellizcar copos de chile rojo seco", "1 limón, solo jugo", "sal marina y pimienta negra recién molida"], "method": ["Recorte la alcachofa, retire las hojas exteriores y pele el tallo. Corta finamente la alcachofa y el tallo a lo largo. Coloque en un tazón de agua fría con los tallos de perejil.", "Calentar el aceite en una sartén a fuego alto. Escurrir la alcachofa y el tallo y agregar a la sartén con el ajo, el tomillo, el vino blanco y un poco de agua. Cubra y cocine por 5 minutos. Ponga a un lado, descartando la ramita de tomillo.", "Ponga a hervir una olla de agua con sal. Cocine los tallarines de acuerdo con las instrucciones del paquete, o hasta que estén al dente. Escurra la pasta, reservando el agua en un recipiente para más tarde.", "Coloque una sartén a fuego medio. Agregue la mantequilla, la alcachofa cocida y el tallo, los camarones, los copos de chile y las hojas de perejil. Freír hasta que los camarones estén cocidos. Incline el tagliatelle, un cucharón de agua de pasta reservada y el jugo de limón. Sazonar y mezclar bien.", "Servir en dos cuencos calentados."], "url": "www_bbc_co_uk_food_recipes_brown_shrimp_and_61489", "title": "Tallarines de alcachofas y alcachofas marrones", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 patatas grandes, peladas, cortadas en discos de 1cm / ½ pulgada de grosor", "200g / 7oz de mantequilla salada, derretida", "500g / 17oz de gambas peladas", "1 cucharada de estragón fresco picado", "4-5 cucharadas de mayonesa, preferiblemente casera", "sal y pimienta negra recién molida", "200g / 7oz de berros frescos, hojas recogidas", "rociar aceite de oliva", "sal y pimienta negra recién molida", "4 huevos de gallinas camperas, solo yemas", "4 panecillos salados, calentados en el horno (opcional)"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Coloque las rodajas de patata en el fondo de un plato resistente al horno. Vierta sobre la mantequilla derretida. Cocine en el horno durante 15-20 minutos, o hasta que las papas estén tiernas.", "Mientras tanto, en un tazón, mezcle los camarones y el estragón. Agregue la mayonesa un poco a la vez hasta que los ingredientes se combinen. (NB: Puede que no necesite toda la mayonesa, solo use suficiente para unir los ingredientes de la ensalada). Sazone al gusto con sal y pimienta negra recién molida.", "Para servir, coloque las hojas de berros en un tazón grande, rocíe sobre el aceite de oliva y sazone, al gusto, con sal y pimienta negra recién molida.", "Coloque una cucharada de papas cocidas en el centro de cada uno de los cuatro platos. Coloque una cuchara sobre la ensalada de gambas en la parte superior, haciendo una pequeña hendidura en el centro de cada porción. Arregle algunas hojas de berro al lado.", "Caliente una bandeja de agua a 70C / 150F. Retire la sartén del fuego y baje suavemente las yemas de huevo en el agua. Espolvorea suavemente hasta que esté cocido, o hasta que esté cocido a tu gusto.", "Retire las yemas de huevo de la sartén de a una por vez con una cuchara ranurada. Coloque uno en la sangría en cada porción de ensalada de camarones. Sirva inmediatamente, con muffins salados calientes."], "url": "www_bbc_co_uk_food_recipes_brown_shrimp_and_potato_63070", "title": "Ensalada de camarón y papa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 hojas de pasta filo", "50g / 1¾oz de mantequilla clarificada", "3 huevos de gallinas camperas", "2 yemas de huevo de gallinas camperas", "Crema doble de 425 ml / ¾ de pinta", "pizca de nuez moscada recién rallada", "sal y pimienta negra recién molida", "2 cucharadas de aceite de colza o aceite de oliva", "2 racimos de cebollas de primavera, en rodajas finas", "algunas ramitas de hinojo", "100g / 3½oz de gambas marrones peladas", "40 g / 1½ oz de queso azul, recién rallado"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Unte con mantequilla los orificios de una lata de panecillos (esta receta contiene ocho tartas, por lo que es posible que tenga que hornearlas en lotes).", "Corte la masa de filo hasta el tamaño correcto para las latas de muffin, luego cubra la masa de filo con la mantequilla clarificada y presione en moldes para muffins creando cuatro capas de filo con mantequilla en cada caso. Hornee durante aproximadamente 10-15 minutos hasta que estén dorados claros (para hornear a ciegas, no deben estar completamente cocidos).", "Para el relleno, coloca los huevos, las yemas de huevo y la crema doble en un bol y bate suavemente. Agregue la nuez moscada, sal y pimienta negra recién molida.", "Coloque un tamiz sobre una jarra de vertido y cuele la mezcla de huevo.", "Calentar el aceite en una sartén y freír rápidamente las cebolletas hasta que se ablanden.", "En una sartén con agua hirviendo, cocine el hinojo, luego dígalo inmediatamente y hágalo correr bajo agua fría para evitar que pierda color y cocine más. Mezcle con las cebollas de primavera.", "Divida el samphire y la mezcla de cebolla de primavera entre los casos de pastelería. Cubra con algunos camarones y el queso azul, luego vierta la mezcla de huevo para llenar los casos.", "Coloque las tartas en una bandeja para hornear en el centro del horno precalentado. Cocine por aproximadamente 20 minutos, o hasta que el llenado esté listo. Deje que se enfríe durante unos minutos antes de servir."], "url": "www_bbc_co_uk_food_recipes_brown_shrimp_tartlets_80711", "title": "Tartaletas de camarones marrones", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50 g / 2 oz de chocolate negro sin gluten de mejor calidad", "100 g / 3½ oz de mantequilla", "200 g / 7 oz de azúcar en polvo", "2 huevos, preferiblemente de campo abierto, ligeramente batidos", "1-2 cucharaditas de extracto puro de vainilla", "75g / 3oz de almendra molida", "1-2 cucharaditas de polvo de hornear sin gluten", "pizca de sal", "110g / 4oz de nueces picadas", "Lata cuadrada de 20cm / 8 pulgadas, forrada con papel de silicona"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Derrita el chocolate en un recipiente resistente al calor suspendido sobre una fuente de agua hirviendo o en un horno bajo.", "Bata la mantequilla y el azúcar hasta que estén pálidos, suaves y livianos, luego bate en los huevos ligeramente batidos, el extracto de vainilla y el chocolate derretido. Por último, agregue las almendras molidas, el polvo de hornear sin gluten, la sal y las nueces picadas. Extienda la mezcla en la lata y hornee en el horno durante aproximadamente 30-35 minutos.", "Deje que se enfríe, luego corte en cuadrados de 5 cm / 2 pulgadas para servir."], "url": "www_bbc_co_uk_food_recipes_brownies_74769", "title": "Brownies", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 16", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 rodajas de soda lista para preparar", "2 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "1 volquete", "300 ml / 10 fl oz de leche", "½ cebolla roja, en rodajas", "1 hoja de laurel", "1 ramita de tomillo fresco", "25g / 1oz de mantequilla", "¼ de cebolla roja, finamente picada", "1 diente de ajo, finamente picado", "1 cucharadita de mostaza integral", "½ cucharadita de vinagre de vino blanco", "Crema doble 50ml / 2fl oz", "500ml / 18fl oz de agua hirviendo", "50ml / 2fl oz de vinagre de vino blanco", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para hacer la bruschetta, caliente una sartén hasta que fume. Rocíe las rodajas de soda con aceite de oliva, sazone al gusto, con sal y pimienta negra recién molida y coloque sobre la plancha caliente a la parrilla durante dos minutos a cada lado.", "Para el kipper escalfado, coloca la leche, la cebolla, el laurel y el tomillo en una sartén ancha y poco profunda. Llevar a fuego lento a fuego lento y dejar en infusión durante unos minutos.", "Agregue el kipper y el poach durante cinco minutos, o hasta que se caliente, luego retire el arenque y déjelo a un lado en un lugar cálido.", "Para hacer la salsa, derrita la mantequilla en una sartén a fuego medio. Agregue la cebolla y el ajo y fría por dos minutos para ablandar.", "Agregue la mostaza y el vinagre y cocine durante dos minutos.", "Agregue la crema y cocine a fuego lento y cocine a fuego lento durante cinco minutos, hasta que se espese y reduzca.", "Para hacer el huevo escalfado, coloque el agua y el vinagre en una cacerola y caliente para mantener una cocción suave a fuego lento. Agita el agua con una cuchara para crear un efecto de hidromasaje. Agregue suavemente el huevo y el poach durante tres minutos, o hasta que esté cocido a su gusto. Retire con una espumadera y enjuague cuidadosamente con agua caliente.", "Para servir, coloque las dos rebanadas de bruschetta en un plato caliente, coloque el huevo escalfado en una rebanada y el arenque escalfado en la otra. Vierta la salsa sobre ambos."], "url": "www_bbc_co_uk_food_recipes_brunchplatter_80192", "title": "Plato de brunch", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1½ cucharadita de cilantro molido", "1½ cucharadita de comino molido", "2 cucharaditas de pimentón dulce ahumado", "125 g / 4½ oz cebolla (aproximadamente ½), cortada en trozos", "3 dientes de ajo, aplastados", "125g / 4½oz de apio, cortado en trozos de 3cm / 1¼ pulgadas", "70g / 2½ oz de hinojo, cortado en trozos de 3cm / 1¼in", "1 zanahoria grande, cortada en trozos de 3cm / 1¼in", "Setas botón 375 g / 13 oz", "1 chile rojo", "Jengibre fresco de 12 g / ½ oz, finamente rallado o en rodajas", "1 pimiento rojo, cortado en dados grandes", "100ml / 3½fl oz de aceite de colza", "gran pizca de sal marina", "100 g / 3½ oz de frijoles flageolet", "260g / 9½oz de arroz basmati marrón", "1 hoja de laurel", "100g / 3½ oz de puré de tomate", "Pimientos del piquillo de 200g / 7oz", "1 x 400 g de tomate picado", "1 x 240 g de frijoles rojos de hojalata (peso escurrido)", "100g / 3½oz de salsa marrón", "2 cucharadas de salsa Worcestershire vegetariana", "40 g / 1½ oz de chocolate (100 por ciento de sólidos de cacao), finamente rallado", "10g de hojas de cilantro, toscamente picadas", "sal y pimienta negra recién molida"], "method": ["Para las especias tostadas, en una sartén seca a fuego medio-bajo, cocine las especias por un minuto, teniendo cuidado de no quemarlas (solo desea extraer los aceites esenciales). Dejar de lado.", "Para la base de vegetales, agregue la cebolla, el ajo, el apio, el hinojo, la zanahoria, los champiñones, el chile, el jengibre y el pimiento rojo a un procesador de alimentos. Pulsa en ráfagas de 3 segundos durante 30 segundos, hasta que tengas dados de 2-3 mm. Esto puede necesitar hacerse en lotes dependiendo de la capacidad de su procesador de alimentos.", "Caliente el aceite en una cacerola grande a fuego medio y fríe con cuidado las verduras, las especias tostadas y una gran cantidad de sal durante 10 minutos.", "Para el arroz, en una cacerola grande separada a fuego alto, ponga a hervir 550 ml / 1 pinta de agua y cocine los frijoles flageolet durante 10 minutos a ebullición hasta que estén tiernos. Levante los frijoles de la sartén con una cuchara ranurada, pero mantenga el licor de cocción en el fuego ya que lo usará para cocinar el arroz. Reserve los frijoles", "Para terminar el chile, agregue el puré de tomate, los pimientos del piquillo y los tomates enlatados y cocine a fuego lento durante 10 minutos. Agregue los frijoles, los frijoles cocidos, las salsas marrón y Worcestershire y déjelos cocer durante 5 minutos más.", "Mientras se cocina el chile, cocine el arroz integral en el licor de cocción de frijoles flageolet con la hoja de laurel y cocine a fuego lento durante 15-20 minutos, cubierto con una tapa. Dependiendo de la variedad de arroz, puede tomar unos minutos más. Una vez cocinado, escurra el exceso de líquido y transfiéralo a los platos.", "Para terminar, agregue el chocolate rallado. Pruebe y sazone con sal y pimienta según sea necesario. Sirve el chile con el cilantro picado y el arroz integral al lado."], "url": "www_bbc_co_uk_food_recipes_bruno_loubets_bean_and_68770", "title": "Pepino de judías y vegetales de Bruno Loubet", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bruno_loubets_bean_and_68770_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["60g / 2¼oz de queso cheddar maduro, rallado", "sal y pimienta negra recién molida", "100 g / 3½ oz de frijoles negros secos, empapados durante la noche en agua fría", "1 cebolla, partida por la mitad", "1 chili ancho seco", "2 dientes de ajo, finamente picados", "45 g / 1¾oz de manteca de cerdo", "Harina normal de 175g / 6oz, más extra para espolvorear", "35 g / 1¼ oz de harina de maíz", "1 cucharadita de polvo de hornear", "150ml / 5fl oz de agua tibia", "2 tomates grandes, carne picada finamente, jugo y semillas drenados", "½ cucharadita de azúcar en polvo", "½ lima, solo jugo", "1½ aguacates grandes, toscamente picados", "1 chile picante rojo grande, finamente picado", "2 cucharaditas de cilantro fresco picado", "½ lima, solo jugo", "1 cucharadita de aceite de oliva", "2 tomates secados al sol, finamente picados", "1 chile jalapeño, finamente picado", "100ml / 3½ fl oz crema agria", "1½ cucharadita de aceite de oliva", "Chorizo ​​de cocina picante 200 g / 7 oz, más o menos picado", "5 hongos castaños, toscamente picados", "2-3 cucharadas de salsa chipotle", "40 g / 1½ oz de mantequilla", "4 huevos grandes de gallinas camperas"], "method": ["Para hacer los frijoles refritos, escurra los frijoles, póngalos en una olla y cúbralos con agua. Agregue las mitades de cebolla y chile ancho y cocine a fuego lento durante 45-50 minutos, o hasta que estén tiernas. Alternativamente, use una olla a presión y cocine durante 20 minutos.", "Mientras tanto, para hacer las tortillas, mezcle la harina, la harina de maíz, el polvo de hornear y ½ cucharadita de sal en un tazón grande. Vierta el agua tibia un poco a la vez y mezcle hasta que tenga una masa dura. Amasar sobre una superficie ligeramente enharinada durante 2-3 minutos. Divida en cuatro y dé forma a cada pieza en una bola. Cubra con film transparente y déjelo reposar por 50 minutos.", "Para hacer la salsa, coloque los tomates en un tazón con el azúcar, el jugo de lima y una pizca de sal y mezcle bien.", "Para hacer el guacamole, ponga los aguacates, el chile y el cilantro en un bol y mezcle bien. Agregue el jugo de lima y el aceite, sazone con sal y pimienta y vuelva a mezclar.", "Para hacer la salsa de crema agria, ponga el tomate deshidratado, el jalapeño y la crema agria en un bol y mezcle hasta obtener una pasta.", "Para los frijoles refritos, escurra los frijoles cocidos, reserve el líquido y mezcle en la sartén con el ajo. Derretir la manteca de cerdo en una sartén grande a fuego medio y freír los frijoles durante 4-5 minutos. Mezcle algo del líquido de cocción reservado en los granos para lograr una consistencia espesa y untable. Sazone al gusto.", "Para hacer el relleno de chorizo, caliente el aceite en una sartén a fuego alto y fría el chorizo ​​durante 2-3 minutos. Agregue los champiñones y fríalos hasta que estén cocidos. Agregue suficiente salsa de chipotle para cubrir los ingredientes.", "Para las tortillas, despliegue cada bola de masa sobre una superficie ligeramente enharinada en forma de tortilla. Coloque una sartén a fuego alto y, cuando esté caliente, cocine la primera tortilla. Cuando un lado esté lleno de ampollas, voltéelo y cocínelo durante 2 minutos más. Cocine las tortillas restantes de la misma manera. Envuelva las tortillas cocidas en un paño para mantener el calor.", "Justo antes de servir, haga los huevos revueltos derretiendo la mantequilla en una cacerola a fuego medio. Agriete los huevos y cocine, revolviendo continuamente. Después de 1 a 2 minutos, cuando los huevos aún estén ligeramente mojados, retírelos del fuego. Sazone con sal y pimienta, luego transfiera a un plato de servir para terminar de cocinar a su propio calor.", "Sirva los huevos revueltos con el cálido chorizo, los frijoles refritos, la salsa de crema agria, el guacamole, la salsa, el queso cheddar y las tortillas calientes, y deje que cada uno prepare su propio burrito."], "url": "www_bbc_co_uk_food_recipes_brunch_burrito_57075", "title": "Brunch burrito", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/brunch_burrito_57075_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["250 g / 9 oz de azúcar en polvo", "1 ramita de canela", "½ limón, corteza entera pelada solamente", "Harina normal de 25g / 1oz, más extra para quitar el polvo", "12 g de harina de maíz", "300ml / 10½ fl oz de leche", "4 yemas de huevo de gallinas camperas, más 1 huevo entero de gallinas camperas", "semillas de vainilla de una vaina de vainilla", "300g / 10½oz de hojaldre listo para usar con mantequilla"], "method": ["Precaliente el horno a su configuración más alta, o al menos 230C / 210C Fan / Gas 8.", "Para el jarabe de azúcar, hierva el azúcar, la canela y la cáscara de limón en una cacerola con 250 ml de agua. Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento, luego cocine a fuego lento durante 3 minutos. Deja el almíbar a un lado hasta que esté completamente frío. Una vez frío, descarta la canela y la cáscara de limón.", "Para el relleno de natillas, mezcle las harinas en un bol. Vierta un poco de leche y revuelva con el dedo hasta que se combinen.", "Llevar la leche restante a ebullición en una cacerola a fuego lento, revolviendo regularmente.", "Poco a poco agregue la leche hervida a la mezcla de harina y bata durante 1 minuto, o hasta que esté suave y bien combinado.", "Bata lentamente el jarabe de azúcar hasta que esté bien combinado.", "Agregue las yemas de huevo, el huevo entero y las semillas de vainilla hasta que estén suaves y bien combinados. Dejar de lado.", "Extienda la masa en una superficie de trabajo ligeramente enharinada en un rectángulo de aproximadamente 50x30 / 20x12 pulgadas, pero más importante, hasta un grosor de 1 mm.", "Con el borde más largo del rectángulo de repostería hacia usted, enrolle la masa lo más apretadamente posible, cepillándola de derecha a izquierda con agua sobre la marcha. Corte el rollo de hojaldre en discos de 2cm / ¾ pulgadas de espesor.", "Coloque los discos en los orificios de una lata de panecillos y masajee con un movimiento circular con un pulgar húmedo, hasta que la masa se eleve por los lados de los agujeros en la bandeja. Asegúrate de no hacer ningún agujero en la masa.", "Llena los pasteles con la crema hasta que estén casi llenos, pero no del todo.", "Hornee las tartas de crema en el horno durante 20 minutos, o hasta que la masa se haya levantado y la superficie de la crema esté chamuscada. Déjelo enfriar durante al menos 10 minutos antes de servir para permitir que la natilla se asiente un poco."], "url": "www_bbc_co_uk_food_recipes_brunos_portuguese_70548", "title": "Tartas de crema Portuguesa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/brunos_portuguese_70548_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 rebanadas de pan de centeno", "2 cucharaditas de mostaza integral", "Queso Emmental 85g / 3oz, rallado", "1 cucharada de salsa Worcestershire", "6 hojas de albahaca fresca, rotas", "2 tomates de ciruela enlatados, cortados en cuartos"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Tueste ligeramente el pan en una bandeja para hornear en el horno. Retire y extienda la mostaza en un lado de la tostada.", "En un tazón, mezcle el queso rallado, la salsa Worcestershire y las hojas de albahaca, luego apile sobre la tostada, seguido de los tomates picados. Regrese al horno para cocinar por 2-3 minutos o hasta que el queso se derrita y burbujee.", "Corta cada pieza por la mitad y sirve inmediatamente."], "url": "www_bbc_co_uk_food_recipes_bruschetta_88846", "title": "bruschetta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 pimientos amarillos", "200g / 7 oz pequeños tomates de ciruela", "1 diente de ajo, finamente picado", "6 cucharadas de aceite de oliva virgen extra italiano, más extra para cepillar", "10 hojas de albahaca, más o menos picadas", "sal y pimienta negra recién molida", "12 rebanadas de jamón", "1 pan de pan ciabatta, de unos 30cm de largo", "queso parmesano, para afeitar"], "method": ["Precalentar el horno a 220C / 428F / Gas 7.", "Coloque los pimientos amarillos enteros en una bandeja para hornear y tápelos durante aproximadamente media hora.", "Retire del horno e inmediatamente transfiéralos a un tazón grande. Cubra con una película adhesiva y déjela tapado hasta que los pimientos estén fríos. El vapor hará que sea más fácil pelar los pimientos.", "Una vez que se haya enfriado, despegue las pieles, retire las semillas y corte. Coloque en un tazón.", "Corte los tomates a la mitad y mezcle con los pimientos asados, el ajo, el aceite de oliva virgen extra y la albahaca. Sazonar con sal y pimienta negra recién molida.", "Coloque las rodajas de prosciutto en una bandeja para hornear y ase a la parrilla durante 2-3 minutos por cada lado hasta que estén crujientes.", "Cortar el pan de chapata en tres piezas iguales y luego cortar cada pieza por la mitad a través del centro horizontalmente. Cepille ambos lados con aceite de oliva y tueste en una sartén hasta que estén dorados.", "Para servir la bruschetta, coloque dos rebanadas de prosciutto crujiente sobre cada pieza de chapata. Divida la mezcla de pimiento y tomate entre cada pieza y cubra con virutas de parmesano.", "Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_bruschettaconpeperon_76388", "title": "Bruschetta con pimientos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 rebanadas de pan de ciabatta", "4 cucharadas de aceite de oliva", "1 diente de ajo, pelado", "1 tomate, picado", "6 hojas de albahaca fresca, rotas", "1 puñado de berros, picados", "sal y pimienta negra recién molida"], "method": ["Rocíe el aceite de oliva sobre las rebanadas de pan de chapata. Caliente una bandeja de carbón hasta que fume y tueste el pan durante 1-2 minutos en ambos lados, o hasta que se dore por todas partes. Retire de la sartén y frote los dientes de ajo en un lado de cada rebanada de pan tostado.", "Mezcle el tomate, la albahaca, el berro y el aceite restante en un bol, sazone con sal y pimienta negra recién molida y apile sobre los tostados de pan ciabatta. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_bruschetta_89024", "title": "Bruschetta de tomate, albahaca y berro", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 rebanada de chapata", "dash aceite de oliva", "1 pimiento rojo asado de un tarro, escurrido, rebanado", "55g / 2oz de queso Dolcelatte, desmenuzado"], "method": ["Precalentar la parrilla a mediano.", "Rocíe una rebanada de chapata con aceite de oliva y luego cocine por 1-2 minutos por cada lado.", "Calentar los pimientos rojos asados ​​en rodajas en una sartén pequeña y luego cuchara sobre el pan a la parrilla. Coloque el queso Dolcelatte desmenuzado encima de los pimientos y colóquelo debajo de la parrilla durante 1-2 minutos o hasta que burbujee.", "Deslice sobre un plato y sirva."], "url": "www_bbc_co_uk_food_recipes_bruschettaofroastedp_88144", "title": "Bruschetta de pimiento asado y Dolcelatte", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 rebanadas de pan", "2 cucharadas de aceite de oliva", "1 diente de ajo", "150g / 5½oz de butterbeans", "1 lima, cáscara y jugo solamente", "4 cucharadas de aceite de oliva", "100g / 3½oz de aceitunas negras deshuesadas", "½ pizca de escamas de chile", "2 cucharaditas de aceite de oliva", "6 cucharadas de albahaca fresca", "100 g / 3½ oz de yogur griego", "2 cucharaditas de cebolletas frescas picadas", "1 cucharadita de mostaza integral"], "method": ["Para la bruschetta, frote el pan con el diente de ajo y rocíe con el aceite de oliva.", "Tueste en una sartén de plancha durante 2-3 minutos hasta que esté dorado.", "Para el puré de butterbean, mezcle todos los ingredientes en una licuadora para formar una pasta suave.", "Para la tapenade, mezcle todos los ingredientes en una licuadora hasta que se forme una pasta homogénea.", "Para la salsa de cebollín, mezcle el yogur, el cebollino picado y la mostaza en un bol.", "Coloque los dips en tazones individuales y sirva con la bruschetta."], "url": "www_bbc_co_uk_food_recipes_bruschettawithbutter_76220", "title": "Bruschetta con puré de mantequilla y tapenade", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["pan de masa fermentada (par de rebanadas por persona)", "1 diente de ajo", "8 hígados de pollo, bilis verde eliminada", "leche, para remojar los hígados de pollo, suficiente para cubrirlos", "harina, suficiente para cubrir los hígados", "1 cucharadita de vinagre balsámico", "½ cucharadita de puré de tomate", "salpicaduras de vino tinto", "1 diente de ajo, picado", "2 chalotes medianos, finamente cortados en cubitos", "30g / 1oz de mantequilla", "Tomillo de ramita grande", "2 cucharadas de caldo de carne"], "method": ["Remoje los hígados de pollo en la leche durante la noche. Retírelos de la leche, luego cúbralos con harina y fríalos con mantequilla derretida.", "Agregue los chalotes y el ajo finamente picados y un poco de tomillo y mezcle para mezclar.", "Agregue un poco de vino tinto, ½ cucharadita de puré de tomate, 2 cucharadas de caldo y el vinagre balsámico.", "Frote dos rebanadas de pan con un poco de ajo y ase a la parrilla. Sirva con los hígados de pollo y decore con un poco más de tomillo."], "url": "www_bbc_co_uk_food_recipes_bruschettawithchicke_66105", "title": "Bruschetta con hígados de pollo en salsa de vino tinto", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pan de ciabatta pequeño, dividido longitudinalmente", "2 cucharadas de aceite de oliva", "150g / 5½oz de tomates cherry, cortados a la mitad", "1 albahaca grande, hojas solo", "sal y pimienta negra recién molida"], "method": ["Rocíe el lado cortado del pan de chapata con una cucharada de aceite de oliva y pan tostado en una sartén grande y antiadherente hasta que se dore.", "Mezcle la cucharada restante de aceite de oliva, tomates cherry, albahaca y sal y pimienta en un tazón pequeño y déjelo a un lado para infundir.", "Para servir, divida la mezcla de tomate entre los dos pedazos de pan de chapata tostado."], "url": "www_bbc_co_uk_food_recipes_bruschettawithfreshc_87057", "title": "Bruschetta con tomates cherry frescos y albahaca", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "Halloumi de 100 g / 3½ oz, cortado en 4 rebanadas", "1 cucharada de aceite de oliva", "2 tomates de ciruela picados", "1 cucharada de azúcar moreno", "2 cucharadas de ketchup de tomate", "sal y pimienta negra recién molida", "1 rebanada de pan ciabatta, tostado", "2 cucharadas de aceite de oliva", "ramita fresca perifollo"], "method": ["Para el halloumi, caliente el aceite en una sartén y fría las rodajas de halloumi durante 2-3 minutos por cada lado, hasta que estén doradas.", "Para la salsa de tomate, caliente el aceite en una cacerola y cocine los tomates, el azúcar y el ketchup hasta que espese. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, coloque la chapata tostada en un plato, rocíe con aceite de oliva y cubra con la salsa de tomate y el halloumi. Adorne con perifollo."], "url": "www_bbc_co_uk_food_recipes_bruschettawithhallou_85353", "title": "Bruschetta con halloumi", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["150g / 5½oz de tomates cherry", "2 cucharadas de aceite de oliva", "2 cucharadas de romero", "2 cucharadas de tomillo", "1 diente de ajo, picado", "2 rebanadas grandes de pan de ciabatta, tostadas"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Coloque los tomates en una bandeja para hornear, rocíe con aceite y espolvoree con romero, tomillo y ajo.", "Coloque en el horno precalentado por 10 minutos.", "Sirva los tomates calientes en el pan tostado y disfrute."], "url": "www_bbc_co_uk_food_recipes_bruschettawithtomato_77891", "title": "Bruschetta con tomates y romero", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 rebanadas gruesas de pan", "1 cucharada de aceite de oliva", "25g / 1oz de cebolla roja picada", "75g / 2¾oz de tomates enlatados, picados", "1 cucharada de aceite de oliva", "1 cucharada de perejil fresco picado", "sal y pimienta negra recién molida"], "method": ["Caliente una sartén a la plancha y frote el pan con aceite de oliva. Coloque el pan en la plancha y cocine por dos minutos en cada lado, o hasta que esté tostado.", "Para el relleno, coloque la cebolla roja, los tomates y el aceite de oliva en un bol y mezcle bien.", "Agregue el perejil y la sazón, al gusto, con sal y pimienta negra recién molida.", "Para servir, coloque el pan tostado en el plato y la cuchara sobre la cubierta."], "url": "www_bbc_co_uk_food_recipes_bruschettawithtomato_79947", "title": "Bruschetta con tomate y cebolla roja", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 cucharadas de aceite de oliva", "2 rebanadas de pan de ciabatta", "½ cucharadita de sal marina", "1 diente de ajo, pelado y reducido a la mitad", "2 cucharadas de perejil fresco picado, picado", "2 tomates de vid, sin semillas y picados", "1 diente de ajo, finamente picado", "6 hojas de albahaca, desgarradas", "3 cucharadas de aceite de oliva", "sal y pimienta negra recién molida"], "method": ["Para el pan tostado, rocíe el aceite sobre la chapata y espolvoree sobre la sal. Caliente una sartén hasta que esté humeando y dore el pan durante 2-4 minutos por cada lado, o hasta que esté dorado y tostado. Retire de la sartén y frote cada rebanada de pan tostado con el lado cortado de medio diente de ajo.", "Para el relleno de tomate, combine todos los ingredientes en un tazón y mezcle bien, luego sazone, al gusto, con sal y pimienta negra recién molida.", "Para servir, apile la mezcla de tomate encima del pan tostado."], "url": "www_bbc_co_uk_food_recipes_bruschettawithtomato_88870", "title": "Bruschetta con tomates, albahaca, ajo y aceite de oliva", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]