[{"ingredients": ["50g / 2oz de chocolate negro de buena calidad", "200 g / 7 oz de azúcar en polvo", "200g / 7oz de mantequilla sin sal, ablandada, más extra para engrasar", "2 naranjas, solo ralladura, más jugo de 1 naranja", "5 huevos de gallinas camperas", "Harina de auto crianza de 200g / 7oz", "1 cucharadita de polvo de hornear", "150 g / 5¼ oz de cacao en polvo", "150g / 5¼ oz de azúcar", "150ml / 5¼fl oz de agua", "dash licor de naranja", "Crema doble de 200 ml / 7 fl oz", "200 g / 7 fl oz de chocolate negro de buena calidad", "dash licor de naranja"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase y alinee dos latas de emparedado de 20 cm / 8 in.", "Derrita el chocolate en un tazón sobre una fuente de agua hirviendo.", "Mientras tanto, unte el azúcar y la mantequilla en un bol hasta que estén suaves y esponjosos. Agregue la ralladura de naranja y el jugo y el chocolate derretido. Lentamente golpee los huevos, uno a la vez, hasta que estén bien combinados.", "Tamice la harina, el polvo de hornear y el polvo de cacao en la mezcla y dóblelos hasta que estén bien combinados. Divida la masa de la torta entre las dos latas de sándwich y hornee durante 25-30 minutos, o hasta que esté bien cocida.", "Mientras los pasteles se cocinan, prepare el jarabe de azúcar. Caliente el azúcar y el agua en una sartén a fuego medio hasta que el azúcar se haya disuelto y el volumen del líquido se haya reducido ligeramente. Agregue el licor de naranja.", "Una vez cocidos, retire los pasteles del horno y déjelos a un lado para que se enfríen durante 10 minutos. Use un pincho para hacer agujeros en todo el pastel, luego vierta sobre el almíbar, dejando que se empape por completo después de cada adición. Deje que se enfríe completamente. Pase un cuchillo de hoja redonda por el borde interior de las latas para aflojar las tortas y luego retírelas de las latas.", "Para la ganache, caliente la crema doble en una cacerola y luego retírela del fuego. Agregue el chocolate y deje reposar durante unos minutos para que se derrita. Revuelva el ganache hasta que esté suave y luego agregue el licor de naranja. Dejar de lado para enfriar.", "Para helar el pastel, coloca una torta en un plato y usa el ganache de chocolate para emparedar los pasteles. Enfríe la parte superior y los lados de los pasteles con el ganache restante (use papel de cocina para limpiar cualquier derrame). Permita que la formación de hielo se ajuste ligeramente, luego alise con una espátula."], "url": "www_bbc_co_uk_food_recipes_chocolate_orange_cake_63709", "title": "Pastel de naranja y chocolate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 8-10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["225g / 8oz de mantequilla salada, a temperatura ambiente", "225 g / 8 oz de azúcar en polvo", "3 naranjas grandes, ralladura finamente rallada solamente", "1 huevo grande de gallinas camperas, ligeramente golpeado", "Harina simple de 450g / 1lb, más extra para enharinar", "250 g / 9 oz de azúcar glas", "½ - 1 cucharada de cacao en polvo (no el chocolate caliente endulzado)", "1 - 1½ cucharada de líquido (jugo de naranja zested arriba)", "colorante de comida naranja"], "method": ["Para las galletas, bata la mantequilla y el azúcar y la ralladura de naranja en un bol hasta que estén suaves y esponjosos.", "Coloque una hoja de película adhesiva sobre una superficie de trabajo limpia.", "Agregue el huevo a la mezcla y bata al mismo tiempo. Agregue la harina para juntarla como masa.", "Envuelva la masa en una película adhesiva y refrigere por al menos 15 minutos.", "Precalentar el horno a 180C / 350F / Gas 4.", "Hierva la superficie de trabajo y luego enrolle la masa suavemente, usando un rodillo enharinado, hasta aproximadamente 0.5cm / ¼ de grosor.", "Corta los bizcochos con los cortadores de galletas de tu elección.", "Transfiera a una bandeja para hornear con una espátula, asegurándose de que los bizcochos estén bien espaciados. Hornea de 10 a 15 minutos o hasta que esté ligeramente dorado.", "Retire a una rejilla para enfriar.", "Para la formación de hielo, tamice el azúcar glas y divídalo entre dos tazones. Tamiza el polvo de cacao en uno de los cuencos.", "Poco a poco agregue el líquido a cada tazón, una cucharadita a la vez, hasta que la formación de hielo sea espesa pero líquida. Si está demasiado líquido, agregue más azúcar glas tamizada.", "Agregue una gota de colorante de comida de color naranja al glaseado blanco.", "Ponga el glaseado en dos bolsas de tubería separadas. Pinte los patrones de color naranja y marrón en los bizcochos. Deje endurecer para servir."], "url": "www_bbc_co_uk_food_recipes_chocolate_orange_iced_84664", "title": "Galletas con chocolate 'naranja chocolate'", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 10-12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Azúcar glas de 360g / 12½oz", "Almendras molidas de 360 ​​g / 12½ oz", "1 cucharada de cacao en polvo", "10 claras de huevo de gallinas camperas", "Azúcar en polvo 360g / 12½oz", "6 cucharadas de agua fría", "100ml / 3½ fl oz crema doble", "150g / 5½oz de chocolate con leche, roto en pedazos", "100ml / 3½ fl oz crema doble", "200g / 7oz de chocolate blanco, roto en pedazos", "pasta colorante naranja", "1½ cucharadita de aroma de naranja", "100ml / 3½ fl oz crema doble", "1 cucharadita de esencia de menta", "200g / 7oz de chocolate blanco, roto en pedazos", "colorante de pasta colorante verde", "6 cucharadas de crema doble", "115 g / 4 oz de azúcar en polvo", "115g / 4oz de mantequilla", "115g / 4oz de chocolate blanco, roto en pedazos", "pasta colorante naranja", "115g / 4oz de chocolate blanco, roto en pedazos", "pasta colorante verde", "115g / 4oz de chocolate con leche, roto en pedazos", "Azúcar glas de 360g / 12½oz"], "method": ["Línea ocho bandejas para hornear con papel antigrasa. Precalentar el horno a 170 C / 325 F / Gas 3.", "Para hacer las conchas, coloca el azúcar glas, las almendras molidas y el polvo de cacao en un procesador de alimentos y pulsa durante unos 30 segundos para hacer un polvo fino. Tamice el polvo en un recipiente limpio, descartando los grumos que quedan en el tamiz.", "Pese las claras de huevo; debería tener aproximadamente 300 g / 10½ oz en total. Mezcle la mitad de las claras de huevo en la mezcla de azúcar glas y almendras para hacer una pasta suave. Coloque las claras de huevo restantes en el tazón de un mezclador con un accesorio batidor. Batir las claras de huevo en la batidora hasta que formen picos suaves.", "Coloque el azúcar y el agua de la máquina en una sartén pequeña, caliente suavemente hasta que el azúcar se haya disuelto y luego suba el fuego hasta que el jarabe alcance los 115 ° C (235 ° F) (use un termómetro de azúcar para verificar esto). Encienda el mezclador y continúe batiendo las claras de huevo a baja velocidad, vertiendo el jarabe en un flujo constante. Aumente el mezclador a una velocidad media durante dos minutos, luego vuelva a bajarlo y continúe batiendo durante cinco minutos, o hasta que se formen picos rígidos cuando se quite el batidor.", "Doble la pasta de azúcar glas, almendras y clara de huevo en las claras de huevo batidas. Coloque la mezcla en una bolsa grande con una boquilla plana de 5 mm / ¼ in. Pipe 4cm / 1½ en círculos en las bandejas para hornear. Usando un palillo de dientes, estalló las burbujas de aire que aparecen en la superficie de las conchas. Los macarrones deben reposar durante al menos 20 minutos antes de entrar en el horno, ya que ayuda a formar una piel.", "Hornee las cáscaras durante 12 minutos o hasta que ya no se tambaleen cuando sacude la bandeja para hornear. (Puede necesitar hacer esto en tandas, pero los macarrones pueden descansar durante 1-2 horas). Retire del horno y deje enfriar. Con cuidado, despegue los macarrones del papel resistente a la grasa.", "Para hacer los centros de chocolate con leche, caliente la crema en una cacerola pequeña hasta que hierva, luego quite la sartén del fuego y bata los trozos de chocolate. Transfiera a un tazón pequeño y colóquelo en la nevera.", "Para hacer el relleno de naranja chocolate, caliente la crema en una cacerola pequeña hasta que hierva, luego quite la sartén del fuego y bata los trozos de chocolate, colorante y saborizantes de naranja. Transfiera a un tazón pequeño y colóquelo en la nevera.", "Para hacer el relleno de chocolate con menta, caliente la crema en una olla pequeña con la esencia de menta hasta que hierva. Retire la sartén del fuego y mezcle con chocolate blanco y colorante verde. Transfiera a un recipiente y colóquelo en el refrigerador", "Para hacer el caramelo, caliente la crema en una olla pequeña hasta que hierva, luego retire la sartén del fuego y déjela a un lado. Caliente el azúcar en una sartén limpia, revolviendo con una cuchara de madera, hasta que se vuelva marrón oscuro. Verter sobre la crema, teniendo cuidado, ya que estará muy caliente, y batir hasta que quede suave. Agregue la mantequilla, bata bien, luego transfiera a un recipiente y reserve.", "Para ensamblar los macarrones, empareja los caparazones de los macarrones con los lados planos hacia arriba y colócalos en bandejas para hornear forradas con papel resistente a la grasa. (Debe tener alrededor de 120 conchas de macarrón.)", "Con una cuchara, coloque el relleno de naranja chocolate en una manga pastelera con una boquilla plana de 5 mm / 1 ¼ pulgadas y trace un círculo alrededor del borde de 20 de las conchas de macarrón. Repita con los rellenos de chocolate con menta y caramelo.", "Con una cuchara, coloque la mezcla para los centros de chocolate con leche en una manga pastelera equipada con una boquilla simple de 5 mm / 1¼in y coloque pequeños puntos en el centro de los círculos de llenado, luego con cuidado con las otras cáscaras.", "Para cada una de las inmersiones, derrita el chocolate en un microondas, o en un recipiente suspendido sobre una fuente de agua a fuego lento, revolviendo el color si lo usa. Vierta en botellas apretadas o bolsas de tubería con boquillas muy pequeñas y remolinos de tubos en los macarrones apropiados.", "Transfiera los macarrones terminados a la nevera para dejarlos durante al menos 30 minutos, preferiblemente durante la noche, antes de servirlos."], "url": "www_bbc_co_uk_food_recipes_chocolate_orange_mint_26674", "title": "Chocolate anaranjado, menta chocolate y chocolate macarrones de caramelo", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Hace 60 macarrones", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["150g / 5½oz de mantequilla sin sal, cortada en cubos de 1-2cm / ½-,, más extra para engrasar", "Harina de crianza de 185g / 6oz", "15 g / ½ oz de cacao en polvo", "20 g / oz de azúcar en polvo", "125g / 4½ sebo", "1 naranja", "150-175 ml / 5-6 fl oz de leche entera, más extra para la amortiguación", "150g / 5½oz de azúcar morena oscura", "25 g / 1 oz de chocolate negro, picado en trozos pequeños", "crema, para servir"], "method": ["Engrase un recipiente de pudín de 1.2 litros / 2 litros con mantequilla.", "Mezcle la harina, el cacao, el azúcar y la grasa en un tazón grande. Rallar finamente la ralladura de la naranja y mezclar esto también. Poco a poco trabaje en suficiente leche para formar una masa suave y ligeramente pegajosa.", "Tome un tercio de la masa y extiéndala sobre una superficie ligeramente enharinada. Invierta la cubeta en la masa y córtela para formar una tapa. Agregue los recortes a la masa restante y extiéndalos en un círculo, de unos 30 cm de diámetro. Use esto para alinear el cuenco del pudín. Asegúrate de que no haya grietas en la masa.", "Coloque la mitad de la mantequilla, el azúcar morena y el chocolate en el recipiente revestido. Pierce la naranja zested por todas partes con un pincho y siéntalo encima. Agregue la mantequilla restante, azúcar y chocolate.", "Humedezca los bordes de la masa con leche o agua y coloque la tapa de la pastelería encima. Presione los bordes para sellar y recortar el exceso.", "Coloque un trozo de pergamino para hornear sobre una hoja de papel de aluminio y haga un pliegue grande en el medio, doblando ambas hojas juntas. Coloque el pergamino y el papel de aluminio sobre el budín, con el lado de la hoja hacia arriba, y asegúrelo con una cuerda, colocando el extremo de la cuerda sobre la punta del pastel y atándolo para formar un mango.", "Coloque el recipiente en una olla grande y vierta suficiente agua hirviendo para llegar hasta la mitad del costado del recipiente. Coloque una tapa en la sartén y cocine a fuego lento. Baje el fuego para mantener la cocción a fuego lento y deje que el pudín hierva durante 2¼ horas. Rellene el agua hirviendo durante este tiempo, si es necesario, para que la sartén no hierva en seco.", "Con cuidado, retire el recipiente de la sartén, retire el papel y el papel de aluminio y suelte los lados del budín del cuenco con un cuchillo pequeño, si es necesario. Coloque un plato grande o un plato hondo en la parte superior del recipiente e inviértalo para que salga el postre.", "Sirva de inmediato, cortando el pudín con cuidado a medida que los jugos se desbordan (la naranja no está destinada a ser consumida). Sirve con crema fría."], "url": "www_bbc_co_uk_food_recipes_chocolate_orange_pond_27717", "title": "Pudín de estanque de chocolate y naranja", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_orange_pond_27717_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["140g / 5oz de mantequilla, más extra para engrasar", "3 cucharaditas de cacao en polvo, más extra para recubrir las latas", "Harina de 340g / 12oz", "1 cucharadita de bicarbonato de soda", "2 cucharaditas de polvo de hornear", "200g / 7oz de azúcar morena suave", "285 ml / 9½ fl oz de leche", "1 cucharada de jarabe de oro", "4 huevos de gallinas camperas", "Harina de 250g / 9oz", "1½ cucharadita de polvo de hornear", "1½ cucharadita de bicarbonato de soda", "250g / 9oz de mantequilla", "250 g / 9 oz de azúcar en polvo", "4 huevos de gallinas camperas", "2 naranjas, cáscara y jugo", "Crema doble de 200 ml / 7 fl oz", "200g / 7oz% 20dark% 20chocolate% 20 (at% 20least% 2070 %% 20cocoa% 20solids),% 20chopped", "300 ml / 10 fl oz crema batida", "2 naranjas, solo cáscara", "400g / 1lb listo para rodar glaseado de fondant con sabor a chocolate", "brillo de oro comestible"], "method": ["Precalentar el horno a 160 ° C / 325 ° F / Gas 3.", "Para la esponja de chocolate, engrase dos moldes para pasteles de 23cm / 9 in con mantequilla y polvo con cacao en polvo.", "Tamiza la harina, el bicarbonato de sodio, el polvo de hornear y el cacao en un tazón para mezclar, y agrega el azúcar.", "Coloque la mantequilla y la leche en una cacerola pequeña a fuego muy suave hasta que la mantequilla se haya derretido. Deje que se enfríe un poco.", "Agregue el jarabe, los huevos y la mezcla de leche al tazón de ingredientes secos y bata la mezcla hasta formar una masa suave con una cuchara de madera.", "Divida la mezcla en las latas preparadas y hornee en el horno durante 40-50 minutos, hasta que una brocheta insertada en el centro del pastel salga limpia. Retire del horno y deje enfriar en la lata durante diez minutos, luego colóquelo en una rejilla para que se enfríe completamente.", "Aumente la temperatura del horno a 170C / 340F / Gas 3½. Engrase y forme una lata de pastel de 23 cm / 9 pulgadas.", "Para la esponja de color naranja, tamice la harina, el polvo de hornear y el bicarbonato de soda en un tazón y déjelos a un lado.", "En otro tazón, bata la mantequilla y el azúcar junto con un mezclador portátil de mano durante 4-5 minutos hasta que esté muy pálido.", "Batir los huevos, uno a la vez, batiendo muy bien entre cada uno. Si es necesario, agregue una cucharada de la harina medida con cada huevo para evitar que la mezcla se cuaje.", "Batir en la ralladura de naranja. Agregue la mezcla de harina a la vez y doble bien, luego doble lentamente el jugo de naranja.", "Coloque la mezcla en la lata preparada y hornee durante 45-50 minutos o hasta que un pincho insertado en el centro del pastel salga limpio. Si comienza a dorarse demasiado rápido, cúbralo con un trozo de papel de mantequilla.", "Retire del horno y deje que la torta se enfríe durante diez minutos en la lata, y luego enfríe completamente en una rejilla de alambre.", "Para la ganache de chocolate, caliente la crema en una sartén, revolviendo ocasionalmente, hasta que hierva.", "Coloque el chocolate picado en un recipiente y vierta la crema caliente. Revuelva hasta que el chocolate se haya derretido y la mezcla esté suave. Deje que se enfríe durante aproximadamente una hora o hasta que se espese lo suficiente como para extenderse.", "Para la crema de naranja, bata la crema hasta que se formen picos suaves cuando se quite la batidora. Doble la ralladura de naranja en la crema.", "Coloque una capa de chocolate en el plato de servir. Extienda la mitad del relleno de crema de naranja en la parte superior.", "Coloque la torta de naranja como la siguiente capa y cubra con la crema de naranja restante. Coloque la última capa de chocolate en la parte superior.", "Coloque la ganache sobre la torta, alisándola con una espátula hasta que la torta esté completamente cubierta.", "Estirar el glaseado de fondant de chocolate a un grosor de 2 mm. Usando la lata del pastel como guía, corte un círculo de 23cm / 9 pulgadas. Coloque cuidadosamente sobre la torta. Coloque la plantilla sobre la pasta de azúcar y espolvoree sobre el polvo de brillo dorado. Retire la plantilla para revelar su patrón."], "url": "www_bbc_co_uk_food_recipes_chocolate_orange_sponge_61345", "title": "Bizcocho de chocolate y naranja", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 10-12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["120 g / 4 oz de mantequilla sin sal, suavizada, más extra para engrasar", "150 g / 5½ oz de azúcar en polvo", "1½ naranjas, ralladura finamente rallada solamente", "4 vainas de cardamomo verde, solo semillas, molidas", "1½ cucharadita de escamas de sal, suelo", "330ml / 11fl oz de leche entera, a temperatura ambiente", "90g / 3% C2% BCoz% 200% -fatos% 20Griego% 20tratados% 20yoghurt", "700g / 1lb 9oz de harina blanca fuerte, más extra para espolvorear", "12g / ⅓oz de levadura de acción rápida", "115g / 4oz% 20dark% 20chocolate% 20 (80 %% 20cocoa% 20solids),% 20roughly% 20chopped", "75g / 2½ oz de almendras molidas", "75g / 2½oz de almendras en copos", "¾ cucharadita de cacao en polvo", "Ch chile de ojo de pájaro, finamente picado y sin semillas", "¾ cucharadita de jengibre molido", "¾ cucharadita de canela molida", "pizca de nuez moscada recién rallada", "1 huevo de gallinas camperas, ligeramente golpeado", "1 cucharada de semillas de cacao"], "method": ["Para la masa, en el cuenco de una batidora independiente, bata la mantequilla, el azúcar, la ralladura de naranja, el cardamomo y la sal hasta que estén pálidos y esponjosos.", "Mezcle la leche y el yogur juntos, luego caliente hasta que alcance la temperatura corporal o 37C si usa un termómetro para alimentos. En un recipiente aparte, mezcle la harina con la levadura. Mezcle lentamente la mezcla de leche en la mezcla de mantequilla. Si se cuaja, agregue un poco de la mezcla de harina, luego vuelva a agregar la leche.", "Cambie el accesorio en el mezclador por un gancho de masa, luego incline la harina sobre los ingredientes húmedos y amasar a baja velocidad hasta que se combinen. Aumente la velocidad a medio y amasar durante 10 minutos.", "Transfiera la masa a un tazón grande engrasado y cubra con una película adhesiva. Deje que pruebe en un lugar cálido durante 45 minutos.", "Para el relleno, en un procesador de alimentos combine el chocolate, ambos tipos de almendras, cacao en polvo, chile y especias. Pulsa hasta que forme la consistencia de las migas de pan.", "Engrase una bandeja para hornear de 30x20x6cm / 12x8x2½ pulgadas y forre con pergamino engrasado para hornear.", "Enharina la superficie de trabajo e incline la masa sobre ella. Corte un tercio de la masa y reserve. Estire la masa restante en un rectángulo de aproximadamente 40x20cm / 16x8 pulgadas.", "Cubra la masa con dos tercios de la mezcla de relleno, dejando un espacio de 1 cm / ½ pulgadas en el borde más largo más cercano a usted. Apriete bien la masa empezando por el borde largo que está más lejos de usted. Utilice la tira de 1 cm / ½ pulgada (que no está cubierta con relleno) para sellar la unión. Corte el rollo en doce rodajas de 3cm / 1¼ pulgadas de espesor y colóquelo en la bandeja preparada.", "Extiende la masa restante en un rectángulo de 10x30 cm / 4x12 in. Cubra con el relleno restante, dejando un espacio de 1 cm / ½ pulgadas en el borde más cercano a usted. Corta en seis rebanadas gruesas de 4cm / 1½ pulgadas y úsalas para llenar los huecos entre los rollos más grandes. Coloque en un lugar cálido para probar durante otros 20 minutos.", "Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Para terminar, cepille la parte superior de los panecillos con huevo batido y espolvoree con semillas de cacao. Hornee en el medio del horno durante 30-40 minutos.", "Retire de la bandeja de hornear y déjelo a un lado para que se enfríe en una rejilla de alambre."], "url": "www_bbc_co_uk_food_recipes_chocolate_orange_swirl_41752", "title": "Pan de remolino de naranja chocolate", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Hace 1 pan dulce", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_orange_swirl_41752_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500 g / 1 lb 2 oz cerezas oscuras, sin hueso, piedras reservadas", "2 limones, solo jugo", "500g / 1lb de azúcar de mermelada 2 oz", "75 g / 2½ oz de azúcar en polvo", "200 g / 7 oz de chocolate negro, picado", "3 claras de huevo de rango medio", "90g / 3¼ oz de azúcar en polvo", "90g / 3¼ oz de azúcar glas, más extra para servir", "1x 200g / 7oz de panettone de chocolate", "2 cucharadas de kirsch", "500ml / 18fl oz de helado de vainilla"], "method": ["Para la compota de cereza, coloque las piedras de cereza en un pequeño cuadrado de muselina, junte en una bolsa y ate con una cuerda. Ponga las cerezas en una sartén preservadora o una sartén grande y pesada con la bolsa de piedras de cereza y vierta en 300 ml / 10 fl oz de agua. Llevar a ebullición, luego reducir a fuego lento y cocinar durante 10-15 minutos, o hasta que las cerezas estén tiernas y estén comenzando a ablandarse. Descarta las piedras. Si prefiere que algunas cerezas permanezcan gruesas en la compota, no las cocine por mucho tiempo.", "Vierta el jugo de limón y agregue el azúcar mermelada. Calienta suavemente, revolviendo hasta que todo el azúcar se haya disuelto. Llevar a ebullición y mantener en ebullición constante, revolviendo ocasionalmente, durante aproximadamente 10 minutos, o hasta que el atasco llegue al punto de ajuste.", "Para probar si el atasco ha alcanzado el punto de ajuste, primero retire la sartén del fuego mientras prueba el atasco; esto es muy importante. Ponga un poco de mermelada en un platillo frío, déjelo enfriar durante unos minutos y luego introduzca el dedo en el atasco. Si se arruga, está listo. De lo contrario, devuelva la sartén al fuego y cocine el atasco durante uno o dos minutos más y vuelva a probar. Dejar enfriar.", "Precalentar el horno a 220C / 450F / Gas 7.", "Para la salsa de chocolate, coloque el azúcar y 75ml / 2½fl de agua en una olla y cocine hasta que el azúcar se derrita. Agregue el chocolate y continúe cocinando por un par de minutos, revolviendo bien hasta que tenga una salsa brillante.", "Para el pan dulce de chocolate horneado en Alaska, bata las claras de huevo con el azúcar impalpable en un tazón limpio hasta que la mezcla forme picos rígidos cuando se quite el batidor.", "Agregue el azúcar glas y mezcle hasta que la mezcla esté suave y brillante. Transfiera a una manga pastelera.", "Cortar el pan dulce y, usando un cortador de pasteles redondo de 8 cm / 3¼ pulgadas, cortar cuatro discos (cada Alaska al horno servirá a dos personas. Utilice un cortador más pequeño si desea porciones individuales). Coloca en platos para servir y rocía sobre el kirsch. Cubra con una gran bola de helado.", "Pase el merengue por el helado, asegurándose de que esté completamente cubierto de arriba a abajo.", "Esmalte el merengue brevemente en un horno caliente (alternativamente use un soplete de chef).", "Para servir, cuchara la salsa de chocolate alrededor del borde de cada Alaska horneada. Polvo con azúcar glas y servir junto con la compota de cereza."], "url": "www_bbc_co_uk_food_recipes_chocolate_panettone_34099", "title": "Pan dulce de chocolate al horno Alaska con compota de cereza y salsa de chocolate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de harina natural, más extra para espolvorear", "50g / 1¾oz de azúcar glas", "50g / 1¾oz de mantequilla, cortada en cubitos, más extra para engrasar", "1 yema de huevo grande de gallinas camperas", "75 g / 2½ oz de mantequilla", "115g / 4oz% 20dark% 20chocolate% 20 (no% 20more% 20than% 2060 %% 20cocoa% 20solids),% 20finely% 20chopped", "115 g / 4 oz de azúcar en polvo de oro", "Harina normal de 55g / 2oz", "4 huevos medianos de granja", "25g / 1oz de mantequilla", "50g / 1¾oz de chocolate blanco", "1 naranja, ralladura fina solamente", "35 g / 1 oz de azúcar en polvo de oro", "Harina normal de 25g / 1oz", "2 yemas de huevo de rango medio"], "method": ["Engrase una lata agria acanalada de 23cm / 9in con mantequilla.", "Para la masa, mida la harina, el azúcar glas y la mantequilla en el recipiente de un procesador de alimentos y pulse hasta que la mezcla se asemeje a migajas de pan finas. Agregue la yema de huevo y una cucharada de agua fría y mezcle hasta que se junte para formar una masa suave.", "Envuelva la masa en una película adhesiva y déjela reposar en la nevera durante aproximadamente 30 minutos.", "Precalentar el horno a 200C (180C fan) / 400F / Gas 6.", "Polvore la superficie de trabajo con harina y luego extienda la masa lo más finamente posible a un círculo de aproximadamente 5 cm / 2 pulgadas más grande que la lata de flan.", "Alinee la lata con la masa. No se preocupe si la pastelería se rompe un poco, es fácil arreglarla. Enfríe por 15 minutos.", "Pinche la base de la masa con un tenedor, forre la caja de pastelería con papel de hornear o papel de aluminio y llénela con alubias para hornear. Hornee la persiana de pastelería por 10 minutos, o hasta que esté ligeramente dorada. Retire el papel y los frijoles y coloque la tarta en el horno para que se cocine por otros 5-7 minutos, o hasta que esté pálida dorada y la base esté cocida.", "Para hacer el relleno de chocolate, derrita la mantequilla y el chocolate en un tazón resistente al calor colocado sobre una fuente de agua hirviendo a fuego lento hasta que se derrita y se suavice. Retire del fuego y agregue el azúcar y la harina. Batir los huevos, uno a la vez, y dejar reposar.", "Para hacer el relleno de naranja, derrita la mantequilla y el chocolate blanco en un tazón resistente al calor colocado sobre una fuente de agua hirviendo a fuego lento hasta que se derrita y suavice. Retirar del fuego e incorporar la ralladura de naranja, el azúcar y la harina. Agregue las yemas de huevo, una a la vez y vierta la mezcla en una jarra.", "Coloque la caja de repostería en una bandeja de horno. Vierta la mezcla de chocolate en la caja de pastelería. Rocíe o vierta el relleno de naranja sobre el relleno de chocolate para crear un efecto de remolino. Dibuje un palillo de cóctel a través del relleno para crear un efecto marmoleado.", "Hornee durante 10-12 minutos, o hasta que estén colocados alrededor de los bordes, pero todavía un poco tambaleantes en el centro.", "Retire del horno y deje enfriar un poco, hasta que esté caliente pero no caliente, luego sirva."], "url": "www_bbc_co_uk_food_recipes_chocolate_orange_tart_25486", "title": "Tarta de naranja y chocolate", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_orange_tart_25486_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de pasta de cacao o chocolate", "pizca de sal", "Pacanas de 50g / 1¾oz, aproximadamente rotas", "50 g / 1¾oz de mantequilla sin sal, ablandada", "50g / 1¾oz de azúcar moreno oscuro", "100 ml / 3½ fl oz crema doble, más extra para servir"], "method": ["Ponga agua a hervir para la pasta y, cuando esté hirviendo, agregue una pizca de sal y cocine la pasta, configurando un temporizador durante dos minutos antes de que las instrucciones del paquete indiquen que estará listo.", "Coloque una sartén antiadherente de tamaño mediano en la estufa y revuelva en las pacanas, luego tápelas a fuego medio. Una vez que puedas oler su aroma flotando desde la sartén, quítales a un plato frío.", "Ahora mezcle la mantequilla y el azúcar en la sartén hasta que tenga un jarabe caliente y untado. Vierta cuidadosamente la crema, revuelva y deje que la mezcla de caramelo burbujee, agregue las nueces tostadas y una pizca de sal, luego apague el fuego.", "Justo antes de vaciar la pasta, baje en una taza para quitar un poco de agua para cocinar pasta, luego mezcle la pasta drenada en la sartén con la salsa de caramelo oscura y nuez, agregue una cucharada o dos de agua de cocción si es necesario para ayudar cubra la pasta. Revuelva para combinar antes de dividir entre dos cuencos. Sirva con un poco de crema doble en una jarra pequeña para verter mientras come, si lo desea."], "url": "www_bbc_co_uk_food_recipes_chocolate_pasta_with_64143", "title": "Pasta de chocolate con caramelo y nueces", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_pasta_with_64143_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["150ml / 5fl oz de crema doble", "½ vaina de vainilla, dividida por la mitad a lo largo, semillas raspadas con un cuchillo afilado", "100ml / 3½ fl oz de leche", "125g / 4 oz de chocolate negro (70 por ciento de sólidos de cacao), rotos en pedazos", "2 yemas de huevo de gallinas camperas", "1 cucharada colmada de azúcar glasé", "1 cucharadita de jengibre molido redondo", "30 g / 1 oz de tallo de jengibre en conserva, picado en trozos pequeños"], "method": ["Precalentar el horno a 140C / 275F / Gas 1.", "Caliente la crema y la vaina de vainilla y las semillas en una olla. Batir ligeramente para dispersar las semillas de vainilla, apagar el fuego y cubrir con una tapa. Reserve para infundir durante 30 minutos.", "Mientras tanto, a fuego lento, derrita el chocolate en la leche en una olla pequeña.", "Batir las yemas de huevo, el azúcar glas y el jengibre molido juntos en un tazón grande hasta que estén suaves y esponjosos. Agregue la mezcla de chocolate y la crema con infusión de vainilla, retire la vaina de vainilla y mezcle hasta que estén bien combinados.", "Coloque el jengibre picado y un poco de jarabe de jengibre en la parte inferior de los moldes. Cubra con la mezcla de chocolate. Coloque los moldes en una lata honda para asar y vierta suficiente agua caliente para que alcancen por lo menos dos tercios del costado de las ollas. Hornee por 45-60 minutos, o hasta que esté un poco hinchado y esponjoso con el toque de un dedo. La superficie de la maceta debe formar una pequeña costra.", "Retire las ollas del horno, deje que se enfríen por unos momentos y levante las ollas del agua en una bandeja limpia. Enfriar en la nevera durante al menos seis horas antes de servir. Sirve directamente de la nevera."], "url": "www_bbc_co_uk_food_recipes_chocolate_pot_with_54547", "title": "Pote de chocolate con jengibre", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_pot_with_54547_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["125g / 4½oz de harina natural", "2 cucharadas de azúcar glas", "2 cucharadas de cacao en polvo", "1 huevo mediano de gallinas camperas", "1 cucharadita de jugo de limón", "135g / 4¾oz de mantequilla sin sal fría, cortada en cubos de aproximadamente 1cm / ½ en cubitos", "80g / 3oz de chocolate negro, roto en pedazos", "45 g / 1½ oz de mantequilla sin sal", "160g / 5¾oz de azúcar granulada", "235ml / 8¼fl oz de jarabe dorado", "3 huevos de gallinas camperas", "1 cucharadita de extracto de vainilla", "235 g / 8¼ oz de nueces picadas", "helado de vainilla o crema doble, para servir"], "method": ["Para la masa, coloque la harina, el azúcar glas y el polvo de cacao en un tazón grande y mézclelos. Batir ligeramente el huevo con el jugo de limón y 2 cucharadas de agua muy fría en una jarra de medir con un tenedor. Dejar de lado.", "Agregue la mantequilla a la harina y mezcle los cubos para cubrirlos con la harina. Frote la mantequilla en la harina, usando las puntas de los dedos. (Levante las manos por encima del tazón, frote la grasa y la harina y luego deje que las migajas vuelvan a caer en el tazón. Continúe hasta que la mezcla se vea como pan rallado fino). Haga un pozo en el centro de la mezcla y vierta la mezcla de huevo . Incorpore el líquido en la mezcla de harina y mantequilla, usando una mano. Evite trabajar demasiado con la masa ya que esto hará que su repostería sea más dura. Si está demasiado seco, agregue un chorro de agua más fría.", "Cuando la masa simplemente se pega en grupos, forma una bola. Amasarlo muy ligeramente sobre una superficie ligeramente enharinada para unirlo en una masa suave. Nuevamente, no trabajes demasiado. Puede probarlo tomando un poco de masa y extendiéndola. Si comienza a agrietarse fácilmente, necesita un poco más de amasado para desarrollar el gluten un poco más. Envuelva la masa en una película adhesiva y déjela en la nevera para que se enfríe durante aproximadamente 30 minutos.", "Precaliente el horno a 190 ° C / 170 ° Ventilador / Gas 5. Caliente una bandeja para horno plana y gruesa.", "Extienda la masa en una superficie enharinada y úsela para revestir una lata de flauta acanalada de 25 cm / 10 pulg. Deje cualquier exceso de saliente y pinche la base de la masa con un tenedor. Enfríe la masa por 10 minutos.", "Alinee la caja de pastelería con papel pergamino y llénela con alubias de cerámica para hornear o arroz sin cocer. Coloque la lata en la bandeja para hornear caliente y hornee a ciegas por unos 15 minutos hasta que se ponga dorado pálido. Retire los frijoles y el papel y vuelva al horno durante aproximadamente 10-12 minutos hasta que la base esté cocida. Reduzca la temperatura del horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Para el relleno, derrita el chocolate y la mantequilla juntos en un recipiente resistente al calor sobre una fuente de agua hirviendo. Cuando se derrita, déjelo enfriar un poco.", "En una cacerola mediana, combine el azúcar y el jarabe dorado y deje que hierva, revolviendo constantemente. Dejar de lado para enfriar.", "Batir los huevos en un tazón grande, luego agregue la mezcla de chocolate. Agregue la mezcla de jarabe de azúcar y combine a fondo. (Es importante enfriar el chocolate derretido y el jarabe de azúcar o revolverán los huevos.) Agregue el extracto de vainilla y agregue las pacanas.", "Vierta el relleno de nuez en la masa horneada y hornee en el horno durante 30-40 minutos hasta que fragüe. Enfriar y servir con helado de vainilla o crema doble."], "url": "www_bbc_co_uk_food_recipes_chocolate_pecan_tart_86249", "title": "Tarta de nueces de chocolate", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Sirve 10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_pecan_tart_86249_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Galletas digestivas 200 g / 7 oz", "50g / 2oz de cacahuetes salados", "100 g / 3½ oz de chips de chocolate negro", "50g / 2oz de mantequilla sin sal ablandada", "500g / 1lb 1oz de queso crema", "3 huevos de gallinas camperas", "3 yemas de huevo de gallinas camperas", "200 g / 7 oz de azúcar en polvo", "125ml / 4¼fl oz de crema agria", "250 g / 9 oz de mantequilla de maní suave", "250ml / 9fl oz de crema agria", "100 g / 3½oz de chips de chocolate con leche", "30g / 1¼oz de azúcar morena suave"], "method": ["Precalentar el horno a 170 C / 325 F / Gas 3.", "Para la base, procese las galletas, los cacahuetes, las virutas de chocolate negro y la mantequilla en un procesador de alimentos. Una vez que la mezcla se una en una mata, colócala en una lata con forma de resorte de 23cm / 9 pulgadas y presiónala en el fondo de la lata y por los lados, con los dedos, para hacer una costra crujiente. Enfríe en la nevera mientras realiza el llenado.", "Para el relleno, procese el queso crema, los huevos y las yemas de huevo, el azúcar, la crema agria y la mantequilla de maní en un procesador de alimentos, batiendo hasta conseguir una mezcla homogénea.", "Verter y raspar la mezcla de relleno en la base de la tarta de queso en la lata de springform enfriada y cocinar durante 1 hora, comprobando después de 50 minutos. La parte superior, solo, debe sentirse fija y seca. Cuando estén cocidos, saca la tarta de queso del horno mientras preparas el relleno.", "Para el relleno, caliente la crema agria y las chispas de chocolate con el azúcar morena suavemente en una cacerola pequeña a fuego lento, batiendo para mezclar el chocolate a medida que se derrita. Una vez que la mezcla esté derretida y bien combinada, quite el fuego.", "Cuchara y extender el topping muy suavemente sobre la tarta de queso, siendo tan cuidadoso como puedas en caso de que rompas la superficie de la tarta de queso. (No es que vaya a pasar nada malo, solo tendrás que echarle un poco de chocolate al pastel). Vuelve a colocarlo en el horno durante los últimos 10 minutos.", "Una vez que salga del horno, deje que la tarta de queso se enfríe completamente en la lata, cubra y ponga en la nevera durante la noche. Cuando esté listo para comer la tarta de queso, sáquela de la nevera con un poco de antelación, solo para descongelarla: esto facilitará que salte la lata. Sin embargo, no permita que se caliente demasiado, ya que se pondrá pegajoso y será difícil de cortar."], "url": "www_bbc_co_uk_food_recipes_chocolate_peanut_butter_74370", "title": "Tarta de chocolate con mantequilla de maní", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 10-12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_peanut_butter_74370_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50 g / 1¾oz de mantequilla sin sal", "Harina normal de 60g / 2oz, tamizada", "2 huevos grandes de gallinas camperas, a temperatura ambiente, golpeados", "2 cucharaditas de azúcar en polvo", "Crema doble 350ml / 12fl oz", "1 cucharada de azúcar glas", "1 cucharadita de extracto de vainilla", "200 g / 7 oz de chocolate negro, roto en pedazos", "botón de mantequilla", "100 g / 3½ oz de almendras tostadas finamente picadas"], "method": ["Precalentar el horno a 210C / 190C Fan / Gas 7.", "Para hacer la masa de choux, ponga 110ml / 4fl de agua en una olla con la mantequilla y deje que hierva. Retire del fuego e incline la harina. Revuelva vigorosamente con una cuchara de madera hasta que la mezcla se separe de los lados de la sartén y se convierta en una bola. Regrese a fuego lento y cocine la masa por unos minutos, batiéndola constantemente. Incline en un tazón grande para enfriar.", "Batir los huevos en la masa en etapas, batiendo hasta que el huevo se incorpora antes de agregar más. Es posible que no necesite todo el huevo, está buscando que la mezcla se caiga de la cuchara de madera en una gota reacia (alrededor de 5-7 segundos). Su mezcla no debe estar demasiado suelta o se extenderá y no se levantará.", "Coloque la mezcla en una manga pastelera con una boquilla simple de 1 cm / ½ pulgadas.", "Alinee una bandeja para hornear grande (o dos) con papel de hornear y pise 25 bolitas, permitiendo que cada habitación se eleve. Suavemente alise la parte superior de cada bola con un dedo mojado, ya que esto lo hará más fresco.", "Hornee durante 20-30 minutos o hasta que estén dorados y crujientes.", "Baje el horno a 180C / 160C Fan / Gas 4. Haga un pequeño orificio en la parte inferior de cada bollo choux con un pincho - muévalo en el centro, pero no atraviese el otro lado. Coloque los bollos de nuevo en la bandeja para hornear y vuelva a colocarlos en el horno durante 5 minutos. Dejar enfriar sobre una rejilla.", "Para hacer el relleno, bata ligeramente la crema, el azúcar glas y la vainilla hasta que conserve su forma. Colóquelo en una manga pastelera con una boquilla simple. Coloque la boquilla en el orificio y pise hasta que la cavidad se llene de crema. El pan debe sentirse pesado.", "Para hacer el relleno, derrita el chocolate y la mantequilla en un tazón resistente al calor sobre una fuente de agua apenas hervida, asegurándose de que el fondo del recipiente no toque el agua o en el microondas. Deje que se enfríe un poco, luego sumerja la parte superior de cada bollo de choux hasta la mitad en el chocolate y deje que el exceso gotee.", "Espolvorea las almendras picadas sobre el chocolate antes de que se solidifique. Una vez que el chocolate se haya solidificado, ensamble los profiteroles en una pila para servir."], "url": "www_bbc_co_uk_food_recipes_chocolate_profiteroles_33570", "title": "Profiteroles de chocolate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 25 profiteroles", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_profiteroles_33570_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina simple de 450 g / 1 lb, más extra para quitar el polvo", "Cacao en polvo de buena calidad de 80 g / 3 oz", "½ cucharadita de sal marina", "1 cucharadita de polvo de hornear", "1 cucharadita de bicarbonato de sodio", "50g / 1¾oz nueces de pacana, picadas", "115g / 4oz de mantequilla sin sal ablandada", "200 g / 7 oz de azúcar en polvo", "200ml / 7fl oz de suero de leche", "2 huevos grandes de gallinas camperas", "50g / 1¾oz de azúcar", "10g / ¼ oz de mantequilla sin sal", "120ml / 4fl oz crema batida", "½ cucharadita de sal marina en copos", "200g / 7fl oz de azúcar en polvo", "20 nueces de pacana, sin cáscara"], "method": ["Precaliente el horno a 200 ° C / 180 ° Ventilador / Gas 6. Cubra una bandeja para hornear con papel para hornear antiadherente.", "Para el pan rápido, tamice la harina, el cacao, la sal, el polvo de hornear y el bicarbonato de sodio en un tazón mediano. Mezcle las nueces de pacana picadas.", "Derrita la mantequilla con el azúcar en una sartén, luego vierta en un tazón limpio. Agregue el suero de leche. Mezcle los huevos, uno a la vez, batiendo bien después de cada adición.", "Poco a poco mezcle los ingredientes húmedos en seco con las manos o una batidora independiente. Convierta la masa en una superficie ligeramente enharinada y déle forma de hogaza. Marca la parte superior en porciones con un cuchillo. Coloque en la bandeja preparada y hornee durante 30-40 minutos, o hasta que la base suene hueca cuando se golpea. Dejar enfriar sobre una rejilla.", "Para la salsa de caramelo salado, en una olla mediana, caliente el azúcar a fuego medio. No lo agite y deje que se caramelice lentamente, tenga cuidado ya que el azúcar estará extremadamente caliente. Comenzará a oscurecerse alrededor de los bordes de la bandeja primero.", "Mientras tanto, en otro plan, caliente lentamente la mantequilla y la crema.", "Con la bandeja de azúcar, agite suavemente el azúcar alrededor de la sartén para asegurarse de que el caramelo se cocine de manera uniforme. Una vez que el azúcar se haya caramelizado hasta obtener un color dorado, agregue cuidadosamente una pequeña cantidad de la crema. Tenga cuidado ya que burbujeará vigorosamente. Revuelva constantemente. Agregue la crema restante, poco a poco. Llevar a ebullición a fuego lento y cocine a fuego lento durante 5 minutos hasta que la salsa se vuelva suave y espesa. Espolvorea la sal y vierte la salsa en una jarra para servir.", "Para las pacanas caramelizadas, forre una bandeja para hornear con papel de hornear antiadherente. Disuelva el azúcar en una sartén para hacer un caramelo oscuro. Tenga cuidado ya que la mezcla estará extremadamente caliente. Coloque las pacanas en la bandeja preparada y vierta cuidadosamente el caramelo sobre las nueces. Deja para establecer.", "Cubra el pan con las pacanas caramelizadas y sirva con la salsa de caramelo salado"], "url": "www_bbc_co_uk_food_recipes_chocolate_quick_breads_07222", "title": "Pan rápido de chocolate con salsa de caramelo salado", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Hace 1 pan dulce", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50 g / 1¾oz de cacao en polvo", "6 cucharadas de agua hirviendo", "3 huevos grandes de gallinas camperas", "50ml / 2fl oz de leche entera", "Harina de 175g / 6oz de auto crianza", "1 cucharadita de polvo de hornear", "Extensión para hornear de 100 g / 3½ oz, más extra para engrasar", "275g / 9¾oz de azúcar en polvo", "7 hojas (11g) de gelatina de hojas", "225 g / 8 oz de azúcar en polvo", "75g / 2¾oz de cacao en polvo", "5 cucharadas de crema doble", "50g / 1¾oz de chocolate negro, picado en trozos", "2 cucharadas de mermelada de albaricoque, tamizada", "Crema doble de 300 ml / 10 fl oz, batida hasta formar picos duros", "10 fresas"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4. Alinee la base de dos moldes para pastel con fondo suelto de 20 cm / 8 pulgadas con papel de hornear y engrase los lados con la extensión para hornear.", "Tamizar el polvo de cacao en un tazón grande. Agregue el agua y revuelva hasta que tenga una pasta suave. Agregue los ingredientes restantes. Batir con un batidor de mano eléctrico hasta que esté suave y esponjoso. Vierta una cuchara en las dos latas y nivele las partes superiores.", "Hornee durante 20-25 minutos, hasta que estén bien levantados y saliendo de los lados de las latas. Transfiera a una rejilla para enfriar.", "Para hacer la guinda, ponga las hojas de gelatina en un recipiente poco profundo de agua fría durante 5 minutos hasta que estén suaves.", "Ponga el azúcar, el cacao en polvo, la crema y 125ml / 4 fl oz en una cacerola a fuego medio. Revuelva hasta que se derrita, luego ponga a hervir y revuelva hasta que quede suave. Retirar del fuego y agregar el chocolate. Deja enfriar por 5 minutos.", "Exprima cualquier líquido de las hojas de gelatina y revuelva en la mezcla de chocolate hasta que se disuelva. Vierta a través de un colador en un recipiente y deje enfriar y espesar en la nevera durante aproximadamente una hora, hasta que alcance la consistencia de la mayonesa espesa.", "Rebana cada pastel por la mitad horizonatalmente. Coloque una mitad de pastel sobre una rejilla de alambre y alise una capa de crema batida encima. Continúe este proceso para que tenga cuatro capas de pastel y tres capas de crema. Presione los pasteles hacia abajo entre cada capa para que la crema llegue a los bordes y los pasteles estén nivelados a los lados. Suave alrededor de los bordes con una espátula para que el exceso de crema cubra ligeramente los lados y brinde un borde liso.", "Suavemente caliente la mermelada de albaricoque y cepille ligeramente sobre la torta, cubriendo los lados y la parte superior. Enfriar en la nevera durante 15 minutos.", "Ponga aproximadamente 100 ml / 3½ fl oz de la formación de hielo en un recipiente a prueba de calor y derretir suavemente sobre una olla de agua hirviendo a fuego lento. Sumerja la mitad de cada fresa en el glaseado derretido. Ponte papel de cocina para preparar.", "Una vez que la torta ha terminado de enfriarse en la nevera, transfiérala a un estante de enfriamiento de alambre colocado en una bandeja grande para hornear para recoger el exceso de glaseado mientras lo vierte sobre la torta. Vierta el glaseado restante sobre la torta y alise la parte superior y los lados. Ten mucho cuidado al hacer esto, quieres un glaseado suave y brillante. Deje por una hora más o menos para establecer. Coloque las fresas glaseadas alrededor del borde inferior del pastel."], "url": "www_bbc_co_uk_food_recipes_chocolate_reflection_23487", "title": "Pastel de chocolate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_reflection_23487_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Chocolate negro de buena calidad 175g / 6oz, finamente picado", "6 huevos de gallinas camperas, separados", "175g / 6oz de azúcar en polvo", "2 cucharadas de cacao en polvo", "300 ml / 10 fl oz doble crema", "azúcar glas, al polvo"], "method": ["Precaliente el horno a 180 ° C / 160 Ventilador / Gas 4. Engrase ligeramente una lata de rollo suizo de 33 cm x 23 cm / 13 in x 9 in, luego forre la base y los lados de la lata con una hoja grande de papel antigrasa, empujándola hacia las esquinas. Haga un pequeño corte diagonal en cada esquina del papel; esto ayuda a ajustar el papel cómodamente en las esquinas de la lata.", "Derrita el chocolate en un recipiente colocado sobre una sartén con agua apenas hirviendo. (No permita que la base del recipiente toque el agua).", "Coloque las claras de huevo en un tazón grande y bata hasta que estén firmes, pero no secos. Si pone el tazón boca abajo, los blancos deben ser lo suficientemente rígidos como para no caerse.", "Coloque las yemas de huevo en un recipiente aparte con el azúcar y bate con la misma batidora (sin necesidad de lavarlo) a alta velocidad durante 2-3 minutos o hasta que estén espesos y cremosos y la mezcla deja un rastro grueso como cinta cuando los batidores son levantados Vierta el chocolate enfriado y dóblelo suavemente hasta que esté bien combinado.", "Agite suavemente dos cucharadas grandes de claras de huevo en la mezcla de chocolate para aflojar la mezcla, luego doble las claras de huevo restantes con una cuchara de metal grande (no desea aplastar el aire que acaba de golpear). Tamice el cacao por la parte superior y dóblelo ligeramente. Vierta la mezcla en la lata preparada y mueva suavemente la lata hasta que la mezcla esté nivelada.", "Hornee en el horno precalentado durante unos 20-25 minutos hasta que se levante y la parte superior se sienta firme y ligeramente crujiente. Retire del horno, deje en la lata (espere que el enredo se caiga y se agriete un poco) y déjelo a un lado hasta que esté frío.", "Batir la crema hasta que solo conserve su forma. Coloque una gran pieza de papel resistente a la grasa en la superficie de trabajo y espolvoree ligeramente con azúcar glasé. Coloque el rollo sobre el papel para que el papel forro quede arriba y luego retire con cuidado el papel. Extienda el rollo con la crema batida, dejando un borde de aproximadamente 2 cm en todos los bordes. Con uno de los bordes más cortos hacia usted, haga un corte a lo largo con un cuchillo afilado, aproximadamente a la mitad de la esponja. Esto ayudará a comenzar a enrollar. Ahora, enrolle este borde de corte con fuerza para comenzar y use el papel para ayudar a continuar el rodado apretado, retirándolo de usted mientras rueda. No se preocupe si el enredo se quiebra, eso es bastante normal y es parte de su encanto.", "Termine con la unión debajo y luego levante el trino en un plato o tablero con una espátula ancha grande o dos rebanadas de pescado. Polvo con azúcar glas."], "url": "www_bbc_co_uk_food_recipes_chocolate_roulade_79152", "title": "Rollo de chocolate", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_roulade_79152_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["250 g / 9 oz% 20dark% 20chocolate% 20 (% mínimo 2070%% 20cocoa% 20solids)", "250g / 9oz de amaretti (crujientes) o ricos bizcochos de té", "100g / 3½oz de mantequilla sin sal, ablandada", "150 g / 5½ oz de azúcar en polvo", "3 huevos de gallinas camperas", "2 cucharadas de licor de amaretto", "2 cucharadas de cacao en polvo", "75g / 2½ oz de almendras, picadas", "Avellanas de 75g / 2½oz, más o menos picadas", "50 g / 2 oz de pistachos, aproximadamente picados", "1 cucharada de azúcar glas, para decorar"], "method": ["En el microondas (siguiendo las instrucciones del fabricante) o en un recipiente resistente al calor suspendido sobre una olla de agua hirviendo (pero sin tocar el agua), derrita el chocolate hasta que quede suave. Mientras se derrite el chocolate, coloque los bizcochos en una bolsa grande para congelar, selle y golpee con un rodillo hasta que tenga una bolsa de escombros, no polvo. Cuando el chocolate se derrita, quítelo en un lugar frío (no en el refrigerador) y déjelo enfriar.", "Bata la mantequilla y el azúcar juntos: hago esto en una batidora independiente, pero no es necesario. Solo necesita usar un tazón grande y asegúrese de que la mezcla sea suave y superligera.", "Poco a poco, y uno por uno, golpee los huevos. No se preocupe si la mezcla parece cuajada en esta etapa: todo tipo de males se corregirán una vez que el chocolate se agregue más tarde. Luego bate en el licor de amaretto.", "Empuja el cacao en polvo a través de un pequeño tamiz o colador de té en el chocolate enfriado y, con una pequeña espátula de goma, revuelve hasta que se combinen, luego mezcla esto en la mezcla de huevo también.", "Cuando tengas una mezcla de chocolate suave delante de ti, coloca las nueces picadas y los bizcochos triturados. Dóblalos firmemente pero con paciencia para asegurarte de que todo esté cubierto de chocolate. Transfiera esta mezcla, aún en su tazón, a la nevera para que se solidifique un poco durante 20-30 minutos. No lo deje durante mucho más tiempo o será difícil salir del recipiente para darle forma.", "Desenrolle y corte dos piezas grandes de película adhesiva, superponiéndolas, de modo que tenga una gran superficie cubierta de pegamento para enrollar el salame de chocolate. Incline la mezcla de chocolate en el medio de este y, usando las manos, por desordenado que sea, moldee la mezcla en un tronco con aspecto de salame graso, de aproximadamente 30 cm de largo.", "Cubra completamente el tronco de chocolate con la película adhesiva, y luego gírelo firmemente, como si fuera un rodillo, para crear un cilindro liso y redondeado del tronco tosco con el que comenzó. Gire los extremos sujetando ambos extremos de la película adhesiva y haciendo rodar el registro de salchichas hacia usted varias veces. Luego, colóquelo en la nevera durante al menos seis horas, aunque preferiblemente de la noche a la mañana, para prepararlo.", "Ahora - uno está listo - para la parte interesante: arranca una gran pieza de papel resistente a la grasa y colócala sobre una superficie clara de la cocina. Saca el salame de la nevera y siéntalo en el papel. Mida un trozo de cuerda al menos seis veces más largo que la longitud del salame, y ate un extremo de la cuerda firmemente alrededor del nudo retorcido de la película adherida en un extremo del salame. Luego recorte la mayor cantidad de película adhesiva que pueda, pero sin cortar ninguno de los extremos afilados, de modo que pueda sujetar la cuerda a estos.", "Espolvorea tus manos con un poco de azúcar glas y luego frota dos cucharadas de azúcar glasé (más si es necesario) sobre el salame sin envolver para evitar que se ponga pegajoso a medida que lo encinas. Además, hace que se vea más como un salame.", "Haz un lazo con la cuerda, un poco más ancho que el salame, y aliméntalo sobre el final del salame, cerca de donde está atado. Tire del extremo posterior para apretarlo (pero no demasiado) y forme otro lazo de cuerda como antes. Trabaje este segundo bucle alrededor de la salchicha, a 4 cm más o menos de la primera, vuelva a apretar y repita hasta llegar al otro extremo del salame, luego ate la cuerda firmemente alrededor de la otra nariz retorcida de la película adhesiva.", "Con la longitud restante de la cuerda, comience a alimentarlo a lo largo del salame, girándolo alrededor de la cuerda que lo rodea cada vez que cruce un bucle, luego átelo de nuevo cuando llegue al final. Repita estas longitudes tantas veces como desee, para crear un diseño de aspecto auténtico, pero dos o tres veces sería suficiente para obtener el efecto.", "Transfiérelo a una tabla de madera, y corte algunas rebanadas, abrácelas como si fueran rebanadas de salame, dejando un cuchillo en la tabla, también, para que la gente corte rebanadas adicionales, como lo deseen. Obviamente, cuando corte el salame, necesitará cortar el hilo, pero los muchos nudos y giros lo mantienen bien atado. Sirva la nevera fría, o muy cerca de ella."], "url": "www_bbc_co_uk_food_recipes_chocolate_salame_17894", "title": "Chocolate salame", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Hace alrededor de 20 rebanadas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_salame_17894_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100g / 3½ oz de jarabe dorado", "350g / 12oz de mantequilla, ablandada, más extra para engrasar", "125 g / 4½ oz de azúcar en polvo", "100 g / 3½ oz de cacao en polvo", "6 huevos de gallinas camperas, ligeramente golpeados", "Harina de auto aumento 350g / 12oz"], "method": ["Mantega generosamente el interior de dos cuencos de pudín de 1,2 litros / 2 pinta.", "Vierta la mitad del almíbar dorado en la base de cada cuenco de budín y déjelo a un lado.", "Batir la mantequilla, el azúcar y el cacao en polvo juntos en una batidora hasta que estén esponjosos.", "Batir en la mitad de los huevos seguido de la mitad de la harina y cuando esté bien combinado, agregue los huevos y la harina restantes. La mezcla debería estar a punto de perder consistencia. Agregue un chorrito de leche si la mezcla es demasiado espesa.", "Con una cuchara, vierta la mezcla en los cuencos de budín, llenándolos solo tres cuartos, luego alise la parte superior con el dorso de una cuchara.", "Cubra sin apretar con película adhesiva, dejando espacio para que la película se hinche a medida que la mezcla se eleva, y cocine en el microondas a alta potencia durante cinco minutos. El pudin se hace cuando un pincho insertado en el centro del pudin sale limpio.", "Deje reposar durante cinco minutos y luego pase un cuchillo sin filo alrededor del borde del pudin para aflojar los lados, invierta cuidadosamente en un plato hondo y retire el lavabo.", "Cortar los budines en 8 cuñas generosas y servir con flan."], "url": "www_bbc_co_uk_food_recipes_chocolate_sponge_pudding_16237", "title": "Pudín de esponja de chocolate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 16", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50 g / 1¾oz de cacao en polvo", "6 cucharadas de agua hirviendo", "100 g / 3½ oz de crema para untar o mantequilla blanda", "275g / 9¾oz de azúcar en polvo", "3 huevos grandes de gallinas camperas", "125ml / 4fl de leche en oz", "Harina de 175g / 6oz de auto crianza", "1 cucharadita de polvo de hornear", "3-4 cucharadas de mermelada de albaricoque calentada y tamizada", "100ml / 3½ fl oz crema doble", "200g / 7oz de chocolate con leche, finamente picado o rallado", "100g / 3½ oz de chocolate blanco"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4 (ventilador de 160 ° C).", "Coloque el cacao en un tazón grande, agregue el agua hirviendo y mezcle hasta que quede suave. Agregue la pasta para hornear o la mantequilla y bata en el cacao hasta que quede suave, luego agregue los ingredientes restantes de la torta y mezcle hasta que se combinen, esto se puede hacer en una batidora o a mano.", "Vierta en la lata, distribuya uniformemente y hornee en el horno precalentado durante aproximadamente 30-35 minutos, o hasta que esté bien levantado, solo firme al tacto y encogiéndose lejos de los lados de la lata. Deje que se enfríe en la lata durante 10 minutos, luego sáquelo y despegue el pergamino para hornear. Cepille la parte superior de la tarta con mermelada de albaricoque y deje que se enfríe por completo", "Para la formación de hielo, caliente la crema en una sartén pequeña hasta que esté caliente, luego agregue el chocolate con leche y revuelva hasta que esté completamente derretido y suave. Deje que se enfríe un poco para que tenga una consistencia espesa (esto no tomará mucho tiempo dependiendo de la temperatura ambiente). Vierta el glaseado sobre el pastel y extiéndalo con una espátula para cubrir el pastel por completo.", "Para decorar, derrita el chocolate blanco en un tazón pequeño sobre una cacerola de agua hirviendo a fuego lento. Coloque en una bolsa pequeña, corte el extremo y pinte en líneas por la torta, a aproximadamente 1 cm / ½ pulgada. Usando un palillo de cóctel, arrastre el chocolate blanco en direcciones opuestas a través del pastel para dar un efecto de pluma."], "url": "www_bbc_co_uk_food_recipes_chocolate_tray_bake_with_69567", "title": "Bandeja de chocolate con glaseado de plumas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 21 rebanadas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_tray_bake_with_69567_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["300g / 10½oz barras de chocolate surtidas, incluyendo chocolate negro, chocolate con leche y chocolate con pasas y nueces, roto en pedazos", "30g / 1oz de mantequilla sin sal", "250ml / 8¾ fl oz crema doble", "pizca de sal", "100 g / 4oz de nueces picadas mezcladas, como pistachos, avellanas tostadas y almendras"], "method": ["Traiga un poco de agua a fuego lento en una sartén. Coloque el chocolate y la mantequilla en un tazón grande, luego coloque el recipiente sobre el agua hirviendo. (No permita que la base del recipiente toque el agua.) Revuelva hasta que se derrita y quede brillante.", "Caliente la crema en una cacerola aparte hasta que esté casi hirviendo (pero no permita que la crema alcance el punto de ebullición). Retirar del fuego y dejar enfriar durante 5 minutos.", "Vierta la crema caliente sobre el chocolate derretido y mezcle hasta que esté suave y bien combinado. Agregue una pizca de sal.", "Cubra una bandeja de asar con papel resistente a la grasa y vierta el chocolate derretido. Dejar reposar para enfriar, luego enfriar en la nevera hasta que cuaje.", "Una vez que la mezcla de chocolate se haya enfriado y fraguado, mezcle las nueces picadas y espolvoree sobre una bandeja para hornear.", "Saque porciones pequeñas de la mezcla de chocolate frío con una cucharilla, luego arrolle en bolas con sus manos. Ruede cada bola en las nueces picadas hasta que estén completamente cubiertas. Coloque las trufas en una bandeja o bandeja para hornear y deje enfriar hasta que estén listas para servir. Las trufas se mantendrán durante 1-2 semanas."], "url": "www_bbc_co_uk_food_recipes_chocolate_truffles_00494", "title": "Trufas de chocolate", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Hace 30", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_truffles_00494_16x9.jpg", "isVegetarian": true, "recommendations": 0}]