[{"ingredients": ["Carne picada 225 g / 8 oz", "2 cucharadas de aceite de oliva", "1 cebolla, pelada y finamente picada", "1 zanahoria, pelada y finamente picada", "1 pimiento verde, sin semillas y finamente picado", "1 diente de ajo, pelado y aplastado", "125g / 4 oz de tocino ahumado lardons", "1 cucharada de hierbas secas mezcladas", "400g / 14oz de tomates enlatados", "150ml / 5fl oz de vino tinto", "sal y pimienta"], "method": ["Caliente una sartén antiadherente y agregue la mitad de la carne picada. Cocine a fuego alto para colorear la carne, rompiendo los grumos con la parte posterior de un tenedor. Repita con el resto de la carne picada y drene cualquier grasa.", "Caliente el aceite en otra sartén grande y cocine la cebolla, la zanahoria y el pimiento verde hasta que empiecen a ablandarse.", "Agregue el ajo, los lardons de tocino y las hierbas y cocine durante 2 minutos.", "Agregue los tomates y el vino y sazone bien.", "Agregue la carne picada y cocine a fuego lento durante 40-50 minutos hasta que espese. Úselo para hacer lasaña o servir con pasta."], "url": "www_bbc_co_uk_food_recipes_bolognesesauce_1306", "title": "Salsa boloñesa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "4", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bolognesesauce_1306_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Paleta de cordero de 450 g / 1 lb, hueso extraído, cortado en cubos", "2 cucharadas de aceite vegetal", "1 cebolla, finamente picada", "1 pimiento rojo, finamente picado", "1 pimiento verde, finamente picado", "2 dientes de ajo, finamente picados", "1 cucharadita de hojas frescas de tomillo", "1 cucharadita de hojas de perejil fresco picado", "1 cucharadita de orégano seco", "150g / 5 oz champiñones, en rodajas", "200g / 7oz de puré de tomate", "2 hojas de laurel", "100ml / 3½fl oz de vino tinto rico", "400 g / 14 oz pueden cortar tomates", "sal y pimienta negra recién molida", "250 g / 9 oz de hojaldre laminado", "1 huevo de gallinas camperas, golpeado", "225 g / 8 oz de queso parmesano, finamente rallado"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Calentar el aceite en una sartén a fuego medio, luego agregar el cordero y freír, revolviendo ocasionalmente, hasta que se dore por todas partes. Retire de la sartén y reserve.", "Agregue la cebolla, los pimientos rojos y verdes, el ajo, las hierbas y los champiñones en la misma sartén y fría hasta que las verduras se suavicen y comiencen a colorear.", "Agregue el puré de tomate y las hojas de laurel y cocine durante 7-8 minutos.", "Agregue el vino y los tomates enlatados y deje que hierva.", "Regrese el cordero a la sartén, luego reduzca el fuego y cocine a fuego lento durante 40 minutos a una hora, hasta que el cordero esté tierno.", "Sazonar, al gusto, con sal y pimienta negra recién molida.", "Divida la mezcla boloñesa entre seis platos de tarta individuales o moldes.", "Cortar seis círculos de masa para cubrir la parte superior de cada pastel, luego coloque en la parte superior de cada pastel."], "url": "www_bbc_co_uk_food_recipes_bolognesewithparmesa_89968", "title": "Boloñesa con patatas fritas parmesano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 cucharadas de aceite de girasol", "1 cucharadita de semillas de mostaza", "½ cucharadita de comino molido", "1 cucharadita de cúrcuma", "1 cucharadita de cilantro molido", "1 cucharadita de sal masala", "1 cucharadita de chile en polvo", "Jengibre fresco de 5 cm / 2 pulgadas, rallado", "1kg / 2lb 3oz de papas, peladas y cortadas en cubos pequeños", "350ml / 12fl oz de caldo de verduras", "4 tomates, toscamente picados", "1 manojo de cilantro, más o menos picado"], "method": ["Calentar un wok hasta que esté caliente y agregar el aceite.", "Agregue todas las especias y el jengibre y saltee por un minuto hasta que estén fragantes.", "Agregue las papas y revuelva para cubrir las especias.", "Agregue el caldo y cocine a fuego lento. Cocine a fuego lento durante 10-15 minutos hasta que las papas estén tiernas.", "Agregue los tomates y el cilantro.", "Sazonar con sal y pimienta negra recién molida y servir."], "url": "www_bbc_co_uk_food_recipes_bombaypotato_76547", "title": "Patata de Bombay", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 3-4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200g / 7oz de aceite vegetal", "450g / 1lb de papas crudas, peladas, cortadas en cubos", "1 cucharada de semillas de cilantro, tostadas en una sartén seca, trituradas hasta formar un polvo", "1 cucharada de semillas de comino, tostadas en una sartén seca, trituradas hasta formar un polvo", "1 cucharada de sal masala", "1 cucharadita de jengibre molido", "2 dientes de ajo, pelados, aplastados hasta formar una pasta con el filo de un cuchillo", "3 chiles rojos, finamente picados", "sal y pimienta negra recién molida", "200g / 7oz de papas hervidas, machacadas hasta que estén suaves", "Harina normal de 100 g / 3½ oz", "pequeño racimo de cilantro fresco", "pequeño manojo de hojas de menta fresca", "1 cucharadita de sal marina", "75ml / 2¾fl oz de vinagre de vino blanco", "200 ml / 7 fl oz oz yogur"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para las tortas de patata, caliente la mitad del aceite en una cacerola en el horno. Cuando el aceite esté humeando, agregue los cubos de patata crudos y gírelos hasta cubrirlos con aceite por todos lados.", "Agregue las especias, el ajo y el chile para cubrir las papas, luego condimente, al gusto, con sal y pimienta negra recién molida.", "Asar las papas en el horno durante 20-25 minutos, o hasta que estén crujientes y doradas pero tiernas por dentro. Retire las papas de la cazuela con una cuchara ranurada y déjelas a un lado sobre papel de cocina para drenarlas y enfriarlas un poco, luego mezcle con el puré de papas.", "Forme la mezcla de puré de papas en veinte a veinticuatro hamburguesas de 5cm / 2in, usando sus manos.", "Espolvoree la harina en un plato y sazone, al gusto, con sal y pimienta negra recién molida. Ruede cada empanada en la harina sazonada.", "Caliente el aceite restante en una sartén a fuego medio. Agregue las hamburguesas, en lotes, y fría en aceite por 2-3 minutos en cada lado, o hasta que estén crujientes y doradas por ambos lados y calientes. Retire de la sartén con una espumadera y déjela a un lado para escurrir sobre papel de cocina. Repite el proceso con las hamburguesas restantes.", "Mientras tanto, para la salsa, mezcle las hierbas, la sal y el vinagre en un procesador de alimentos hasta que estén bien combinados. Agregue el yogur.", "Para servir, divida las tortas de papa Bombay por igual entre seis y ocho platos para servir. Coloque los tazones de inmersión de la salsa al lado de cada uno."], "url": "www_bbc_co_uk_food_recipes_bombaypotatocakeswit_92717", "title": "Tortas de papa Bombay con cilantro y menta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "½ semillas de cilantro", "¼ cucharadita de polvo de curry mediano", "¼ cucharadita de cúrcuma molida", "1 diente de ajo, picado", "1 patata grande, pelada y cortada en cubos", "1 cucharada de puré de tomate", "½ limón, cortado en cuñas", "2 tomates, picados", "puñado de cilantro fresco, picado", "1 cucharada de yogur al estilo griego", "aceite de oliva, a llovizna"], "method": ["Calentar el aceite de oliva en una olla mediana, agregar las especias y el ajo y freír durante 1-2 minutos para liberar el sabor de las especias.", "Agregue los trozos de papa, cubra con una tapa y cocine durante cinco minutos, revolviendo ocasionalmente.", "Agregue el puré de tomate, las rodajas de limón y los tomates y cocine durante diez minutos, o hasta que las papas estén tiernas. Agregue el cilantro y revuelva bien.", "Para servir, coloque las papas en un recipiente y cubra con una cucharada de yogurt al estilo griego y una llovizna de aceite de oliva."], "url": "www_bbc_co_uk_food_recipes_bombaystylepotatoesw_85694", "title": "Papas estilo Bombay con limón y yogur", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 cucharadas de aceite", "¼ cucharadita de semillas de mostaza", "2 pizcas de chile en polvo", "¼ cucharadita de cúrcuma en polvo", "Papas 350g / 12oz, hervidas y descuartizadas", "sal al gusto"], "method": ["Caliente el aceite en una sartén a fuego medio.", "Para verificar que el aceite esté lo suficientemente caliente, espolvoree unas pocas semillas de mostaza, si se abren, el aceite está listo. Luego agrega el resto de las semillas de mostaza.", "Agregue los polvos de chile y cúrcuma a las chisporroteantes semillas y sal al gusto.", "Freír esta mezcla picante de aceite y especias durante 1 minuto y luego agregar las papas. Freír por unos 4 minutos hasta que las papas estén cubiertas de semillas y parezcan tener bordes crujientes. Se verán bastante amarillos en color. Cubra la sartén y, a fuego lento, cocine las papas por otros 5 minutos.", "Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_bombaypotatoes_1406", "title": "Patatas de Bombay", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bombaypotatoes_1406_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["6 cucharadas de aceite de oliva", "4 chalotes, cortados a la mitad y la piel dejada en", "5 x 2.5 cm / 1 en médula ósea cortada, limpiada", "4 filetes de solomillo", "50 g / 1¾oz de mantequilla sin sal", "1 chalote, finamente picado", "2 ramitas de tomillo, hojas recogidas", "1 hoja de laurel", "5 granos de pimienta negra", "200ml / 7fl oz de vino tinto", "300 ml / 10 fl oz de ternera o caldo de carne, calentado", "azúcar pizca", "50 g / 1¾oz de mantequilla sin sal", "250 g / 9 oz de coles de Bruselas, en rodajas finas", "70 g / 2½ oz de castañas cocidas, picadas", "2 cucharadas de perejil fresco de hojas planas"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4. Caliente 4 cucharadas de aceite en una sartén, agregue las chalotas y fría hasta que estén doradas. Transfiera a una bandeja para asar y tueste durante 15-20 minutos.", "Agregue la médula ósea a la bandeja de tostado y vuelva al horno durante 6 minutos, o hasta que la médula esté recién cocida, suelta pero no completamente derretida. Deje descansar en un lugar cálido.", "Caliente el aceite restante en la sartén. Agregue los filetes y cocine cada lado durante 2-3 minutos, dependiendo del grosor del bistec y cómo le gusta cocinarlo. Déjalo descansar.", "Para la salsa bordelaise, derrita la mantequilla en una cacerola a fuego medio. Agregue la chalota y cocine por 2-3 minutos. Agregue el tomillo, la hoja de laurel y los granos de pimienta y cocine durante 3 minutos.", "Agregue el vino y cocine hasta que el volumen del líquido se haya reducido a la mitad. Vierta el caldo y reduzca a la mitad nuevamente. Sazonar con un poco de azúcar, al gusto. Agregue la médula ósea de una de las piezas asadas, bata y reserve. Mantener caliente", "Para los brotes salteados, caliente una sartén. Agregue los brotes y cocine durante 1-2 minutos. Agregue las castañas y el perejil y cocine por otros 2 minutos.", "Sirva el bistec con los chalotes asados ​​y la médula ósea y los brotes, con la salsa derramada."], "url": "www_bbc_co_uk_food_recipes_bone_marrow_with_sirloin_04518", "title": "Médula ósea con solomillo, salsa bordelesa y brotes salteados con castañas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["5 cucharadas de aceite vegetal", "3 cebollas, finamente picadas", "1 diente de ajo, en rodajas finas", "Jengibre fresco de 5cm / 2in en rodajas finas", "1 tomate, toscamente picado", "1½ cucharadita de copos de chile rojo seco", "1½ cucharadita de cúrcuma molida", "1½ cucharadita de sal masala", "1½ cucharadita de jengibre molido", "1½ cucharadita de ajo en polvo", "1½ cucharadita de comino molido", "1½ cucharadita de cilantro molido", "1½ cucharadita de hojas secas de methi", "4 pechugas de pollo (aproximadamente 125 g / 4 oz cada una), cortadas en cubos pequeños", "2 chiles verdes", "1 cucharada de cilantro fresco picado", "sal y pimienta negra recién molida", "Arroz de grano largo de 400 g / 14 oz, enjuagado y remojado durante 20 minutos", "1 cucharada de mantequilla", "300g / 10½oz de yogurt natural", "1 cucharadita de semillas de comino", "½ pepino, pelado y rallado"], "method": ["Calentar un poco de aceite en una cacerola de fondo grueso a fuego medio y freír las cebollas hasta que estén doradas. Agregue más aceite si es necesario, luego agregue el ajo, el jengibre y el tomate y revuelva. Agregue las especias y sazone con sal antes de agregar un chorrito de agua. Cubra con una tapa y cocine por 20 minutos.", "Saque la sartén del fuego y bata con una batidora para hacer una pasta suave.", "Revuelva en el pollo. Pierce los chiles y agrégalos también. Si la salsa necesita aflojarse, agregue un poco más de agua. Regrese al fuego y cocine por 15-20 minutos.", "Mientras tanto, trae una olla grande de agua a ebullición. Escurra el arroz, agrégalo a la sartén y cocina por 5 minutos. Escurra el agua y devuelva el arroz al fuego. Agregue la mantequilla, cubra con una tapa y cocine al vapor el arroz a fuego lento durante 5 minutos.", "Mientras tanto, para hacer la raita, bata el yogur con un tenedor para hacer una pasta suave. Freír en seco las semillas de comino a fuego lento hasta que estén tostadas y fragantes. Agregue al yogur con el pepino y sazone al gusto.", "Adorne el pollo al curry con cilantro antes de servir con el arroz y la raita."], "url": "www_bbc_co_uk_food_recipes_boneless_chicken_curry_62956", "title": "Pollo deshuesado al curry con arroz", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["75g / 3oz de jarabe dorado", "75g / 3 oz de melaza negra", "150g / 6oz de azúcar morena suave y ligera", "75g / 3oz de mantequilla", "¼ cucharadita de crema de tártaro"], "method": ["Cubra una bandeja para hornear de 15 x 20 cm / 6 x 8 pulgadas con papel para hornear antiadherente.", "Mida todos los ingredientes en una olla profunda de base pesada. Coloque a fuego medio y revuelva ocasionalmente hasta que la mantequilla se derrita y el azúcar se haya disuelto.", "Cuando la mezcla esté suave y bien combinada, aumenta el fuego y lleva la mezcla a un punto de ebullición rápido. Cuando la mezcla alcance 140 ° C / 285 ° F, vierta cuidadosamente en la bandeja revestida.", "Si desea incluso piezas, espere hasta que el caramelo sea lo suficientemente frío como para manipularlo, pero lo suficientemente elástico como para que un dedo presionado en la parte superior deje una ligera hendidura (aproximadamente 15-20 minutos dependiendo de la temperatura ambiente). Cortar parcialmente el caramelo en trozos uniformes con un cuchillo engrasado. Cuando se haya enfriado por completo, rompa a lo largo de estas líneas. De forma alternativa, deje que el caramelo se enfríe por completo y luego divídalo en fragmentos con un martillo de caramelo o un rodillo.", "Almacenar en un recipiente hermético, con capas individuales de toffee separadas por pergamino para hornear. Si se deja expuesto a la humedad, el toffee se ablandará y se pegará."], "url": "www_bbc_co_uk_food_recipes_bonfire_toffee_21396", "title": "Toffe de fogata", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 8-10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bonfire_toffee_21396_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["90ml / 6 cucharadas de leche entera", "7g bolsita levadura acción rápida", "4 huevos de gallinas camperas", "3 cucharadas de azúcar en polvo de oro, más extra para quitar el polvo", "2 cucharaditas de pasta de vainilla", "400 g / 14 oz de harina de pan blanco, más extra para espolvorear", "10 g / ¼ oz de sal", "½ cucharadita de nuez moscada molida", "2 cucharadas de canela molida", "150 g / 5½ onzas de mantequilla, ablandadas, más extra para engrasar", "1 huevo de gallinas camperas, solo yema", "2 cucharadas de leche, para glasear", "200 g / 7 oz de azúcar en polvo", "75ml / 2½ fl oz crema doble", "1 cucharadita de pasta de vainilla", "pizca de crema de tártaro", "50g / 1¾oz de mantequilla salada", "75ml / 2½fl oz de leche entera", "30g / 1oz de mantequilla sin sal", "2 cucharaditas de pasta de vainilla", "225 g / 8 oz de azúcar en polvo", "pizca de sal", "125g / 4½oz de mantequilla sin sal, ablandada", "125g / 4½oz de queso crema con alto contenido de grasa", "275g / 9¾oz de azúcar glasé"], "method": ["Para el brioche, caliente la leche a 37 ° C / 99 ° F, viértala en una jarra medidora y agregue la bolsita de levadura. Cubra con film transparente y déjelo a un lado durante 10 minutos.", "Batir los huevos y agregar el azúcar y la pasta de vainilla. Tamiza la harina en un tazón grande y agrega la sal y la nuez moscada. Haga un pozo en la harina y vierta la mezcla de leche. Use sus manos para juntar la masa, estará muy pegajosa y húmeda. Coloque un gancho de masa en un mezclador independiente, agregue la masa y empiece a amasar.", "En un tazón separado, bata la canela en la mantequilla hasta que esté combinada, luego agrégala a la mezcla de masa a medida que se amasa. Cuando toda la mantequilla se haya incorporado a la masa, enharine la superficie de trabajo y amase la masa con la mano hasta que quede suave, suave y elástica. Transfiera a un tazón engrasado, cubra con una película adhesiva y refrigere durante la noche.", "Para el caramelo, pon una sartén a fuego medio. Agregue el azúcar, la crema, la vainilla, la crema de tártaro y 75 ml / 2 ½ oz de agua. Revuelva y cocine el caramelo hasta que llegue a 114 ° C (use un termómetro de azúcar para esto), agregue la mantequilla y siga revisando la temperatura. Cuando el jarabe alcanza los 143 ° C, viértalo en la lata preparada y déjelo a un lado para que se enfríe y se endurezca.", "Para el dulce de azúcar, engrase y forme una segunda lata pequeña. En una sartén a fuego medio, combine la leche, la mantequilla, la vainilla, el azúcar y la sal. Revolver hasta que el azúcar se disuelva. Cubra con una tapa bien ajustada y cocine por otros dos minutos. Retire la tapa y continúe cocinando al hervir durante 10 minutos hasta que llegue a 114C (use un termómetro de azúcar), luego transfiera la cacerola a un recipiente lleno de agua fría. Deje la sartén en un lugar fresco hasta que esté tibio (o 43C) - no revuelva. Cuando el chocolate se haya enfriado, use una cuchara de madera para batirlo hasta que quede espeso, liso y cremoso. Vierta en la lata preparada y reserve en un lugar fresco para que se endurezca.", "Para el glaseado de queso crema, bata la mantequilla y el queso crema hasta que quede suave y liviano. Agregue el azúcar glas hasta que se incorpore, luego batir brevemente de nuevo hasta que esté suave y lisa (tenga cuidado de no batir demasiado el glaseado ya que se va a mojar). Ponga a un lado hasta que esté listo para servir.", "Precaliente el horno a 200C / 400F / Gas 6 y engrase y forre una pequeña fuente cuadrada para hornear. Cuando el caramelo y el chocolate se hayan endurecido, divídelos en trozos pequeños.", "Retire la masa del refrigerador, amasar el dulce de azúcar y las piezas de caramelo en la masa, y divídalas en 12 bolas del mismo tamaño.", "Engrase una lata de hornear redonda de 30 cm / 12 pulg. De lado alto con mantequilla y polvo con azúcar. Coloque las bolas de masa en forma ordenada y déjelas a un lado durante dos horas para que se levanten. Cuando el brioche haya subido, mezcle la yema de huevo y la leche y cepille sobre el pan suavemente con un cepillo de pastelería.", "Coloque el brioche en el horno precalentado durante cinco minutos, luego reduzca la temperatura a 180 ° C / 350 ° F / Gas 4 y hornee durante otros 25 minutos, o hasta que esté dorado y suene hueco al tocar debajo. Transfiera a un estante de enfriamiento.", "Cuando el pan esté frío, quítelo de la lata y esparza el glaseado de queso crema sobre la parte superior de cada panecillo. Permita que la formación de hielo se establezca un poco antes de servir."], "url": "www_bbc_co_uk_food_recipes_bonfire_night_brioche_07518", "title": "Bonfire brioche noche", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Sirve 12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de albaricoques secos picados", "175g / 6oz sultanas", "150 g / 5½ oz pasas", "100 g / 3½ oz de cerezas glacé, lavadas, secas y cortadas a la mitad", "75 g / 3 oz de tallo de jengibre, picado", "125ml / 4fl oz de whisky de malta, más extra para la alimentación", "1 naranja, ralladura y jugo", "175g / 6oz azúcar morena oscura", "175g / 6oz de mantequilla, ablandada, más extra para engrasar", "3 huevos de gallinas camperas", "Harina normal 175g / 6oz", "1 cucharadita de especias mixtas molidas", "1 cucharadita de jengibre molido", "200g / 7oz de azúcar glasé", "1 huevo blanco de corral", "1 cucharada de glicerina", "150 g / 5½ oz mezcladas frutas glacé enteras, como dátiles, cerezas y naranjas, cortadas a la mitad o en rodajas, para decorar"], "method": ["Para la torta, coloque los albaricoques, pasas, pasas, cerezas y tallo de jengibre en un tazón y vierta más de 100 ml / 3½ fl oz del whisky. Agregue la ralladura de naranja y el jugo para combinar, luego cubra y deje de lado durante la noche hasta que la fruta haya absorbido todo el líquido.", "Cuando la fruta se haya empapado, precaliente el horno a 140C / 120C Fan / Gas 1. Engrase el interior de una lata de torta de savarin antiadherente de 20cm / 8in con mantequilla. Doble una hoja grande de papel de hornear en una tira de 3 capas de grosor y lo suficientemente grande como para envolver la parte exterior de la lata haciendo un alto \"collar\" (esto ayudará a que la torta se hornee uniformemente y evite que se dore demasiado al hornear) . Asegure el collar con una cuerda.", "Batir el azúcar y la mantequilla en un batidor de alimentos o en un tazón grande durante al menos 3-4 minutos, o hasta que se haya vuelto de color caramelo claro y esponjoso. Agriete los huevos de uno en uno, batiendo bien después de cada adición.", "Doble la harina, mezcle las especias, el jengibre molido y la fruta remojada hasta que se combinen por completo. Con una cuchara, coloque la mezcla de torta en la lata preparada y alise la parte superior con una espátula.", "Hornee la torta durante 1 hora y media, o hasta que una brocheta insertada en el centro salga limpia (si no lo hace, cocine la torta por otros 10 minutos y revise una vez más).", "Retire la torta del horno y rocíe con el whisky restante. Reserve para enfriar en la lata durante 15 minutos, luego colóquelo sobre una rejilla de alambre (consulte la información sobre cómo alimentar la torta).", "Para la formación de hielo, en una batidora de pie, mezcle el azúcar glasé, la clara de huevo y la glicerina hasta que sea lo suficientemente grueso como para mantener su forma, esto llevará de 3 a 4 minutos.", "Cuando el pastel esté frío, coloque la guinda en la parte superior y extiéndalo por todo el pastel con una espátula. Decora con la fruta glacé."], "url": "www_bbc_co_uk_food_recipes_boozy_christmas_cake_80904", "title": "Corona de pastel de Navidad", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Hace 1 x 20cm / 8 en pastel de Navidad", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["mantequilla suave, para engrasar", "Crema doble 500ml / 18fl oz", "150 g / 5½ oz de chocolate blanco, roto en cuadrados", "6 yemas de huevo grandes de gallinas camperas", "150ml / 5fl oz de licor de crema irlandesa", "75 g / 2½ oz de azúcar en polvo", "150 g / 5½ oz de azúcar en polvo", "aceite, para engrasar", "100g / 3½ oz de mantequilla ablandada", "100g / 3½oz de azúcar glasé", "½ cucharadita de extracto de vainilla", "½ cucharadita de canela molida", "½ naranja, ralladura de ralladura", "2 claras de huevo grandes de gallinas camperas", "Harina normal de 120g / 5oz"], "method": ["Precalienta el horno a 150 ° C / 300 ° F / Gas 2. Mantequilla el interior de un recipiente para budines de dos litros.", "Coloque la crema y el chocolate en una olla mediana antiadherente y caliente muy suavemente, revolviendo regularmente hasta que el chocolate se derrita. Retire del fuego.", "Coloque las yemas de huevo, el licor de crema irlandesa y el azúcar en un tazón grande y bata hasta que estén pálidos.", "Lentamente vierta la crema caliente y la mezcla de chocolate en los huevos, revolviendo vigorosamente hasta que estén bien combinados. Con cuidado vierta la mezcla en el plato de budín con mantequilla y colóquelo en una lata grande para asar.", "Hierva una tetera de agua y vierta cuidadosamente el agua recién hervida en la lata de asar para que se eleve aproximadamente 3 cm por encima del costado del plato. Tenga cuidado de no gotear agua sobre la mezcla de crema.", "Abra la puerta del horno y, usando un paño para horno para mantener caliente la lata, coloque el budín en el centro del horno. Hornea por 40-45 minutos. La crema está lista cuando está casi lista. Si mueves el plato, deberías ver cómo la crema se tambalea como una gelatina con una ligera ondulación debajo de la superficie. Continuará fortaleciéndose a medida que se enfríe.", "Saque la lata de asar del horno, levante la fuente de budín con cuidado del agua y déjela enfriar durante aproximadamente una hora. Cubra con película adhesiva y enfríe en la nevera durante la noche.", "Hasta cinco horas antes de servir, prepare el caramelo. Ponga el azúcar y cuatro cucharadas de agua fría en una cacerola pequeña y coloque a fuego medio durante aproximadamente un minuto, revolviendo con una cuchara de madera hasta que el azúcar se disuelva.", "Aumente el fuego un poco y cocine el azúcar, sin remover, durante 5-7 minutos, o hasta que se ponga dorado, del mismo color que el jarabe de arce. Descubre la crema y ten a mano listo para el relleno de caramelo.", "Tan pronto como el caramelo esté listo, retire la sartén del fuego. No toque ni pruebe el caramelo ya que estará extremadamente caliente. El caramelo continuará cocinando una vez que haya sido retirado del fuego, por lo que no debe oscurecerse antes de quitárselo.", "Cepille una cuchara grande de metal con aceite y vierta lentamente el caramelo sobre la cuchara sobre la crema enfriada, asegurándose de que esté lo más uniformemente posible. No vierta en un área solamente o el caramelo caliente comenzará a derretir la crema. Inclina el plato para ayudarlo a correr hacia los bordes si es necesario. Deje que se enfríe durante 15 minutos antes de servir o manténgalo cubierto en la nevera. (El caramelo comenzará a suavizarse después de un par de horas).", "Para las galletas langues de chat, precaliente el horno a 200C / 400F / Gas 6 y alinee dos bandejas para hornear con papel pergamino.", "Con un batidor eléctrico, unte la mantequilla y el azúcar glas juntos hasta que estén suaves y esponjosos. Batir el extracto de vainilla, la canela y la ralladura de naranja. Agregue las claras de huevo una a la vez y luego doble la harina.", "Usando una manga pastelera equipada con una boquilla simple de 1 cm / ½ pulgada, pase 6 cm / 2½ pulg. En tiras de la mezcla sobre las bandejas de hornear forradas.", "Hornee por 6-8 minutos hasta que los bordes estén ligeramente dorados. Deje enfriar en la bandeja.", "Sirve la crema Trinity con cubierta de caramelo con las galletas langue de chat al lado."], "url": "www_bbc_co_uk_food_recipes_boozy_trinity_cream_with_54240", "title": "Crema Boozy Trinity con galletas langues de chat", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6 personas (hace 36 galletas)", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de queso feta, desmenuzado", "pimienta negra recién molida", "1 cucharada de pasas de uva apiladas", "20g / ¾oz de perejil fresco de flatleaf, solo hojas, picado", "harina común, para quitar el polvo", "4 hojas de pasta filo", "50g / 2oz de mantequilla, derretida", "Ensalada mixta, para servir (opcional)"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "En un tazón, condimentar el queso feta, al gusto, con la pimienta negra. Agregue las pasas o las pasas sultanas y el perejil. Dejar de lado.", "Empolva ligeramente una superficie de trabajo con harina. Coloque una hoja de hojaldre y cepille con un poco de mantequilla derretida. Dobla la hoja de la pastelería por la mitad a lo largo.", "Coloque dos o tres cucharaditas colmadas de la mezcla de relleno en la esquina inferior izquierda del rectángulo de repostería. Doble la esquina llena de la masa hacia la parte superior del rectángulo para formar un triángulo, cepillando la masa doblada con mantequilla derretida sobre la marcha.", "Dobla la esquina superior izquierda de la masa una y otra vez, para envolver el paquete triangular con más masa. Siga doblando el paquete de pastelería sobre sí mismo, cepillándolo con mantequilla derretida cada vez, hasta que el paquete se asemeje a una samosa.", "Repita el proceso con las tres hojas restantes de filo y la mezcla de relleno restante.", "Coloque los cuatro boreks en una bandeja para hornear, con la última aleta de masa en la parte inferior. Hornee en el horno durante 18-20 minutos, o hasta que la masa esté crujiente y dorada. Sirve con una ensalada mixta."], "url": "www_bbc_co_uk_food_recipes_boreks_75041", "title": "Bórax", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Rinde 4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite vegetal", "15g / ½ oz de mantequilla", "1 zanahoria grande, cortada en cubitos", "1 tallo de apio cortado en cubitos", "1 cebolla, finamente picada", "3 remolachas de tamaño mediano (alrededor de 450 g / 1 libra de peso sin pelar), peladas y cortadas en cubitos", "1 patata grande y cerosa, cortada en cubitos", "2 dientes de ajo, finamente picados", "1½ litros / 2½ pintas de caldo de buey de buena calidad", "½ repollo morado, finamente rallado", "2 tomates, desollados, sin corazón y picados", "sal y pimienta negra recién molida", "cCrea agria", "1 cucharada de eneldo finamente picado"], "method": ["Caliente el aceite vegetal y la mantequilla en una olla grande de fondo grueso. Una vez derretido agregue la zanahoria, el apio y la cebolla y cocine suavemente por unos minutos. Agregue la remolacha, la papa y el ajo. Freír durante un par de minutos, hasta que estén bien cubiertos y combinados.", "Agregue el caldo y sazone con sal y pimienta negra. Lleve justo por debajo del hervor y cocine a fuego lento durante 15 minutos.", "Agregue el repollo y los tomates. Cubra y deje hervir a fuego lento por otros 20 minutos.", "Sirve la sopa con una cucharada de crema agria y una pizca de eneldo."], "url": "www_bbc_co_uk_food_recipes_borscht_18028", "title": "Sopa de remolacha", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "500 g / 1 lb 2 oz puerros, recortado, lavado y en rodajas", "sal y pimienta negra recién molida", "2 x 400 g / 14 oz de frijoles borlotti, escurridos y enjuagados", "2 ramitas de romero", "500ml / 18fl oz de caldo de verduras o pollo (hecho de un cubo)", "Pan en rebanadas de 200g / 7oz (el pan duro está bien), sin corteza", "40 g / 1½ oz de mantequilla", "2 dientes de ajo, finamente picados"], "method": ["Caliente una sartén grande o una sartén a fuego medio. Agregue el aceite, los puerros y una pizca de sal. Freír los puerros suavemente durante 5-8 minutos, o hasta que estén suaves y translúcidos.", "Agregue los frijoles borlotti, las ramitas de romero y el caldo a la sartén y revuelva para mezclar. Cubra con una tapa, cocine a fuego lento y cocine a fuego medio-bajo durante 20 minutos, o hasta que el ragù se espese un poco y los frijoles Borlotti se suavicen.", "Mientras tanto, rasga el pan en trozos pequeños. Caliente una sartén grande a fuego medio, agregue un poco de mantequilla y, una vez derretida, fríe el pan por lotes hasta que esté dorado y crujiente. Retire de la sartén y reserve. Agregue el primer lote a la sartén con un poco más de mantequilla y el ajo. Freír por un minuto, o hasta que el ajo esté recién hecho y las migas de pan estén cubiertas. Sazonar con sal y pimienta al gusto. Retire las migas con una cuchara ranurada y mezcle con las migas de pan restantes y una pizca de sal.", "Pruebe el borlotti bean ragù y sazone con sal y pimienta al gusto. Retire las ramitas de romero y sirva los frijoles borlotti con las migas de ajo rociadas en la parte superior."], "url": "www_bbc_co_uk_food_recipes_borlotti_and_rosemary_16332", "title": "Borlotti y romero ragù con puerros y migas de ajo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500 g / 1 libra de alubias blancas de 2 onzas, secas", "Vientre de cerdo de la pieza 400g / 14oz", "50g / 2oz de azúcar morena suave", "45 g / 3 cucharadas de melaza negra", "1 cucharada de mostaza inglesa (hecha de polvo)", "4 dientes", "8-10 cebollas encurtidas (o 2-3 cebollas pequeñas)", "pimienta negra molida", "sal"], "method": ["Remoje los frijoles durante la noche en abundante agua fresca.", "Precalentar el horno a 140C / 275F / Gas 1.", "Escurra y enjuague, luego coloque en una sartén o cacerola pesada, a prueba de horno, con agua fresca para cubrir los granos de aproximadamente 5 cm. Llevar a ebullición y hervir durante al menos 10 minutos. Baje el fuego para obtener una cocción suave a fuego lento, cubra con la tapa de la sartén y cocine a fuego lento durante aproximadamente una hora hasta que los frijoles estén tiernos pero no completamente suaves. Retire del fuego.", "Cortar la barriga de cerdo en cubos grandes de 5cm / 2in, dejando la cáscara y agregar a los frijoles. Agregue el azúcar morena, la melaza negra y la mostaza.", "Presione los dientes en una cebolla y agregue, con las cebollas adicionales, a la olla. Sazonar con pimienta, pero sin sal en esta etapa. Si es necesario, agregue un poco de agua caliente para que los granos estén cubiertos.", "Vuelva a colocar la tapa en la cazuela. Hornea los frijoles en el horno para hornear durante unas tres horas. A continuación, retire la tapa y arrastre algunos de los trozos de cerdo hasta la parte superior. Regrese, sin tapa, al horno, durante una hora más. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Sirva solo, con pan crujiente (o sobre pan tostado), como un refrigerio o una comida liviana.", "Los frijoles cocidos se mantendrán en la nevera, en un recipiente sellado o en un recipiente tupperware, durante dos semanas. También puedes congelar cualquier sobra."], "url": "www_bbc_co_uk_food_recipes_bostonbakedbeans_10471", "title": "Habas cocidas al horno Boston", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bostonbakedbeans_10471_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1kg / 2¼lb de remolacha", "450 g / 1 libra de zanahorias", "8 chalotas", "2 dientes de ajo, picados aproximadamente", "1 barra de apio, picado aproximadamente", "1 hoja de laurel", "2 cucharadas de semillas de alcaravea", "suficiente stock para cubrir las verduras con aproximadamente media pinta de sobra", "sal y pimienta negra recién molida"], "method": ["Pele y corte las verduras aproximadamente. Coloque en una sartén grande con la hoja de laurel y las semillas de alcaravea.", "Cubra con la acción. Llevar a ebullición rápida. Cubra la sartén y reduzca el fuego a fuego lento y cocine durante aproximadamente 1 hora o hasta que las verduras estén tiernas.", "Retire la hoja de laurel y licúe la sopa hasta que esté suave, ajuste el condimento. Pase la sopa a través de un tamiz mediano.", "Recalentar suavemente, no dejar hervir, servir con la crema agria y Pirags."], "url": "www_bbc_co_uk_food_recipes_borschbeetrootsoup_12298", "title": "Borsch (sopa de remolacha)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 x 425 g / 15 oz pueden cerezas en jugo, escurrido", "3 tiras de ralladura de naranja, cortadas con un pelador", "2 cucharadas de jarabe de arce", "2 cucharadas de vino tinto", "1 cucharadita de arrurruz", "2 cápsulas de cardamomo, divididas", "1 hoja de pasta de filo lista para usar", "55 g / 2 oz de mantequilla, derretida", "2 cucharadas de azúcar glas", "100ml / 3½ fl oz crema doble", "2 cucharadas de menta fresca picada"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para las cerezas alcohólicas, coloque todos los ingredientes en una sartén y caliente, revolviendo, hasta que la mezcla se espese y se convierta en almíbar.", "Para las parcelas de filo, corte la hoja de hojaldre en tres o cuatro pedazos, y arrugue en pequeños paquetes. Cepille generosamente con la mantequilla derretida y el polvo con el azúcar glas.", "Coloque los paquetes de filo en una bandeja para hornear y cocine en el horno durante aproximadamente 4-5 minutos, o hasta que estén dorados y crujientes.", "Para la crema de menta, en un tazón, bata la crema hasta que se formen picos suaves cuando se quite la batidora. Dobla la menta fresca.", "Para servir, coloque los paquetes de filo en la mitad de un plato de servir y coloque las cerezas borrachas en el otro. Sirva con la crema de menta en un tazón pequeño en el lateral."], "url": "www_bbc_co_uk_food_recipes_boozycherrieswithmin_88601", "title": "Boozy cerezas con crema de menta y paquetes de filo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "2 cebollas, finamente picadas", "1 hinojo pequeño, finamente picado", "2 dientes de ajo, aplastados", "1 cucharada de puré de tomate tbsp", "100 ml / 3½ fl oz de vino blanco seco", "750 ml / 1¼ pinta de pescado", "6 tomates grandes, desollados y toscamente picados", "pellizcar el azafrán", "albahaca pequeña, tallos y hojas separadas, hojas trituradas", "1 naranja pequeña, ralladura y jugo", "Mejillones de 1kg / 2lb 4 oz, fregados y rellenos", "Bacalao de 350g / 12oz, pelado y cortado en rodajas de 15mm / ⅝in", "2 filete de lubina, pelado y cortado en 5 rebanadas", "Colas de cangrejo cocinadas 200g / 7oz, sin cáscara", "sal y pimienta negra recién molida", "pellizcar el azafrán", "½ limón pequeño, solo jugo", "6 cucharadas de mayonesa completa de grasa", "1 diente de ajo grande, aplastado"], "method": ["Caliente el aceite en una olla grande y profunda. Agregue la cebolla y el hinojo y cocine durante 5 minutos, o hasta que comience a ablandarse. Agregue el puré de ajo y tomate y revuelva durante 30 segundos. Agregue el vino, el caldo y los tomates. Llevar a ebullición, agregar el azafrán, los tallos de albahaca y la ralladura de naranja. Cubra y cocine a fuego lento durante 10 minutos.", "Deseche los mejillones con cáscaras rotas y los que se nieguen a cerrarse al tocarlos. Agregue los mejillones, voltee la sartén y cubra con una tapa. Hierva por unos 4 minutos, o hasta que se hayan abierto todos los mejillones. Deseche cualquier que no se haya abierto. Saca la sartén del fuego.", "Cuidadosamente saca los mejillones cocidos. Reserve 18 mejillones, luego retire los mejillones restantes de sus caparazones y colóquelos en un tazón pequeño. Deseche los tallos de albahaca.", "Mezcle la sopa hasta que esté completamente suave, transfiera a una cacerola y cocine a fuego lento sin tapar durante 10 minutos para reducirla. (Debe tener aproximadamente 2 litros / 3½ pintas en total en este punto).", "Sazone con sal y pimienta y agregue el jugo de la mitad de la naranja. Agregue el bacalao y la lubina, tape y cocine a fuego lento durante 3-4 minutos, luego devuelva los mejillones cocidos, los mejillones reservados en cáscaras y las colas de cangrejo y caliéntelos durante otros 2-3 minutos, o hasta que estén calientes y todo el pescado esté cocido. .", "Ponga la cuchara en tazones y espolvoree con hojas de albahaca picadas.", "Para hacer el rouille, remoje el azafrán en el jugo de limón y mezcle con el ajo y la mayonesa en un tazón. Sazonar con sal y pimienta y una cuchara encima de la bouillabaisse."], "url": "www_bbc_co_uk_food_recipes_bouillabaisse_00342", "title": "bullabesa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bouillabaisse_00342_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 salmonetes pequeños (100g / 3½ oz), destripados, a escala, branquias retiradas, cortadas en trozos de 3cm / 1¼in, cabezas y colas reservadas", "1 x 1kg / 2lb 4oz perlón, eviscerado, a escala, branquias eliminadas, cortadas en trozos de 3cm / 1¼in, cabeza y cola reservadas", "1 cebolla grande, finamente rebanada", "1 bulbo de hinojo, en rodajas finas", "1 bulbo de ajo, clavos separados y rebanadas finas", "1 puerro, en rodajas finas", "100ml / 3½fl oz de aceite de oliva virgen extra", "15g / ½ oz de albahaca fresca", "2 ramitas de tomillo fresco", "10g / ⅓oz de tallos de perejil fresco", "Sal cocida en escamas de 25g / 1oz", "10 granos de pimienta negra", "1 semillas de cilantro apiladas", "1 cucharada colmada de semillas de hinojo", "pellizcar hilos de azafrán", "1 diente", "pizca de cayena", "Tomates de ciruela 500 g / 1lb 2 oz, en rodajas", "3 cucharadas de aceite de oliva", "50g / 1¾oz puré de tomate", "Tomates 500g / 1lb 2 oz, picados", "150ml / 5fl oz vino blanco seco de buena calidad", "3 litros / 5¼ pintas de peces de buena calidad o agua", "Patatas Maris Piper de 600g / 1lb y 5oz, cortadas en trozos del tamaño de un bocado", "2 puerros", "12 langostinos grandes", "1 x 1kg / 2lb 4oz rape de rape, deshuesado y cortado", "12 vieiras", "2 salmonetes pequeños (100g / 3½ oz), destripados, a escala, branquias retiradas, cortadas en trozos de 3cm / 1¼in, cabezas y colas reservadas", "1 x 1kg / 2lb 4oz perlón, eviscerado, a escala, branquias eliminadas, cortadas en trozos de 3cm / 1¼in, cabeza y cola reservadas", "1 cebolla grande, finamente rebanada", "1 bulbo de hinojo, en rodajas finas", "1 bulbo de ajo, clavos separados y rebanadas finas", "1 puerro, en rodajas finas", "100ml / 3½fl oz de aceite de oliva virgen extra", "15g / ½ oz de albahaca fresca", "2 ramitas de tomillo fresco", "10g / ⅓oz de tallos de perejil fresco", "Sal cocida en escamas de 25g / 1oz", "10 granos de pimienta negra", "1 semillas de cilantro apiladas", "1 cucharada colmada de semillas de hinojo", "pellizcar hilos de azafrán", "1 diente", "pizca de cayena", "Tomates de ciruela 500 g / 1lb 2 oz, en rodajas", "3 cucharadas de aceite de oliva", "50g / 1¾oz puré de tomate", "Tomates 500g / 1lb 2 oz, picados", "150ml / 5fl oz vino blanco seco de buena calidad", "3 litros / 5¼ pintas de peces de buena calidad o agua", "Patatas Maris Piper de 600g / 1lb y 5oz, cortadas en trozos del tamaño de un bocado", "2 puerros", "12 langostinos grandes", "1 x 1kg / 2lb 4oz rape de rape, deshuesado y cortado", "12 vieiras"], "method": ["Coloque el salmonete y el perlón en un tazón grande. Agregue la cebolla, el hinojo, el ajo, el puerro, el aceite de oliva virgen extra, las hierbas, la sal, las especias y los tomates de ciruela y mezcle bien. Cubre y marina en la nevera durante 24 horas, girando el contenido cada 4-6 horas.", "Separe el pescado de las verduras y la mezcla de especias, reservando el líquido. Caliente 2 cucharadas de aceite de oliva en una sartén grande a fuego medio y fría el pescado, descartando las cabezas y las colas, durante 10-15 minutos, o hasta que estén doradas por todos lados.", "Mientras tanto, caliente el restante 1 cucharada de aceite en una cacerola lo suficientemente grande como para contener la sopa. Agregue las verduras y el sudor durante 5-7 minutos, sin dejar que se coloreen. Condimentar con sal y pimienta.", "Retire el pescado de su sartén y manténgalo caliente. Desglasar la sartén con un toque de vino y agregar a las verduras.", "Cuando las verduras estén blandas, agregue el puré de tomate y cocine durante 5 minutos. Agregue los tomates picados, el líquido reservado y el vino restante, aumente el fuego y cocine a fuego lento durante 10 minutos. Agregue el caldo, lleve a ebullición rápidamente, reduzca a fuego lento y cocine durante 20 minutos.", "Mientras tanto, cocine las papas en una sartén grande con agua con sal durante 20 minutos o hasta que estén suaves.", "Mezcle la sopa en una licuadora hasta que esté muy suave. Pase a través de un tamiz fino y manténgalo caliente.", "Blanquee los puerros enteros en una sartén grande con agua con sal durante 5 minutos. Escurrir y cortar en rebanadas de 1cm / ½.", "Escurra las papas y agregue a la sopa junto con los puerros.", "Ponga a hervir una olla grande de agua con sal, agregue las langostinas y cocine durante 1 minuto. Escurrir y reservar para enfriar un poco antes de quitar la carne de la cola, luego agregar a la sopa para cocinar.", "Dorar la cola de rape en una sartén caliente durante 5 minutos, hasta que se dore por cada lado pero no completamente cocido. Retire de la sartén y corte en 24 rebanadas. Agregue a la sopa para cocinar.", "Sazonar las vieiras en la misma sartén, dorarlas y cocinarlas.", "Para servir, divida la sopa entre 12 tazones para servir calentados y cubra cada uno con una vieira sellada. Rocíe el pescado con jugo de limón y sirva al lado."], "url": "www_bbc_co_uk_food_recipes_bouillabaisse_58073", "title": "bullabesa", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Sirve 12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]