[{"isVegetarian": false, "title": "Chicken, cashew nut and basil stir fry", "url": "www_bbc_co_uk_food_recipes_chicken_cashew_nut_and_78081", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_cashew_nut_and_78081_16x9.jpg", "ingredients": ["2 tsp five-spice powder ", "250g/9oz brown or white long grain or basmati rice or quinoa", "125g/4½oz cashew nuts", "1 tbsp sunflower oil", "2 large boneless, skinless chicken breasts (about 225g/8oz each), cut into bite-sized chunks", "flaked sea salt and freshly ground black pepper", "2-3 peppers, mixed colours, cut into strips ", "1 bunch spring onions, trimmed and cut into 3cm/1¼in pieces", "2-3 red chillies, deseeded (if preferred for less heat) and cut into long strips ", "3cm/1¼in piece fresh root ginger, peeled and cut into thin matchsticks", "2 garlic cloves, finely chopped", "1 tsp cornflour", "100ml/3½fl oz chicken stock", "3 tbsp hoisin sauce (alternatively use soy sauce)", "large handful basil leaves"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["First cook the rice. Put the five spice in the bottom of a medium pan over a low heat. Cook for about 3-4 minutes, or until you start to smell the aromas, then add the rice or quinoa along with a little salt and cook it according to the pack instructions.", "Meanwhile, put the cashew nuts in a large wok (without any oil) over a medium heat and toast for about 3-4 minutes, giving them a shake from time to time until golden-brown all over. Then tip them onto a plate and set them aside.", "Heat the oil in the wok with the heat turned up to high. Season the chicken pieces with salt and pepper and stir-fry for about 4-5 minutes, stirring occasionally, until golden-brown. Add the peppers, spring onions, chillies and ginger, and cook for 2-3 minutes keeping the pan moving so nothing burns. Add the garlic and cook for another minute. ", "Place the cornflour in a small bowl with two teaspoons of cold water and mix to a smooth paste. Add to the stir fry along with the stock and hoisin sauce and let the sauce bubble away for 1-2 minutes, or until it thickens slightly.  Toss the toasted cashew nuts into the pan and check that the chicken is cooked through. Remove from the heat.", "The rice or quinoa should be cooked by now and so drain, season to taste with salt and pepper and then return to the pan to keep warm if necessary. ", "Spoon the rice or quinoa onto each serving plate. Spoon the stir fry between them and rip up the basil leaves to scatter over. Serve immediately."]}, {"isVegetarian": false, "title": "Chicken casserole with potato cobbler", "url": "www_bbc_co_uk_food_recipes_chicken_casserole_with_67654", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_casserole_with_67654_16x9.jpg", "ingredients": ["350g/12oz floury potatoes, such as King Edwards or Maris Piper", "250g/9oz self-raising flour, plus extra for rolling", "1 tsp fine sea salt", "100g/3½oz cold butter, cut into cubes", "125ml/4fl oz full-fat milk, plus extra for brushing", "8 skinless, boneless chicken thighs", "flaked sea salt and freshly ground black pepper", "3 tbsp sunflower oil", "4 rashers rindless smoked streaky bacon, cut into 2cm/¾oz wide strips", "2 medium onions, halved and sliced", "2 celery sticks, thinly sliced", "150g/5½oz small button mushrooms, wiped and halved or quartered if large", "400g/14oz can chopped tomatoes", "600ml/20fl oz chicken stock, made with 1 stock cube", "1 bay leaf", "2 tsp dried thyme ", "375g/13oz medium carrots, peeled and cut into 1.5cm slices", "2 slender leeks, trimmed and cut into 2cm/¾in slices", "1 tbsp cornflour", "2 tbsp cold water", "flaked sea salt ", "freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["To prepare the mash for the cobbler topping, peel the potatoes and cut into 2cm/¾in chunks. Put in a medium saucepan and cover with cold water. Bring to the boil and simmer for 15 minutes, or until the potatoes are very tender. ", "Drain in a colander and mash with a potato masher or put through a potato ricer until smooth. Leave to cool for 10-15 minutes. You will need 250g/9oz mashed potatoes for the cobbler topping. Any remaining mash can be set aside for another recipe.", "For the chicken casserole, trim the chicken thighs of any fatty bits and cut each one into four pieces. Season well with salt and pepper. Heat the oil in a large non-stick frying pan over a medium heat. Fry the chicken, in two batches, until lightly browned all over. Transfer to a large flame-proof casserole dish. Preheat the oven to 200C/400F/Gas 6.", "Put the bacon, onion and celery in the same frying pan used to brown the chicken and fry for 4-5 minutes over a medium-high heat until lightly browned, stirring often. Add the mushrooms and cook for one minute more, stirring. ", "Tip the vegetables into the casserole with the chicken pieces. Stir in the tomatoes, stock, bay leaf, thyme and carrots.  Bring to a simmer on the hob, cover loosely with a lid and cook in the oven for 30 minutes.", "While the chicken is cooking, finish making the cobbler topping. Put the flour and salt in a large bowl and rub in the butter using your fingertips until the mixture resembles coarse breadcrumbs. Add 250g/9oz mashed potatoes and rub together with the butter and flour. ", "Stir in the milk and mix to form a soft, smooth dough. Turn the dough out onto a well-floured surface and roll into a thick sausage, about 24cm/9½in long. Cut into 12 rounds, each around 2cm/¾in thick.", "Take the chicken out of the oven and season to taste with salt and pepper. You won’t be able to season it again once the topping has been added. Mix the cornflour and water and stir into the casserole. Add the leeks and stir well.", "Top the chicken mixture with the potato dumplings, overlapping them slightly, so they almost cover the filling. Brush with a little extra mix to glaze. Season with a little ground black pepper and some sea salt. Return to the oven without a lid for a further 30 minutes, or until the cobbler topping is well risen, fluffy and golden-brown. "]}, {"isVegetarian": false, "title": "Chicken chasseur", "url": "www_bbc_co_uk_food_recipes_chicken_chasseur_11639", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz salt", "2 bay leaves", "2 garlic cloves", "2 sprigs rosemary", "2 sprigs thyme", "1 tsp whole black peppercorns", "1 whole chicken", "1 onion, roughly chopped", "2 sticks celery, roughly chopped", "1 carrot, roughly chopped", "4 garlic cloves, smashed", "2 sprigs thyme", "500g/1lb 2oz Maris Piper potatoes", "125ml/4fl oz double cream", "125g/4½oz unsalted butter", "300ml/10fl oz white wine", "300ml/10fl oz dark chicken stock", "½ bunch fresh tarragon", "200g/7oz fresh morel mushrooms", "4 tomatoes, peeled, seeds removed, finely chopped", "2 tbsp finely chopped fresh chives"], "serves": "Serves 4-6", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the brine, put all the ingredients into a large saucepan with 1 litre/1¾pint of water and bring to the boil. Once boiled and the salt has dissolved, remove from the heat and allow to cool.", "For the chicken, place the chicken in a large bowl and pour over the brine. Cover and leave in the fridge for at least eight hours.", "Preheat the oven to 220C/425F/Gas 7. Place the chopped vegetables, garlic and thyme in a deep baking tray and place the chicken on top. ", "Roast in the oven for 40-50 minutes, depending on the size of the chicken – pierce the chicken in the thickest part with a skewer; when the juices run clear the meat is cooked.", "For the mashed potato, cook the potatoes in a pan of boiling salted water for 12-15 minutes, or until tender. Drain.", "Press the potato through a potato ricer into a saucepan. Return to the heat, then add the butter and cream and beat to a smooth purée. Season, to taste, with salt and freshly ground black pepper. ", "For the chicken chasseur, place the white wine in a large pan and cook until the volume of liquid has reduced by half. Add the chicken stock and tarragon and reduce by half again.  ", "Add the morels and cook for two minutes and then, just before serving, add the diced tomato and fresh chives.", "To serve, cut the chicken into pieces and place in a serving dish. Place the mash next to the chicken and pour the sauce over the chicken and mash."]}, {"isVegetarian": false, "title": "Chicken chasseur for a crowd", "url": "www_bbc_co_uk_food_recipes_chicken_chasseur_60410", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125g/4½oz plain flour", "sea salt and freshly ground black pepper", "7.5kg /9lb 13oz chicken thighs, skinned and bone removed and cut into 3cm pieces", "150ml/5fl oz sunflower oil", "875g/1lb 15oz button mushrooms", "5 onions, sliced", "2.8 litres/5 pints chicken stock", "150ml/5fl oz tomato purée", "25g/1oz fresh tarragon, half left as sprigs, half finely chopped", "5 x 400g/14oz tins chopped tomatoes", "small bunch curly parsley, finely chopped"], "serves": "Serves 40", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Place the flour into a bowl and season with salt and freshly ground pepper. Dredge the chicken in the flour, shaking off any excess. ", "Heat a large, deep frying pan and add the oil.  Fry the chicken pieces skin-side down for 1-2 minutes until golden-brown, turn over and brown on the other side.  Remove the chicken from the pans and set aside.", "Add a little more oil if the pans are dry then add the mushrooms and fry for 2-3 minutes. Add the onion and cook for a further five minutes.", "Place the chicken back in the pans and add the stock, tomato purée, whole tarragon sprigs and tomatoes. Bring to the boil and transfer the chicken to ovenproof dishes.  Cover with aluminium foil and place in the oven for 45 minutes, or until the chicken is cooked through. ", "Adjust the seasoning if necessary then add the parsley and the chopped tarragon."]}, {"isVegetarian": false, "title": "Chicken chasseur with creamy mash", "url": "www_bbc_co_uk_food_recipes_chicken_chasseur_with_12065", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_chasseur_with_12065_16x9.jpg", "ingredients": ["1.5kg/3lb 5oz chicken, cut into eight pieces", "salt and freshly ground black pepper", "1 tbsp plain flour", "2 tbsp olive oil", "110g/4oz butter", "110g/4oz smoked streaky bacon, sliced into 1cm/½in pieces", "125g/4½oz shallots, thickly sliced", "150g/5½oz chestnut mushrooms", "2 tbsp tomato purée", "175ml/6fl oz white wine", "400ml/14fl oz chicken stock", "1 small bunch tarragon", "3 tomatoes", "2 tbsp finely chopped flatleaf parsley", "sea salt", "freshly ground white pepper", "1kg/2lb 4oz floury potatoes, peeled and cut into chunks", "125g/4½oz butter", "125ml/4fl oz double cream", "freshly ground white pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the chicken, season the chicken with salt and black pepper then toss in the flour to just coat.", "Heat a large pan until hot, add the oil, a knob of the butter and half the chicken and fry skin side down for 3-4 minutes until golden-brown.", "Turn and fry on the other side for another 1-2 minutes, then remove from the pan. Repeat with another knob of butter and the rest of the chicken.", "Add another knob of butter and the bacon and fry until golden-brown then add the shallots, mushrooms and tomato purée and fry for another couple of minutes.", "Add the wine and bring to a simmer, gently scraping up any cooked on bits from the bottom of the pan.", "Add the stock then return the chicken to the pan with half the tarragon and bring to a boil.", "Reduce the heat to a simmer, cover and cook for 30-40 minutes until the chicken is tender and the liquid slightly reduced.", "While the chicken cooks, skin and seed the tomatoes. Bring a pan of water to the boil, take out the stalk of the tomato and make a cross on the bottom.", "Drop the tomatoes into the water and simmer for 10-15 seconds until the skin starts to peel away.", "Lift straight out into a bowl of iced water and peel off the skin.", "Cut the tomatoes into quarters and remove the seeds then cut into small dice. Roughly chop the remaining tarragon.", "Add the tomatoes, flatleaf parsley and tarragon then check the seasoning.", "For the mash place the potatoes into a pan of salted water and bring to the boil.", "Reduce the heat and simmer for 12-15 minutes until the potatoes are tender.", "Drain and return to the pan, then place over the heat for one minute to drive off any excess moisture.", "Pass through a potato ricer back into the pan (or mash with a fork) then add the butter and cream, beating to form a smooth mash.", "Season with salt and white pepper.", "Serve two pieces of chicken per person with the sauce spooned over and a dollop of mash."]}, {"isVegetarian": false, "title": "Chicken chasseur with mashed potato", "url": "www_bbc_co_uk_food_recipes_chicken_chasseur_with_30427", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1.5kg/3lb 5oz chicken, cut into 8 pieces", "salt and freshly ground black pepper", "2 tbsp olive oil", "110g/4oz butter", "110g/4oz pancetta, sliced into lardons", "1 carrot, diced", "150g/5oz button mushrooms", "250g/9oz shallots, thickly sliced", "2 garlic cloves, finely chopped", "175ml/6fl oz white wine", "275ml/10fl oz chicken stock", "2 tbsp tomato purée", "2 tbsp fresh tarragon, finely chopped", "2 tomatoes, skinned, seeded and chopped", "4 tbsp flatleaf parsley, finely chopped", "1kg/2lb 2oz floury potatoes, peeled and cut into chunks", "110g/4oz butter", "110ml/4fl oz full-fat milk", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the chicken, season the chicken with salt and black pepper. Heat a large frying pan or sauté pan until hot. Add the oil and half the butter. Fry the chicken skin-side down for 1-2 minutes, or until golden-brown.", "Turn and fry on the other side for another 1-2 minutes, then remove from the pan.", "Add the remaining butter, the pancetta, carrot, mushrooms, shallots and garlic, and fry until golden-brown.", "Add the wine and bring to a simmer, stirring to deglaze the pan.", "Put the chicken back into the pan with the tomato purée and tarragon and bring to a boil.", "Reduce the heat to a simmer and cook for 30-40 minutes until the chicken is tender and the liquid slightly reduced in volume.", "Add the tomatoes, flatleaf parsley and season to taste with salt and pepper.", "Simmer for a further two minutes.", "For the mash, place the potatoes into a pan of cold, salted water and bring to the boil.", "Reduce the heat and simmer for 12-15 minutes, or until the potatoes are tender.", "Drain and return to the pan, then place over a low heat for one minute to dry the potatoes slightly.", "Mash thoroughly, then add the butter and milk and beat to form a smooth mash.", "Season to taste with salt and black pepper.", "Serve each person two pieces of chicken with the sauce spooned over and a dollop of mash."]}, {"isVegetarian": false, "title": "Chicken chasseur with straw fries", "url": "www_bbc_co_uk_food_recipes_chicken_chasseur_with_32863", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1.5kg/3lb 5oz whole chicken, jointed into eight pieces", "salt and freshly ground black pepper", "50g/2oz plain flour", "2 tbsp olive oil", "110g/4oz butter", "150g/5½oz button mushrooms, left whole", "100g/3½oz chestnut mushrooms, halved", "150g/5½oz shallots, peeled and left whole", "40g/1½oz caster sugar", "175ml/6fl oz white wine", "500ml/18fl oz chicken stock", "3 tbsp tomato purée", "½ bunch fresh tarragon, half left as sprigs and half finely chopped", "2 plum tomatoes, peeled, seeds removed, finely chopped", "vegetable oil, for deep frying", "4 large potatoes, peeled and cut into skinny fries", "salt and freshly ground black pepper"], "serves": "4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the chicken chasseur, season the chicken pieces with salt and freshly ground black pepper. Dredge in the flour to coat.", "Heat a large pan over a medium heat and add the oil and a third of the butter.  When the butter is foaming, add the chicken pieces and fry skin-side down for 1-2 minutes until golden-brown. Turn the chicken over and fry for another 1-2 minutes.", "Meanwhile, heat a separate frying pan over a medium heat and add another third of the butter. When the butter is foaming, add the mushrooms and fry, stirring occasionally, until golden-brown all over. Reserve a few mushrooms for a garnish and transfer the rest of the mushrooms to the chicken pan.", "In the pan used to fry the mushrooms, add the remaining third of the butter, the shallots and the caster sugar and fry for 2-3 minutes, or until the shallots are golden-brown and caramelised.", "Add the wine and bring to the boil, scraping the base of the pan with a wooden spoon to dislodge any brown bits.", "Reserve a few shallots for the garnish and pour the remaining shallots and wine mixture over the chicken. Add the stock, tomato purée and whole tarragon sprigs. Bring to the boil and then reduce the heat to simmer. Cook for 45-60 minutes, or until the chicken is completely cooked through and the sauce has reduced slightly.", "Add the tomatoes and the chopped tarragon and season, to taste, with salt and freshly ground black pepper. Simmer for a further two minutes.", "For the straw fries, pour the oil into a large, deep, heavy based saucepan and heat until a cube of bread sizzles and turns golden-brown when dropped in. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "In batches carefully lower the potatoes into the hot oil and fry for 3-4 minutes, or until crisp and golden-brown. Remove from the hot oil using a slotted spoon and set aside to drain on kitchen paper. Season, to taste, with salt and freshly ground black pepper. Repeat the process with the remaining potatoes.", "To serve, place two pieces of chicken onto each plate, drizzle the sauce over and garnish with the reserved mushrooms and shallots. Serve the fries alongside."]}, {"isVegetarian": false, "title": "Chicken chilli beer batter strips", "url": "www_bbc_co_uk_food_recipes_chicken_chilli_beer_83289", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 chicken breasts, cut into equally-sized strips", "½ lemon, juice only", "chilli powder, to taste", "salt", "vegetable oil, for deep frying", "50g/1¾oz plain white flour", "280g/10oz plain white flour", "pinch bicarbonate of soda", "10fl oz/½ pint beer, chilled", "200ml/7fl oz sparkling water, chilled", "1 egg white"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put the chicken in a bowl and add the lemon juice, chilli powder and a pinch of salt. Mix, cover with cling film and transfer to the fridge to marinate for 20 minutes.", "Preheat a deep-fat fryer to 180C/350F. (CAUTION: Hot oil can be dangerous. Do not leave unattended).", "For the beer batter, mix the flour, bicarbonate of soda and a pinch of salt in a bowl. Stir in the cold beer and enough sparkling water to make a smooth batter (you may not need all the water). Leave to stand for 10 minutes.", "Whisk the egg white in a clean, dry glass bowl, until soft peaks form when the whisk is removed. Gently fold the egg white into the batter.", "For the chicken, put the flour on a plate. Toss the chicken in the flour until coated, shake off any excess and dip in the batter. ", "Deep-fry the chicken for 6-8 minutes, or until crisp, golden-brown and cooked through with no sign of pink in the juices when you cut the thickest strip in half. Remove using a slotted spoon and drain on kitchen paper. Season with salt and serve."]}, {"isVegetarian": false, "title": "Chicken, cider and apple casserole", "url": "www_bbc_co_uk_food_recipes_chicken_cider_and_apple_38859", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_cider_and_apple_38859_16x9.jpg", "ingredients": ["2 tbsp flour, seasoned with salt and freshly ground black pepper", "4 boneless (but not skinless, ideally) chicken breasts ", "3 tbsp light olive oil", "25g/1oz butter", "1 large onion, sliced", "1 large carrot, sliced", "2 celery stalks, trimmed and sliced", "½  tsp finely chopped fresh thyme", "175ml/6fl oz chicken or vegetable stock", "175ml/6fl oz dry cider", "1 large or 2 smaller Blenheim or Cox apples, peeled, sliced", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Pat the chicken breasts dry with kitchen paper then dip in the flour, shaking off any excess. ", "Heat a large, deep, lidded frying pan or casserole for a couple of minutes over a moderately high heat.  Add one tablespoon of oil then, when that is hot, add half the butter. ", "Place the chicken breasts in the pan, skin-side down and fry for 2-3 minutes, or until the skin is nicely browned. Turn the breasts over, turn the heat down and fry the other side for 1-2 minutes. Remove the chicken breasts to a plate, discard the fat in the pan and wipe it clean.", "Return the pan to a moderate heat and add the remaining oil and butter. Add the onion, carrot and celery, stir well, cover the pan and cook for five minutes, or until the vegetables are beginning to soften. ", "Stir in the thyme and any leftover flour. Add the chicken stock and cider, bring to the boil and add the sliced apples.  Turn the heat down and return the chicken pieces to the pan, spooning the vegetables and apple over them. Replace the lid and simmer for about 35-40 minutes, turning the chicken breasts over half way through. Add a little extra cider or chicken stock if needed. Check the seasoning, adding extra salt or pepper to taste."]}, {"isVegetarian": false, "title": "Chicken, confit fennel and artichoke, lemon and tarragon terrine", "url": "www_bbc_co_uk_food_recipes_chicken_confit_fennel_81334", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 chicken legs", "1 tbsp olive oil", "300ml/10fl oz duck fat ", "½ fennel bulb ", "3 globe artichokes, trimmed and chokes removed", "2 garlic bulbs", "1 lemon, zest only ", "2 tsp chopped thyme ", "1 small bunch basil, roughly chopped ", "1 small bunch tarragon, leaves picked ", "12 slices Parma ham", "salt and freshly ground black pepper", "salad leaves, to serve"], "serves": "Serves 6–8", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Preheat the oven to 190C/170C Fan/Gas 5. ", "Place the chicken legs in a large roasting tin, drizzle with oil and season with salt and pepper. Roast for 35–40 minutes, until cooked through. Set aside to cool. ", "Meanwhile, heat the duck fat in a large saucepan to 70C and confit the artichokes, fennel and garlic bulbs for 2 hours, until soft. ", "Discard the chicken skin, remove the meat from the bones and place in a bowl. Chop the confit fennel very finely and add to the chicken with the lemon zest, thyme, basil, and tarragon. Squeeze the garlic from its skins into the bowl, season with salt and pepper and mix well. ", "Line a large terrine mould with cling film, and lay the Parma ham slices width-ways along the mould so that each slice hangs over the edges. ", "Place half of the chicken mixture into the mould. Slice the artichokes and press them in a neat layer over the chicken. Top with the rest of the chicken, fold over the Parma ham and the cling film. Press with a weight such as tins of tomatoes and leave to set in the fridge overnight. ", "When ready to serve, turn out onto a board and remove the cling film. Use a sharp knife to cut slices and serve with some salad leaves on the side. "]}, {"isVegetarian": false, "title": "Chicken cordon bleu", "url": "www_bbc_co_uk_food_recipes_chicken_cordon_bleu_31848", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 skinless, boneless chicken breasts", "60g/2¼oz emmental cheese", "4 thin slices smoked ham (roughly 130g/4½oz)", "8 tsp cranberry sauce", "25g/1oz plain flour ", "2 medium free-range eggs", "200g/7oz golden breadcrumbs", "5 tbsp sunflower oil", "flaked sea salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put the chicken breasts on a board. Using a sharp knife, remove the mini-fillet and reserve to one side. Carefully cut horizontally through each breast from the straighter side almost all the way through to the other side and open out like a book. Cut the cheese into four rectangles, each around 1.5cm/½in wide and roughly half the size of a small matchbox.", "Take one of the opened breasts and its mini fillet and place between two sheets of cling film. Flatten both by bashing with a rolling pin until around 5mm thick all over. Remove the top layer of cling film and cover the flattened fillet with one slice of ham. Place a chunk of Emmental in the middle of the ham slice and top with two teaspoons of the cranberry sauce. ", "Use the flattened mini-fillet of chicken to cover the fillings and then carefully wrap the chicken breast up by bringing the pointy end of the chicken breast up over the cheese to insure it’s tucked neatly inside and, using the bottom layer of cling film, roll the breast up tightly and neatly insuring the cling film remains on the outside of the chicken to create a parcel. ", "Repeat the same method with the remaining three chicken breasts and put to one side.", "Sprinkle the flour onto a large plate and season with a couple of pinches of salt and lots of freshly ground black pepper. Whisk the eggs together in a shallow bowl. Scatter 50g/1¾oz of the breadcrumbs onto a large plate. ", "Dust one of the stuffed chicken breasts thoroughly in the seasoned flour and pat lightly to remove any excess. Roll the floured chicken in the egg and give it a light shake. ", "Place the chicken on the plate with the breadcrumbs and turn a couple of times, pressing with the breadcrumbs until well coated. Dip back in the egg and then coat in the breadcrumbs once more. This will make sure your crust is really crisp. Put the chicken on a baking tray and leave to stand.", "Flour, egg and coat the remaining chicken breasts in exactly the same way. You’ll need to add 50g/1¾oz of the breadcrumbs to the plate for each breast, throwing away the remaining crumbs from the previous batch as they will be very sticky. (The chicken breasts can now be covered and popped in the fridge until you are ready to cook them.)", "Preheat the oven to 220C/425F/Gas 7. Heat the sunflower oil in a large non-stick frying pan. Fry the chicken breasts over a medium high heat for 1-2 minutes on all four sides, or until golden-brown.", "Transfer the chicken to a baking tray and finish cooking in the oven for 25 minutes, or until the chicken is hot and thoroughly cooked - there should be no pinkness remaining. Serve immediately so that the cheese oozes out as it is cut."]}, {"isVegetarian": false, "title": "Chicken cordon bleu", "url": "www_bbc_co_uk_food_recipes_chicken_cordon_bleu_44159", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 boneless skinless chicken breasts", "175g/6oz emmental, cut into 8 chunks", "4 slices good-quality thick-cut ham", "salt and freshly ground black pepper", "75g/2¾oz plain flour", "3 free-range eggs, lightly beaten", "150g/5oz Japanese panko breadcrumbs", "150g/5oz butter", "300g/10½oz French beans, trimmed", "25g/1oz flaked almonds"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cut the chicken breasts in half horizontally nearly all the way through, then open each one out into a heart shape. ", "Lay a large sheet of cling film onto a work surface, place one butterflied chicken breast on top, then cover with a second sheet of cling film. Gently flatten the chicken breast with a meat mallet or rolling pin to a thickness of 1cm/½in. Discard the cling film.", "Repeat the process with the remaining chicken breasts. ", "Place 2 pieces of emmental onto one side of each flattened chicken breast. Fold over one slice of ham and place it on top of the cheese. Fold the other half of the chicken over the filling and press down lightly. Repeat the process with the remaining chicken breasts. ", "Sprinkle the flour onto a plate and season with salt and freshly ground black pepper. Beat the eggs in a bowl. Sprinkle the breadcrumbs onto a separate plate. ", "Dredge each filled chicken breast first in the flour, then dip it in the beaten egg, then roll it in the breadcrumbs to cover. ", "Heat 125g/4½ oz of the butter in a large frying pan over a medium heat. When the butter is foaming, add the chicken breasts (in batches if necessary) and fry for 4-5 minutes on one side, or until the breadcrumbs are golden-brown. Turn the chicken breasts over and fry for a further 4-5 minutes, basting the chicken with the butter in the pan at intervals. Try to keep the heat low enough to avoid burning the breadcrumbs or butter, but high enough to cook the chicken completely, until no trace of pink remains. ", "When the chicken breasts are cooked through, the coating is golden-brown and the cheese filling has melted, remove the chicken breasts from the pan and set aside on a warm plate. ", "Bring a pan of salted water to the boil, add the beans and cook for 3-4 minutes, or until just tender. Drain well. ", "Return the pan to the heat, add the remaining butter, then fry the flaked almonds for a few seconds until toasted. Return the beans to the pan, mix well, then season, to taste, with salt and freshly ground black pepper. ", "Serve the chicken cordon bleu on serving plates with a spoonful of beans alongside."]}, {"isVegetarian": false, "title": "Chicken croquetas with piquillo pepper mayo", "url": "www_bbc_co_uk_food_recipes_chicken_croquetas_with_26131", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75g/3oz butter", "200g/7oz plain flour", "500ml/18fl oz milk", "salt and freshly ground black pepper", "75g/3oz fresh breadcrumbs", "150g/5oz cooked chicken, chopped", "1 small bunch fresh tarragon, leaves picked and chopped", "75g/3oz plain flour", "2 free-range eggs, beaten", "75g/3oz panko Japanese breadcrumbs", "50g/1¾oz ground almonds", "rapeseed oil, for deep frying", "1 large bunch watercress, to garnish", "3 free-range egg yolks", "1-2 tsp English mustard", "100ml/3½fl oz rapeseed oil", "1 tbsp white wine vinegar", "75g/3oz piquillo peppers, roughly chopped", "1 tbsp flatleaf parsley, roughly chopped", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["For the croquetas, melt the butter in a large saucepan, then whisk in the flour and cook for 2-3 minutes. Whisk in the milk gradually until you have a very thick sauce. Season with salt and pepper.", "Stir in the fresh breadcrumbs, chicken and tarragon, then place in the fridge to chill for 3-4 hours.", "Shape the chilled mixture into 7cm/2¾in cylinders. Place the flour, beaten eggs and panko breadcrumbs in three separate bowls. Add the ground almonds to the panko breadcrumbs and mix well. Coat each cylinder in the flour, then egg and finish with a layer of breadcrumbs.", "Add the oil into a deep-fat fryer and preheat to 170C/338F. (Caution: Do not leave hot oil unattended.)", "Deep fry the croquetas in batches until golden-brown. Remove and drain on kitchen paper.", "For the mayonnaise, whisk the egg yolks with the mustard in a bowl and then gradually add the oil, whisking continuously. Stir through the vinegar, piquillo peppers and parsley, then season with salt and pepper.", "To serve, put the croquetas on a board with the watercress alongside and a bowl of pepper mayonnaise for dipping."]}, {"isVegetarian": false, "title": "Chicken curry with ginger and red pepper served with pilau rice", "url": "www_bbc_co_uk_food_recipes_chicken_curry_with_45089", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 tbsp vegetable oil", "8 chicken thighs, skin on, bone in", "2 large onions, finely sliced", "5 garlic cloves, chopped", "5cm/2in piece root ginger, chopped", "1 large red pepper, chopped", "2 tbsp tomato purée", "3 tbsp mild curry paste", "1 tbsp garam masala", "1 tbsp dry fenugreek leaves", "1 tbsp ground coriander", "¼ root turmeric, finely grated", "1 fresh red chilli, finely sliced", "½ bunch fresh coriander", "1 tbsp vegetable oil", "½ tsp cumin seeds", "3 cardamom pods", "1 cinnamon sticks", "½ tsp ground black pepper", "1 bay leaf", "500g/1lb 2oz basmati rice, rinsed and drained", "1 tsp salt", "50g/1¾oz unsalted butter"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the chicken thighs, put a large frying pan on a high heat and add two tablespoons of oil. Once hot, add the chicken thighs skin-side down and cook for 3-4 minutes, or until golden-brown on each side. Put the chicken on a plate and set aside.", "Heat a large frying pan and add the rest of the oil. Once hot, add the onions, garlic, ginger and red pepper. Cook until soft, then remove from the heat and leave to cool. Tip the mixture into a blender or food processor and blend until smooth.", "Add the purée back to the pan and cook over a low heat for 5-10 minutes.", "Add the tomato purée, curry paste, garam masala, fenugreek leaves, ground coriander and fresh turmeric and cook for a further five minutes.", "Place the chicken thighs back in the sauce and simmer for 20 minutes.", "For the pilau rice, heat a large saucepan and add the oil. Once hot, add the cumin, cardamom, cinnamon, black pepper and bay leaf. Once they start to pop, add the rice and continue to stir until the rice is lightly toasted. ", "Add 650ml/1¼ pint water and the salt and bring to the boil. Place a lid on top and turn the heat to low. Leave to steam for 20-30 minutes.", "Just before serving mix in the butter with a fork.", "To serve, place the rice on the plate and the curry to one side. Garnish with the chilli and coriander."]}, {"isVegetarian": false, "title": "Coconut chilli chicken", "url": "www_bbc_co_uk_food_recipes_chicken_curry_with_59058", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_curry_with_59058_16x9.jpg", "ingredients": ["3 plump stalks lemongrass ", "50g/2oz fresh ginger ", "2 hot red chillies", "2 cloves garlic", "a bunch coriander ", "2 limes", "2 tbsp groundnut oil", "200g/7oz tomatoes", "2 tbsp fish sauce (nam plah)", "2 tbsp dark soy sauce", "8 chicken thighs", "400ml/14oz can coconut milk", "8 apricots, halved"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Peel and discard the outer leaves of the lemongrass- they can sometimes be tough. Cut the inner leaves into short lengths and put in the food processor. Peel the ginger, then slice into thin pieces and add to the lemongrass. Chop the chillies, discarding their stems and add to the ginger with the peeled garlic. Roughly chop the stems and half of the leaves of the coriander to add to the food processor, reserving the rest for later.", "Grate the lime zest into the food processor, reserving the limes for later, then turn the machine on and let it chop everything to a coarse paste. Add a little groundnut oil and scrape the sides down with a spatula if it sticks. Add the fish sauce, soy sauce and the tomatoes and process for a few seconds longer.", "Warm a further tablespoon of groundnut oil in a deep pan over a moderate to high heat and use it to brown the chicken pieces, turning them so they colour nicely on both sides. Lift the chicken pieces out and pour away anything more than a tablespoon of oil and juices. Add the spice paste and let it fry over a moderate heat for two minutes till fragrant, stirring almost constantly, then return the chicken to the pan. Pour over the coconut milk, stir, cover and leave to simmer over a low heat for 15-20 minutes. Meanwhile halve and stone the apricots and leave them to one side.", "Test the chicken for doneness making certain it’s cooked right the way through, then add the apricots. Leave to simmer for a few minutes, then add the juice of the limes and the reserved coriander leaves. "]}, {"isVegetarian": false, "title": "Chicken curry with basmati rice", "url": "www_bbc_co_uk_food_recipes_chicken_curry_with_83629", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_curry_with_83629_16x9.jpg", "ingredients": ["3 tbsp desiccated coconut", "200g/7oz basmati rice", "40g/1¾oz butter", "1 tbsp vegetable oil", "1 onion, finely sliced", "50g/2oz medium-strength curry paste", "4 small chicken breasts, skinned and cut into 2cm/1in slices", "200g/7oz canned tomatoes", "300ml/10½fl oz coconut milk", "2 tbsp chopped fresh coriander leaves", "2 tbsp chopped fresh mint leaves", "1 lime, juice only", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to medium heat. Sprinkle the coconut onto a baking tray and toast under the grill until just golden-brown. Set aside.", "Put  the basmati rice in a lidded saucepan then cover with 400ml/¾ pint cold water. Add half of the butter, then cover the pan, place it over a high heat and bring just to the boil. Reduce the heat to its lowest setting and cook the rice for 12-15 minutes, or until the rice has absorbed all the water and is just tender.", "Meanwhile, heat the vegetable oil in a frying pan over a medium heat. Add the onion and stir-fry for 2-3 minutes, or until just softened. Add the curry paste and stir-fry for a further minute.", "Add the chicken to the pan and stir well to coat it in the sauce. ", "Add the tomatoes and coconut milk, stir well and bring the mixture to the boil, then reduce the heat until the mixture is simmering and simmer for 10 minutes, or until the chicken is cooked through and the sauce has thickened slightly.", "Stir in the chopped coriander, mint and lime juice, then stir in the remaining butter and season, to taste, with salt and freshly ground black pepper.", "To serve, fluff the cooked rice using a fork, then divide it equally among four serving plates. Spoon a ladleful of chicken curry on top of each portion of rice. Garnish with a sprinkling of desiccated coconut."]}, {"isVegetarian": false, "title": "Chicken dhansak curry", "url": "www_bbc_co_uk_food_recipes_chicken_dhansak_curry_98040", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_dhansak_curry_98040_16x9.jpg", "ingredients": ["low-calorie cooking spray", "2 onions, finely chopped", "6-8 chicken thighs, boned, skinned and all visible fat removed", "2 garlic cloves, crushed", "20g/¾oz ginger, finely grated", "2 tsp garam masala", "½ tsp hot chilli powder", "400g tin chopped tomatoes", "600ml/20floz chicken stock, made with 1 chicken stock cube", "100g/3½oz dried red split lentils, rinsed and drained", "2 bay leaves", "200g/7oz wholegrain long grain rice", "150g/5½oz fat-free natural yoghurt", "1 tbsp roughly chopped fresh coriander leaves"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Spray a wide-based saucepan or sauté pan with oil and place over a medium heat. Cook the onions for five minutes, stirring regularly, until softened and very lightly browned.", "Cut the chicken thighs in half and add to the pan. Cook for two minutes, turning occasionally. Stir in the garlic, ginger, garam masala and chilli powder and cook for a few seconds, stirring constantly. ", "Tip the tomatoes into the pan and add the chicken stock, lentils and bay leaves. Bring to the boil, then cover loosely with a lid and simmer gently for 35 minutes, or until the chicken is tender and the lentils have completely broken down, stirring occasionally. Remove the lid for the last 10 minutes of cooking time, stirring regularly so the lentils don’t stick.", "About 25 minutes before the curry is ready, cook the rice in plenty of boiling water until tender, then drain well.", "Season the curry to taste. Serve with the rice, topped with yoghurt and sprinkled with coriander."]}, {"isVegetarian": false, "title": "Chicken fajita drumsticks with Mexican corn salad", "url": "www_bbc_co_uk_food_recipes_chicken_drumsticks_with_66853", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_drumsticks_with_66853_16x9.jpg", "ingredients": ["12 chicken drumsticks", "1 tbsp paprika", "1 tbsp ground cumin", "4 garlic cloves", "1 tbsp vegetable oil", "6 large tortilla wraps", "approx 200g tin sweetcorn, rinsed and drained", "1 red pepper", "2 spring onions", "half a lemon, juice only", "salt and pepper"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. Tip the chicken into a large roasting tray and sprinkle over the spices. Lightly crush the garlic, leaving the skins on, and add to the tray with the chicken. Drizzle with the oil and season with salt and pepper. Roast for 30 minutes, turning halfway through cooking, until the chicken is lightly charred on the outside and perfectly cooked inside.", "While the chicken is cooking, make the salad. Tip the sweetcorn into a bowl then finely chop the pepper (removing the seeds) and add to the bowl. Finely slice the spring onions then add to the bowl along with a squeeze of lemon juice. Season to taste with salt and pepper.", "Shred the chicken from the bone and then wrap in tortilla wraps with the salad."]}, {"isVegetarian": false, "title": "Chicken en croûte", "url": "www_bbc_co_uk_food_recipes_chicken_en_croute_94416", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz buffalo mozzarella, chopped", "12 fresh basil leaves, shredded", "20 sun-blush tomatoes, chopped", "4 x chicken breasts", "4 pieces puff pastry, 15cm/6in square, 3mm/⅛in thick", "1 egg, beaten "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Mix the mozzarella, basil and sun-blush tomatoes together in a bowl.", "Cut a pocket in each of the chicken breasts and stuff with the mozzarella mixture.", "Place a stuffed chicken breast into the middle of each square of puff pastry and roll up into parcels.", "Brush each parcel with the beaten egg and bake in the oven for 25-30 minutes, or until risen and golden-brown."]}, {"isVegetarian": false, "title": "Chicken escalope with tomato and artichoke salad", "url": "www_bbc_co_uk_food_recipes_chicken_escalope_with_49951", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 heritage tomatoes, halved widthways", "4 tbsp olive oil", "salt and black pepper", "6 sprigs thyme, leaves picked", "2 Little Gem lettuces, separated into leaves", "25g/1oz baby leaf spinach", "150g/5½oz chargrilled artichokes", "100g/3½oz baby mozzarella balls", "1 tbsp sherry vinegar", "1 tbsp red wine vinegar", "3 tbsp olive oil", "1 lemon, cut into wedges to serve", "60g/2¼oz Japanese panko breadcrumbs", "25g/1oz parmesan cheese, freshly grated", "1 lemon, zest only", "4 chicken breasts, boneless and skinless", "8 slices Parma ham", "75g/2½oz plain flour", "salt and black pepper", "2 free-range eggs, beaten", "2 tbsp olive oil", "50g/1¾oz butter"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the tomato and artichoke salad, preheat the oven to 150C/300F/Gas 2 (or its lowest setting).", "Place the tomatoes, cut-side up onto a roasting tray and drizzle with the olive oil.", "Season with salt and black pepper then scatter half the thyme leaves over the top.", "Place in the oven and roast for 4-6 hours, or until slightly dried out. Turn the oven off and allow to cool, preferably overnight in the oven.", "For the chicken escalope, preheat the oven to 220C/425F/Gas 7.\r\n", "Place the breadcrumbs, parmesan and lemon zest into a food processor and pulse to form fine crumbs.", "Place the chicken breasts between two sheets of cling film or baking parchment and using a rolling pin bash until flattened out. Wrap the chicken breasts in the Parma ham.", "Season the flour with salt and black pepper then dust the chicken in the flour.", "Place the beaten egg in a shallow bowl. Dip the chicken in the beaten egg then into the breadcrumbs, making sure to coat each side thoroughly.", "Heat the olive oil and the butter in a large frying pan then add the chicken breasts, one at a time, and fry for two minutes on each side, or until golden-brown. Transfer to the oven to finish cooking. When the chicken is cooked through, place onto kitchen paper to drain.", "For the tomato and artichoke salad, place the lettuce and baby spinach in a large bowl and add the cooled tomatoes, artichokes and mozzarella balls.", "In a small bowl combine the vinegars and olive oil. Season with salt and pepper and whisk to combine. Pour the dressing over the salad, add any oil from the artichoke too, and toss to coat.", "To serve, place the chicken escalope on a serving plate with the salad next to it and a wedge of lemon."]}, {"isVegetarian": false, "title": "Chicken fajitas with tomato salsa", "url": "www_bbc_co_uk_food_recipes_chicken_fajitas_with_07231", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_fajitas_with_07231_16x9.jpg", "ingredients": ["1 small red onion, finely chopped", "425g/15oz small vine-ripened tomatoes, chopped", "2 garlic cloves, crushed", "large handful of fresh coriander leaves, chopped", "freshly ground black pepper", "1 tbsp olive oil", "1 large red onion, thinly sliced", "1 red pepper, cored, deseeded and thinly sliced", "1 yellow pepper, cored, deseeded and thinly sliced", "450g/1lb chicken breasts, skinned and cut into thin strips", "pinch paprika", "pinch mild chilli powder", "pinch cumin", "pinch dried oregano", "4 soft wholemeal tortillas", "½ iceberg lettuce, finely shredded"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. ", "For the salsa. Combine the onion, tomatoes, garlic and coriander in a bowl. Season with freshly ground black pepper. Cover and chill for 30 minutes.", "For the chicken, heat the oil in a wok or large nonstick frying pan, add the onion and peppers and stir-fry for 3-4 minutes. Add the chicken, paprika, chilli powder, cumin and oregano and cook for 5 minutes, or until the chicken is cooked through.", "Meanwhile, wrap the tortillas in foil and warm them in the oven for 5 minutes.", "Spoon one-quarter of the chicken mixture into the centre of each tortilla, add a couple of tablespoons of salsa and some shredded lettuce. Roll up and serve warm."]}, {"isVegetarian": false, "title": "Chicken fricassée", "url": "www_bbc_co_uk_food_recipes_chicken_fricasse_02463", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_fricasse_02463_16x9.jpg", "ingredients": ["500ml/18fl oz chicken stock", "200ml/7fl oz white wine", "125g/4½oz pearl onions", "3 sprigs thyme, leaves only", "1.5kg/3lb 5oz whole chicken, cut into 8 pieces, plus the rest of the carcass", "200g/7oz baby button mushrooms", "4 free-range egg yolks", "150ml/5fl oz double cream", "salt and freshly ground black pepper", "2 tbsp finely chopped flatleaf parsley", "1kg/2lb 4oz floury potatoes, peeled and cut into chunks", "150g/5½oz butter", "150ml/5fl oz full-fat milk or cream", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place a large casserole over a high heat, add the stock, white wine, pearl onions and thyme and bring to a simmer.", "Add the chicken, including the carcass and return to a simmer.", "Add the button mushrooms, then cover and simmer for about 15-20 minutes, or until the chicken is cooked through.", "Remove the casserole from the heat and lift out the chicken, discarding the carcass.", "Whisk the egg yolks and cream together in a bowl, then gradually add to the casserole, mixing well as you pour – if the pan is too hot, the eggs will cook too quickly and curdle the sauce.", "Return the chicken to the pan then check the seasoning, adding salt and freshly ground black pepper, to taste. Finally stir in the parsley.", "For the mash, place the potatoes into a pan of cold, salted water and bring to the boil.", "Reduce the heat and simmer for 12-15 minutes, or until the potatoes are tender.", "Drain and return to the pan, then place over a low heat for a couple of minutes to dry the potatoes slightly.", "Tip the potatoes back into a colander and then pass through a ricer.", "Add the butter and milk (or cream) and beat to form a very smooth mash, then season to taste with salt and black pepper.", "To serve, spoon the mash into bowls, then top with two pieces of chicken and a ladleful of sauce."]}, {"isVegetarian": false, "title": "Chicken goujons with almond satay sauce and a ponzu dressing", "url": "www_bbc_co_uk_food_recipes_chicken_goujons_with_82425", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz beansprouts ", "50g/1¾oz mangetout, finely sliced into sticks ", "50g/1¾oz carrot, finely sliced into sticks ", "2 tbsp dashi stock (available from some large supermarkets)", "1 tbsp stock syrup (see tip) ", "1 tbsp rice wine vinegar ", "½ tbsp fish sauce ", "3 tbsp lemon juice ", "50ml/2fl oz soy sauce ", "1 tbsp each of oil and butter ", "2 shallots, finely chopped ", "1½ garlic cloves, finely chopped ", "60g/2¼oz fresh root ginger, finely grated ", "300g/10½oz almonds, chopped and toasted ", "4 tbsp clear honey ", "5 tbsp chicken stock", "5 tbsp soy sauce ", "1 lime, juice only ", "1 red chilli, finely chopped ", "small handful coriander leaves, finely chopped ", "vegetable oil, for deep frying ", "75g/2½oz plain flour", "2 medium free-range eggs, beaten", "100g/3½oz Japanese panko breadcrumbs", "4 large chicken breasts, skinless and boneless, cut into strips", "few sprigs coriander, to garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Mix the vegetables together and set aside. ", "For the ponzu dressing, mix all the ingredients together, pour into a container and set aside. ", "For the almond satay, melt the butter and oil in a saucepan. Add the shallot and garlic and gently fry until soft, but not coloured. Add the ginger and cook for 5 minutes. Stir in the almonds, honey, stock, soy sauce and lime juice. Cook for 2 minutes more or until combined. Remove from the heat, then stir in the chilli and coriander. Set aside.", "For the chicken goujons, preheat a deep-fat fryer to 180C. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Place the flour, eggs and breadcrumbs in separate shallow bowls. Dredge the chicken strips in the flour, then dip in the egg and coat in breadcrumbs.", "Lower the chicken goujons into the hot oil (you may need to do this in batches) and cook for 5 minutes or until the chicken is cooked through and the breadcrumbs golden-brown. Remove using a slotted spoon and drain on kitchen paper.", "Serve the chicken goujons with the raw vegetables alongside. Pour over a spoonful of warm almond satay, then 3 tablespoons of ponzu dressing. Garnish with a few coriander leaves."]}, {"isVegetarian": false, "title": "Chicken in a creamy mushroom sauce", "url": "www_bbc_co_uk_food_recipes_chicken_in_a_creamy_84614", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_in_a_creamy_84614_16x9.jpg", "ingredients": ["spray olive oil", "2 chicken breasts, skinless and trimmed (200g/7oz each)", "½ onion, finely chopped", "1 fat garlic clove, crushed ", "100g/3½oz mixed or chestnut mushrooms, sliced", "250ml/9fl oz chicken stock (made with ½ a stock cube)", "salt and pepper", "100ml/3½fl oz half-fat crème fraîche ", "1 tbsp freshly chopped parsley, for garnish", "300g/10½oz broccoli, steamed, to serve"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the spray oil in a non-stick frying pan, add the chicken breasts and fry for about 10 minutes, or until well browned on both sides. Set aside.", "In the same pan, add a little more oil and fry the onion for 2–3 minutes, or until translucent. Add the garlic and fry for another 1–2 minutes. Add the mushrooms and fry until golden-brown. If they start to stick, add a little stock to the pan.", "Return the chicken to the pan and stir in the stock. Bring to the boil. Cover with a tight fitting lid, lower the heat and simmer for 12–15 minutes, or until the chicken is cooked through. Season with salt and pepper.", "Meanwhile, cook the broccoli in boiling salted water until tender.", "Stir the crème fraîche and parsley into the sauce and serve immediately with the broccoli."]}, {"isVegetarian": false, "title": "Chicken, halloumi and green chilli spring roll with carrot and raisin yoghurt salad", "url": "www_bbc_co_uk_food_recipes_chicken_halloumi_and_45727", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "2 chicken legs, skin removed", "½ tsp ground cumin", "½ tsp dried mint", "1 bay leaf", "4 shallots, peeled and sliced", "110ml/4fl oz chicken stock", "3 tbsp roughly chopped  flatleaf parsley", "200g/7oz halloumi cheese, crumbed", "3 small green chillies, seeds removed and sliced ﬁnely", "16 sheets of filo pastry, each 10cm/4in x 10cm/4in", "5-6 tbsp melted butter, for brushing", "1-2 tbsp sesame or hemp seeds", "2 tbsp extra virgin olive oil", "300g/11oz carrots, peeled, grated medium coarse ", "300g/11oz thick, strained yoghurt ", "½ tbsp good quality mayonnaise", "3 tbsp raisins", "2 garlic cloves, crushed", "½ tsp ground cumin", "salt and freshly ground black pepper", "2 tbsp fresh chives, finely chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the spring rolls, preheat the oven to 180C/350F/Gas 4. Heat an ovenproof frying pan until hot, add the olive oil and chicken and lightly brown the chicken.", "Add the cumin, mint, bay leaf and shallots and fry for for 1-2 minutes.", "Add the stock, bring to a simmer, then cover with a lid and place in the oven to cook for 30 minutes, or until the chicken is cooked through.", "Remove the chicken and place to one side until it is cool enough to handle. Set aside the stock, then pull the meat off the chicken and shred it into a bowl, discarding the skin and bones.", "Add the shallots and stock from the chicken, along with the parsley, the crumbled cheese and green chillies to the chicken, and give it a good mix. ", "Heat a deep fat fryer to 180C/350F or turn the oven up to 200C/400F/Gas 6. (CAUTION: Do not leave hot fat unattended.)", "Place a filo sheet on a clean work surface.  ", "Spoon some chicken filling onto one end of the filo sheet, pull the bottom over and roll up.  Close in the sides, brush with melted butter and seal. Sprinkle with the sesame or hemp seeds. Repeat to use up all the filling and filo.", "Arrange the rolls onto a tray and bake for 5-6 minutes, or until golden (or place in a deep fat fryer and cook for 3-4 minutes, or until golden-brown and hot through).", "For the carrot and raisin yoghurt salad, heat a frying pan until hot, add the olive oil and carrot and fry for two minutes over a medium heat. The carrot should be wilted, but not brown. Remove and place into a bowl to cool.", "Once the carrot has cooled, add the yoghurt, mayonnaise, raisins, garlic and cumin. ", "Stir well to combine and season to taste with salt and freshly ground black pepper.", "Sprinkle with the chives and serve.", "To serve, pile the spring rolls onto a plate and spoon the salad alongside."]}]