[{"ingredients": ["4 escalopes de pavo", "4 cucharadas de harina normal", "1 cucharadita de pimentón molido", "1 cucharadita de mostaza inglesa", "6 huevos medianos de granja", "Pan rallado blanco de 250g / 9oz", "2 cucharadas de aceite de oliva", "aceite vegetal, para freír", "16 filetes de anchoas en conserva", "2 cucharadas de vinagre de jerez", "170g / 6oz de mantequilla sin sal", "2 cucharadas de alcaparras sin papas", "1 cucharada de perejil fresco picado"], "method": ["Cortar el escalope de pavo y aplanar con un martillo de carne (alternativamente colocar entre dos pedazos de película y libra con un rodillo).", "En un recipiente poco profundo, mezcle la harina, el pimentón, la mostaza en polvo, la sal y la pimienta juntas. En un recipiente aparte, bate dos de los huevos.", "Pasar los escalopes de pavo a través de la mezcla de harina, dragar en huevo batido y cubrir en pan rallado, sacudiendo cualquier exceso en cada etapa.", "Calentar un poco de aceite de oliva en una sartén grande. Freír el pavo con la cara de presentación hacia abajo primero hasta que se dore (puede necesitar hacer esto por lotes). Voltee y fríe el otro lado hasta que esté cocido. Retire de la sartén y escurra sobre papel de cocina.", "Calentar una sartén por separado y freír los huevos restantes en aceite vegetal hasta que estén cocidos a su gusto.", "Coloque los escalopes en los platos para servir, con los huevos fritos encima. Coloque las anchoas alrededor del plato.", "Deseche el exceso de grasa de la sartén y agregue el vinagre. Cocine a fuego lento hasta que el volumen del líquido se haya reducido a la mitad. Agite la mantequilla y cuele a través de un colador fino en una sartén limpia. Agregue las alcaparras y el perejil. Vierta la salsa sobre los huevos y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_turkey_holstein_14324", "title": "Turquía Holstein", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "2 cucharadas de harina", "sal y pimienta negra recién molida", "4 muslos de pavo, piel en", "1 cebolla picada", "2 zanahorias picadas", "2 palitos de apio picados", "2 dientes de ajo, aplastados", "2 ramitas de tomillo, atadas juntas", "2 hojas de laurel", "6 tomates, cortados en cuartos", "1 cucharadita de azúcar", "300 ml / ½ pinta de caldo de pollo", "125ml / 4fl oz de vino blanco seco", "1 naranja, ralladura solamente, rallado", "1 cucharada de perejil picado", "gran manojo de perejil", "2 cucharadas de alcaparras", "2 cucharadas de cornichons picados", "12 filetes de anchoa", "3 dientes de ajo, pelados y finamente picados", "3 cucharadas de vinagre de vino tinto", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 170C / 340F / Gas 3½.", "Caliente el aceite de oliva en una cazuela para horno. Ponga la harina en un bol, sazone con sal y pimienta.", "Cubra los muslos con harina y sacuda el exceso. Freír primero en la cazuela con la piel hacia abajo y luego aplicar color por todas partes. Retire la carne de la sartén y reserve.", "Coloque la cebolla, la zanahoria y el apio en la cazuela y fría hasta que estén dorados, luego agregue el ajo, el tomillo y las hojas de laurel.", "Agregue los tomates y el azúcar a la cazuela y coloque los muslos sobre las verduras en una sola capa.", "Cubrir con caldo y vino blanco y llevar a ebullición. Cubra con un círculo de papel resistente a las grasas y una tapa.", "Cocine en el horno durante aproximadamente dos horas, o hasta que esté bien cocido.", "Levante con cuidado el pavo de la cazuela y déjelo en un lugar cálido. Para espesar la salsa (si es necesario) hierva el licor de cocción y cocínelo hasta que el volumen del líquido se haya reducido.", "Para la salsa verde, coloque todos los ingredientes en un tazón y mezcle.", "Mezcle la ralladura de naranja y el perejil.", "Para servir, ponga un muslo en cada plato de servir y vierta sobre la salsa. Espolvorear con la ralladura y el perejil y servir con la salsa verde."], "url": "www_bbc_co_uk_food_recipes_turkey_osso_bucco_with_47340", "title": "Turquía osso bucco con salsa verde", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite vegetal", "100g / 3½ oz de tocino ahumado lardons", "1 cebolla, en rodajas", "1 diente de ajo, aplastado", "2 zanahorias picadas", "200g / 7oz de pavo sobrante, rallado", "1 chile rojo, picado", "1 cucharada de puré de tomate", "200ml / 7fl oz de vino tinto", "100 ml / 3½ oz de caldo de pollo", "1 huevo de gallina, batido para lavar huevos", "Pasta de copos de 250g / 10oz"], "method": ["Calentar el aceite en una sartén a fuego medio. Freír los lardons de tocino hasta que estén crujientes. Retire los lardons con una espumadera y déjelos a un lado.", "En la misma sartén, freír las cebollas y el ajo durante 5-6 minutos, o hasta que estén dorados y suaves.", "Agregue el resto de los ingredientes, excepto el huevo y la masa. Llevar la mezcla a ebullición y hervir a fuego lento durante 25 minutos. Dejar de lado para enfriar.", "Precalentar el horno a 180 ° C / 350 ° F / Gas 5.", "Divida la mezcla entre cuatro platos individuales. Corta la masa en cuatro pedazos, cada uno lo suficientemente grande como para cubrir el plato de tarta. Cepille el borde de cada plato con huevo y cúbralo con la masa. Recorte cualquier exceso de masa y cepille la tapa con el resto de la colada de huevo.", "Cocine por 20-25 minutos hasta que la tapa esté crujiente y dorada."], "url": "www_bbc_co_uk_food_recipes_turkey_pot_pie_09104", "title": "Cazuela de pavo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/turkey_pot_pie_09104_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 medallones de pavo, filetes o escalopes, alrededor de 150 g / 5½ oz cada uno (puede ser un poco más pequeño)", "1 cucharada de harina normal", "sal y pimienta negra recién molida", "8 hojas de salvia", "8 rebanadas de jamón de Parma", "2-3 cucharadas de aceite de oliva", "15-30 g / ½-1 onza de mantequilla", "1 limón, ralladura solamente", "1 cucharadita de salvia seca", "250ml / 9fl oz de vino Marsala", "100 ml / 3½ fl oz de caldo de pollo", "1 papa grande, pelada", "sal"], "method": ["Primero prepara el pavo. Coloque cada filete entre dos pedazos grandes de película adhesiva. Colóquelo en una superficie de trabajo, luego bata con un mazo de carne o un rodillo hasta que quede lo más delgado posible sin que se rompa. Repita con el pavo restante. Corta cada escalope por la mitad.", "Sazone la harina con sal y pimienta y luego use para quitar el polvo del pavo aplastado. Elimine cualquier exceso. Coloque una hoja de salvia en el centro de cada pedazo de pavo, luego envuelva una rebanada de jamón de Parma alrededor.", "Caliente el aceite de oliva y la mantequilla en una sartén grande. Freír 2-3 escalopes (dependiendo del tamaño de la sartén) en cada lado durante 3-4 minutos, o hasta que la carne esté completamente cocida y el jamón se haya crujido. Sacar de la sartén y mantenga caliente. Agregue más aceite y mantequilla y continúe como antes.", "Cuando haya cocinado todos los escalopes, suba el fuego. Agregue la ralladura de limón, salvia seca y Marsala a la sartén. Deje hervir a fuego lento durante un par de minutos hasta que el Marsala parezca almibarado, luego agregue el caldo de pollo. Continúe cocinando hasta que la salsa parezca almibarada.", "Para las fichas del juego, corta la patata en rondas muy finas, preferiblemente con mandolina. Cubra con agua fría en un tazón de 10 a 15 minutos para ayudar a eliminar parte del almidón. Escurra y seque lo más posible con un paño de cocina o toalla de cocina.", "Llene la mitad de una olla o freidora con aceite vegetal. Calor a 180C. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido). Si no tiene un termómetro, pruebe el calor del aceite dejando caer un cubo de pan: debe crujir y dorar en 30 segundos.", "Freír las astillas unas cuantas a la vez en el aceite; terminan cuando han flotado hacia la superficie y se han vuelto doradas. Retirar del aceite y continuar con las rodajas de patata restantes. Espolvorea con sal y sirve inmediatamente.", "Sirve el saltimbocca de pavo con la salsa derramada y las fichas del juego en el lateral."], "url": "www_bbc_co_uk_food_recipes_turkey_saltimbocca_78349", "title": "Turquía saltimbocca", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 medallones de pechuga de pavo", "12 lonchas pequeñas de jamón", "12 pequeñas hojas de salvia", "1 cucharada de aceite de oliva", "115g / 4oz de mantequilla sin sal", "sal y pimienta", "2 cucharadas de caldo de pollo", "2 cucharadas de vino blanco seco", "exprimir jugo de limón fresco", "2 cucharadas de perejil picado"], "method": ["Coloque cada medallón de pavo entre las hojas de película adhesiva y use un rodillo para aplanarlos.", "Deseche la película adhesiva y coloque una hoja de salvia y una rodaja de jamón en cada trozo de pavo. Asegúrelo en su lugar con palitos de cóctel.", "Caliente el aceite de oliva en una sartén y luego agregue 25 g / 1 oz de la mantequilla. Cocine los medallones, prosciutto hacia arriba, luego voltee y cocine el otro lado. Retire de la sartén y colóquelo en papel de cocina. Condimentar con sal y pimienta.", "Retire el exceso de grasa de la sartén y agregue el caldo de pollo y el vino blanco. Llevar a ebullición y luego cocine a fuego lento hasta que el volumen de líquido se reduzca a la mitad. Colar en una sartén limpia y agregar un chorrito de jugo de limón.", "Agregue el resto de la mantequilla, pruebe y compruebe que el condimento es de su agrado.", "Agregue el perejil y sirva con el pavo."], "url": "www_bbc_co_uk_food_recipes_turkey_saltimbocca_34007", "title": "Turquía saltimbocca", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pechuga de pavo, sin piel y sin hueso, cortado en cuatro rebanadas delgadas", "4 rebanadas grandes de Gruyère, de aproximadamente 3 mm de grosor", "4 rebanadas grandes de jamón cocido", "4 hojas sabias", "4 ramitas largas de romero, agujas retiradas del tercio inferior y el extremo afilado para hacer un pincho", "150 g / 5½ oz de mantequilla", "2 cucharadas de aceite de oliva", "110ml / 4fl oz de vino Marsala", "½ limón, solo jugo", "2 cucharadas de perejil picado", "sal y pimienta negra recién molida", "200g / 7oz de judías verdes, recortadas", "50g / 1¾oz de mantequilla", "Repollo negro 200g / 7oz", "nuez moscada recién rallada", "1 limón, cortado en cuñas"], "method": ["Para el pavo, coloque las rodajas de pavo entre dos pedazos de película adhesiva y luego use un rodillo o un martillo para carne para presionar hasta aproximadamente 5 mm / ¼ de grosor.", "Retire la película adhesiva y coloque el queso sobre la mitad de las rebanadas de pavo, cubra con el jamón y la salvia y sazone con sal y pimienta negra recién molida.", "Doble la otra mitad del pavo sobre la parte superior y presione ligeramente hacia abajo. Asegure el borde con el pincho de romero.", "Caliente 50 g / 1¾ oz de la mantequilla y el aceite de oliva en una sartén. Agregue el paquete de pavo y fría en cada lado durante 2-3 minutos hasta que el pavo esté bien cocido y el queso apenas esté comenzando a salir.", "Agregue el Marsala y el glaseado raspando los jugos caramelizados de la base de la sartén. Cocine hasta que el líquido se haya reducido lo suficiente como para cubrir el pavo.", "Retire el pavo de la sartén y colóquelo en un plato para que descanse.", "Regrese la sartén al fuego, agregue la mantequilla restante y caliéntela hasta que se vuelva marrón-nuez (para hacer un noisette de beurre). Agregue el jugo de limón y el perejil y revuelva. Sazone al gusto con un poco de sal y pimienta negra recién molida.", "Para la guarnición, ponga a hervir un sartén con agua con sal, agregue los frijoles y cocine a fuego lento durante 3-4 minutos, o hasta que estén tiernos.", "Escurra, mezcle con un poco de mantequilla y sazone al gusto con sal y pimienta negra recién molida.", "Caliente una sartén hasta que esté medianamente caliente, agregue la mantequilla restante, el cavolo nero y 50ml / 1¾fl oz de agua. Cocine suavemente hasta que el repollo esté tierno. Sazone al gusto con sal, pimienta negra y un poco de nuez moscada recién rallada.", "Para servir, coloque un paquete de pavo en cada plato y apile los frijoles y el cavolo nero al costado. Con una cuchara, coloca el beurre noisette en la parte superior y termina con un chorrito de limón."], "url": "www_bbc_co_uk_food_recipes_turkey_saltimbocca_with_13526", "title": "Salimbocca de pavo con perejil beurre noisette, frijoles y cavolo nero", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["25 g / 1oz de mantequilla sin sal", "1 diente de ajo, aplastado", "1 chalote, finamente picado", "100 g / 3½ oz de champiñones castaños, finamente picados", "100g / 3½ oz champiñones, finamente picados", "2 cucharadas de estragón fresco picado", "1 pechuga de pavo, sin piel y sin hueso, cortado en 4 rebanadas delgadas", "4 rebanadas de jamón de Parma", "sal y pimienta negra recién molida", "100g / 3½oz de harina blanca normal", "2 huevos de gallinas camperas, golpeados", "Pan rallado pancho japonés de 100 g / 3½ oz", "150 g / 5½ oz de mantequilla", "2 cucharadas de aceite de oliva", "exprimir jugo de limón", "1 cucharada de perejil picado", "2 cucharadas de aceite de oliva", "1 diente de ajo, picado", "1 chalote, picado", "1 calabaza, pelada y cortada en cubos pequeños", "Anís de 2 estrellas"], "method": ["Para saltimbocca, precalentar el horno a 200C / 400F / Gas 6.", "Caliente una sartén y, una vez caliente, agregue la mantequilla. Agregue el ajo y la chalota y cocine por 2-3 minutos. Agregue las setas picadas y cocine durante 2-3 minutos más, luego agregue el estragón.", "Coloque las rodajas de pavo entre dos pedazos de película adhesiva, luego use un rodillo o un martillo de carne para presionar hasta aproximadamente 5 mm / ¼ de grosor. Deseche la película adhesiva.", "Coloque el jamón y los champiñones cocidos en la mitad de cada rebanada de pavo. Sazonar con sal y pimienta negra recién molida. Doble la otra mitad de la rodaja de pavo sobre la parte superior y presione ligeramente hacia abajo.", "Pon la harina, el huevo y las migas de pan en tres cuencos poco profundos. Teniendo cuidado de no permitir que se escape el relleno, pasa el pavo primero a través de la harina, luego el huevo y luego cúbrelo en pan rallado.", "Calentar la mantequilla y el aceite de oliva en una sartén. Agregue las papas de pavo y fría en cada lado durante 2-3 minutos hasta que se doren.", "Transfiera al horno por 5-10 minutos, o hasta que esté cocido.", "Para la calabaza tostada, caliente una sartén grande y agregue el aceite. Una vez caliente, agregue el ajo y la chalota y cocine por 2-3 minutos. Agregue la calabaza y el anís estrellado y cocine durante cinco minutos o hasta que la calabaza se haya cocinado. Retire el anís estrellado.", "Sirve la calabaza con el pavo saltimbocca. Termine con un chorrito de jugo de limón y espolvoree con perejil."], "url": "www_bbc_co_uk_food_recipes_turkey_saltimbocca_with_78094", "title": "Turquía saltimbocca con champiñones y calabaza", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de girasol", "2 cucharadas de jugo de limón", "1 cucharadita de pimentón", "3 cucharadas de perejil de hojas planas picadas, más extra para decorar", "Pechuga de pavo 400 g / 14 oz, en cubitos", "sal y pimienta negra recién molida", "400ml / 14fl oz de caldo de pollo", "250g / 9oz de trigo bulgur", "400 g / 14 oz de lentejas verdes de estaño, enjuagadas y escurridas", "½ pepino, cortado en cubitos", "10 tomates cherry", "25 g / 1 oz de menta, picada", "cuñas de limón, para adornar", "4 cucharadas de hummus", "1 cucharada de jugo de limón"], "method": ["Ponga 8 pinchos de madera en agua tibia y déjelos remojar mientras prepara el pavo.", "Mezcle el aceite, el jugo de limón, el pimentón y el perejil en un bol y sazone al gusto con sal y pimienta negra recién molida. Agregue el pavo y vuélvalo a cubrir completamente. Reserve en la nevera durante al menos 20 minutos.", "Precalentar la parrilla a un ajuste caliente.", "Retire el pavo del tazón (deseche cualquier adobo) y enrosque las piezas en los pinchos. Cocine bajo la parrilla, dando vuelta una o dos veces, durante 10 minutos, o hasta que estén cocidos.", "Mientras tanto, lleva la acción a ebullición. Coloque el trigo bulgur en una olla con tapa de tamaño mediano y cubra con el caldo. Cubra con la tapa y cocine a fuego lento a fuego medio durante 12-15 minutos, o hasta que el trigo bulgur esté tierno y haya absorbido el caldo.", "Cuando el bulgur esté cocido, escurrir y extender para enfriar. Agregue las lentejas verdes, el pepino, los tomates y la menta.", "Para el aderezo, combine el hummus con el jugo de limón y 1 cucharada de agua.", "Coloque los pinchos de pavo en la ensalada de trigo bulgur y cuchara sobre el aderezo. Adorne con rodajas de limón y perejil de hoja plana y sirva."], "url": "www_bbc_co_uk_food_recipes_turkey_skewers_and_58075", "title": "Brochetas de pavo y ensalada de bulgur", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/turkey_skewers_and_58075_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500g / 1lb 2oz de harina blanca fuerte, más extra para espolvorear", "50 g / 2 oz de azúcar en polvo", "10 g / ¼ oz de sal", "40 g / 1½ oz de mantequilla sin sal cortada en trozos pequeños, más extra para engrasar la lata", "2 huevos de gallinas camperas", "2 bolsas de 7 g de levadura seca de acción rápida", "150ml / 5fl oz leche tibia", "90 ml / 6 cucharadas de agua tibia", "Salsa de arándanos de 280 g / 10 oz", "300g / 10½oz de sobra de pavo, rallado", "200 g / 7 oz de sobra salvia y relleno de cebolla"], "method": ["Coloque la harina, el azúcar impalpable y la sal en un tazón grande para mezclar y mezcle. Agregue la mantequilla, los huevos, la levadura, la leche y el agua tibia.", "Mezcle los ingredientes con las manos hasta que se forme una masa áspera.", "Incline la masa sobre una superficie bien enharinada y amasar bien durante diez minutos, o hasta que la masa esté suave y elástica.", "Coloque la masa en un tazón limpio y engrasado, cúbralo con un paño húmedo y déjelo reposar durante una hora.", "Incline la masa sobre una superficie muy ligeramente enharinada.", "Estirar la masa en un rectángulo de aproximadamente 50x28 cm / 20x11 pulgadas. Gire la masa para que el borde más largo quede más cerca de usted y \"pegue\" la masa a la superficie de trabajo presionándola firmemente con el dedo.", "Extienda la salsa de arándano sobre la superficie de la masa con el dorso de una cuchara. Espolvoree el pavo rallado y el relleno en la parte superior.", "Ruede el lado más largo de la masa hacia usted con bastante fuerza, formando una espiral dentro. Cuando esté enrollado, suelte el borde con punta y colóquelo en una parte enharinada de la superficie. Con un cuchillo afilado, corte la forma de la salchicha en rondas de 5 cm / 2 pulgadas.", "Coloque todas las rondas en espiral, con el lado hacia arriba, en una lata de horno o bandeja de horno grande y profunda engrasada a fondo con mantequilla, dejando un espacio de 1 cm / ½ pulgadas entre cada una. Usted quiere que estén lo suficientemente cerca para que hornearán con sus lados tocándose.", "Cubra con un paño de cocina húmedo y déjelo en un lugar cálido para que se levante durante una hora. Deberían haberse expandido y estar tocándose.", "Precalentar el horno a 200C / 400F / Gas 6.", "Cuando los panecillos estén listos, colócalos en el horno y hornea por 15-20 minutos.", "Después de retirar los panecillos del horno, déjelos enfriar un poco antes de sacarlos de la lata y colocarlos en una rejilla para enfriar.", "Cuando esté listo para comer, separe los panes para revelar los bordes suaves."], "url": "www_bbc_co_uk_food_recipes_turkey_stuffing_and_77957", "title": "Pavo, relleno y arándano Chelsea bollos", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Hace 10-12 bollos", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/turkey_stuffing_and_77957_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "½ cebolla, finamente picada", "1 diente de ajo, finamente picado", "55 g / 2 oz de champiñones, en rodajas", "pizca de polvo de curry medio", "225 g / 8 onzas de carne de pavo lista para cocinar, en rodajas", "Crema doble de 300 ml / ½ pinta", "Relleno precocido de 150 g / 5 oz, en forma de bolas de 1 cm / ½ pulgadas", "sal y pimienta negra recién molida", "1 cucharada de perejil de flatleaf fresco picado, para servir"], "method": ["Calentar el aceite en una sartén grande. Agregue la cebolla y el ajo y freír suavemente hasta que estén suaves pero no coloreados.", "Agregue los champiñones y freír durante un minuto más o menos. Espolvorea sobre el polvo de curry.", "Agregue el pavo a la sartén y revuelva hasta que se caliente, luego vierta la crema. Deje que se reduzca un poco, luego agregue las bolas de relleno y cocine a fuego lento hasta que se caliente. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, vierta en un recipiente y espolvoree con perejil."], "url": "www_bbc_co_uk_food_recipes_turkeyandwildmushroo_87803", "title": "Turquía y setas silvestres salteados con crema y relleno de albóndigas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1-2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500g / 1lb 2oz de tomates maduros", "½ cabeza de dientes de ajo, sin pelar", "2 chiles anchos secos", "2 cucharadas de aceite de oliva", "2 cebollas rojas, cortadas en finas cuñas", "1 pimiento rojo, cortado en cubitos", "1 pimiento verde, cortado en cubitos", "2 palitos de apio, en rodajas", "2 cucharaditas de comino molido", "Tomillo de ramita grande", "2 hojas de laurel", "1 cucharadita de orégano seco", "pequeño racimo de cilantro, tallos y hojas separados", "1,25 litros / 2 pintas de caldo de pavo", "250 g / 9 oz de frijoles negros cocidos", "250g / 9oz de maíz dulce", "sal y pimienta negra recién molida", "300g / 10½oz de carne de pavo cocida, cortada en tiras", "1 lima, solo jugo (opcional)", "6-8 tortillas de maíz, cortadas en tiras o tiras", "2 cucharadas de aceite de oliva", "2 aguacates, pelados, piedras removidas, cortadas en cubitos", "1 lima, solo jugo", "sal al gusto", "3-4 cebollas de primavera, en rodajas finas", "100g / 3½oz de queso duro rallado"], "method": ["Primero prepara los tomates. Caliente una sartén de base pesada hasta que esté caliente, luego agregue los tomates, el ajo y los chiles secos. Freír en seco, sacudiendo la sartén regularmente hasta que los tomates comiencen a ennegrecerse.", "Retire la guindilla cuando empiece a oler aromático y colóquela en un bol. Vierte un poco de agua recién hervida y deja que se ablande.", "Incline los tomates en un procesador de alimentos o licuadora. Pele los dientes de ajo y agregue estos también, luego drene el chile de su agua y añádalo. Mezclar hasta que esté suave.", "Mientras está secando los tomates, caliente el aceite de oliva en una cazuela grande o una cacerola. Agregue las cebollas, el pimiento y el apio. Freír a fuego medio hasta que comience a caramelizar alrededor de los bordes, esto demorará entre 10 y 15 minutos.", "Agregue el comino, el tomillo, las hojas de laurel y el orégano. Corta finamente los tallos de cilantro y agrégalos también.", "Agregue el caldo y la mezcla de tomate reservada a la cacerola, junto con los frijoles negros y el maíz dulce. Sazonar bien con sal y pimienta, luego llevar a ebullición, bajar el fuego y hervir a fuego lento durante 15-20 minutos.", "Agregue el pavo cocido a la sopa y deje hervir a fuego lento mientras prepara las guarniciones.", "Precaliente el horno a 200C / 180C Ventilador / Gas 6. Mezcle los pedazos de tortilla en el aceite y coloque sobre un par de bandejas para hornear. Deja en el horno hasta que estén crujientes.", "Mezcle el aguacate en el jugo de lima y sazone bien con sal.", "Pruebe la sopa y agregue un poco de jugo de lima si cree que lo necesita. Sirva la sopa adornada con aguacate, hojas de cilantro, cebolletas, queso y tortillas."], "url": "www_bbc_co_uk_food_recipes_turkey_tortilla_soup_40086", "title": "Sopa de tortilla de pavo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/turkey_tortilla_soup_40086_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Carne picada de pavo 250 g / 9 oz", "100g / 3½oz de pan rallado", "1 cucharada de tomillo fresco picado", "1 huevo, golpeado", "sal y pimienta negra recién molida", "1 tomate picado en lata", "1 tomillo pequeño de racimo, hojas recogidas", "1 cucharada de puré de tomate", "½ cebolla, picada", "sal y pimienta negra recién molida", "1 diente de ajo, en rodajas", "1 cucharada de tomillo fresco picado", "55 g / 2 oz de mantequilla", "100 ml / 3½ fl oz de caldo de pollo", "100 g / 3½ oz de batata, cortada en rodajas finas"], "method": ["Para las bolas de pavo, coloque todos los ingredientes en un tazón grande y mezcle bien. Divide la mezcla en dos, dale forma de bolas y colócala en el refrigerador, mientras preparas la salsa.", "Para la salsa, coloque todos los ingredientes en una sartén honda a fuego medio. Llevar a ebullición y reducir el fuego a fuego lento durante cinco minutos.", "Agregue las bolas de pavo y cocine en la salsa, volteándolas de vez en cuando. Cocina durante 15 minutos, o hasta que las bolas de pavo estén cocidas.", "Mientras tanto, haga el fondant de la batata colocando todos los ingredientes en una sartén pequeña antiadherente a fuego medio y cocinando durante diez minutos, revolviendo ocasionalmente.", "Para servir, coloca el fondant en un plato. Cubra con las bolas de pavo y cuchara sobre cualquier salsa extra."], "url": "www_bbc_co_uk_food_recipes_turkeyballswithtomat_80567", "title": "Bolas de pavo con salsa de tomate y pasta de camote", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de vinagre de vino blanco", "1 cucharada de mostaza Dijon", "2 yemas de huevo de gallinas camperas", "1 diente de ajo, picado", "200ml / 7fl oz de aceite de oliva", "3 rebanadas gruesas de pan", "3 rebanadas de pavo", "1 cucharada de perejil de flatillo, picado"], "method": ["Para la mayonesa de ajo, bata las yemas de huevo con el vinagre de vino blanco y la mostaza Dijon en un tazón grande.", "Agregue el ajo picado y bata de nuevo.", "Continúe batiendo y agregue gradualmente el aceite para crear una consistencia espesa de mayonesa.", "Para construir el sándwich de club, extiende la mayonesa en el pan y haz una capa con las rebanadas de pavo. Cortar el sándwich en triángulos y espolvorear el perejil plano de hojas picadas para servir."], "url": "www_bbc_co_uk_food_recipes_turkeyclubsandwichwi_79115", "title": "Sándwich de pavo con mayonesa de ajo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "25 g / 1oz de mantequilla sin sal", "1 cebolla grande, pelada y finamente picada", "4 dientes de ajo, pelados y finamente picados", "Pomo de jengibre fresco de 2.5cm / 1in, pelado y rallado", "1 chile rojo, sin semillas y finamente picado", "8 vainas de cardamomo verde, ligeramente aplastadas", "1 cucharadita de comino molido", "1 cucharada de cúrcuma molida", "½ cucharadita de chile en polvo", "1 cucharadita de sal masala", "1 cucharadita de semillas de cilantro molido", "2 patatas grandes, peladas y cortadas en cubos", "1 calabaza, pelada, sin semillas y cortada en cubos", "570 ml / 1 pt de caldo de pollo o pavo", "125ml / 4fl oz de yogur", "Crema doble 85ml / 3fl oz", "1 cucharada de jugo de limón", "6 puñados grandes de sobra, picados", "1 cucharada de hojas frescas de cilantro picadas"], "method": ["Caliente el aceite y la mantequilla en una cazuela grande antiadherente.", "Agregue las cebollas y cocine por 2-3 minutos, luego agregue el ajo, el jengibre, el chile, el cardamomo, el comino, la cúrcuma, el garam masala y el cilantro molido. Cocine a fuego medio hasta que la cebolla esté suave, teniendo cuidado de no quemar las especias.", "Agregue las papas y la calabaza y cocine hasta que la papa comience a pegarse ligeramente al fondo de la sartén.", "Añadir el caldo y hervirlo. Sazonar, al gusto, con sal y pimienta negra recién molida. Reduzca el fuego y cocine a fuego lento durante 10-15 minutos, hasta que las papas y la calabaza estén tiernas.", "Agregue el yogur y la crema, luego agregue el jugo de limón. Agregue el pavo cocido, dóblelo y cocine a fuego lento para que se caliente. Espolvoree con hojas de cilantro y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_turkeycurry_78850", "title": "Pavo con curry", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/turkeycurry_78850_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Pechuga de pavo 1 pieza de 150 g / 5½ oz", "1 cucharada de aceite de oliva", "3 hojas frescas de salvia", "1 cucharada de aceite de oliva", "½ limón, solo jugo", "1 tomate, semillas eliminadas, picadas", "puñado de perejil fresco, picado", "puñado de cebollín fresco, picado", "sal y pimienta negra recién molida"], "method": ["Para el escalope de pavo, coloque la pechuga de pavo entre dos hojas de película adhesiva y aplanar con un rodillo o la base de una sartén.", "Calentar el aceite en una sartén a fuego medio y cocinar el escalope con las hojas de salvia durante 3-4 minutos en cada lado, o hasta que esté completamente cocido. Retire el pavo de la sartén y déjelo a un lado para mantenerlo caliente.", "Para la vierge salsa, en la misma sartén calentar el aceite de oliva restante con el jugo de limón, tomate picado y hierbas hasta hervir a fuego lento. Sazonar con sal y pimienta negra recién molida.", "Para servir, coloque el escalope de pavo en un plato de servir y rocíe sobre la salsa vierge."], "url": "www_bbc_co_uk_food_recipes_turkeyescalopewithsa_85320", "title": "Escalope de pavo con salsa virgen de salvia", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 cebolla picada", "1 diente de ajo, aplastado", "Passata de 200 ml / 7 fl oz (o 1 x 400 g de tomates picados)", "1 cucharadita de orégano fresco picado (o 1/2 cucharadita de orégano seco)", "½ cucharadita de pimienta negra recién molida", "1 cucharada de aceite de oliva", "1 diente de ajo, aplastado", "1 cebolla roja picada", "1 pimiento rojo, semillas y núcleo eliminado, finamente picado", "1 calabacín, picado", "170 g / 6 oz de carne picada de pavo", "85g / 3oz de queso cheddar rallado", "4 tortillas integrales"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4.", "Para hacer la salsa calentar el aceite de oliva en una cacerola a fuego medio. Agregue la cebolla y el ajo y saltee durante 4-5 minutos, hasta que se ablanden.", "Agregue la passata, el orégano y la pimienta negra. Cubra, reduzca el fuego y deje hervir a fuego lento durante diez minutos.", "Mientras tanto, para el pavo, caliente el aceite de oliva en una sartén por separado a fuego medio. Agregue la cebolla, el ajo, el pimiento rojo y el calabacín. Saltee durante cinco minutos y luego agregue la carne picada de pavo. Cocine por alrededor de 5-7 minutos, o hasta que la carne picada de pavo esté dorada y cocida.", "Agregue la mitad del queso a la mezcla de pavo y continúe cocinando hasta que el queso se derrita.", "Divida la mezcla de pavo entre cuatro tortillas y enrolle en paquetes. Coloque en un plato a prueba de horno, cuchara sobre salsa y espolvorear con el queso restante. Coloque en el horno precalentado para hornear durante 15-20 minutos, hasta que estén dorados."], "url": "www_bbc_co_uk_food_recipes_turkeyenchiladas_80222", "title": "enchiladas de pavo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Rinde 4", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/turkeyenchiladas_80222_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ pechuga de pavo", "85g / 3oz de queso feta", "1 puñado de hierbas frescas mezcladas (perejil, albahaca y cebollín)", "½ limón, solo ralladura", "1 yema de huevo de gallinas camperas", "sal y pimienta negra recién molida", "2 cucharadas de harina normal", "2 cucharadas de aceite de oliva", "1 limón, segmentado", "½ cucharadita de azúcar en polvo", "½ cucharadita de copos de chile", "½ cucharadita de sal", "1 cucharada de menta fresca picada", "1 cucharada de perejil fresco picado", "1 cucharada de eneldo fresco picado", "2 cucharadas de aceite de oliva", "2 rebanadas de pan blanco, a la plancha"], "method": ["Para las hamburguesas, coloque todos los ingredientes de la hamburguesa, excepto la harina y el aceite, en un procesador de alimentos y pulse hasta que estén bien combinados. Con las manos húmedas, dé forma a la mezcla en dos hamburguesas y luego espolvoree con la harina.", "Calentar el aceite de oliva en una sartén y freír las hamburguesas durante 3-4 minutos en ambos lados, o hasta que estén doradas y cocidas.", "Para la ensalada, combine todos los ingredientes de la ensalada en un tazón y mezcle bien.", "Para servir, coloque una empanada en cada rebanada de pan y coloque la ensalada encima."], "url": "www_bbc_co_uk_food_recipes_turkeyfetaburgerswit_90372", "title": "Hamburguesas de feta de pavo con hierbas sicilianas y ensalada de limón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["300ml / ½ pinta de aceite vegetal, para freír", "1 pechuga de pavo de 150 g / 5½ oz", "75g / 2½oz de ajo y queso crema de hierbas", "3-4 hojas frescas de salvia", "sal y pimienta negra recién molida", "Harina normal de 75 g / 2½ oz", "1 huevo de gallinas camperas, golpeado", "50g / 1¾oz de pan rallado fresco", "1 patata, pelada, rallada", "30g / 1oz de mantequilla", "sal y pimienta negra recién molida", "30 g / 1 oz de brócoli, al vapor, para servir"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Coloque el aceite vegetal en una olla profunda de fondo grueso y caliente hasta que un pequeño cubo de pan chisporrotee y se ponga dorado cuando se deje caer en él. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Para hacer el pavo kiev, cubra la pechuga de pavo con film transparente y golpee con un mazo para carne o rodillo hasta que tenga 0.5cm / ¼ de grosor.", "Coloque el queso crema y la salvia en el centro de la pechuga de pavo aplanada y sazone bien con sal y pimienta negra recién molida.", "Dobla el pavo por la mitad sobre el relleno y asegúralo con palitos de cóctel. Transfiera a la nevera por cinco minutos.", "Coloque la harina, el huevo batido y las migas de pan en tres cuencos separados. Sazone la harina con sal y pimienta negra recién molida.", "Retire el pavo de la nevera, retire los palitos de cóctel y sumerja el pavo primero en la harina, luego el huevo y finalmente el pan rallado.", "Coloque con cuidado el pavo en el aceite caliente y fríalo durante 3-4 minutos, o hasta que se dore. Retirar del aceite con una cuchara ranurada y escurrir sobre papel de cocina.", "Coloque el pavo en una bandeja para hornear, transfiéralo al horno y hornee durante 10-12 minutos, o hasta que esté completamente cocido.", "Para el rösti, coloque la papa rallada en una toalla de té limpia y exprima la toalla de té sobre un recipiente para eliminar el exceso de humedad.", "Derrita la mantequilla en una sartén pequeña, agregue la papa rallada y presione en la sartén para formar un disco de 1cm / ½ pulgada de grosor. Sazonar bien con sal y pimienta negra recién molida y freír durante 2-3 minutos, o hasta que la base comience a dorarse. Voltee y cocine en el otro lado durante 2-3 minutos.", "Para servir, coloque la papa rösti en un plato y cubra con la kiev, cortada por la mitad en diagonal, con el brócoli al vapor al costado."], "url": "www_bbc_co_uk_food_recipes_turkeykievwithcheese_84984", "title": "Turquía kiev con queso y salvia y patatas rosti", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 patas de pavo", "2 alas de pavo", "menudencias de pavo (es decir, cuello, corazón, molleja, pero no el hígado, excepto el relleno)", "50g / 2oz de mantequilla", "1 cucharada de aceite de oliva", "250 g / 9 oz cebollas pequeñas (es decir, decapado), escaldadas y luego peladas", "Panceta de 250 g / 9oz o tocino de corte grueso, en trozos gruesos", "50g / 2oz de harina sazonada", "½ brandy de copa de vino", "500ml / 16½fl oz de vino tinto", "500 ml / 16½ fl oz de aves de corral o de cerdo, o agua", "bouquet garni de tallos de laurel, tomillo y perejil", "4 palitos de apio, cortados en longitudes de 3cm / 1¼in", "4 dientes de ajo, magullados", "4 tomates medianos, pelados, sin semillas y finamente picados", "sal y pimienta negra molida", "beurre manie (25 g / 1 oz de harina mezclada con 25 g / 1 oz de mantequilla blanda)"], "method": ["Cuidadosamente corte las patas enteras del pavo, luego corte la articulación para separar el muslo del muslo. Corta las alas con tijeras de aves de corral en el punto en que se unen al pecho.", "Caliente la mantequilla y el aceite en una sartén grande y fría los trozos de tocino hasta que estén dorados. Transfiera las piezas de tocino a su plato de cazuela elegido. Dore ligeramente las cebollas en la misma sartén y transfiéralas a la cazuela.", "Espolvorea las patas de pavo con harina sazonada y dore las siguientes, volteándolas varias veces hasta que estén coloreadas y crujientes. Vierta sobre el brandy y enciéndalo (inclinando la sartén hacia la llama de gas, si está cocinando con gas, con un cono de madera encendido si no lo está). Cuando las llamas se hayan calmado, transfiere las patas de pavo y todos los jugos en la sartén a la cazuela.", "Regrese la sartén al fuego, desglasifique una vez más echando el vino y raspando el fondo y los lados de la sartén mientras el vino burbujea. Vierta el vino hirviendo sobre las piezas de pavo y luego repita el proceso con agua o caldo (el trabajo de deshielo ya está hecho, pero es bueno agregar líquido caliente, no frío, a la cazuela para comenzar a cocinar) .", "Ahora agregue las hierbas, el apio y los tomates a la sartén y cocine a fuego lento. Cubra la sartén y cocine a fuego muy lento o en un horno bajo durante aproximadamente 1 ½ horas hasta que la carne esté completamente tierna.", "Cuele el caldo en una sartén limpia y separada dejando la carne y las verduras en su cazuela. Hervir el caldo rápidamente para reducir a la mitad o incluso dos tercios, en una salsa rica e intensa. Si crees que la salsa parece un poco delgada, puedes introducir unas cuantas migas de beurre manié. Sazone al gusto con sal y pimienta.", "Cuando las piezas de pavo estén lo suficientemente frías para manipularlas, retire la carne de los huesos con los dedos y devuelva los trozos de carne a la salsa terminada junto con los trozos de tocino y los vegetales.", "Ponga a un lado, manteniéndolo en la nevera si es necesario, recalentado cuidadosamente pero sin quemarlo o sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_turkeylegscoqauvin_13962", "title": "Pavo piernas coq au vin", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 chile, sin semillas y finamente picado", "½ puerro, finamente picado", "3 dientes de ajo picados", "1 manojo de raíz de cilantro, picado", "ralladura de 1 lima", "1 cucharadita de comino", "1 cucharadita de salsa de pescado (nam pla)", "125 g / 4½ oz de carne picada de pavo", "1 cucharada de aceite de oliva", "pequeña joya, lechuga, desmenuzada", "rodajas de limón"], "method": ["Para hacer la pasta de curry, mezcle todos los ingredientes de la pasta en un procesador de alimentos.", "Agregue una cucharada de la pasta de curry a la carne picada de pavo y mezcle bien en un bol. Divida la mezcla en tres partes y moldee alrededor de tres brochetas.", "Caliente una sartén de la parrilla y agregue el aceite. Ase los pinchos, volteándolos de vez en cuando durante 8-10 minutos.", "Sirva en la lechuga gema bebé con las cuñas de lima."], "url": "www_bbc_co_uk_food_recipes_turkeymincekebabs_78586", "title": "Kebabs de carne picada de pavo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 3", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]