[{"ingredients": ["1 saucisson grande u otra salchicha francesa suave", "1 x 7 g / oz de saco de levadura seca de acción rápida", "1 cucharadita de azúcar en polvo", "125ml / 4fl oz de leche caliente", "500g / 1lb 2 oz de harina natural, más extra para espolvorear", "1 cucharadita de sal marina fina", "2 cucharadas de azúcar en polvo", "4 huevos medianos, golpeados", "175g / 6oz de mantequilla, ablandada, más extra para engrasar", "1 yema de huevo, batida, para glasear"], "method": ["Para hacer el brioche, espolvorea la levadura y el azúcar en polvo sobre la leche tibia en un tazón pequeño. Bátelos ligeramente, luego déjelos en un lugar cálido por 10 minutos o hasta que se forme una espuma ligera en la superficie.", "Tamiza la harina, la sal y el azúcar en polvo en un tazón grande. Haga un pozo en el centro y vierta la mezcla de levadura y los huevos batidos. Mezcle con una cuchara de madera hasta que la mezcla forme una bola.", "Convierta la masa en una superficie enharinada y amasarla suavemente durante aproximadamente 5 minutos hasta que quede suave. Poco a poco agregue la mantequilla ablandada, una cucharadita a la vez, amasando bien entre cada adición. Tomará aproximadamente 10 minutos incorporar la mantequilla y la masa estará muy pegajosa.", "Sobre una superficie limpia enharinada y con las manos limpias, espolvorea la masa con harina y continúa amasando ligeramente durante 10 minutos hasta que la masa sea muy flexible, suave y no más pegajosa. Colóquelo en un tazón grande con mantequilla y cúbralo con un paño limpio. Deja en un lugar cálido durante 1 hora y media hasta que esté bien erguido y esponjoso.", "Vuelva a colocar la masa en una superficie ligeramente enharinada y retírela con los nudillos.", "Amasar durante un minuto más o menos, luego aplanar la masa ligeramente y envolverlo alrededor del saucisson, presionando los bordes firmemente para sellar.", "Colóquelo en una lata de pan de 900ml / 1½ pinta ligeramente untada con mantequilla y cúbralo con una película adhesiva. Deja en un lugar cálido para probar durante 45 minutos o hasta que la masa esté bien subida.", "Precalentar el horno a 180C / 350F / Gas 4.", "Cepille el brioche ligera pero generosamente con yema de huevo batida y hornee por 35-40 minutos hasta que se levante y dore.", "Enfríe en la lata durante 10 minutos, luego déjelo enfriar en una rejilla.", "Servir en rodajas gruesas."], "url": "www_bbc_co_uk_food_recipes_brioche_sausage_roll_01493", "title": "Rollo de salchicha brioche (brioche de salchicha)", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 huevos grandes de gallinas camperas", "4 cucharadas de jarabe de arce", "½ vaina de vainilla, cortada por la mitad a lo largo y semillas raspadas", "pizca de sal", "Azúcar demerara 100 g / 3½ oz, más 1 cucharada para las peras caramelizadas", "50g / 1¾oz nueces de pacana", "60 g / 2¼ oz de mantequilla sin sal", "4 rebanadas de brioche", "3 peras de conferencia, peladas, sin corazón y cortadas en rodajas gruesas", "Jengibre de tallo 75g / 2½ oz en almíbar, finamente picado", "100 ml / 3½ fl oz de jarabe, reservado desde el tallo de jengibre", "4 cucharadas de crema fresca", "1 limón, ralladura y un poco de jugo sin cera", "azúcar en polvo, para quitar el polvo"], "method": ["Batir los huevos, el jarabe de arce, las semillas de vainilla y una pizca de sal en un tazón grande.", "Para las pacanas caramelizadas, caliente el azúcar en una sartén pequeña hasta que adquiera un color caramelo profundo (PRECAUCIÓN: el azúcar hirviendo es extremadamente caliente. Maneje con mucho cuidado. Use una sartén profunda para evitar burbujear). Agregue las nueces y mezcle bien para cubrir. Vierta la mezcla en una bandeja para hornear forrada con papel de hornear antiadherente. Dejar enfriar y endurecer durante unos minutos, luego cortar en trozos.", "Derrita 50 g / 1¾ oz de mantequilla en una sartén antiadherente grande. Sumerja las rebanadas de brioche en la mezcla de huevo y luego fría la mantequilla por 2-3 minutos por cada lado, o hasta que estén doradas.", "Caliente la mantequilla restante en una sartén antiadherente y agregue la pera rebanada, reservando cuatro rebanadas para una guarnición. Agregue una cucharada de azúcar a la sartén y cocine por 2-3 minutos. Luego agrega el jengibre y el jarabe picados. Cocine durante 1-2 minutos más hasta que el líquido se haya reducido y las peras se hayan caramelizado.", "Arregle el brioche tostado en cuatro platos, cubra con las peras caramelizadas y las rodajas de pera fresca, la crema fresca y un chorrito de limón y ralladura. Esparce con nueces picadas y polvo con azúcar glas."], "url": "www_bbc_co_uk_food_recipes_brioche_toast_with_41352", "title": "Brioche tostado con peras caramelizadas y jarabe de jengibre", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["30 g / 1¼ oz de levadura fresca", "25 ml / 1 fl oz de agua", "500g / 1lb 1½ oz de harina fuerte", "pizca de sal", "20 g / oz de azúcar en polvo", "4 huevos", "4 yemas de huevo", "500 g / 1 libra de mantequilla y 1 / 2oz, fría y en cubos", "6 cucharaditas de azúcar en polvo", "1 cucharadita de canela", "aceite de maní, para freír", "10g / ½ oz de mantequilla", "6 manzanas Bramley, peladas y picadas", "150 g / 5¼ oz de azúcar en polvo", "1 ramita de canela", "1 limón, ralladura solamente"], "method": ["Prepare la masa agregando unas gotas de agua a la levadura y deje a temperatura ambiente para que se vuelva espumosa y cremosa.", "Ponga la harina, la sal y el azúcar en un recipiente, e incline la levadura y el resto del agua. Agregue los huevos y las yemas de huevo y finalmente, la mantequilla. Dibuje con las manos, luego amase hasta que la masa esté suave como la seda.", "Rompe piezas del tamaño de una pelota y rueda en bolas. Coloque en una bandeja para hornear, con suficiente espacio entre cada bola.", "Deje que se pruebe en un lugar cálido hasta que las bolas se hayan duplicado.", "Mientras tanto, prepara la compota. Calienta la mantequilla en una sartén de fondo grueso.", "Agregue las manzanas, el azúcar, la canela y la ralladura de limón y caliente suavemente hasta que la fruta esté cocida. Retire la varita de canela. Transfiera la fruta guisada a una botella de plástico squeezy.", "Para cocinar las donas, caliente el aceite de nuez molido en una freidora a 190 ° C / 375 ° F. Para probar si el aceite tiene la temperatura correcta, deje caer un pequeño cubo de pan en el aceite, si chisporrotea y se vuelve dorado, el aceite está listo para usar. (PRECAUCIÓN: el aceite caliente es muy peligroso. No lo deje sin supervisión.) Vuelva a dar forma a las bolas y luego colóquelas en el aceite caliente.", "Cuando estén dorados, saque las bolas con una cuchara ranurada y siéntese sobre un pedazo de toalla de papel.", "Combina el azúcar impalpable con la canela.", "Cuando las rosquillas estén lo suficientemente frías como para manejarlas, dóblelas con azúcar canela, luego tome la botella de compota de manzana y presione suavemente cada rosquilla, exprimiéndola para liberar una cucharada de compota."], "url": "www_bbc_co_uk_food_recipes_briochedonutsfilledw_74853", "title": "Donuts Brioche llenos de compota de manzana", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 70}, "serves": "Sirve 8-10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500g / 1lb 2oz de harina blanca fuerte", "50 g / 1 oz de azúcar en polvo", "10g / ⅓oz de levadura de acción rápida", "7 g / ¼ oz de sal", "140ml / 5fl oz de leche entera", "6 huevos de gallinas camperas, un huevo batido para lavar huevos", "250g / 9oz de mantequilla sin sal ablandada"], "method": ["Coloque la harina, el azúcar, la levadura, la sal, la leche y los cinco huevos en una batidora de pie y mezcle, durante unos cinco minutos, con una masa homogénea. Si se mezcla a mano, esto llevará unos ocho minutos.", "Agregue la mantequilla a la masa y mezcle durante otros cinco minutos en la batidora, o 10 minutos a mano. Coloque la masa en un recipiente, cubra y deje en la nevera durante la noche.", "La masa ahora debe ser rígida y de forma fácil. Cortar la masa en trozos de 50 g / 1¾Oz y dividir 45 g / 1½ oz para los cuerpos de brioche y 5 g / ¼ oz para las cabezas de brioche.", "Usando sus manos, forme las piezas de masa en bolas. Coloque cada pieza grande de masa en un molde de brioche y empuje una masa más pequeña sobre cada una de ellas. Deje el brioche en un lugar cálido para levantarse durante una hora.", "Precaliente el horno a 200C / 400F / Gas 6. Cepille el brioche con el huevo lavado y hornee durante 20 minutos, o hasta que estén doradas.", "Transfiera a una rejilla para enfriar."], "url": "www_bbc_co_uk_food_recipes_brioches__ttes_39328", "title": "Bollos con una cabeza", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Hace 16 cabezas de brioche", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/brioches__ttes_39328_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["25g / 1oz de mantequilla", "Filete de chuletón de 750 g / 1 lb 10 oz, cortado en cubos de 4 cm / 1½ pulgadas", "2 cebollas medianas, en rodajas", "3 dientes de ajo, aplastados", "1 cucharadita de ají de Kashmiri en polvo", "1 cucharadita de cúrcuma molida", "1½ cucharada de sal masala", "1½ cucharadita de sal", "600ml / 20fl oz de caldo de carne", "50g / 1¾oz de coco desecado", "100 g / 3½ oz de sultanas", "Elija entre: pato de Bombay (o cualquier pescado seco y salado, como anchoas secas, disponible en tiendas asiáticas), salsa picante de manzana, chutney de tamarindo, plátanos en rodajas, coco rallado y / o poppadoms"], "method": ["Derrita la mantequilla en una sartén grande y resistente a fuego medio. Agregue el bistec, en lotes, y fría por unos minutos hasta que se dore y luego retire a un plato. Agregue las cebollas a la misma sartén y fría por 10 minutos, o hasta que estén suaves y doradas.", "Agregue el ajo y fría por un minuto, luego devuelva la carne a la sartén, junto con los jugos en el plato. Agregue el chile en polvo, la cúrcuma, una cucharada de garam masala y la sal, y cocine por un minuto.", "Agregue el caldo, seguido del coco y las sultanas. Traiga a fuego lento, cubra y cocine a fuego lento durante 45 minutos a una hora o hasta que la carne esté tierna. Agregue el garam masala restante y sirva."], "url": "www_bbc_co_uk_food_recipes_british_beef_raj_curry_70957", "title": "Carne de vacuno británica Raj curry", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/british_beef_raj_curry_70957_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["30g / 1oz de mantequilla", "15 g / ½ oz de harina", "230ml / 8fl de leche en oz", "3 huevos, separados, blancos azotados rígidamente", "85g / 3oz de queso, rallado", "1 cucharada de aguardiente", "170g / 6oz de gambas (sin cáscara), camarones grandes, cortados en pedazos de 1cm / ½ en", "30g / 1oz de mantequilla", "1 cucharada de aguardiente", "sal, pimienta blanca, cayena, nuez moscada, para sazonar"], "method": ["Engrase bien un plato de soufflé y precaliente una bandeja para hornear en el horno a 190 ° C / 375 ° F / Gas 5.", "Derrita la mantequilla en una sartén, agregue la harina para hacer un roux, luego agregue la leche gradualmente.", "Dejar enfriar. Batir las yemas y el queso hasta que quede suave.", "Picar 25 g / 1 oz de las gambas muy finas y agregar a la salsa, también agregue la mitad del brandy. Sazone bastante con sal, pimienta, cayena y nuez moscada.", "Dobla la mezcla en los blancos endurecidos.", "saltee las langostinas restantes en mantequilla clarificada durante 1 minuto, agregue el brandy restante y enciéndalo.", "Coloque la mitad de la mezcla de souffli en el plato, coloque las gambas flameadas encima y cubra con la mezcla restante.", "Coloque en el horno precalentado y hornee durante 40 minutos."], "url": "www_bbc_co_uk_food_recipes_brisbaneprawnsouffle_13045", "title": "Brisbane gambas sopladas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["400 g / 14 oz de habas frescas, (alrededor de 300 g / 10½ oz cuando se envasa)", "1 chile rojo entero", "2 dientes de ajo grasos, finamente picados", "1 cebolleta, finamente cortada", "1 limón, cáscara y jugo solamente", "1 cucharada de orégano seco o 2 cucharadas de orégano fresco picado", "½ barra de pan de masa fermentada, en rodajas", "4 cucharadas de aceite de oliva", "Queso de cabra suave 200 g / 7 oz"], "method": ["Calentar una olla grande llena de agua hirviendo. Blanquee los frijoles muy brevemente (solo para suavizar, no para cocerlos). Escurrir y reservar para enfriar.", "Asar el chile sobre una llama directa en el fogón hasta que se ennegrezca un poco, pero no completamente carbonizado. Alternativamente, charlos bajo una parrilla caliente. Rebana y quita las semillas. Corta la carne en cintas delgadas.", "Mezcle el chile, el ajo, la cebolleta, la ralladura de limón y el jugo juntos. Agregue el orégano y las habas y aplaste ligeramente al mezclar. No desea un puré suave, pero necesita mantenerse unido.", "Caliente una sartén grande y rocíe la masa fermentada en rodajas con un poco de aceite de oliva. Coloque en la plancha y cocine en ambos lados durante 1-2 minutos, o hasta que aparezcan las marcas de la barra.", "Retirar del fuego y extender con el queso de cabra. Cubra con la mezcla de frijoles anchos y sirva."], "url": "www_bbc_co_uk_food_recipes_broad_bean_and_goats_69027", "title": "Brocheta de queso de frijoles y cabras", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/broad_bean_and_goats_69027_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 queso estilo camembert como Tunworth", "1 ramita de romero", "1 cucharada de miel clara", "pimienta negra recién molida", "rebanadas de baguette", "pickle o chutney comprado en la tienda", "8 huevos de codorniz, a temperatura ambiente", "vinagre de malta (suficiente para llenar un tazón pequeño)", "200 g / 7 oz de carne picada de cerdo", "unas pocas hojas de salvia fresca, picada", "½ cucharadita de sal", "½ cucharadita de pimienta negra recién molida", "1 huevo de gallinas camperas, golpeado", "harina común, para quitar el polvo", "Pan rallado japonés panko 100g / 3½oz", "aceite vegetal, para freír", "salsa marrón, para servir", "4 resortes de menta fresca, más extra para decorar", "250g / 9oz de guisantes congelados", "1 cucharada de crema", "sal y pimienta para probar"], "method": ["Para el queso horneado y el encurtido, precaliente el horno a 180 ° C / 350 ° F / Gas 4. Retire la envoltura de plástico del queso y colóquelo en su caja, o cree un paquete de papel de aluminio para que se asiente.", "Pierce la parte superior del queso con un cuchillo pequeño y afilado. Empuja unas hojas de romero en cada hoyo, rocía con miel y espolvorea con pimienta negra recién molida. Hornee durante 15-20 minutos, o hasta que la parte superior esté dorada y el queso burbujee a través de las grietas. Sirva con rebanadas de baguette y pepinillo comprado en la tienda.", "Para los mini huevos escoceses, coloque cuidadosamente los huevos de codorniz en una olla de agua hirviendo y cocine durante dos minutos. Retire de la sartén directamente en un recipiente con agua helada para evitar que sigan cocinando.", "Transfiera los huevos a un tazón de vinagre de malta para remojar por alrededor de 10 minutos, esto hará que las cáscaras sean más fáciles de pelar.", "Mientras tanto, combine la carne picada, la salvia, la sal y la pimienta en un recipiente y reserve.", "Rompe el huevo en un bol y golpéalo. Coloque unas cucharadas de harina en otro tazón y las migajas de pan en un tercer tazón.", "Con cuidado pele los huevos de codorniz. Enróllalos en harina y luego moldea un cuarto de la mezcla de carne alrededor de cada huevo. Mézclalos en el huevo batido y luego cúbrelos con las migas de Panko. Coloque los huevos escocés preparados en la nevera mientras calienta el aceite vegetal para freír.", "Llene una olla de fondo grueso con aproximadamente 8 cm / 3 in de aceite vegetal y ponga a fuego medio. Para comprobar si el aceite está listo, deje caer una pizca de pan rallado. Deberían chisporrotear inmediatamente y elevarse a la superficie (PRECAUCIÓN: el aceite caliente es peligroso. No lo deje desatendido).", "Retire los huevos escoceses de la nevera y cuidadosamente baje en el aceite con una cuchara ranurada. Freír durante 3-4 minutos, o hasta que estén doradas por todas partes. Retire del aceite con la cuchara ranurada a un plato forrado con papel de cocina para absorber el exceso de aceite. Sirve con salsa marrón.", "Para la sopa de guisantes y menta, retire las hojas de las ramitas de menta y reserve. Coloque los guisantes en una cacerola con los tallos de menta y vierta lo suficiente para regarlos. Sazonar con sal y llevar a ebullición. Cocine por tres minutos, o hasta que los guisantes estén tiernos. Escurra y reserve algunos guisantes para adornar.", "Agregue los guisantes a una licuadora con un toque de líquido de cocina, hojas de menta, crema fresca y pimienta negra. Licúe hasta que quede suave y pruebe el condimento. Servir en vasos pequeños con unos guisantes en el fondo y una hoja de menta en la parte superior."], "url": "www_bbc_co_uk_food_recipes_british_tapas_94352", "title": "Tapas británicas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["300 ml / 10½ fl oz de vino blanco", "1kg / 2lb 4oz de mariscos mixtos, como berberechos, almejas, mejillones y guijarros, limpios y empapados en agua fría", "50 g / 1¾oz de mantequilla sin sal", "1 chalote, finamente picado", "1 diente de ajo, finamente picado", "1 bulbo de hinojo, finamente picado", "½ puerro, solo parte blanca, finamente picado", "Papas cerosas de 250 g / 9 oz, peladas y cortadas en cubos de 5 mm / ¼ in", "2 pellizcos hilos de azafrán", "1 estrella de anís", "500ml / 18 fl oz de caldo de pollo", "Crema doble 175ml / 6fl oz", "75g / 2½ oz de samphire", "2 tomates maduros, piel y semillas retiradas", "12 bucinos cocidos sin cáscara", "2 cucharadas de cebollines frescos finamente picados", "puñado de hojas de apio, finamente picadas", "sal y pimienta negra recién molida"], "method": ["Llevar el vino a ebullición en una olla grande con tapa. Agregue los mariscos, cubra la olla con la tapa, reduzca el fuego hasta que el vino esté hirviendo a fuego lento, y cocine a fuego lento los mariscos durante 3-5 minutos, o hasta que todas las conchas se hayan abierto (deseche las que no se abren).", "Escurra los mariscos, reservando el licor de cocina en un tazón. Cuando los mariscos estén lo suficientemente fríos como para manipularlos, recoge la carne de las conchas.", "Calentar la mantequilla en una cacerola grande a fuego medio. Agregue la chalota y el ajo y fría por 1-2 minutos, o hasta que estén blandos. Agregue el hinojo, el puerro, las papas, el azafrán y el anís estrellado y fría por otros 1-2 minutos.", "Agregue el licor de cocinado reservado y el caldo de pollo y lleve la mezcla a ebullición. Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento y cocine a fuego lento durante 3-4 minutos, o hasta que los cubos de patata estén tiernos.", "Agregue la crema y el hinojo y continúe cocinando a fuego lento durante 1-2 minutos, o hasta que la sopa se haya espesado un poco. Reduzca el fuego a bajo, luego agregue los tomates y la carne de mariscos, incluidos los buccinos. Caliente hasta que la carne se caliente.", "Agregue las cebolletas y las hojas de apio, sazone al gusto, con un poco de sal y pimienta negra recién molida, luego sirva."], "url": "www_bbc_co_uk_food_recipes_british_seaside_chowder_59346", "title": "Sopa de pescado británica con azafrán", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100g / 3½ oz de harina natural, más extra para enrollar", "100g / 3½oz de harina integral", "125g / 4oz de mantequilla fría, en cubos", "1 huevo de gallinas camperas, golpeado", "botón de mantequilla", "2 puerros medianos, cortados, cortados finamente", "50g / 2oz de mantequilla", "Crema semidescremada de 300 ml", "3 huevos de gallinas camperas, golpeados", "100 g / 3½ oz de carne de cangrejo marrón fresca", "pellizcar copos de sal marina", "100 g / 3½ oz de carne de cangrejo blanca fresca", "50g / 2oz de queso cheddar maduro, finamente rallado", "pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para la masa, pulse las harinas y la mantequilla en un procesador de alimentos hasta que la mezcla se asemeje a migas de pan finas. Con el motor en marcha, agregue el huevo en una corriente delgada y mezcle hasta que la mezcla comience a formar una bola.", "Haga rodar la masa en un círculo sobre una superficie de trabajo enharinada y úsela para revestir una lata agria acanalada de 23cm / 9 pulgadas. Presione la masa con las puntas de los dedos firmemente en la base y los lados. Corte cualquier exceso de hojaldre y pique ligeramente la base de la tarta con un tenedor. Enfriar en la nevera durante 30 minutos.", "Alinee la masa con una hoja grande de pergamino arrugado para hornear y medio relleno con alubias para hornear. Hornee la caja agria durante 25 minutos. Retire los granos y devuelva la tarta al horno por otros 5-10 minutos o hasta que la superficie esté seca y comience a dorarse. Retire del horno y reduzca el horno a 180C / 350F / Gas 4.", "Para el relleno, derrita la mantequilla en una sartén grande de base pesada a fuego lento. Agregue los puerros y freír suavemente durante 2-3 minutos, revolviendo hasta que se ablanden. Sáquelo del fuego y apártelo.", "Pon los huevos en una jarra grande y bate suavemente con un batidor. Agregue la crème fraîche, sazone con sal y pimienta negra recién molida. Batir con una cuchara de madera hasta que estén bien combinados. Agregue la carne de cangrejo marrón.", "Esparce los puerros sobre la caja de pastelería y salpique la carne blanca de cangrejo alrededor de ellos. Verter sobre la mezcla de crème friache y espolvorear con el queso. Cocine en la bandeja para hornear por 25 minutos, o hasta que el relleno esté dorado y solo listo. (Todavía se tambaleará un poquito en el centro ya que continuará fraguando mientras se enfría).", "Retire la quiche del horno y deje enfriar en la lata durante 15 minutos antes de quitarla."], "url": "www_bbc_co_uk_food_recipes_british_crab_and_leek_40568", "title": "Tarta de cangrejo y puerro", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/british_crab_and_leek_40568_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["150g / 5½oz de judías verdes", "dash aceite de oliva", "1 cebolla grande, finamente picada", "Arroz risotto 300g / 10½ oz", "1 litro / 1¾ pintas de caldo de verduras", "3 cucharadas de mascarpone (opcional)", "50g / 2 oz de queso parmesano (o queso vegetariano similar), finamente rallado, más extra para servir", "200 g / 7oz de habas cocidas", "3 perillas de mantequilla", "sal y pimienta negra recién molida", "1 cucharada colmada de hierbas frescas picadas (una mezcla de perifollo, estragón, cebollín y perejil)"], "method": ["Ensarte los frijoles, córtelos en trozos de 2cm / ¾ en trozos y cocine en una olla con agua hirviendo hasta que estén tiernos. Escurrir y apartar.", "Caliente el aceite de oliva en una olla grande con tapa, luego agregue la cebolla y cocine a fuego lento durante 3-4 minutos, o hasta que se ablande.", "Agregue el arroz y cocine durante 2-3 minutos más, revolviendo continuamente.", "Verter sobre el caldo, remover la mezcla y cubrir con la tapa. Cocine a fuego lento durante 15-17 minutos, o hasta que el arroz esté tierno.", "Agregue el mascarpone (si se usa), parmesano, mantequilla, habas y judías verdes y sazone al gusto con sal y pimienta negra recién molida. Espolvorea sobre las hierbas para servir."], "url": "www_bbc_co_uk_food_recipes_broad_bean_and_runner_93551", "title": "Rissotto de alubias y frijoles", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/broad_bean_and_runner_93551_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["450g / 1lb de espesor rebanadas de pan blanco", "6 cucharadas de aceite de oliva", "sal y pimienta", "300g / 10oz de frijoles congelados", "6 pequeñas lechugas gema", "100 g / 3½ oz de queso parmesano, o queso duro vegetariano, cortado en virutas con un pelador de verduras", "3 cucharadas de mostaza Dijon", "5 cucharadas de vinagre de vino blanco", "8 cucharadas de aceite de oliva", "5 cucharadas de crema doble o simple", "1 cucharada redondeada de azúcar en polvo", "sal y pimienta"], "method": ["Para los croutons, precalentar la parrilla a fuego. Corta las cortezas del pan y deséchalas. Corta el pan en pequeños cubos de tamaño uniforme. Coloque una bolsa de plástico en un recipiente, vierta el aceite y sazone con sal y pimienta.", "Agregue los crotones en cubos a la bolsa, levante la bolsa y agite, lanzando los cubos en el aceite sazonado. Incline el pan en una bandeja para hornear y colóquelo debajo de la parrilla. Gírelo hasta que estén dorados uniformemente; obsérvelo todo el tiempo para evitar quemarse y agitarlo de vez en cuando para asegurarse de que se doren uniformemente.", "Para la ensalada, cocine las habas en agua hirviendo durante aproximadamente 3-4 minutos o hasta que estén tiernas. Escurrir y refrescar en agua fría. Retire los frijoles de sus vainas, reserve.", "Corta los extremos de las lechugas Little Gem pero mantén la raíz intacta. Rebana cada lechuga en seis cuñas. Arregle en un plato, espolvoree con frijoles y queso parmesano y sazone con sal y pimienta.", "Para el aderezo de mostaza, mida todos los ingredientes del aderezo en un tarro de mermelada limpio, sazone con sal y pimienta y selle con una tapa y agite hasta que se combinen. Vierta sobre el aderezo, mezcle y sirva."], "url": "www_bbc_co_uk_food_recipes_broad_bean_and_little_99871", "title": "Ensalada de frijoles y Little Gem", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["450 g / 1 libra de habas frescas, peso envasada", "100 g / 3½ oz de garbanzos en lata, escurridos y se reservan 6 cucharadas del líquido de la lata", "1 diente de ajo, aplastado", "2 cucharadas de tahini", "1 cucharada de jugo de limón", "½ cucharadita de sal", "pellizcar el comino molido", "pizca de pimienta blanca molida", "azúcar impalpable (opcional)", "4 cucharadas de aceite de oliva virgen extra, más extra para lloviznar", "1 cucharadita de semillas de sésamo, tostadas", "tostada Melba"], "method": ["Cocine las habas en polvo en una sartén de agua hirviendo con sal durante uno o dos minutos, o hasta que estén tiernas. Escurrir y enfriar en agua helada.", "Una vez que estén fríos, los frijoles están listos para drenar y reiniciar (etapa doble de podding): quite la piel de los frijoles verdes brillantes.", "Coloque las habas (guarde algunas para decorar), garbanzos, ajo picado, pasta de tahini, jugo de limón, sal, comino, pimienta blanca y azúcar en polvo, si usa, en un procesador de alimentos y mezcle hasta que quede suave, aflojando con el garbanzo reservado espíritu.", "A medida que la mezcla continúa puré, vierta lentamente el aceite de oliva hasta que esté completamente combinado.", "Sirva el hummus de frijol ancho hecho en casa con una cuchara o con un tubo en un tazón, cubierto con las habas de sésamo tostadas y un poco de aceite de oliva tostado guardado con la tostada melba."], "url": "www_bbc_co_uk_food_recipes_broad_bean_hummus_29052", "title": "Hummus de frijol ancho", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 remolachas del patrimonio", "2 chalotas", "2 cucharadas de aceite de colza", "Habas de 500g / 1lb 2oz, removidas y con piel exterior", "200 g / 7 oz de guisantes frescos, envasadas", "Mangetout de 200 g / 7 oz, en rodajas finas", "2 bolas de mozzarella de búfala, desgarrada", "algunas hojas de albahaca, para adornar", "30g / 1oz de aderezo francés", "30g / 1 oz de miel", "30g / 1oz de vinagre balsámico blanco", "pizca de sal", "exprimir jugo de limón", "1 diente de ajo, aplastado", "100g / 3½oz de queso azul", "50g / 1¾oz de suero de leche", "Crema de 40g / 1½ oz", "Mayonesa 40 g / 1½ oz", "guise salsa worcestershire (omita si se cocina para vegetarianos)", "dash Tabasco"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Coloque las remolachas y los chalotes, sin pelar, sobre una hoja de papel de aluminio y rocíe con el aceite. Envuélvalos y selle para hacer un paquete y hornear en el horno durante 40-50 minutos, o hasta que estén blandos.", "Retirar del horno y dejar enfriar. Una vez frío, pelar las remolachas y chalotes y cortar en cuartos.", "Prepare el aderezo de mostaza y miel mezclando todos los ingredientes en un tazón o licuadora hasta que quede suave.", "Escalde las habas en agua hirviendo durante un par de minutos y luego escurra.", "Caliente una sartén grande y agregue las habas, los guisantes y el mangetout. Agregue el aderezo de mostaza y miel a la sartén y cocine por un par de minutos.", "Prepare el aderezo de queso azul mezclando todos los ingredientes en una licuadora hasta que quede suave.", "Coloque los frijoles, mangetout y guisantes en un tazón grande.", "Esparce sobre las piezas de mozzarella desgarrada, chalotes y remolacha.", "Vierta la ensalada con un poco del aderezo de queso azul, decore con unas hojas de albahaca rotas y sirva."], "url": "www_bbc_co_uk_food_recipes_broad_bean_mange_tout_00471", "title": "Ensalada templada de habas, mangetout, guisantes, remolacha asada y mozzarella", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/broad_bean_mange_tout_00471_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharadita de semillas de comino", "1 cucharadita de semillas de cilantro", "50ml / 2fl oz de aceite vegetal", "1 cebolla, pelada, finamente picada", "2 dientes de ajo, pelados, aplastados", "1 ramita de canela", "1 cucharadita de cúrcuma molida", "10 vainas de cardamomo, ligeramente trituradas", "2 dientes", "225g / 8oz de arroz basmati, remojado en agua durante 20 minutos y escurrido", "Habas de 200g / 7oz, fuera de sus vainas, membranas internas quitadas", "400ml / 14fl oz de caldo de verduras", "4 calabacines, cortados en rondas de 3cm / 1in", "aceite de oliva, para cepillar", "sal y pimienta negra recién molida", "50g / 2oz de mantequilla", "perejil fresco picado", "jugo de limon", "yogur"], "method": ["Caliente una sartén seca y agregue las semillas de comino y cilantro. Freír a fuego medio, moviendo las especias alrededor de la sartén con frecuencia para evitar que se quemen, durante 2-3 minutos o hasta que estén aromáticas y ligeramente doradas. Transfiera a un mortero y muela con un mortero.", "En una sartén, caliente el aceite vegetal y fría la cebolla y el ajo a fuego medio-bajo durante 6-8 minutos, o hasta que se ablanden. Agregue las especias tostadas molidas, la rajita de canela, la cúrcuma molida, las vainas de cardamomo y los clavos y cocínelos por 2-3 minutos.", "Agregue el arroz, las habas y el caldo, tape la olla con una tapa y cocine a fuego lento durante 12-15 minutos, o hasta que el arroz esté tierno.", "Mientras tanto, caliente una sartén hasta que fume. Cepille los calabacines con el aceite de oliva, sazone con sal y pimienta negra recién molida y luego cocine en la plancha por 2-3 minutos en ambos lados, o hasta que esté chamuscado y ablandado. Dejar de lado.", "Para servir, revuelva la mantequilla en el pilaf hasta que se derrita, luego la cuchara en tazones de servir y la parte superior con las piezas de calabacín a la parrilla. Adorne con perejil fresco picado, un chorrito de jugo de limón y una cucharada de yogur."], "url": "www_bbc_co_uk_food_recipes_broadbeanandcourgett_91842", "title": "Pilaf de frijol ancho y calabacín", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/broadbeanandcourgett_91842_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["300 g / 10½ oz de habas", "Crema de 150g / 6oz", "sal y pimienta recién molida", "azúcar pizca", "1 cucharadita de ajo, finamente picado", "1 cucharada de orégano fresco, picado", "1 cucharadita de comino molido", "150ml / ¼ pinta de aceite de oliva virgen extra", "cebollas de primavera, para adornar", "chile en polvo, para adornar", "comino molido, para adornar"], "method": ["Use un mouli de verdura para triturar las habas, esto machacará la carne de frijol pero dejará las pieles.", "Agregue un poco de crema, sal, pimienta y un toque de azúcar.", "Agregue el ajo, el orégano, el comino, el aceite de oliva y la pimienta al puré de habas.", "Adorne con cebollas de primavera, chile en polvo, comino molido y aceite de oliva."], "url": "www_bbc_co_uk_food_recipes_broadbeandip_68044", "title": "Salsa de haba", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["½ papa grande, pelada, cortada en cubos y hervida hasta que esté tierna", "puñado de habas, retiradas de las vainas y blanqueadas", "puñado de espárragos, recortado y blanqueado", "sal y pimienta negra recién molida", "55g / 2oz de queso de cabra", "2 cucharadas de crema doble", "2 cucharadas de albahaca fresca finamente picada", "½ pechuga de pato, sin piel, rebanada en 4 tiras", "2 rebanadas de jamón de Parma, cortadas a la mitad", "1 cucharada de aceite de oliva"], "method": ["Para la ensalada, coloque la papa cocida, las habas y los espárragos en un recipiente y sazone con sal y pimienta negra recién molida.", "Para el aderezo, caliente el queso de cabra y la crema en una cacerola a fuego lento hasta que el queso se haya derretido y la salsa esté suave. Revuelva en la albahaca.", "Para el pato, envuelva cada tira de pato en media loncha de jamón de Parma.", "Calentar el aceite en una sartén y freír durante 6-8 minutos, o hasta que esté crujiente y dorado, y el pato esté bien cocido.", "Para servir, coloque la ensalada en el centro de un plato, cubra con el pato y rocíe sobre el aderezo. Sirve caliente o frío."], "url": "www_bbc_co_uk_food_recipes_broadbeanasparagusan_87236", "title": "Ensalada de frijoles, espárragos y papas con pato en jamón serrano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Frijoles en daditos de 85 g / 3 oz, cocidos y sin piel", "¼ de cebolla roja, pelada y picada", "1 cucharada de cebollín, picado", "1 cucharada de aceite de oliva", "½ limón, solo jugo", "sal y pimienta negra recién molida"], "method": ["Para hacer la ensalada, mezcle las habas, la cebolla roja y el cebollín en un tazón.", "Rocíe el aceite de oliva y el jugo de limón y luego agregue la sal y la pimienta negra recién molida.", "Mezcle y luego transfiéralo a un plato de servir."], "url": "www_bbc_co_uk_food_recipes_broadbeansalad_76452", "title": "Ensalada de frijoles", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["450 g / 1 libra de habas frescas jóvenes en sus vainas", "50ml / 2fl oz de aceite de oliva", "2 cebollas picadas", "2 dientes de ajo, pelados y finamente picados", "½ limón, solo jugo", "250ml / ½ pinta de caldo de verduras", "2 cucharadas de eneldo fresco picado", "una porción de yogur griego (opcional)"], "method": ["Lave los frijoles, la parte superior, la cola y ensartarlos cuando sea necesario.", "Calentar el aceite en una sartén grande con tapa gruesa y agregar las cebollas y el ajo. Cocine por 2-3 minutos para ablandar. Agregue los frijoles en sus vainas y el jugo de limón y revuelva para combinar.", "Agregue el caldo, lleve a ebullición y cocine durante 20-25 minutos hasta que las vainas estén muy tiernas. Cubra y reduzca el fuego a fuego lento.", "Al final de la cocción, agregue el eneldo. Sirve caliente. Agregue una cucharada generosa de yogur al estilo griego (opcional)."], "url": "www_bbc_co_uk_food_recipes_broadbeanswithdill_74757", "title": "Habas con eneldo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["5 cucharadas de aceite de oliva", "85 g / 3 oz de habas, fuera de sus vainas", "½ cebolla, en rodajas", "100 g / 3½ oz de queso feta, desmenuzado", "125g / 4½oz de tomates cherry, cortados por la mitad", "½ cucharadita de azúcar", "½ cucharadita de sal", "100g / 3½ oz de patatas nuevas, en rodajas", "1 cucharadita de cúrcuma molida", "25g / 1oz de mantequilla", "1 puñado de perejil fresco, picado", "1 puñado de albahaca fresca picada", "1 puñado de cebollín fresco, picado"], "method": ["Caliente dos cucharadas de aceite en una sartén y fría ligeramente las habas y la cebolla durante 6-8 minutos, o hasta que las cebollas se ablanden. Retirar del fuego y dejar enfriar un poco antes de remover el queso feta.", "Coloque la mitad de los tomates en un plato y espolvoree el azúcar y la sal. Coloque en el microondas durante cinco minutos a fuego medio, o hasta que se seque. Retire del microondas, rocíe sobre el aceite de oliva restante y deje enfriar antes de remover en la cebolla y la mezcla de habas.", "Precalentar las rodajas nuevas de patata en agua salada hirviendo aderezada con cúrcuma molida durante 5-6 minutos, luego escurrir. Derretir la mantequilla en una sartén y freír las papas durante 5-6 minutos, o hasta que estén tiernas y doradas.", "Para servir, coloca las hierbas frescas en un plato para servir y apila la mezcla de frijoles, cebolla, queso feta y tomate seco. Dispersar sobre las mitades de tomate restantes, colocar las papas de cúrcuma alrededor del borde del plato y rociar sobre el resto del aceite de la sartén."], "url": "www_bbc_co_uk_food_recipes_broadbeansaladwithdr_89015", "title": "Ensalada de frijoles con tomates secos, queso feta y patatas de cúrcuma", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]