[{"ingredients": ["6-8 chiles rojos picados", "2 cucharadas de agua", "150 g / 5½ oz de azúcar en polvo", "2 cucharadas de mirin", "1 lima, solo jugo", "1 vientre de cordero, recortado de exceso de grasa", "2 limas, solo jugo", "3 dientes de ajo, aplastados", "1 cucharada de jengibre, finamente rallado", "2 cucharadas de azúcar de palma", "4 cucharadas de nuoc nam (salsa de pescado vietnamita)", "1 chile rojo, finamente picado", "1 chile rojo, en rodajas", "Hojas de mizuna de 115 g / 4 oz", "1 manojo grande de menta, hojas recogidas", "½ coco, cáscara eliminada, carne desmenuzada", "½ pepino, cortado a la mitad longitudinalmente, en rodajas finas en diagonal", "12 chuletas de cordero, completamente cortadas"], "method": ["Para la mermelada, caliente los chiles picados, el agua, el azúcar, el mirin y el jugo de lima en una cacerola hasta que hierva.", "Cocine, revolviendo continuamente, durante 6-8 minutos, luego retire la sartén del fuego y déjela enfriar, ya que el atasco se espesará a medida que se enfríe.", "Para la ensalada, precaliente la parrilla a un nivel medio alto. Coloque la barriga de cordero en una bandeja de parrilla pesada y colóquela debajo de la parrilla durante 7-8 minutos, volteándola hasta la mitad, luego retírela de la parrilla y descanse durante cinco minutos.", "Coloque el jugo de lima, el ajo, el jengibre, el azúcar de palma, la salsa de pescado y los chiles rojos picados en un mortero o procesador de alimentos y mezcle hasta que se combinen.", "Coloque el chile rebanado, mizuna, hojas de menta, coco y pepino en un bol y mezcle suavemente para combinar.", "Cortar el vientre de cordero en tiras finas y luego mezclar en la ensalada. Agregue el aderezo a la ensalada y mezcle una vez más.", "Para cocinar las chuletas, caliente una sartén hasta que esté muy caliente. Cepille las chuletas con un poco de aceite y sazone con sal y pimienta negra recién molida.", "Coloque las chuletas en la plancha y cocine a cada lado durante 2-3 minutos hasta que estén cocidas pero aún rosadas, luego quítelas y descanse durante dos minutos en un plato caliente.", "Coloca tres chuletas de cordero en cada plato de servir, coloca la mermelada de chile al lado y apila la ensalada junto a las chuletas de cordero."], "url": "www_bbc_co_uk_food_recipes_grilled_lamb_chops_with_01274", "title": "Chuletas de cordero a la parrilla con mermelada de chile y cordero a la parrilla Ensalada tailandesa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 filetes de pierna de cordero 2 x 225 g / 8 oz", "sal y pimienta negra recién molida", "2 cucharadas de aceite de semilla de uva", "2 dientes de ajo picados", "Jengibre fresco de la raíz de los 2.5cm / 1in, pelado y rallado", "1 cucharada de miel clara", "6 cucharadas de salsa de soja ligera", "3 cucharadas de aceite de oliva", "2 cucharadas de aceite de oliva", "2 bulbos de hinojo, cortados y descuartizados", "1 cucharadita de semillas de hinojo", "2 limones, solo jugo", "Pastillas de 125ml / 4fl oz"], "method": ["Para adobar los filetes, agréguelos a un tazón con todos los ingredientes del adobo y sazone con sal y pimienta negra recién molida. Poner en la nevera, tapado, durante al menos una hora, pero preferiblemente durante la noche.", "Precalentar el horno a 200C / 180C Fan / Gas 6.", "Para el hinojo estofado, caliente el aceite en una sartén. Una vez caliente, agregue el hinojo y las semillas de hinojo. Cocine a cada lado durante 3-4 minutos o hasta que el hinojo se dore. Agregue los pastis a la sartén y reduzca a la mitad. Agregue el jugo de limón y 125ml / 4 fl oz de agua y vuelva a reducir a la mitad antes de sazonar con sal y pimienta negra recién molida. Transfiera al horno por 15-20 minutos, o hasta que el hinojo esté tierno.", "Mientras tanto, para cocinar los filetes, caliente una sartén hasta que esté caliente y coloque los filetes en la plancha. Cocine por 3-4 minutos en cada lado, o hasta que esté cocido a su gusto. Retire los filetes de la sartén, sazone con sal y pimienta negra recién molida y déjelos a un lado en un lugar cálido para descansar.", "Para servir, ponga el hinojo estofado en el centro del plato y cubra con las rebanadas del filete de cordero. Termine con los jugos de pan del hinojo estofado."], "url": "www_bbc_co_uk_food_recipes_grilled_lamb_steaks_with_88836", "title": "Filetes de cordero a la parrilla con hinojo estofado", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 filetes de caballa, 1 despellejado, deshuesado y finamente cortado en cubos, 1 dejado entero", "1 chalote, finamente cortado en cubitos", "1 limón, cáscara y jugo solamente", "2 cucharadas de cebollines frescos finamente picados", "2 cucharaditas de alcaparras para bebés, escurridas, finamente picadas", "50 g / 1 oz de crema fresca", "100ml / 3½fl oz de vinagre de vino de arroz", "20 g / oz de azúcar en polvo", "2 chalotes de plátano, finamente cortados en anillos", "3 cucharadas de apio finamente picado", "½ racimo de rábanos, preferiblemente la variedad de desayuno francés", "pizca de sal", "3 cucharadas de hojas de apio finamente picadas", "100ml / 3½fl oz de aceite de oliva", "1 baguette, en rodajas finas", "2 cucharadas de berro de cilantro, para servir"], "method": ["Para el tartar de caballa, mezcle todos los ingredientes tartar de caballa, aparte del filete de caballa entera, juntos en un bol hasta que estén bien combinados. Enfriar en la nevera hasta que sea necesario.", "Precaliente la parrilla a un ajuste medio. Coloque el filete de caballa entero en una bandeja para hornear y ase a la parrilla durante 2 o 3 minutos, o hasta que se dore por la parte superior y se cocine completamente. Dejar de lado.", "Para los anillos de chalote, caliente el vinagre de vino de arroz y el azúcar en una cacerola no reactiva a fuego medio. Cuando la mezcla esté a punto de hervir, agregue los anillos de chalote, el tallo de apio, los rábanos y la sal. Reserve para macerar durante 5 minutos. Agregue las hojas de apio justo antes de servir.", "Para los croûtons, caliente el aceite en una sartén de base pesada a fuego medio hasta que la miga de pan chisporrotee y se ponga dorada cuando se la deje caer. (Precaución: El aceite caliente puede ser peligroso. No lo deje desatendido). Agregue las rebanadas de baguette al aceite caliente, en lotes si es necesario, y fría por 2-3 minutos por cada lado, o hasta que estén doradas por ambos lados y crujientes. . Retire de la sartén con una espumadera y déjela a un lado para escurrir sobre papel de cocina.", "Para servir, divida los croûtons por igual entre cuatro platos para servir. Cubra cada croûton con una cucharada de tartar de caballa. Cucharee los anillos de chalote y el líquido de maceración a lo largo. Adorne con el berro de cilantro y un trozo de caballa a la parrilla."], "url": "www_bbc_co_uk_food_recipes_grilled_mackerel_and_54030", "title": "Tartar de caballa y caballa a la parrilla con anillos de chalota, croûtons y berros de cilantro", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 nabo blanco, finamente cortado en una mandolina", "Vinagre de vino blanco 110ml / 4fl oz", "1 cucharadita de azúcar", "1 cucharadita de sal", "50 g / 2 oz de perejil flatleaf, solo hojas", "50g / 2oz de mantequilla", "½ cebolla, finamente picada", "Hojas de berro de 150g / 5oz", "250ml / 9fl oz de caldo de verduras", "12 espárragos de lanzas, recortados", "3 cucharadas de aceite de oliva virgen extra", "4 filetes de caballa", "2 cucharadas de hojas de berro de bebé"], "method": ["Coloque el nabo en un recipiente resistente al calor.", "Ponga 110ml / 4fl de agua en una sartén con el vinagre de vino blanco, el azúcar y la sal, y caliente hasta que la sal y el azúcar se hayan disuelto.", "Vierta sobre el nabo y déjelo a un lado para que quede encurtido por dos horas, luego escurra el líquido decapante.", "Ponga a hervir una sartén de agua con sal, agregue el perejil y blanquee y luego revuelva en agua helada.", "Escurrir, exprimir y luego cortar y reservar.", "Calentar una sartén hasta que esté caliente, agregar la mantequilla y la cebolla y cocinar por unos minutos hasta que se ablande.", "Agregue el berro y el caldo y lleve a ebullición, luego agregue el perejil escaldado picado.", "Cortar en lotes en un procesador de alimentos luego mezclar en un puré fino y pasar a través de un tamiz fino, a continuación, dejar de lado.", "Poner a hervir una olla de agua con sal, agregar los espárragos y blanquear durante 2-3 minutos hasta que estén tiernos.", "Escurrir y sazonar los espárragos con un poco de aceite de oliva, sal y pimienta negra.", "Precalentar la parrilla a alto.", "Coloque la caballa en una bandeja de parrilla y sazone con sal y pimienta negra.", "Grill por dos minutos en cada lado.", "Para servir, coloque una cucharada de puré de perejil en el centro de cada plato y frote en el centro de la placa. Coloque la caballa encima y esparza los espárragos y los nabos alrededor del plato. Termine con una dispersión de berros de bebé y una llovizna de aceite."], "url": "www_bbc_co_uk_food_recipes_grilled_mackerel_with_45828", "title": "Caballa a la parrilla con nabo en escabeche, espárragos y berros", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["20g / ¾oz dulse algas marinas (disponible de proveedores especializados y algunas tiendas de alimentos saludables)", "175g / 6oz de mantequilla, ablandada", "½ limón, solo jugo", "2 caballas frescas, sin tripas (pida a su pescadero que haga esto por usted, o que marque la caballa por usted)", "1 chalote, en rodajas finas", "Habas de 75g / 3oz (sin las vainas, membranas internas quitadas)", "100 g / 3½ oz de guisantes frescos, medio removidos de sus vainas, medio partidos pero dejados en las vainas", "12 lanzas de espárragos, recortadas", "4 ramitas de estragón fresco, solo hojas"], "method": ["Precalentar la parrilla a su configuración más alta.", "Remoje las algas dulse en agua fría durante unos 10 segundos, luego escurra bien y corte aproximadamente. Mezcle en un procesador de alimentos hasta que esté finamente picado, luego agregue la mantequilla ablandada y mezcle hasta que esté bien combinado. Agregue el jugo de limón y mezcle una vez más. (Puede guardar cualquiera que no use en el congelador).", "Para masticar la caballa, abre cada barriga de caballa y desliza un cuchillo afilado debajo de la caja torácica, alejando los huesos de la carne. Corta los huesos en la cabecera y la cola, luego levanta la caja torácica y los huesos. Abra la caballa un poco, luego eche la mantequilla por el centro, dejando solo una cucharada grande en el tazón.", "Haga 2 paquetes abiertos de papel de aluminio para sostener la caballa y colóquelos en una bandeja para hornear. Coloque la caballa mariposa dentro de las parcelas de aluminio y ase a la parrilla durante 5-10 minutos, hasta que la mantequilla se haya derretido y la caballa esté recién hecha.", "Mientras tanto cocina las verduras. Ponga a hervir 100 ml / 3½ fl oz de agua en una sartén grande. Agregue los chalotes y las habas y cocine a fuego lento durante 2 minutos, luego agregue los guisantes y las vainas y cocine a fuego lento durante 1 minuto. Agregue las lanzas de espárragos y las ramitas de estragón y deje que el agua hierva a fuego lento. Agregue la última cucharada de mantequilla dulse al agua y cocine a fuego lento los espárragos y las verduras por otros 2 minutos, o hasta que los espárragos estén tiernos y la mantequilla se haya emulsionado. Sazonar las verduras, al gusto, con sal y pimienta negra recién molida.", "Levante la caballa fuera de las bandejas de aluminio y en las placas de servir, rociando el exceso de mantequilla de las bandejas en la parte superior. Coloque las verduras al lado."], "url": "www_bbc_co_uk_food_recipes_grilled_mackerel_with_49800", "title": "Caballa a la plancha con mantequilla dulse", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Ajo picado 25g / 1oz", "25 g / 1 oz de raíz de jengibre fresco, rallado con jugo", "Pasta umeboshi 50g / 1¾oz (hecha de frutas ume en escabeche), disponible en proveedores japoneses especializados", "1 lima, jugo y ralladura solamente", "200ml / 7fl oz de aceite de oliva ligero", "10 hojas verdes de shiso, picadas", "¼ de manojo de perejil de flatleaf", "8 mejillas de rape medianas", "4 lechuga gema bebé, descuartizado", "1 aguacate, firme pero maduro, descuartizado", "6 lanzas de espárragos", "sal marina", "aceite de oliva ligero", "35 g / 1¼ oz de frijoles edamame", "12 hojas pequeñas de menta"], "method": ["Para el aderezo, mezcle el ajo, el jengibre y el umeboshi en un tazón. Agregue el jugo de limón y la ralladura, luego mezcle con el aceite. Agregue las hierbas y reserve.", "Para el rape a la parrilla, precaliente la parrilla a altura.", "Coloque las mejillas de rape en un plato poco profundo y vierta más de la mitad del aderezo. Dejar macerar durante 30 minutos.", "Caliente una olla grande de agua hirviendo y blanquee los espárragos durante un minuto, luego retírelos y póngalos en agua fría para enfriarlos, luego drene.", "Cubra la lechuga, el aguacate y los espárragos en un poco de aceite de oliva y espolvoree con sal al gusto. Coloque la lechuga, el aguacate y los espárragos debajo de la parrilla. Retire las verduras mientras se cocinan y están carbonizadas en cada lado. Reserve las verduras a la parrilla a temperatura ambiente.", "Ase las mejillas de rape durante 2-3 minutos por cada lado. Una vez retirado de la parrilla, mezcle las mejillas con el adobo. Deja las mejillas para descansar durante tres minutos para terminar de cocinar.", "Para servir, corte las verduras en pedazos del tamaño de un bocado y mezcle con los frijoles edamame y hojas de menta. Coloque las verduras en un plato de servir y vístelas.", "Coloque las mejillas de rape sobre las verduras. Termine con el aderezo restante y sirva."], "url": "www_bbc_co_uk_food_recipes_grilled_monkfish_cheeks_52393", "title": "Mejillas de rape a la plancha con salsa umeboshi y shiso", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 cucharadas de aceite de oliva virgen extra", "1 cucharada de vinagre balsámico (no un sirope)", "1 cucharadita de mostaza Dijon", "sal marina escamada y pimienta negra recién molida", "2 cucharaditas de aceite de oliva", "4 melocotones, casi maduros pero no demasiado blandos, descuartizados y apedreados", "Burrata con bola de 200g / 7oz, drenada y rasgada en trozos (o 2 x 125 g / 4½ oz de mozzarella)", "Cohete de bolsa de 70 g / 2½ oz", "1 manojo de albahaca, solo hojas, aproximadamente desgarrado"], "method": ["Para el aderezo, mezcle ligeramente todos los ingredientes en un tazón pequeño. Sazone al gusto y reserve.", "Para los duraznos, engrase ligeramente una sartén o barbacoa con el aceite y luego póngalo caliente y agradable. Es posible que deba trabajar en lotes, según el tamaño de su bandeja. Coloque los cuartos de durazno, con el lado del corte hacia abajo en la sartén de la plancha o la barbacoa durante 1-2 minutos para darles una buena marca a la brasa.", "Use una rebanada de pescado de metal para ayudar a levantarlos para no dejar marcas de brasa. Ponlas en el otro lado cortado por otro minuto (no cocines en el lado de la piel). La carbonización se agregará al sabor. También puede usar una sartén para cocinar, pero obviamente no obtendrá las líneas a la parrilla. Siente los melocotones con el lado cortado en un plato grande para servir a medida que avanzas.", "Coloque los trozos de buratta (o mozzarella) alrededor de los melocotones y esparza el cohete y las hojas de albahaca. Esparce un poco de sal y pimienta encima. Vuelva a batir rápidamente el aderezo si es necesario, rocíe y sirva."], "url": "www_bbc_co_uk_food_recipes_grilled_peach_burrata_88873", "title": "Ensalada de durazno, burrata y albahaca a la parrilla con aderezo de Dijon", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/grilled_peach_burrata_88873_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 piña, pelada, sin corazón y cortada en 8 cuñas", "1 lima, solo jugo", "1 cucharada de jarabe de arce", "1 cucharadita de jengibre molido", "1 cucharada de ron oscuro", "4 cucharadas de yogur natural crema dorada"], "method": ["Caliente una barbacoa o una sartén a fuego alto.", "Coloque la piña en un tazón grande. Agregue el jugo de lima, el jarabe de arce, el jengibre y el ron y mezcle bien para combinar.", "Cocine la piña durante 2-3 minutos en cada lado, o hasta que esté ligeramente carbonizada.", "Sirve con el yogur o crema fresca."], "url": "www_bbc_co_uk_food_recipes_grilled_pineapple_89456", "title": "Piña a la parrilla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["25 g / 1oz de mantequilla sin sal", "4 manzanas Bramley, peladas y cortadas en trozos", "50 g / 1 oz de azúcar en polvo", "200ml / 7fl oz de sidra scrumpy", "200 g / 7 oz de morcilla", "50g / 1¾oz de harina natural", "2 huevos de gallinas camperas, golpeados", "50g / 1¾oz pan rallado panko japonés", "aceite de colza, para freír", "1 kg / 2lb 4 oz de lomo de cerdo con hueso, francés cortado, cortado en cuatro chuletas gruesas", "sal y pimienta", "50 g / 1¾oz de mantequilla sin sal", "25 g / 1oz de mantequilla sin sal", "1 cabeza de verduras de primavera, en rodajas gruesas", "sal y pimienta", "250ml / 9fl oz jus o salsa de cerdo"], "method": ["Para la salsa de sidra, caliente la mantequilla en una cacerola. Agregue las manzanas, el azúcar y la sidra de scrumpy. Haga hervir a fuego lento y cocine hasta que las manzanas estén muy suaves. Agregue un poco más de sidra o agua si la mezcla se vuelve demasiado seca. Revuelva de vez en cuando.", "Para la morcilla crujiente, corte el pudín en trozos de 2½cm / 1in. Espolvorea las piezas en harina, sumérgelas en el huevo batido y cúbrelas con pan rallado panko. Guárdelo en el refrigerador hasta que esté listo para cocinar.", "Para las chuletas de cerdo, precaliente una parrilla en alto. Sazone las chuletas de cerdo con sal y pimienta.", "Coloque la tajada en una sartén a prueba de horno y colóquela debajo de la parrilla. Cocine por ambos lados durante 3-4 minutos. Retire de la parrilla y coloque en la placa. Agregue la mantequilla y, cuando se derrita, úselo para hilvanar la tajada. Coloque las chuletas a un lado para descansar antes de servirlas.", "Para obtener el flan negro, caliente una freidora a 180 ° C o 350 ° F, o caliente el aceite de colza en una sartén profunda de fondo grueso hasta que la miga de pan chisporrotee y se ponga dorada cuando se la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Freír el budín negro cubierto durante 2-3 minutos o hasta que esté crujiente. Retire de la freidora y escurra sobre papel de cocina.", "Para los verdes de primavera, en una sartén calentar la mantequilla con 50 ml / 2 fl oz de agua para hacer una emulsión. Agregue los greens, cubra con una tapa y deje hervir durante 2-3 minutos. Condimentar con sal y pimienta.", "Para servir, coloque una chuleta de cerdo en cada plato con una cucharada de salsa de sidra, morcilla y verduras crujientes. Rocíe el jus de cerdo o la salsa."], "url": "www_bbc_co_uk_food_recipes_grilled_pork_chop_with_18109", "title": "Chuleta de cerdo a la parrilla con morcilla, salsa de sidra y verduras crujientes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 x 200 g / 7 oz de chuletas de cerdo", "sal y pimienta negra recién molida", "2 cucharadas de aceite de oliva", "50g / 2oz de mantequilla sin sal", "Col de primavera 200 g / 7 oz, finamente triturado", "1 coliflor grande, cortada en florecillas", "50 g / 2 oz de mantequilla, más extra para engrasar", "Harina normal de 50g / 2oz", "450ml / 16fl de leche en oz", "2 huevos de gallinas camperas, solo yemas", "1 cucharadita de mostaza inglesa", "splash salsa Worcestershire", "sal y pimienta negra recién molida", "200g / 7oz Lincolnshire Poacher (o queso cheddar fuerte), rallado"], "method": ["Para las chuletas de cerdo a la parrilla, precaliente el horno a 200C / 400F / Gas 6.", "Sazone las chuletas de cerdo con sal y pimienta negra recién molida y luego frote con un poco de aceite de oliva.", "Caliente una sartén hasta que esté caliente, agregue las chuletas de cerdo y cocínelas por cada lado hasta que estén doradas, luego transfiera la sartén al horno y cocine durante 5 minutos hasta que la carne de cerdo esté recién hecha.", "Retire la carne de cerdo del horno y déjela reposar durante 4-5 minutos.", "Mientras tanto, caliente una sartén hasta que esté caliente, agregue la mantequilla y el repollo y saltee durante 2-3 minutos hasta que estén tiernos. Sazonar con sal y pimienta negra recién molida y reservar hasta que se necesite.", "Para el queso de coliflor, precaliente el horno a 200C / 400F / Gas 6.", "Pon a hervir una olla grande de agua con sal, luego agrega las flores de coliflor y cocina durante dos minutos.", "Escurra y coloque la coliflor en un plato a prueba de horno con mantequilla.", "Coloque la mantequilla y la harina en una cacerola y caliente para derretir la mantequilla.", "Cocine, revolviendo por uno o dos minutos hasta que esté ligeramente dorado.", "Retire la sartén del fuego y bata gradualmente en la leche para formar una salsa suave.", "Regrese la salsa al fuego y cocine a fuego lento durante dos o tres minutos.", "Retirar del fuego y batir en las yemas de huevo, la salsa de mostaza y Worcestershire y la mitad del queso.", "Sazone con sal y pimienta, vierta sobre la coliflor y cubra con el queso restante.", "Coloque el queso de coliflor debajo de la parrilla y cocine hasta que se dore.", "Para servir, coloque una cucharada de col en el centro del plato y coloque la chuleta de cerdo encima. Vierta el queso de coliflor con cuchara."], "url": "www_bbc_co_uk_food_recipes_grilled_pork_chop_with_58226", "title": "Chuleta de cerdo a la parrilla con coliflor y repollo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 chuletas de lomo de cerdo, alrededor de 2 cm / ¾ de espesor", "1 manzana, sin corazón y cortada en cuñas", "sal", "1 yema de huevo de gallinas camperas", "1 cucharadita de mostaza inglesa", "2 cucharaditas de miel clara", "2 cucharadas de vinagre de sidra", "150ml / 5fl oz de aceite vegetal o de girasol", "1 chalote de plátano, finamente picado", "1 diente de ajo, finamente picado", "1 cucharada de perejil de flatillo finamente picado", "1 cucharada de menta finamente picada", "1 cucharada de albahaca finamente picada", "1 cucharada de tomillo finamente picado", "sal y pimienta negra recién molida", "500g / 1lb 2oz de puré de papas", "1 cucharada de perejil de flatillo finamente picado", "50g / 1¾oz de harina natural", "1 huevo de gallinas camperas, golpeado", "75g / 3oz de almendras en copos", "1 cabeza de lechuga pequeña gema, más o menos picada", "2 puñados de lechuga de cordero"], "method": ["Precalentar la parrilla a alto. Coloque las chuletas de cerdo y las cuñas de manzana en una sartén para horno. Sazonar la grasa de cerdo con sal y colocar debajo de la parrilla para asar durante 5 minutos en cada lado, o hasta que el cerdo se cocine bien.", "Mientras tanto, haz el aderezo. Coloque la yema de huevo, la mostaza y la miel en un tazón. Agregue el vinagre de sidra y bata, agregando gradualmente el aceite vegetal, batiendo constantemente, hasta que espese y cremoso. Agregue la chalota, el ajo, el perejil, la menta, la albahaca y el tomillo y bata una vez más. Controle el condimento y reserve.", "Caliente el aceite en una freidora o en una cacerola grande a 180 ° C / 350 ° F. (PRECAUCIÓN: el aceite caliente puede ser peligroso. Nunca deje la bandeja desatendida).", "Para hacer las croquetas, revise el condimento del puré de papas, agregue el perejil de flatillo restante y mezcle bien. Tome un puñado pequeño y enrolle en una forma de salchicha pequeña, repitiendo con toda la mezcla de papa.", "Prepare un plato de harina, un plato de huevos y un plato de almendras en copos. Enrolle las salchichas de papa en la harina, luego los huevos y luego las almendras en copos.", "Con cuidado, baje las croquetas en la freidora por 2-3 minutos, o hasta que estén doradas, crujientes y calientes. Retire con una espumadera y escurra sobre papel de cocina.", "Coloque las hojas de ensalada en un recipiente con suficiente aderezo para cubrir las hojas y mezcle bien.", "Sirva las chuletas de cerdo con las croquetas, las rodajas de manzana y la ensalada."], "url": "www_bbc_co_uk_food_recipes_grilled_pork_chop_with_91412", "title": "Chuletas de cerdo a la parrilla con croquetas de almendra", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/grilled_pork_chop_with_91412_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Sal 80g / 3oz", "1 cucharadita de semillas de cilantro", "1 cucharadita de semillas de hinojo", "Anís de 2 estrellas", "1 cucharada de jengibre tallo más o menos picado", "250g / 9 oz de chuletas de cerdo, recortadas", "350g / 12oz de albaricoques secos", "175 g / 6oz de pasas", "7 g / ¼ oz de semillas de mostaza negra", "7 g / ¼ oz de semillas de mostaza blanca", "250 g / 9 oz de azúcar en polvo", "375ml / 13fl oz de vinagre de sidra", "100 g / 3½ oz de almendras molidas", "puñado de albaricoques secos, finamente picados", "1 chile rojo, finamente picado", "puñado de hojas frescas de cilantro", "½ mooli, en rodajas finas", "½ rábano negro, en rodajas finas", "10 rábanos de desayuno, en rodajas finas", "aceite de oliva, para lloviznar", "sal y pimienta negra recién molida", "berros, para servir"], "method": ["Para hacer las chuletas de cerdo, ponga la sal, las semillas de cilantro, las semillas de hinojo, el anís estrellado y el jengibre en una olla con 1.5 litros / 2¾ pintas de agua. Calienta suavemente, luego retira del fuego y enfríalo hasta que esté frío.", "Coloque las chuletas de cerdo en un recipiente y vierta sobre el adobo frío. Cubra y deje en la nevera durante 6 horas.", "Precalentar una barbacoa o parrilla a la configuración más alta.", "Para hacer el blatjang, mezcle todo el albaricoque seco, las pasas, los dos tipos de semillas de mostaza, el azúcar y el vinagre en una cacerola. Cocine a fuego lento durante 15 minutos o hasta que espese. Agregue las almendras molidas, los albaricoques picados, el chile y el cilantro.", "Ase las chuletas de cerdo marinadas durante 5 minutos en cada lado, o hasta que estén bien cocidas.", "Mientras tanto, para hacer los rábanos, mezcle el mooli con el rábano negro y los rábanos del desayuno, rocíe el aceite y sazone.", "Sirva las chuletas de cerdo con blatjang y rábanos y esparza sobre el berro."], "url": "www_bbc_co_uk_food_recipes_grilled_pork_chops_with_74983", "title": "Chuletas de cerdo a la parrilla con blatjang y rábanos", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filete de salmón de 250g / 9oz, desollado y cortado en piezas de 2cm / 1in", "4 vieiras, coral eliminado", "8 tomates cherry, dejados enteros", "1 pimiento verde, cortado en piezas de 2cm / 1in", "1 cebolla roja, cortada en piezas de 2cm / 1in", "Harina normal de 500 g / 1 lb 2 oz, más extra para enrollar", "½ cucharadita de azúcar en polvo", "pizca de sal", "3 cucharaditas de aceite vegetal", "250ml / 9fl oz de leche entera", "1 huevo mediano de gallinas camperas", "½ repollo blanco, finamente rallado", "¼ daikon, finamente cortado en juliana", "1 manojo de cebolletas, finamente picado", "pizca de copos de chile", "20 g / ¾ oz de semillas de amapola", "50ml / 2fl oz de vinagre de vino de arroz", "pizca de azúcar en polvo", "¼ raíz de cúrcuma fresca, pelada y rallada", "1 diente de ajo", "½ cucharadita de copos de chile", "½ cucharadita de azúcar en polvo", "1 cucharada de vinagre de vino blanco", "3 cucharadas de aceite de oliva", "200g / 7oz de yogurt natural", "½ pepino rallado", "1 lima, solo jugo", "1 cucharada de menta fresca picada"], "method": ["Para los kebabs, inserte todos los ingredientes alternativamente en un pincho de madera, solo uno de cada uno, y colóquelos en un plato en el refrigerador hasta que todos los otros componentes estén listos para servir.", "Para el naan, ponga la harina en un tazón grande y agregue el azúcar, la sal y una cucharadita de aceite vegetal y revuelva.", "Batir la leche y el huevo en un recipiente aparte.", "Poco a poco agregue la leche y el huevo a la harina. Amasar para hacer una masa y cubrir con una película adhesiva. Deja reposar en un lugar cálido durante una hora.", "Precalienta el horno a 220C / 425F / Gas 7. Espolvorea dos bandejas para hornear con harina.", "Una vez que la masa ha descansado, vierta el aceite restante sobre la masa y mezcle.", "Ponga en harina una superficie de trabajo limpia y enrolle o dé forma al pan en ocho formas en forma de lágrima y colóquelo en las bandejas para hornear enharinadas.", "Hornee durante 8-10 minutos, o hasta que estén dorados e hinchados.", "Para la ensalada, coloque todos los ingredientes en un tazón grande y mezcle. Dejar de lado en la nevera.", "Para la salsa de ajo y chile, coloque todos los ingredientes de la salsa en un tazón pequeño y mezcle hasta que estén bien combinados.", "Para la raita de menta, ponga todos los ingredientes de raita en un tazón mediano y mezcle y reserve.", "Para cocinar los kebabs, precaliente la parrilla a fuego. Coloque los pinchos en una bandeja debajo de la parrilla y cocine durante 8-10 minutos, o hasta que estén cocidos.", "Para servir, coloque la raita en cada plato y la ensalada en el centro y el kebab en la parte superior. Sirva la salsa de inmersión en un plato pequeño y un naan en el lado."], "url": "www_bbc_co_uk_food_recipes_grilled_salmon_and_76093", "title": "Kebab de salmón y vieira a la plancha", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["250g / 9oz de fideos udon", "1,5 litros / 2½ pintas dashi o stock de miso (de bolsita)", "50ml / 2fl oz", "50ml / 2fl oz de salsa de soja oscura", "100 g / 3½ oz de tofu firme, en cubos", "6 cebollas de primavera, en rodajas", "algunas hebras de algas wakame", "1 pak choi, roto en hojas separadas", "4 x 200 g / 7 oz de filetes de salmón, piel, escala y espinas", "1 cucharada de aceite de girasol", "Polvo japonés de siete especias (disponible de proveedores especializados en línea y tiendas asiáticas), al gusto", "¼ mouli, pelado y en juliana (si no puedes obtener mouli, algunas col picadas también funcionarían aquí)", "pocas hojas de cilantro, para adornar"], "method": ["Para cocinar los fideos, sumérjalos en una olla con agua hirviendo.", "Cocine los fideos durante cuatro minutos y luego drene y revuelva en un tazón de agua helada. Drenar de nuevo.", "Coloque el caldo dashi en una cacerola y agregue el mirin, la salsa de soja y el tofu. Agregue las cebolletas en rodajas y las algas wakame. Cocine a fuego lento durante 3-4 minutos. Agregue el paquete choi y deje que se marchite durante 1-2 minutos.", "Precalentar una sartén de plancha. Cepille el salmón con aceite y polvo con el polvo de siete especias japonés.", "Ase el salmón con la piel hacia abajo en la sartén de la plancha durante 2-3 minutos, antes de voltear y terminar durante 1-2 minutos más.", "Para servir, calentar los fideos udon en el caldo de miso y ponerlos en cuencos para servir. Vierta el caldo caliente.", "Cubra con el salmón a la plancha y decore con las tiras de mouli y hojas de cilantro para servir."], "url": "www_bbc_co_uk_food_recipes_grilled_salmon_with_36749", "title": "Salmón a la plancha con siete especias japonesas con caldo de miso", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 puñados de hojas de espinaca baby", "2 puñados de hojas de berros de bebé", "3 cucharadas de berro de coriandro", "1 mango, pelado, sin piedra, cortado en 0.5cm / ¼ en dados", "1 cucharada de vinagre de vino blanco", "3 cucharadas de aceite de colza", "1 pizca de azúcar", "Filete de salmón de 500 g / 1 libra y 2 onzas, sin espinas y sin piel, cortado en rodajas gruesas de 0,5 cm.", "Mantequilla 110g / 4oz, derretida", "1 vaina de vainilla, partida, semillas raspadas con un cuchillo", "Harina normal de 25g / 1oz", "25g / 1 oz de harina de maíz", "pizca de sal", "75-110ml / 3-4fl oz de agua con gas", "12 gambas crudas, cabezas y cáscaras eliminadas, desvenaduradas"], "method": ["Para la ensalada, mezcle la espinaca, el berro y el cilantro en un bol. Agregue la mitad del mango troceado y vuelva a mezclar.", "Coloque el mango cortado en cubitos restante y el vinagre de vino blanco en un procesador de alimentos y mezcle hasta obtener un puré.", "Con el motor todavía en marcha, agregue lentamente el aceite en una corriente delgada hasta que la mezcla esté solo emulsionada. Sazonar, al gusto, con sal, pimienta negra recién molida y una pizca de azúcar.", "Vierta la mezcla sobre la ensalada y mezcle para combinar. Dejar de lado.", "Para el salmón, precaliente la parrilla a su configuración más alta.", "Coloque un anillo de chefs de 20 cm / 8 pulgadas (o un anillo de tarta sin fondo) en una bandeja para hornear. Coloque una cuarta parte de las rodajas de salmón en el anillo, superponiendo cada rebanada un poco.", "Mezcle la mantequilla derretida y las semillas de vainilla juntas en un recipiente y sazone, al gusto, con sal y pimienta negra recién molida.", "Cepille la mezcla de mantequilla derretida sobre la capa de salmón, luego retire el anillo de los chefs. Repita el proceso con la mezcla restante de salmón y mantequilla para crear cuatro anillos de salmón.", "Coloque los anillos de salmón debajo de la parrilla durante 2-3 minutos, o hasta que estén recién cocidos. Deslice cada uno en un plato de servir.", "Mientras tanto, para las gambas tempura, caliente el aceite en una freidora a 190C / 375 / Gas 5. Alternativamente, llene una sartén de dos lados con aceite vegetal. Caliente el aceite hasta que esté caliente pero sin fumar. (Precaución: el aceite caliente puede ser peligroso. No lo deje desatendido).", "Coloque la harina, la harina de maíz y la sal en un tazón y agregue el agua con gas, batiendo bien hasta que la mezcla forme una pasta espesa y suave.", "Coloque las gambas en la mezcla para cubrirlas por completo, luego coloque directamente en el aceite caliente. Freír por 2-3 minutos, o hasta que la masa esté dorada y crujiente y las gambas estén rosadas y cocidas. Retire de la sartén con una espumadera y déjela a un lado para escurrir sobre papel de cocina.", "Para servir, apila una porción de ensalada en cada círculo de salmón. Top con tres gambas tempura."], "url": "www_bbc_co_uk_food_recipes_grilled_salmon_with_78688", "title": "Salmón a la parrilla con gambas tempura", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["20ml / ¾fl oz de vinagre de Cabernet Sauvignon", "20g / ¾oz de mostaza Dijon", "80ml / 2¾fl oz de aceite de oliva", "sal y pimienta", "1 limón, jugo y ralladura", "3 lechuga pequeña gema", "1 cucharada de aceite de oliva", "60 g / 2¼ oz de hinojo, recogido", "8 sardinas grandes, a escala y eviscerado", "sal marina gruesa", "1 cucharada de perejil finamente picado"], "method": ["Caliente una parrilla o una rejilla sobre el calor o las brasas de una barbacoa.", "Para el aderezo, mezcle el vinagre, la mostaza y el aceite de oliva en un bol hasta que estén completamente emulsionados. Sazone con sal y pimienta, agregando un poco de jugo de limón si lo desea.", "Para las sardinas, la lechuga y el hinojo, corte la raíz marrón del fondo de la lechuga y luego córtela en cuartos. Cepille con un poco de aceite de oliva y colóquelo en la parrilla hasta que esté tostado y carbonizado.", "Blanquee la hierba en una olla con agua hirviendo durante veinte segundos, luego retírela del agua con una espumadera.", "Cepille las sardinas con un poco de aceite y sazone con la sal marina.", "Coloque las sardinas en la parrilla o barbacoa caliente y cocine hasta que la piel esté carbonizada; luego dale la vuelta para cocinar el otro lado del pescado.", "Cuando esté cocido, vierta el pescado en un tazón con la gema de lechuga, perejil y cáscara de limón. Agregue la samphire y viste con el aderezo de vino tinto."], "url": "www_bbc_co_uk_food_recipes_grilled_sardines_with_52686", "title": "Sardinas asadas con hinojo y lechuga Little Gem", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 yema de huevo grande de gallinas camperas", "50g / 1¾oz de carne de cangrejo marrón, pasada a través de un tamiz", "½ chile rojo, finamente picado", "½ diente de ajo, finamente picado", "1 pequeña cucharadita de mostaza Dijon", "100ml / 3½fl oz de aceite de oliva virgen extra", "5 cucharadas de aceite vegetal", "jugo de limón, al gusto", "4 cucharaditas de suero de leche", "½ cilantro pequeño, finamente picado", "sal marina y pimienta negra recién molida", "50 g / 1¾oz de semillas de sésamo", "50 g / 1¾oz de pistachos", "Semillas de 10g / ¼oz de nigella", "5g semillas de comino", "Semillas de cilantro de 25g / 1oz", "4 cucharaditas de aceite de oliva virgen extra", "½ limón, solo jugo", "4 cucharaditas de aceite de oliva virgen extra", "8 sardinas grandes, escamadas, con mariposa y colas dejadas en el tacto", "2 pequeñas lechugas Little Gem, cortadas en 4 longitudes", "½ cucharadita de mezcla de especias y zumaque", "½ cucharadita de copos de chile", "½ limón, solo jugo", "ramitas de hierba de hinojo"], "method": ["Para la mayonesa de cangrejo, ponga la yema de huevo, el cangrejo, el chile, el ajo y la mostaza en un bol y mezcle. Mezcle el aceite de oliva y el aceite vegetal en una jarra. Vierta lentamente el aceite en el recipiente en una corriente delgada, batiendo todo el tiempo hasta que se emulsione. Sazone con sal, pimienta y jugo de limón. Luego agregue el suero de leche y el cilantro picado. Dejar de lado.", "Para el dukka, coloca las semillas y nueces en una sartén seca y coloca a fuego medio. Cocine con cuidado hasta que las especias se vuelvan fragantes y las nueces comiencen a liberar sus aceites naturales. Transfiera todo a un mazo y mortero y pummel a una pasta áspera junto con el aceite de oliva y el jugo de limón. Sazonar con sal y pimienta y reservar.", "Para cocinar las sardinas, precalienta la parrilla a fuego alto.", "Rocíe el aceite de oliva virgen extra sobre las sardinas y los cuartos Baby Gem y luego sazone con sal, pimienta negra, zumaque y escamas de chile.", "Ase la pequeña gema por todos lados durante aproximadamente 2 minutos hasta que esté ligeramente chamuscada y ablandada. Coloque con cuidado las sardinas con la piel hacia arriba y cocine durante 2 minutos antes de voltear y cocinar brevemente en el lado de la pulpa. Las sardinas deben estar bien carbonizadas y un poco rosadas por dentro. Exprime un poco de jugo de limón sobre las sardinas y la lechuga.", "Para servir, espolvoree un círculo de mayonesa en un plato y luego coloque las sardinas y los cuartos de Baby Gem en la parte superior, seguidos por el dukka y algunas ramitas de hierba de hinojo."], "url": "www_bbc_co_uk_food_recipes_grilled_sardines_with_92256", "title": "Sardinas a la parrilla con mayonesa de cangrejo y dukkah", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 cucharadas de menta fresca picada", "3 cucharadas de albahaca fresca rasgada", "3 cucharadas de perejil de flatillo picado", "1 chalota, más o menos picada", "1 diente de ajo, aproximadamente picado", "1 limón, ralladura solamente", "2 cucharadas de alcaparras, escurridas", "4 anchoas, aproximadamente picadas", "½ cucharadita de mostaza inglesa", "3 cucharadas de aceite de oliva virgen extra", "100g / 3½oz de mantequilla sin sal, ablandada", "1 diente de ajo, finamente picado", "4 cucharadas de perejil de flatleaf tostado", "sal y pimienta", "4 setas de campo grandes", "20g / ¾oz pan rallado panko japonés", "Solomillo de solomillo de 4 x 150 g / 5½ oz", "2 cucharadas de aceite de oliva", "sal y pimienta", "1 kg / 2 lb 4 oz chips congelados", "aceite vegetal, para freír en grasa"], "method": ["Para la salsa verde, coloque todos los ingredientes en un mortero y machaque hasta que tenga una pasta espesa.", "Para los champiñones de campo de ajo, precaliente la parrilla en alto.", "Coloque la mantequilla ablandada en un tazón grande para mezclar, agregue el ajo y el perejil y sazone con sal y pimienta.", "Corte los tallos de los champiñones y rellene los champiñones con la mantequilla de ajo y cubra con los pan rallado.", "Coloque debajo de la parrilla durante 4-6 minutos, o hasta que estén cocidos.", "Para el solomillo a la parrilla con patatas fritas congeladas, caliente una sartén grande, frote la carne con aceite y sazone con sal y pimienta. Coloque en la sartén de la plancha durante 2-3 minutos por cada lado.", "Retire de la plancha, cubra y deje reposar en un lugar cálido durante cinco minutos.", "Caliente una freidora a 180 ° C / 350 ° F, o hasta que un cubo de pan chisporrotee y se ponga marrón después de aproximadamente un minuto. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión. La fritura profunda de las papas congeladas es potencialmente peligrosa, debido al alto contenido de agua de las papas fritas. Asegúrese de poner las papas fritas en la freidora de vez en cuando. sin duda tendrá que cocinarlos en lotes).", "Cocine cada lote durante 4-5 minutos o hasta que estén dorados y cocidos.", "Escurrir y colocar en un plato forrado con rollo de cocina. Sazonar con sal y servir inmediatamente.", "Para servir, coloca cada bistec en un plato y coloca un poco de salsa verde en la parte superior. Sirve con las papas fritas y una de las setas para cada porción."], "url": "www_bbc_co_uk_food_recipes_grilled_sirloin_steak_78860", "title": "Solomillo a la parrilla con salsa verde", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite vegetal", "500g / 1lb 2oz de cordero en cubos", "60g / 2¼ oz de chalote en cubitos", "10 ramitas recogieron tomillo", "25g / 1oz de ajo", "Puré de tomate 25 g / 1 oz", "250g / 9oz de tomates pelados", "150g / 5½oz de caldo de pollo marrón", "200g / 7oz de cebada cocida", "30g / 1oz de verdolaga", "50g / 2oz guisantes de jardín", "50 g / 2 oz de habas frescas, blanqueadas", "Harina simple 800g / 1lb 12oz", "7-8 claras de huevo de gallinas camperas", "Sal de mesa 350g / 12oz", "10 papas medianas de Jersey Royal", "5 ramitas de menta fresca", "50 g / 1¾oz de alga comestible fresca", "¼ ala de patín (aproximadamente 50 g / 2 oz), sin piel", "50g / 1¾oz de mantequilla", "1 cucharada de aceite de oliva", "¼ limón, solo jugo"], "method": ["Para el ragú de hombro de cordero de primavera, caliente dos cucharadas de aceite vegetal en una sartén de tamaño mediano y dore los pequeños pedazos del hombro de cordero en la sartén. Una vez dorado, coloque la carne en un fino tamiz de metal para drenar.", "Agregue la chalota y el tomillo a la misma sartén que usó para dorar la carne. Después de dos minutos, agregue el ajo.", "Agregue el puré de tomate y cocine por dos minutos.", "Agregue los tomates pelados frescos y el caldo de pollo.", "Cocine a fuego lento durante una hora, o hasta que la carne esté tierna.", "Una vez que el cordero esté cocido, quítelo del licor de cocción con una cuchara con ranura y use un tenedor para romper la carne. Si el licor de cocción parece que debe espesarse más para obtener una consistencia de salsa, continúe cocinando a fuego lento hasta que espese. Guarde el licor de cocina y el cordero.", "Para el Jersey Royals con costra de sal, precaliente el horno a 180 ° C / 350 ° F / Gas 4. Prepare la costra de sal mezclando la harina, 175 ml / 6 fl oz de agua, claras de huevo y sal hasta formar una masa húmeda.", "Limpie el Jersey Royals debajo de una pestaña fría con una esponja para eliminar la piel amarga exterior.", "Una vez que las papas estén limpias, séquelas con papel de cocina.", "Cortar la masa en dos y extenderla a un grosor de 3 cm / 1¼ pulgadas.", "Coloque una pieza de hojaldre en una bandeja forrada con papel resistente a la grasa.", "Coloque los Jersey Royals en la parte superior con la menta y las algas marinas que los cubren", "Coloque la segunda capa de la masa en la parte superior y selle con un poco de agua en los bordes", "Cocine las papas durante 30-45 minutos en el horno.", "Para el patín a la parrilla, precaliente la parrilla a caliente. Coloque el ala del patín en una bandeja para hornear. Extienda la mantequilla sobre el patín, rocíe sobre el aceite de oliva y exprima el jugo de limón. Coloque debajo de la parrilla por alrededor de cuatro minutos, o hasta que esté cocido.", "Para terminar el ragoût, coloque el cordero y suficiente del licor para cubrir en una sartén, agregue la cebada cocida, la verdolaga marina, los guisantes de jardín y las habas y caliente.", "Para servir, cuchara el cordero ragoût en cada uno de los cuatro platos. Retire con cuidado la carne del ala del patín y colóquela encima del ragoût.", "Sirve con los Jersey Royals horneados con sal."], "url": "www_bbc_co_uk_food_recipes_grilled_skate_with_90321", "title": "Patín a la plancha con ragú de hombro de cordero de primavera y costra de sal Jersey Royals", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 filetes de pez espada (alrededor de 150 g / 5½ oz cada uno)", "sal y pimienta negra recién molida", "50ml / 2fl oz de aceite de oliva", "1 limón, cáscara y jugo solamente", "2 dientes de ajo, aplastados", "1 cucharadita de orégano seco o 1 cucharadita de hierbas italianas mezcladas", "Habas de vaina peladas y de 200g / 7oz (alrededor de 300g / 10½ oz de peso envasada, 1kg / 2lb 4oz de peso fresco no embalado)", "1 cucharada de aceite de oliva", "100ml / 3½fl oz de vino blanco", "20 g / oz de mantequilla", "1 limón, piel recién cortada, finamente picada", "50g / 1¾oz de aceitunas verdes, finamente picadas", "Alcaparras 50g / 1¾oz, finamente picadas", "25 g / 1 oz de perejil, finamente picado"], "method": ["Sazone los filetes de pez espada con sal y pimienta y colóquelos en un plato poco profundo. Mezcle todos los ingredientes del adobo y vierta sobre el pez espada. Deje marinar durante no más de 15 minutos (no quiere arriesgarse a que el limón \"cocine\" el pescado).", "Mientras tanto, para hacer la salsa, pula las habas en una olla de agua hirviendo durante 2 minutos, luego drene y reserve.", "Haga la gremolata mezclando la ralladura de limón, las aceitunas, las alcaparras y el perejil.", "Caliente una cucharada de aceite de oliva en una sartén de base pesada. Cuando la sartén esté muy caliente, agregue los filetes de pez espada y fríe durante 3-4 minutos en cada lado.", "Retire de la sartén y deje reposar mientras termina la salsa. Desglasar la sartén con el vino blanco, luego agregar la mantequilla. Remueva hasta que la mantequilla se haya derretido, luego agregue las habas blanqueadas. Calor a través de.", "Sirva el pez espada con la salsa una cucharada y la gremolata en el lado."], "url": "www_bbc_co_uk_food_recipes_grilled_swordfish_71017", "title": "Pez espada a la parrilla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]