[{"ingredients": ["Fideos ramen 750 g / 1 libra 10 oz (alternativamente, use fideos udon)", "rociar aceite de sésamo", "2,5 litros / 4½ pintas toridashi stock", "30 g / 1 oz de raíz de jengibre fresco, cortado en 4 rodajas gruesas", "2 dientes de ajo, cortados en slithers", "10 hongos shiitake frescos, cortados en slithers", "1 zanahoria, cortada en fósforos", "100 g / 3 ½ oz de champiñones shimeji", "200g / 7 oz de soja brotes de soja (o brotes de soja)", "Brotes de bambú rebanados 50g / 1¾oz", "100 g / 3½ oz enoki hongos", "200g / 7oz de suma de choi, termina cortado y cortado por la mitad", "500g / 1lb 2 oz chashu de cerdo, alrededor de 16 rebanadas", "4 cebolleta, cortada en diagonal", "1 guindilla roja larga, finamente cortada en diagonal", "4 huevos completos de tomago, cortados a la mitad", "Aceite de ají japonés comprado en la tienda", "Recoge camarones (Feliz cumpleaños)", "copos de atún seco"], "method": ["Cocine los fideos siguiendo las instrucciones del paquete. Una vez cocido, escurrir y rociar con un poco de aceite de sésamo para evitar que se peguen los fideos.", "Caliente el caldo en una sartén grande con jengibre, ajo, champiñones shiitake y zanahorias.", "Cocine a fuego lento durante 5-8 minutos. Agregue los hongos shimeji.", "Coloque con cuidado los fideos calientes, los brotes de soja, los brotes de bambú, las setas enoki, la suma de choi y el cerdo cortado en cuatro tazones grandes.", "Con cuidado, vierta el caldo sobre el cerdo y las verduras con un cucharón. Cubra con cebolletas y rodajas de chile.", "Cuidadosamente la mitad de los huevos y coloque en la parte superior de cada porción.", "Servir a la vez con un chorrito de aceite de chile, una pizca de shichimi togarashi (condimento japonés de siete especias) y un florecimiento de copos de atún desecados (si le gusta)."], "url": "www_bbc_co_uk_food_recipes_chashu_pork_ramen_90056", "title": "Chamyu Po rk ramen", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chashu_pork_ramen_90056_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de vinagre de estragón", "Vino blanco 50ml / 2floz", "1 cucharadita de granos de pimienta blanca", "1 chalote de plátano pequeño, finamente cortado en cubos", "4 huevos, solo yemas", "¼ limón, solo jugo", "200g / 7oz de mantequilla, derretida", "sal y pimienta negra recién molida", "2-3 cucharadas de hojas de estragón picadas", "2 x 800 g / 1lb12 oz chateaubriand, totalmente recortado", "1 cucharada de aceite de oliva", "75g / 3oz de mantequilla", "4 tallos pequeños tomates cherry en la vid", "4 papas grandes para cortar, cortadas en 1x7.5cm / ½x3 en bastones", "1 gran racimo de berros"], "method": ["Para hacer la salsa bearnesa, coloca el vinagre, el vino blanco, los granos de pimienta y la chalota en una cacerola pequeña y lleva a ebullición.", "Cocine a fuego lento hasta que el líquido se haya reducido a la mitad.", "Retire los granos de pimienta y luego vierta en un tazón mediano.", "Agregue las yemas de huevo y bata bien, luego agregue el jugo de limón.", "Coloque sobre una fuente de agua hirviendo y mezcle hasta que espese y luz en color.", "Poco a poco agregue la mantequilla derretida, batiendo constantemente.", "Sazonar con sal y pimienta negra y agregar las hojas picadas de estragón.", "Apague el fuego y deje el recipiente sobre la sartén hasta que esté listo para usar", "Para la carne, precaliente el horno a 200C / 400F / Gas 6.", "Sazonar el chateaubriand con sal y pimienta negra recién molida.", "Caliente una sartén grande a prueba de horno hasta que esté caliente, agregue el aceite y la mitad de la mantequilla, luego agregue la carne y el sello en cada lado hasta que se dore, agregando el resto de la mantequilla sobre la marcha, hilvanando la carne con ella.", "Transfiera al horno y tueste durante 15-20 minutos (dependiendo de cómo le guste su carne).", "Retire del horno, voltee y deje reposar durante al menos 15 minutos.", "Mientras tanto, coloque los tomates cherry en una bandeja de asar y coloque en el horno durante 8-10 minutos hasta que estalle.", "Caliente una freidora a 160C / 320F. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Coloque con cuidado los bastones de patata en la freidora de grasa en lotes y fríe durante 3-4 minutos, o hasta que estén tiernos pero no coloreados.", "Retire las papas fritas, luego incremente el calor en la freidora a 190 ° C / 375 ° F y devuelva las papas fritas a la freidora y cocine por 2-3 minutos hasta que estén doradas y crujientes.", "Retirar con una espumadera y escurrir sobre papel de cocina y luego sazonar con sal y un poco de pimienta negra.", "Para servir, esculpe la carne descansada en rodajas gruesas y colóquela en el plato para servir. Apila las papas fritas y los tomates al lado y luego termina con una cucharada de bearnesa y un puñado de berros."], "url": "www_bbc_co_uk_food_recipes_chateaubriand_with_80496", "title": "Chateaubriand con salsa bearnesa y papas fritas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal 175g / 6oz", "40 g / 1½ oz de cacao en polvo", "Azúcar glas de 80g / 3oz", "140g / 5oz de mantequilla, cortada en cubitos", "2 yemas de huevo de rango medio", "750g / 1lb 10oz de chocolate con leche", "Crema doble 260ml / 9½fl oz", "120ml / 4fl oz de amaretto", "200g / 7oz de almendras blanqueadas", "250 g / 9 oz de azúcar en polvo", "100 g / 3½ oz de chocolate negro, finamente rallado", "75 g / 2½ oz de granos de café", "1 cucharada de gránulos de café liofilizados, disueltos en 1 cucharada de agua hirviendo", "3 cucharadas de licor de café", "Crema doble de 200 ml / 7 fl oz", "50 g / 1 oz de azúcar en polvo"], "method": ["Para la masa, tamice la harina, el cacao en polvo y el azúcar glas en un tazón. Agregue la mantequilla y frote con los dedos hasta que la mezcla se asemeje a pan rallado. Agregue las yemas de huevo y mezcle hasta que se forme una masa. Agregue un poco de agua helada si la pasta se siente seca. Envuelva la masa en una película adhesiva y colóquela en la nevera para que descanse durante al menos una hora.", "Precalentar el horno a 170C / 340F / Gas 3½.", "Cuando la masa repose, enharine ligeramente una superficie de trabajo y extienda la masa en un círculo del grosor de una moneda de 1 £. Coloque la masa sobre la caja de tarta y empuje suavemente hacia abajo a la línea, teniendo cuidado de obtener la masa directamente en los bordes. Cubra la masa con papel de hornear y rellene con alubias o arroz crudo. Coloque la tarta en una bandeja para hornear y hornee en el horno precalentado durante 25 minutos.", "Retire con cuidado el pergamino para hornear y los frijoles y coloque la tarta de nuevo en el horno para cocinar por otros 10-20 minutos o hasta que la base parezca seca. Retire la tarta del horno y deje enfriar. Una vez que haya enfriado, recorte la masa para ordenar los bordes.", "Para el relleno, rompa el chocolate con leche y colóquelo en un tazón sobre una sartén con agua apenas hirviendo. No dejes que el recipiente toque el agua. Una vez derretido, retire el tazón del fuego.", "En una sartén a fuego medio, ponga a hervir la crema doble y el amaretto. Vierta la mezcla de crema sobre el chocolate derretido, batiendo todo junto bien. Vierta esta mezcla en la caja de tarta cocida y enfríe a temperatura ambiente antes de colocar la tarta en la nevera durante 30 minutos, o hasta que se endurezca.", "Para el relleno, precaliente el horno a 190C / 375F / Gas 5 y coloque las almendras en una bandeja para hornear. Coloque en el horno y cocine durante 8-10 minutos, o hasta que estén tostados y ligeramente dorados. Retire del horno y deje enfriar por unos minutos. Alinee una bandeja o plato con pergamino para hornear.", "Ponga el azúcar impalpable y 50 ml / 2 fl oz de agua en una sartén a fuego medio y cocine hasta que el azúcar comience a colorear. Agregue las almendras y mezcle hasta que el azúcar cubra las almendras para darle un aspecto glaseado. Transfiera las almendras a la bandeja o plato revestido y deje enfriar. Una vez que esté completamente frío, corta las almendras aproximadamente en trozos.", "Para la crema de café, mezcle los gránulos de café disuelto y el licor de café en una pasta en un tazón grande y agregue el azúcar. Vierta la crema doble y bata a los picos firmes, teniendo cuidado de no azotar demasiado. Cubra con film transparente y colóquelo en el refrigerador hasta que lo necesite.", "Verifique que la tarta se haya puesto. De lo contrario, déjalo en la nevera durante 20 minutos más. Una vez establecido, cubrir con chocolate rallado y espolvorear con los granos de café y almendras heladas. Sirve con la crema de café batida."], "url": "www_bbc_co_uk_food_recipes_cheats_chocolate_tart_45173", "title": "Tarta de chocolate del truco", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Hace 1 tarta grande", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cheats_chocolate_tart_45173_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal 300g / 10½ oz", "pizca de sal", "50g / 1¾oz de mantequilla, enfriada y cortada en cubos", "120g / 4½oz de mantequilla congelada"], "method": ["Mezcle la harina y la sal juntas en un tazón. Frote la mantequilla fría con la punta de los dedos hasta que la mezcla se asemeje a pan rallado. Poco a poco agregue suficiente agua para formar una masa (alrededor de 4-6 cucharadas de agua).", "Ruede la masa en un rectángulo sobre una superficie de trabajo ligeramente enharinada.", "Ralla la mitad de la mantequilla congelada sobre los dos tercios inferiores de la masa. Dobla hacia abajo el tercio superior y dobla el tercio inferior como si doblaras una letra.", "Gire la masa doblada 90 grados y colóquela en un rectángulo nuevamente. Repita el proceso de agregar la mantequilla congelada restante y doblar como antes.", "Envuelva la masa en una película adhesiva y déjela reposar en la nevera durante 30 minutos antes de usarla."], "url": "www_bbc_co_uk_food_recipes_cheats_rough_puff_pastry_91549", "title": "Hojaldre áspero de Cheat", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 60}, "serves": "Rinde 600 g / 1lb de pasta de 5oz", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50g / 1¾oz de mantequilla", "500 g / 1 libra 2 oz mezcladas setas exóticas frescas, como shiitake o enoki, limpiadas y en rodajas", "250 g / 9 oz hojas de espinaca bebé", "2 paquetes de 375 g de hojaldre con mantequilla", "harina común, para quitar el polvo", "1 salmón entero (aproximadamente 3kg / 6lb 12oz), piel escamada y removida, eviscerada, deshuesada y fileteada (alternativamente, use los lados preparados de salmón)", "3 yemas de huevo de gallinas camperas, batidas", "sal marina y pimienta negra recién molida", "1kg / 2lb 4oz de papas nuevas cocidas y untadas con mantequilla", "ensalada verde vestida"], "method": ["Precalentar el horno a 230C / 210C Fan / Gas 8.", "Calienta la mitad de la mantequilla en una sartén grande a fuego medio. Cuando la mantequilla esté espumosa, agregue los champiñones y fríalos durante 4-5 minutos, o hasta que hayan liberado la mayor parte de su agua y se haya evaporado de la sartén. Sazonar, al gusto, con sal y pimienta negra recién molida, luego transferir a un plato forrado con papel de cocina.", "Regrese la sartén al fuego, agregue lo último de la mantequilla y luego marchite las hojas de espinaca y sazone, al gusto, con sal y pimienta negra recién molida. Agregue al plato con los champiñones, déjelos a un lado hasta que estén frescos, luego enfríelos en el refrigerador.", "Estire ambos pedazos de masa en una superficie de trabajo ligeramente enharinada para crear dos rectángulos de aproximadamente 5 cm / 2 pulgadas más largos y más anchos que los filetes de salmón.", "Coloque una hoja de hojaldre en una bandeja grande para hornear y coloque un filete de salmón encima, con la carne hacia arriba. Sazonar bien con sal y pimienta negra recién molida.", "Cubra el filete de salmón con los champiñones y luego las espinacas, luego coloque el segundo filete de salmón encima, con la carne hacia abajo, presionando suavemente.", "Cepille los bordes de la masa con un poco de la yema de huevo batida. Con cuidado, pase la segunda hoja de hojaldre sobre el coulibiac con un rodillo para transferirlo. Presione los bordes de cada hoja de masa juntos para sellar y engarzar en los bordes.", "Cepille la superficie del paquete de pastelería con la yema de huevo restante. Con unas tijeras afiladas, corte la parte superior de la masa a intervalos para hacer marcas que se parezcan a las escamas de pescado.", "Hornee el coulibiac de salmón durante 25 minutos, luego reduzca la temperatura del horno a 200C / 180C Fan / Gas 6 y hornee durante otros 12-15 minutos, o hasta que los filetes de salmón estén recién hechos y la masa esté dorada.", "Retire el coulibiac de salmón del horno y transfiéralo a un plato de servir. Reserve para descansar durante 10 minutos, luego talle en rebanadas en la mesa y sirva con papas con mantequilla y una ensalada verde."], "url": "www_bbc_co_uk_food_recipes_cheats_salmon_coulibiac_71143", "title": "Chel's salmon coulibiac", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 8-10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["400 g de caramelo de leche condensada lista para lata", "100g / 3½oz de mantequilla sin sal", "½ cucharadita de sal", "3 cucharadas de ron (opcional)"], "method": ["Primero esteriliza los tarros de mermelada. Lave los frascos en agua jabonosa y enjuague con agua tibia y limpia. Déjelos secar por goteo, al revés, en una rejilla en el horno a 140 ° C / 120 ° C Ventilador / Gas 1. Déjelos allí durante al menos media hora mientras prepara el caramelo salado.", "Calentar el caramelo de leche condensada, la mantequilla y 8 cucharadas de agua en una sartén y llevar a fuego lento. Revuelva hasta que el caramelo se disuelva. Agregue la sal y el ron (si se usa), mezcle, luego deje enfriar un poco.", "Vierta en un frasco esterilizado. Esto se mantendrá en la nevera durante 1 semana ... si puede hacerlo durar tanto tiempo."], "url": "www_bbc_co_uk_food_recipes_cheats_salted_caramel_71714", "title": "Salsa de caramelo salado de Cheat", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Hace 2 tarros de mermelada de salsa", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cheats_salted_caramel_71714_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 gran caja de flan preparada", "3-4 cucharadas de licor de whisky (como Drambuie)", "800ml / 1 pinta 8fl oz crema doble", "1 cucharada de pasta de frijoles de vainilla", "60g / 2¼ oz de azúcar en polvo", "Fresas grandes de 400g / 14oz, recortadas y cortadas por la mitad a lo largo", "50g / 1¾oz de azúcar glas, para quitar el polvo", "1 cilantro fresas pequeñas", "50g / 1¾oz cada una de grosellas, arándanos y moras", "3-4 ramitas de menta", "Azúcar en polvo de 65 g / 2¼ oz"], "method": ["Coloque un anillo de acero inoxidable de 20-25 cm / 8-10 pulg. En la caja de flan y úselo para cortar, descartando el borde exterior de la esponja. Corta el flan por la mitad horizontalmente para que termines con dos capas delgadas.", "Coloque el anillo de acero en un plato de servir grande y plano. Coloque una de las capas de esponja dentro y presione ligeramente hacia abajo. Espolvoree la mitad del Drambuie sobre la esponja y luego reserve.", "Coloque la crema doble en un bol con la pasta de frijoles de vainilla, el resto de Drambuie y el azúcar impalpable. Batir hasta que se formen picos semirresistentes cuando se quite el batidor.", "Alinee el anillo con las mitades de fresa grandes, colocando el lado cortado contra el anillo - reserve el resto de las fresas.", "Con cuidado, coloque la crema batida en el centro del flan y extiéndala suavemente para llenar todo el molde, agregando tanta crema como sea necesario para cubrir la parte superior de las fresas. Coloque la funda de flan restante en la parte superior y presione ligeramente hacia abajo.", "Retire el anillo calentando cuidadosamente los bordes con un paño caliente y levantándolo directamente hacia arriba.", "Polvo la parte superior del castillo con el azúcar glas. Con cuidado, caliente un pincho metálico sobre una llama directa hasta que esté muy caliente (use guantes para el horno). Utilice el pincho caliente para marcar la parte superior de la torta con líneas para crear un patrón de diamantes.", "Para el azúcar hilado, si está usando, coloque el azúcar impalpable restante en una sartén muy limpia y colóquela en la estufa para que se caramelice. Una vez que esté caramelizado, retíralo del fuego para que se enfríe un poco. Sumerja una cuchara pequeña en el azúcar caramelizado y gírela alrededor de un acero para crear rizos que decorarán la parte superior del gâteau.", "Apila las fresas y bayas restantes encima del pastel. Adorne con ramitas de menta y los rizos de caramelo. Sirva cortado en rodajas con crema para verter si lo desea."], "url": "www_bbc_co_uk_food_recipes_cheats_strawberry_gteau_94997", "title": "El castillo de fresa de Cheat", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 8-10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cheats_strawberry_gteau_94997_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite vegetal", "2 cucharadas de pasta de curry Madras", "2 caballas, cortadas en 4-5 filetes", "Cilantro de racimo pequeño, tallos picados, hojas para rociar", "1 cebolla roja mediana, picada", "2 limas, cáscara y jugo solamente", "½ puede leche de coco", "arroz, hervido, para servir"], "method": ["Cocine la pasta de curry en una sartén con el aceite.", "Eche los filetes de caballa y cubra completamente con pasta.", "Agregue los tallos de cilantro a la sartén con la cebolla roja y cocine por un momento o dos.", "Agregue la ralladura de limón y el jugo y la leche de coco.", "A fuego medio, cocine a fuego lento durante 15 minutos, girando la caballa un par de veces.", "Sirve con arroz."], "url": "www_bbc_co_uk_food_recipes_cheatsgoanmackerelcu_72061", "title": "Trucos de Goa caballa al curry", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["8 articulaciones cocidas de pollo, en el hueso - una mezcla de pechos y muslos o piernas", "30g / 1oz de mantequilla", "1 cucharada de aceite de oliva", "4 dientes de ajo, picados", "2 cebollas rojas, en rodajas", "Panceta de 140 g / 5oz en una sola pieza, corteza quitada y picada", "250g / 9 oz champiñones", "buena pizca de tomillo seco", "290ml / ½ pinta de vino tinto", "500ml / 17fl oz de caldo de pollo fresco", "Crema doble de 150 ml / 1/4 de pinta", "2 cucharadas de perejil fresco picado", "sal y pimienta negra recién molida"], "method": ["Piel los trozos de pollo cocidos y reservarlos.", "Caliente la mantequilla con el aceite en una cacerola grande de hierro fundido o a prueba de fuego, agregue el ajo, la cebolla y la panceta y saltee durante unos 5 minutos hasta que se suavice. Agregue los champiñones y el tomillo y saltee durante 5 minutos.", "Verter el vino, llevar a ebullición y continuar hirviendo, sin tapar, durante unos 5 minutos hasta que la salsa se reduzca a la mitad. Vierta el caldo y vuelva a hervir.", "Sazonar y agregar el pollo a la salsa. Reduzca el fuego y cocine a fuego lento durante unos 5 minutos hasta que el pollo esté bien caliente. Retire las piezas de pollo a un plato de servir caliente con una cuchara ranurada.", "Aumente el fuego y hierva la salsa hasta reducirla a la mitad. Reduzca el fuego, agregue la crema y caliéntela suavemente.", "Vierta la salsa sobre las piezas de pollo, espolvoree con perejil. Servir."], "url": "www_bbc_co_uk_food_recipes_cheatscoqauvin_68039", "title": "Gallo de tramposo con vino", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 durazno grande (800g / 1¾lb) en almíbar", "½ limón, solo jugo", "Crema doble 500ml / 16fl oz"], "method": ["Vacíe el contenido de la lata y el jugo de limón en un licuador y mezcle hasta que quede suave.", "Agregue la crema. Verter en una máquina de helados, batir y congelar."], "url": "www_bbc_co_uk_food_recipes_cheatypeachicecream_14298", "title": "Cheaty helado de melocotón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["700g / 1lb 9oz grandes papas para ensalada, peladas y partidas a la mitad", "Tocino ahumado de 175g / 6oz, más o menos picado", "1 cucharada de aceite de oliva", "1 diente de ajo", "½ pimiento rojo, en rodajas finas", "6 huevos grandes de gallinas camperas", "25g de perejil de flatleaf, más o menos picados", "30g / 1oz de queso cheddar rallado", "sal y pimienta negra recién molida"], "method": ["Se parbolizan las papas en agua ligeramente salada durante 6-10 minutos, hasta que estén casi cocidas pero firmes. Cortarlos en rodajas. Precalentar la parrilla a fuego medio-alto.", "Usando una sartén grande antiadherente para horno, fríe el tocino en su propia grasa, revolviendo, durante 4-5 minutos, o hasta que esté cocido. Transfiera a un plato y reserve.", "Calienta el aceite en la misma sartén. Agregue el ajo y los pimientos y fría por 4-5 minutos, o hasta que estén recién cocidos.", "Agregue las papas a la sartén, revuelva suavemente, luego fríe durante 2-3 minutos, hasta que estén ligeramente doradas. Regrese el tocino a la sartén y revuelva suavemente.", "Rompe los huevos en una jarra y golpea ligeramente con un tenedor. Agregue el perejil y sazone bien. Vierta sobre la mezcla de papas y tocino, luego espolvoree el queso encima. Cocine por 5 minutos.", "Transfiera a la parrilla y cocine durante 5 minutos, o hasta que esté bien cocida. Servir en rebanadas, con ensalada si quieres."], "url": "www_bbc_co_uk_food_recipes_cheddar_and_bacon_31049", "title": "Tortilla de queso y tocino", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cheddar_and_bacon_31049_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal de 250g / 9oz, más extra para espolvorear", "150g / 5½oz de mantequilla fría, en cubos, más extra para engrasar", "pizca de sal", "1 huevo de gallinas camperas", "6 rebanadas de tocino rayado ahumado curado en seco", "5 yemas de huevo de gallinas camperas", "300 ml / 10 fl oz doble crema", "150 g / 5½ oz de queso cheddar maduro, finamente rallado", "1 calabacín pequeño, cortado, finamente cortado en cubos", "4 ramitas de tomillo fresco, solo hojas", "1 cucharadita de mostaza integral", "1 cucharadita de vinagre de vino tinto", "3 cucharaditas de aceite de colza", "bolsa pequeña ensalada verde hojas", "1 cabeza de lechuga Little Gem, hojas lavadas y separadas"], "method": ["Para la masa, en un tazón grande, frote la harina y la mantequilla con los dedos hasta que la mezcla se asemeje a pan rallado. Sazonar con una pizca de sal.", "Agregue el huevo batido y junte la mezcla en una bola, luego amase muy levemente en una superficie de trabajo ligeramente enharinada.", "Envuelva el papel a prueba de grasa y la película adhesiva, luego enfríe en la nevera durante 10-15 minutos para reafirmarse.", "Mientras tanto, para el llenado, precaliente el horno a 180 ° C / 160 ° Fan / Gas 4. Engrase 6 tartaletas pequeñas, de fondo suelto, cada una con un diámetro de 9 cm / 3½ pulgadas de diámetro y una altura de 4 cm / 1½ pulgadas.", "Ruede los pasteles sobre una superficie ligeramente enharinada hasta un grosor de 3 mm. Corta 6 discos, cada uno ligeramente más grande en diámetro que las cajas de tartas, de la masa (tendrás que volver a hacer los cortes de masa para los dos últimos discos).", "Cubra cada lata con un disco de pastelería, presionando suavemente en la base y los lados, luego recorte los lados para que las cajas de pastelería estén al ras del borde de las latas.", "Seque el tocino en una sartén a fuego medio durante 3-4 minutos o hasta que se dore y quede crujiente. Escurrir sobre papel de cocina, luego cortar y reservar.", "Batir los huevos y la crema en una jarra, luego sazonar, al gusto, con sal y pimienta negra recién molida.", "Espolvoree la mitad del queso por igual entre las cajas de tartas, seguido de la mitad del tocino picado.", "Divida todo el calabacín en cubos entre las cajas de pastelería, luego cúbralo con el queso y el tocino restantes. Adornar con las hojas de tomillo.", "Vierta la mezcla de huevo y crema en las cajas de tartas, luego hornee en el horno durante 15-20 minutos, o hasta que el relleno se haya puesto y esté dorado en la parte superior. Retire del horno y deje enfriar un poco antes de servir.", "Mientras tanto, para la ensalada, mezcle la mostaza, el vinagre y el aceite de colza en un recipiente pequeño hasta que estén bien combinados.", "Llene una bolsa de plástico con cierre con las hojas de ensalada, agregue el aderezo y agite la bolsa para cubrir las hojas en el aderezo. Alternativamente, vierta el aderezo sobre las hojas de ensalada en un tazón y mezcle bien.", "Sirva las quiches calientes con la ensalada al lado."], "url": "www_bbc_co_uk_food_recipes_cheddar_smoked_bacon_and_56861", "title": "Cheddar, tocino ahumado y quiche de calabacín", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 huevos", "115ml / 4¼fl de leche en oz", "sal marina", "pimienta negra recién molida", "2 rebanadas de pan blanco (3cm / 1.25in de espesor)", "1 cucharadita de mostaza Dijon", "2 rebanadas de jamón, cortadas para que quepan en el pan", "2 rebanadas de queso cheddar", "1 cucharada de aceite de oliva"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4.", "Coloque huevos, leche, sal y pimienta en un tazón grande. Batir para combinar.", "Con un cuchillo afilado y de hoja fina, abra cuidadosamente un lado de cada rebanada de pan para formar un bolsillo. Asegúrese de dejar 1cm / 0.5in alrededor de los bordes.", "Extienda la mostaza en un lado del bolsillo y coloque una rebanada de jamón y queso dentro.", "Pon los bolsillos en un plato poco profundo. Vierta sobre la mezcla de huevo y déjela durante cinco minutos, volteándola una vez.", "Caliente una sartén antiadherente a fuego medio-alto, agregue la mitad del aceite de oliva y revuelva para cubrir la base de la sartén.", "Coloque el bolsillo del pan en la sartén y cocínelo por un lado durante aproximadamente dos minutos hasta que esté dorado. Gire y cocine por otro minuto.", "Retire de la sartén y colóquelo en una bandeja para hornear. Ponlo en el horno y cocina por diez minutos, o hasta que el relleno se derrita."], "url": "www_bbc_co_uk_food_recipes_cheddarandhameggybre_72058", "title": "Tostadas francesas con jamón y queso cheddar", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cheddarandhameggybre_72058_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["20g / ½ oz de mantequilla", "15g / ½ oz de harina natural", "½ cucharadita de mostaza Dijon", "pizca de cayena", "150ml / 5½ fl oz de leche", "1 cucharada de crema doble", "Queso cheddar de 55 g / 2 oz, rallado", "sal y pimienta negra recién molida", "2 huevos de gallinas camperas, separados"], "method": ["Precaliente el horno a 225C / 425F / Gas 7 y coloque una bandeja para hornear en el horno para calentar.", "Derretir la mantequilla en una olla pequeña. Cepille dos moldes con un poco de la mantequilla derretida y colóquelos en la nevera.", "Agregue la harina común a la sartén con la mantequilla derretida restante y revuelva hasta que se combinen. Agregue la mostaza de Dijon y la pimienta de cayena y revuelva.", "Poco a poco agregue la leche y la crema y cocine a fuego lento, revolviendo continuamente, hasta que la mezcla esté espesa y suave. Dejar hervir durante dos minutos, o hasta que la mezcla comience a salir de los bordes de la sartén.", "Retire del fuego y agregue el queso, la sal y la pimienta negra recién molida y las yemas de huevo. Dejar enfriar un poco.", "Coloque las claras de huevo en un tazón grande y bata hasta que se formen picos rígidos cuando se quite el batidor. Doble las claras de huevo batidas en la mezcla de queso y la cuchara en los moldes preparados.", "Coloque los moldes en la bandeja para hornear caliente en el horno y hornee durante 8-10 minutos, o hasta que estén bien levantados y dorados en la parte superior. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_cheddarcheesesouffle_88285", "title": "Soufflé de queso cheddar", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 salchichas Bratwurst o Lincolnshire", "pan para remojar", "Queso cheddar de 200 g / 7¼ oz, rallado", "½ litro de crema doble", "80ml / 2¾fl oz Grappa", "30g / 1¾oz de perejil fresco picado", "1 diente de ajo"], "method": ["Cocine las salchichas hasta que estén doradas y deje reposar", "Luego coloque la crema en una sartén y deje hervir a fuego lento. A continuación, agregue el ajo, el queso, la Grappa y el perejil.", "Sazonar al gusto y servir en una olla de fondue.", "Moje las salchichas y el pan en el queso."], "url": "www_bbc_co_uk_food_recipes_cheddarfonduewithbra_70705", "title": "Fondue cheddar con salchichas de bratwurst", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ cebolla blanca grande, cortada a la mitad por el centro, con la raíz y el tallo en cada extremo", "2 cucharadas de aceite de oliva", "1 salchicha", "30g / 1oz de queso cheddar, en rodajas"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Marque la superficie cortada de la cebolla varias veces con un cuchillo afilado y rocíe con una cucharada de aceite de oliva.", "Coloque las mitades de cebolla boca abajo en una sartén antiadherente, pequeña y resistente al horno, y fríe durante cuatro minutos o hasta que estén doradas.", "Gire las mitades de cebolla hacia arriba en la sartén y transfiéralas al horno para asar durante 8-10 minutos o hasta que estén suaves en el centro.", "Con el resto de una cucharada de aceite de oliva, freír la salchicha durante 2-3 minutos hasta que se dore por todos lados.", "Retire la salchicha de la sartén y corte por la mitad a lo largo.", "Llene el centro de la salchicha con las rodajas de queso cheddar y coloque en el horno junto a la cebolla. Hornee durante seis minutos o hasta que la salchicha esté cocida. Coloque en un plato de servir y sirva caliente."], "url": "www_bbc_co_uk_food_recipes_cheddarsausageandroa_86802", "title": "Cheddar, salchicha y cebolla asada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500g / 1lb 2oz de harina blanca fuerte", "7g de levadura instantánea", "1 cucharadita de sal", "1 cucharadita de azúcar o miel", "2 cucharadas de aceite de oliva", "300ml / 10fl oz de agua tibia", "50g / 1¾oz de chorizo, finamente picado", "Queso duro de 100 g / 3½ onzas (como queso cheddar o gouda), rallado", "2 cucharadas de cebollines finamente cortados (o tomillo finamente picado, orégano, perejil)", "1 huevo de gallinas camperas, batido, para glasear"], "method": ["Ponga la harina, la levadura, la sal y el azúcar (o miel) en un bol y vierta en el aceite de oliva, luego en el agua, mezclándolos hasta que se junte como una masa. Agregue el chorizo, 50 g / 1¾ oz del queso y el cebollino (u otras hierbas).", "Amasar en el bol por un minuto hasta que las adiciones hayan funcionado un poco, luego amase sobre una superficie enharinada hasta que la masa esté suave. Vuelva al tazón, cúbralo con un paño húmedo o película adhesiva y déjelo reposar en un lugar cálido durante 1½ a 2 horas, hasta que duplique su tamaño.", "Precaliente su horno a su configuración más alta. Derriba la masa levantada y divídela en 8-10 piezas iguales. Amasar y dar forma a las bolas, luego colocar en una lata de pastel de 28 cm / 11 pulgadas de diámetro o una pequeña lata de asar, que se ha forrado con papel resistente a la grasa. Cúbralo nuevamente con una toalla húmeda y déjelo ascender durante otros 20-30 minutos, o hasta que se levante y aplaste.", "Cepíllese ligeramente con el glaseado de huevo (se necesita un toque muy ligero si la masa de pan está hinchada y elástica), luego espolvoree sobre el queso restante de 50g / 1¾oz. Hornee en el horno durante 20-25 minutos, o hasta que estén cocidos y de un color dorado. Deberían sentirse un poco huecos. Sirve caliente del horno o frío."], "url": "www_bbc_co_uk_food_recipes_cheese_and_chorizo_rolls_96145", "title": "Rollos de queso y chorizo", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Hace 8-10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cheese_and_chorizo_rolls_96145_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina de auto crianza de 200g / 7oz", "100 g / 3½ mantequilla", "1 huevo de gallinas camperas", "leche para unir", "Queso cheddar 100 g / 3½ oz, rallado", "1 gran puñado de albahaca fresca", "1 cucharada de aceite de oliva", "1 cebolla roja, finamente rebanada", "2 cucharadas de azúcar moreno", "3 cucharadas de vinagre balsámico"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para los bollos, mezcle la harina, la mantequilla, el huevo y la leche suficiente para unirlos en un procesador de alimentos y formar una masa firme y suave.", "Estirar un poco de masa de bollo en una superficie plana. Mezcle el queso (reservar un poco para más tarde) y la albahaca y extienda la masa a 2½cm / 1in de espesor.", "Con un anillo o cortador de chefs de tamaño mediano, corte las rondas y coloque en una bandeja para hornear. Cepille con leche y cubra con el queso reservado.", "Coloque en el horno precalentado durante 15 minutos, o hasta que se haya levantado y dorado.", "Mientras tanto, para las cebollas, caliente el aceite en una cacerola, agregue las cebollas y fríelas hasta que estén suaves.", "Agregue el azúcar y deje que las cebollas se caramelicen durante 2-3 minutos.", "Agregue el vinagre balsámico y reduzca hasta que espese y sirope.", "Sirve los bollos calientes con cebollas balsámicas."], "url": "www_bbc_co_uk_food_recipes_cheddarsconeswithbal_78409", "title": "Bollos de cheddar con cebollas balsámicas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Rinde 7", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "20 g / ¾oz de hojas de espinaca baby", "1 diente de ajo, picado", "Salsa picante de 300 g / 10½ oz", "Baguette de estilo francés de 1 día, cortado en 1 cm / ½ en rondas", "4 huevos de gallinas camperas", "450ml / 16fl oz de leche entera", "150g / 5½oz de queso cheddar fuerte, rallado", "Queso de cabra suave 350g / 12oz, desgarrado en pedazos", "2 ramitas de romero", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 160C / 140C Fan / Gas 3.", "Calentar una sartén y agregar el aceite. Incline la espinaca y el ajo y cocine hasta que se marchiten. Condimentar con sal y pimienta.", "Coloque la espinaca en un plato para servir a prueba de horno. Extienda la salsa picante sobre un lado de la barra de corte y colóquela encima de la espinaca.", "Batir los huevos con la leche en un tazón. Agregue el queso cheddar y sazone con sal y pimienta. Vierta esta mezcla sobre la espinaca y el pan y deje reposar durante 10 minutos.", "Coloque el queso de cabra y las ramitas de romero encima y hornee durante 30 minutos o hasta que el queso se haya derretido. Servir de inmediato"], "url": "www_bbc_co_uk_food_recipes_cheese_and_chutney_77502", "title": "Estratos de queso y chutney", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 yemas de huevo grandes de gallinas camperas", "150g / 5½oz de mantequilla fría, cortada en cubos", "½ limón, solo jugo", "2 cucharadas de cebollines picados", "sal marina", "Harina normal de 250g / 9oz", "1 cucharadita de polvo de hornear", "1 cucharadita de sal", "1 cucharada de azúcar en polvo", "3 huevos de gallinas camperas", "425ml / 15fl oz de leche entera", "115g / 4oz de mantequilla sin sal", "6 rebanadas de jamón, rallado", "Queso cheddar 100 g / 3½ oz, rallado", "4 huevos frescos de gallinas camperas", "1 cucharadita de vinagre de vino blanco", "sal marina", "75g / 2½oz de mantequilla sin sal", "4 puñados de espinaca fresca"], "method": ["Precalentar un generador de gofres a la configuración media.", "Para hacer el holandesa, coloque un tazón grande a prueba de calor sobre una sartén de agua hirviendo a fuego lento. Agregue las yemas al recipiente, bata y agregue lentamente la mantequilla en cubos, poco a poco. Batir continuamente hasta que la salsa se haya combinado y haya espesado. Agregue el jugo de limón, el cebollín y una pizca de sal marina y revuelva. Apague el fuego, pero mantenga el recipiente sobre la sartén para mantenerse caliente.", "Para hacer los waffles, derrita la mantequilla en una sartén pequeña y agréguela a un tazón grande. Agregue los ingredientes restantes y mezcle.", "Vierta la mezcla en la máquina de hacer gofres y cocine durante 6-8 minutos. Si la máquina de gofres gana menos de cuatro a la vez, repita con la masa restante y mantenga los waffles cocidos calientes en un horno a baja temperatura.", "Para hacer los huevos escalfados, ponga a hervir una olla de agua. Agregue la sal y el vinagre y revuelva para disolver la sal. Rompe un huevo en una taza y baja lentamente el borde de la taza en la olla y deja caer el huevo. Cocine el huevo a fuego lento a fuego lento durante 3-4 minutos para que la yema aún esté líquida.", "Retire el huevo con una cuchara ranurada y colóquelo en un plato forrado con papel de cocina. Repita con los huevos restantes. Justo antes de servir, vuelva a calentar los huevos en agua tibia durante 1 minuto, si es necesario.", "Para hacer las espinacas, caliente la mantequilla en una cacerola, agregue las espinacas y cocine hasta que se marchiten.", "Para servir, coloque un waffle en cada plato con un poco de espinaca marchita en la parte superior. Cubra cada uno con un huevo escalfado y vierta sobre la salsa holandesa."], "url": "www_bbc_co_uk_food_recipes_cheese_and_ham_waffles_28778", "title": "Waffles de queso y jamón con salsa holandesa y huevos escalfados", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]