[{"isVegetarian": false, "title": "Lemon sole Véronique", "url": "www_bbc_co_uk_food_recipes_lemon_sole_vronique_12672", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["30g/1oz butter", "1 shallot, roughly chopped", "1 celery stick, chopped", "4 sprigs fresh thyme", "12 langoustine tails, blanched, meat removed, shells reserved", "5 tbsp white wine", "300ml/10fl oz fish stock ", "50g/1¾oz unsalted butter", "1 shallot, finely chopped", "100ml/3½fl oz dry vermouth", "200ml/7fl oz stock (from above)", "1 bay leaf", "150ml/5fl oz double cream", "150g/5½oz green grapes, peeled and cut in half ", "¼ cucumber, balled using a Parisian scoop", "75g/2½oz unsalted butted", "2 x lemon sole fillets, skinned, fillets halved and rolled up", "2 tbsp fresh chervil", "selection of edible flowers"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the stock, heat the butter in a saucepan and add the shallot, celery and thyme. Cook for 2-3 minutes. Add the langoustine shells and increase the heat. Add the white wine and fish stock and cook for 5 minutes. ", "Remove from the heat and place in a large food processor. Blend everything together, including the shells. Pass through a sieve and set aside.", "For the sauce, heat a large sauté pan and add the butter. Once melted add the shallot and cook for 1 minute. Add the vermouth, stock and bay leaf and cook until the volume of liquid has reduced by half. Add the cream and reduce by half again. Pass through a sieve into a clean pan. Add the grapes and cucumber balls and cook for 1 minute. ", "To cook the sole, heat a large frying pan and add the butter. Once hot add the sole. Cook on each side until golden and cooked through. Add the langoustine meat and warm through. ", "Put the sole fillets on a large plate and top with the langoustines. Pour the sauce around the plate and garnish with the fresh chervil and edible flowers."]}, {"isVegetarian": true, "title": "Lemon soufflé with spun sugar and raspberries", "url": "www_bbc_co_uk_food_recipes_lemon_souffl_with_spun_53293", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz butter, softened", "4 tbsp caster sugar", "4 free-range egg whites", "175ml/6fl oz ready-made vanilla custard", "3 lemons, zest and juice of 2", "200g/7oz caster sugar", "500g/1lb 2oz raspberries", "1 tsp lemon juice", "1-2 tbsp icing sugar, to taste"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the soufflé, preheat the oven to 220C/425F/Gas 7.", "Lightly grease four large ramekins with the butter, then dust with half the caster sugar.", "Whisk the egg whites in a large clean bowl until soft peaks form when the whisk is removed. Slowly whisk in the remaining caster sugar and continue to whisk until stiff peaks form. ", "Gently fold in the vanilla custard, lemon zest and juice until just combined. ", "Spoon the mixture gently into the prepared ramekins and place onto a baking tray. ", "Bake in the oven for 7-8 minutes then remove from the oven and serve immediately.", "Meanwhile, for the spun sugar, melt the sugar in a frying pan over a medium heat and when it turns into a deep golden colour, remove from the heat and use a fork to flick back and forth over the back of a ladle to form a cage. Set aside to cool and harden, then carefully twist the cage off of the ladle and place onto the plate.", "Place 300g/11oz of the raspberries and the lemon juice into a food processor and blend to a smooth purée. Taste the mixture and add icing sugar, to taste. Pass the mixture through a fine sieve into a bowl. ", "Place the soufflé onto the plate. Fill the cage with a few raspberries then drizzle the sauce around."]}, {"isVegetarian": true, "title": "Lemon Swiss roll with passionfruit cream and lemon drizzle glaze", "url": "www_bbc_co_uk_food_recipes_lemon_swiss_roll_with_37413", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 medium free-range eggs", "115g/4oz caster sugar, plus extra for dusting", "1 vanilla pod, cut in half lengthways and seeds scraped out", "75g/2½oz self-raising flour", "1 lemon, zest only", "100ml/3½fl oz double cream", "1 tsp vanilla extract", "100g/3½oz cream cheese", "6 passionfruits, seeds removed", "1 lemon, sliced ", "100g/3½oz caster sugar", "100g/3½oz raspberries or strawberries", "50g/1¾oz icing sugar", "1 lemon, zest and juice", "150g/5½oz icing sugar"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5. Line a 23x33cm/9x13in Swiss roll tin with baking parchment.", "Place the eggs, sugar and vanilla seeds in a large bowl and whisk until very light, fluffy and thickened. Sift the flour over the mixture, add the lemon zest and gently fold in.", "Pour the mixture into the lined tin and use a spatula to smooth the surface. Bake the sponge for 10-12 minutes, or until just firm to the touch.", "Place a piece of baking parchment that is slightly bigger than the Swiss roll tin on the work surface and dust it with caster sugar. Carefully flip the hot sponge over onto the baking parchment and peel off the parchment from the bottom of the sponge. Set aside to cool slightly.", "For the garnish, place the caster sugar and 100ml/3½fl oz water in a saucepan and bring to the boil. When the sugar is dissolved, add the sliced lemon and cook over a low heat for about 20 minutes, or until the lemons are soft. Leave to cool.", "For the passionfruit cream, in a large bowl, whip the double cream with the vanilla extract until soft peaks form when the whisk is removed. Stir in the cream cheese. ", "To assemble the Swiss roll, spread the whipped cream and cream cheese over the top of the sponge and then spoon over the passionfruit seeds. Take one of the short edges, then using the parchment paper underneath to start it off, roll up the sponge quite tightly, making sure the filling stays inside. Roll the sponge off the parchment.", "For the glaze, add all the ingredient to a small pan. Heat the mixture until the sugar dissolves.", "Pour the syrup evenly over the Swiss roll, dust with icing sugar and garnish with the berries and confit lemon slices."]}, {"isVegetarian": true, "title": "Lemon tart", "url": "www_bbc_co_uk_food_recipes_lemon_tart_38623", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz plain flour, plus extra for dusting", "100g/3½oz cold butter, plus extra for greasing", "25g/1oz icing sugar, plus extra for dusting", "1 pinch salt", "1 free-range egg", "14 free-range eggs, plus 1 beaten egg for glazing", "550g/1lb 4oz caster sugar", "700ml/1¼ pint double cream", "10 large lemons, zest and juice only", "500g/1lb 2oz crème fraîche, to serve"], "serves": "Serves 8-10", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["For the pastry, put the flour, butter, icing sugar and salt in a bowl and rub with the tips of your fingers until it resembles the texture of fine breadcrumbs.", "Add the egg and mix together until it forms a dough, then knead lightly on a work surface until smooth.", "Roll into a ball then flatten slightly, wrap in cling film and put in the fridge to rest for 30 minutes.", "For the tart, preheat the oven to 170C/340F/Gas 3½ and butter a 25cm/10in tart ring (approximately 4.5cm/1¾in deep).", "Break the eggs into a bowl, add the sugar, cream, lemon zest and juice and whisk gently to combine. Place in the fridge to chill.", "Roll out the pastry on a work surface lightly dusted with flour to about 3mm thick – keep turning the pastry a quarter turn every time you roll it so you end up with a perfect circle of pastry.", "Put the buttered tart ring on a flat baking sheet then line it with the pastry, carefully lifting the pastry up then pressing it into the base of the ring, leaving any excess hanging over the edge.", "Line with a several sheets of cling film to cover the pastry and hang over by 10cm/4in then fill the tart with flour, raw rice or baking beans. Fold the cling film back over the flour/rice and bake for 15 minutes. Not all cling film is suitable for use in the oven but aluminium foil or baking parchment can be used instead if preferred.", "Remove the cling film and flour/rice, brush the inside of the tart with the beaten egg and return to the oven for another 3-4 minutes, or until just golden-brown.", "Reduce the oven temperature to 150C/300F/Gas 2. ", "Skim off any bubbles from the top of the lemon cream and discard. ", "Pour half the lemon cream into the pastry case, then transfer to the oven before adding the rest of the filling (this prevents any spillage and gives a neat finish).  ", "Bake for an hour, or until the filling is set but still just wobbling in the centre. Leave to cool at room temperature.", "To serve, cut the tart into wedges and dust with icing sugar. Glaze either by putting the tart under a hot grill or by using a blow torch. Serve with a quenelle of crème fraîche."]}, {"isVegetarian": true, "title": "Lemon tendercake with blueberry compôte", "url": "www_bbc_co_uk_food_recipes_lemon_tendercake_with_52994", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_tendercake_with_52994_16x9.jpg", "ingredients": ["225g/8oz plain flour ", "1½ tsp baking powder ", "½ tsp bicarbonate of soda ", "¼ tsp fine sea salt ", "150ml/5fl oz vegetable oil, plus extra for greasing ", "150g/5½oz caster sugar ", "275ml/9½fl oz coconut milk ", "2 lemons, zest and juice ", "1 tsp vanilla extract ", "150g/5½oz blueberries ", "1 lemon juice, juice only", "1 tbsp caster sugar ", "1½ tsp cornflour ", "250g/9oz coconut milk yoghurt ", "1 tsp vanilla extract ", "2½ tsp icing sugar "], "serves": "Serves 8–12", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. Grease the sides and line the base of a 20cm/8in springform cake tin with baking paper. ", "To make the cake, combine the flour, baking powder, bicarbonate of soda and salt in a large bowl. ", "Whisk the oil, sugar and coconut milk together in a jug, followed by the lemon zest and 3 tablespoons of juice and the vanilla extract. ", "Pour the jug of liquid ingredients into the bowl of dry ingredients, whisking to combine, then pour into the prepared tin and bake for 30–35 minutes, by which time the top will be golden brown, the sides shrinking away from the tin and a cake tester should come out clean. Transfer to a wire rack and leave the cake to cool completely in its tin. It may sink slightly as it cools.", "To make the compôte, put the blueberries, 1 tablespoon lemon juice, caster sugar and 50ml/2fl oz of cold water into a saucepan and bring to the boil, then turn down the heat and simmer, stirring gently every now and again, for a couple of minutes until the blueberries have softened. Remove the pan from the heat. ", "Mix 1½ teaspoons of cold water with the cornflour in a small cup and stir the paste into the compôte. Put the pan back over the heat and stir gently for about 30 seconds until bubbling and thickened. If you feel it has become too jammy and thick, simply add a little more water and stir it in over the heat. Pour the compôte into a small heatproof bowl or jug to cool and set. ", "Just before serving, remove the cold cake from its tin and place on a cake stand or plate. ", "Mix the coconut-milk yoghurt and vanilla together, spoon the icing sugar into a tea-strainer, then sieve it over the yoghurt and stir it in before spreading and swirling this soft mixture over the top of the cake. Loosen the blueberry compôte a little with a fork and gently spoon on top, leaving a gleaming white frame. Serve immediately. "]}, {"isVegetarian": true, "title": "Strawberry meringue roulade", "url": "www_bbc_co_uk_food_recipes_lemon_verbena_meringues_29213", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["5 egg whites", "275g/9¾oz caster sugar", "handful small lemon verbena leaves", "1 tsp icing sugar, for dusting", "350g/12oz strawberries, hulled and halved depending on size", "400ml/14fl oz double cream", "1 vanilla pod, cut in half lengthways and seeds scraped out"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the meringues, preheat the oven to 180C/160C Fan/Gas 4. Line a large baking sheet with non-stick baking paper or a silicone mat.", "Whisk the egg whites in a clean, glass bowl using an electric hand whisk until stiff peaks form when the whisk is lifted out. Gradually add the sugar, one spoonful at a time, and whisk well between each addition. Whisk until very stiff and glossy and all the sugar has been added. ", "Spoon the mixture onto the lined baking sheet, creating a 35x25cm/14x10in rectangle, and smooth the surface. Sprinkle with most of the lemon verbena. Bake for 8 minutes, or until golden brown. Reduce the temperature to 170C/Fan 150C/Gas 3 and bake for a further 12 minutes, or until crisp.", "Lightly dust a sheet of baking paper with caster sugar. Allow the meringue to cool slightly before turning it out onto the baking paper, lemon verbena side down. Leave to cool. ", "For the filling, put 200g/7oz strawberries in a blender and blend until smooth. Pass the mixture through a sieve into a bowl to remove the seeds.", "Lightly whisk the cream in a large bowl. Stir in the strawberry sauce and 100g/3½oz of the remaining strawberries. Spread the strawberry cream evenly over the meringue. Starting at the long end, roll the roulade up using the paper to help you. ", "Decorate the top of the roulade with the remaining strawberries and lemon verbena leaves and dust with the icing sugar. "]}, {"isVegetarian": true, "title": "Lemon thyme custard with raspberries and sweet scraps", "url": "www_bbc_co_uk_food_recipes_lemon_thyme_custard_with_16395", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300ml/10½fl oz full-fat milk", "300ml/10½fl oz double cream", "4 sprigs lemon thyme", "6 free-range egg yolks", "50g/1¾oz sugar", "200ml/7fl oz double cream, whipped", "vegetable oil for deep frying", "1 free-range egg white ", "175g/6oz self-raising flour", "pinch bicarbonate of soda", "160ml/5½fl oz sparkling water ", "50g/1¾oz icing sugar", "200g/7oz fresh raspberries"], "serves": "Serves 2-3", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the lemon thyme custard, place the milk and cream in a large saucepan and add the lemon thyme. Heat for a couple of minutes. Meanwhile place the egg yolks and sugar in a large bowl and whisk. ", "Sieve the milk and cream to get rid of the thyme. Gradually pour the liquid over the egg and sugar and keep whisking to stop the eggs from scrambling.", "Pour the mixture back into the saucepan and cook until it coats the back of the spoon.", "Allow the custard to cool. Once cool, add the whipped cream and mix it in.", "For the sweet scraps, heat the oil in a deep fat fryer to 170C/340F, or heat the oil in a deep, heavy-based pan until a breadcrumb sizzles and goes brown when dropped in. (Caution: Hot oil can be dangerous. Do not leave unattended.)", "Place the egg white, flour and bicarbonate of soda in a large bowl and whisk. Gradually add the sparkling water, whisking all the time.", "Drizzle the batter into the deep fat fryer and cook for 1-2 minutes to make scraps. Remove with a slotted spoon, drain on a plate lined with kitchen paper and dust with icing sugar.", "To serve, layer the lemon thyme custard and fresh raspberries in a serving glass. Garnish with the sweet scraps and a few more raspberries."]}, {"isVegetarian": true, "title": "No-churn lemon yoghurt ice cream", "url": "www_bbc_co_uk_food_recipes_lemon_yoghurt_ice_cream_79279", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_yoghurt_ice_cream_79279_16x9.jpg", "ingredients": ["300ml/½ pint double cream", "300ml/½ pint full-fat natural yoghurt", "2 lemons, finely grated zest and juice", "350g/12oz caster sugar", "300ml/½ pint milk"], "serves": "Serves 8", "time": {"preparation": "overnight", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 0, "preparationMins": 0}, "recommendations": 0, "method": ["Whisk the cream in a bowl until soft peaks form when the whisk is removed.  Stir in the yoghurt, lemon zest and juice, sugar and milk. Whisk until well combined.", "Pour into a 1.5 litre/2½ pint shallow plastic container, cover with a lid and freeze for at least six hours, preferably overnight, until firm.", "Remove the ice cream from the freezer, cut into chunks and blend in a processor until smooth and creamy.  Return to the plastic container, cover with the lid and return to the freezer until required."]}, {"isVegetarian": false, "title": "Lemon and dill-marinated salmon with herb salad", "url": "www_bbc_co_uk_food_recipes_lemonanddillmarinate_84941", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz salmon fillet, skin removed", "1 tsp caster sugar", "½ lemon, juice only", "small handful fresh dill, finely chopped", "drizzle olive oil", "small handful each fresh chives, parsley, basil, mint, chopped", "squeeze lemon juice", "1 tbsp extra virgin olive oil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Put all the salmon ingredients into a bowl and stir to coat to salmon well. Cover with cling film and leave to  marinate for ten minutes. Slice thinly.", "To make the herb salad, put the herbs into a large bowl and squeeze over the lemon juice and olive oil. Mix until  the herbs are well coated.", "To serve, put the herb salad on a plate and top with the slices of marinated salmon."]}, {"isVegetarian": true, "title": "Lemonade granita", "url": "www_bbc_co_uk_food_recipes_lemonadegranita_70981", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["175g/6oz caster sugar", "6 lemons, juice and grated rind", "1 lemon grass stalk, roughly flattened with a rolling pin", "450ml/¾ pint soda water"], "serves": "Makes 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the sugar, lemon rind and juice, lemongrass stalk in a pan with 150ml/¼ pint water. ", "Heat gently, stirring until the sugar dissolves then simmer gently for five minutes then allow to cool. ", "Strain the liquid into a rigid container then stir in the soda water.", "Transfer to the freezer for at least two hours, whisking every 20 minutes to stop crystals forming.", "Serve in glasses."]}, {"isVegetarian": true, "title": "Lemon and lime pavlova", "url": "www_bbc_co_uk_food_recipes_lemonandlimepavlova_91318", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemonandlimepavlova_91318_16x9.jpg", "ingredients": ["150g/5½oz caster sugar", "3 free-range egg whites, whisked in a clean bowl until stiff peaks form when the whisk is removed", "½ tsp sherry vinegar", "2 lemons, juice and zest", "3 limes, juice and zest", "175g/6oz caster sugar", "3 free-range eggs, plus 5 free-range egg yolks", "150g/5oz butter, softened", "200g/7oz double cream, whipped until soft peaks form when the whisk is removed ", "12 passion fruit, pulp only, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Line a baking tray with greaseproof paper.", "For the meringue, whisk the sugar, a tablespoon at a time, into the stiffened egg whites, until the mixture is smooth and glossy.", "Gently fold in the sherry vinegar.", "Spoon the meringue mixture onto the prepared baking tray to form a circle about 20cm/8in in diameter. Spoon the remaining meringue in dollops around the edge of the meringue, forming swirls and peaks as you go. ", "Transfer the meringue to the oven and immediately reduce the temperature to 150C/300F/Gas 2. Bake for 45-50 minutes, or until the meringue has hardened on the outside, but is still soft and chewy in the middle. ", "Meanwhile, for the filling, place the lemon juice and zest, lime juice and zest, caster sugar, eggs, egg yolks and 75g/2¾oz of the butter into a heavy-based pan. Whisk over a medium heat until the sugar has dissolved and the mixture is smooth and thick enough to coat the back of a spoon. ", "Add the remaining butter, stirring continuously. Continue to stir until all of the butter has melted and the mixture has thickened considerably. ", "Remove the mixture from the heat and whisk a little, then set aside until completely cool.", "To serve, place the meringue into the centre of a serving platter. Spoon the lemon and lime filling mixture into the centre, then top with the whipped cream and passion fruit pulp."]}, {"isVegetarian": false, "title": "Lemon and garlic-roasted chicken with cheesy butternut mash", "url": "www_bbc_co_uk_food_recipes_lemonandgarlicroaste_85530", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 chicken breast", "1 garlic clove, chopped", "50g/1¾oz cheddar cheese, grated", "2 tsp fresh thyme leaves", "1 lemon, juice and zest only", "2 tbsp olive oil", "salt and freshly ground black pepper", "150g/5½oz butternut squash, peeled and chopped into 1cm/½in cubes", "2 smoked garlic cloves, peeled", "200ml/7fl oz milk", "salt and freshly ground black pepper ", "85g/3oz cheddar cheese, grated"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the lemon and garlic-roasted chicken, cut two slashes into the chicken breast. Tuck the garlic and cheese into the pocket under the mini-fillet, cutting to make it larger if necessary.", "Place the thyme leaves, lemon juice and zest and olive oil into a bowl, season with salt and freshly ground black pepper and mix well.", "Place the chicken into the bowl and leave to marinate for ten minutes.", "Heat a griddle pan and griddle the chicken for 3-4 minutes on each side. Transfer to a baking sheet and roast in the oven for 12-14 minutes, or until completely cooked through.", "Meanwhile, for the cheesy butternut mash, place the squash, garlic and milk into a large pan. Bring to the boil, reduce the heat and simmer for 10-12 minutes, or until the squash is tender. Mash with a potato masher, season well with salt and freshly ground black pepper and stir in the grated cheese. ", "To serve, place the mash onto a plate, top with the chicken and pour over the chicken cooking juices."]}, {"isVegetarian": false, "title": "Lemon and orange Chinese-style beef", "url": "www_bbc_co_uk_food_recipes_lemonandorangechines_79829", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp oil", "knob fresh ginger, peeled and sliced", "170g/6oz beef, thinly sliced", "3 lemon leaves, shredded (or subsitute lime leaves)", "2 tsp sesame oil", "2 tsp sesame seeds", "2 tbsp lemon, zest only", "honey, to drizzle"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a small wok over a high heat, until smoking, and add the ginger and beef. Stir fry for two minutes, to brown.", "Turn the heat down slightly, add the remaining ingredients and stir fry for a further two minutes before transferring to a bowl and serving."]}, {"isVegetarian": true, "title": "Lemon and polenta cake with lemon vodka cream", "url": "www_bbc_co_uk_food_recipes_lemonandpolentacakew_83693", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "2 lemons, thinly sliced", "450g/1lb butter", "450g/1lb caster sugar", "6 free-range eggs", "150g/5¼oz ground almonds", "500g/1lb 1½oz quick cook polenta", "2 lemons, zest and juice only", "150g/5¼oz mascarpone", "200ml/7¼fl oz double cream", "45ml/1½fl oz lemon vodka", "30g/1¼oz icing sugar", "½ lemon, juice only", "sprig of mint", "lemon zest"], "serves": "Serves 8-10", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Line a 30cm/9in deep cake tin with baking parchment.", "Heat a frying pan until hot then add the oil and lemon slices.", "Fry for 1-2 minutes until just caramelised.", "Remove and place caramelised side down in a pattern on the baking parchment in the tin.", "Place the butter and sugar into a large bowl and whisk together until light and fluffy.", "Add the eggs one at a time, mixing well.", "Fold in the ground almonds, polenta, lemon juice and zest and stir to combine.", "Pour the mixture over the lemon slices and spread evenly into the tin.", "Place in the oven for 25-30 minutes until just risen and golden.", "Allow to cool before turning out onto a plate, lemon slices uppermost.", "To make the lemon cream, place the mascarpone into a bowl and beat to soften.", "Pour in the double cream, lemon vodka, icing sugar and lemon juice.", "Whisk until mixture forms soft peaks.", "Serve a wedge of cake with a dollop of cream, a sprig of mint and sprinkle of lemon zest."]}, {"isVegetarian": false, "title": "Lemon and rosemary mackerel with olive dressing", "url": "www_bbc_co_uk_food_recipes_lemonandrosemarymack_88380", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "25g/1oz butter", "1 mackerel fillet, cut in half, skin scored with a sharp knife", "1 sprig fresh rosemary, chopped", "salt and freshly ground black pepper", "½ lemon, juice only", "100g/3½oz Kalamata olives, pits removed", "1 garlic clove, chopped", "2 tbsp olive oil", "fresh basil leaves, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the mackerel, heat the olive oil and butter in a frying pan. Add the mackerel and sprinkle with rosemary, salt and freshly ground black pepper. Fry for two minutes on each side, or until cooked through. Squeeze over the lemon juice and remove from the heat.", "For the dressing, place the olives, garlic and olive oil into a mini blender and process until smooth.", "To serve, place the mackerel onto a serving plate. Pour over the dressing and garnish with fresh basil leaves."]}, {"isVegetarian": true, "title": "Lemon and rosemary bulgar wheat salad", "url": "www_bbc_co_uk_food_recipes_lemonandrosemarybulg_89458", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz bulgar wheat", "½ vegetable stock cube", "boiling water", "1 lemon, zest and juice", "2 tbsp chopped fresh rosemary", "2 tbsp olive oil", "3 spring onions, sliced", "handful mixed salad leaves, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the bulgar wheat into a small pan and crumble the stock cube over it.", "Add boiling water to reach 1cm/½in above the bulgar wheat and stock. Cover with a lid and simmer over a medium heat for 12-15 minutes, or until the bulgar wheat is tender and has absorbed the water. ", "Fluff the wheat with a fork and add the remaining ingredients, mixing well until combined. ", "Press the bulgar wheat salad into a small heatproof bowl so that the wheat moulds to the bowl, and cover with a plate. ", "To serve, turn out the salad onto the serving plate and garnish with the mixed salad leaves."]}, {"isVegetarian": false, "title": "Lemon and thyme chicken with chilli beans", "url": "www_bbc_co_uk_food_recipes_lemonandthymechicken_70823", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150ml/5fl oz white wine ", "1 lemon, juice only", "4 boneless chicken breasts ", "plain flour, for dusting ", "120ml/4fl oz olive oil ", "2 small onions, finely sliced ", "1 lemon, zest and pith removed, thinly sliced, plus a few lemon slices to garnish ", "16 branches of fresh thyme, plus a few sprigs to garnish", "10 fresh sage leaves ", "salt ", "freshly ground black pepper", "1 clove of garlic", "1 red chilli, de-seeded and finely chopped", "200g/7oz green beans", "1 lemon, juice only"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["In a small bowl, mix together the wine and lemon juice, then set aside. ", "Season the chicken breasts with salt and pepper and rub well in.", "Lightly dust them with some flour, shaking off any excess. With the palm of your hand, flatten the breasts slightly.", "Heat the olive oil in a large pan. Add the chicken and seal on both sides (some chicken breasts contain water and may spit while cooking. To prevent this, cover with a lid).", "Once they are well-sealed and golden brown, remove the chicken breasts from the pan and set aside. ", "Lower the heat, add the onions, season with salt and pepper and sweat until the onions are soft. ", "Add the lemon slices, thyme and sage leaves and mix well.", "Return the chicken to the pan, cover and cook over a gentle heat for three minutes. Raise the heat (but be careful not to burn the onions and lemon).", "Add the wine and lemon juice mixture, then cover and cook for 10-15 seconds, until the mixture is bubbling. ", "Remove the lid and simmer until the liquid has evaporated slightly. You will see the sauce thickening.", "Taste and adjust the seasoning if necessary. ", "Arrange the chicken breasts on a large plate or on individual serving plates and pour the sauce over.", "Garnish with lemon slices and sprigs of thyme.   \t", "To prepare the chilli beans, cook until tender, then drain and toss in the garlic, lemon juice and chopped chilli."]}, {"isVegetarian": true, "title": "Lemon and thyme sweet potato fondant", "url": "www_bbc_co_uk_food_recipes_lemonandthymesweetpo_85374", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 sweet potato, peeled and sliced into 1cm/½in thick rounds", "3 tbsp water", "sprig fresh thyme, leaves only", "salt and freshly ground black pepper", "½ lemon, juice only", "lemon wedge, to serve"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a small frying pan and gently fry the sweet potato slices, turning frequently, until lightly golden on both sides.", "Add the water and thyme leaves and season with salt and freshly ground black pepper. Cover and simmer for 6-8 minutes, or until tender. Squeeze in the lemon juice and stir.", "To serve, place the sweet potato fondant onto a plate and garnish with a lemon wedge."]}, {"isVegetarian": true, "title": "Lemon cheesecake", "url": "www_bbc_co_uk_food_recipes_lemoncheesecake_65665", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemoncheesecake_65665_16x9.jpg", "ingredients": ["10 digestive biscuits", "75g/3oz butter, melted", "1 tbsp clear honey", "700g/1½ lb mascarpone cheese", "2 lemon, juice and zest", "200g/7oz caster sugar, plus more to taste", "4 tbsp icing sugar", "mint, to garnish", "450g frozen summer fruits, defrosted", "icing sugar, to taste"], "serves": "Serves 8-10", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Brush the bottom of a 23cm/9in springform cake tin with some of the melted butter and place a round of greaseproof paper in the base. ", "Crush the biscuits and tip them into a bowl, add the melted butter and honey and stir until well combined.", "Tip the mixture into the bottom of the cake tin. Using the back of a spoon, gently push the crumbs from the centre outward, until smooth and level. This will form the base of the cheesecake.  Chill in the fridge while making the filling.", "For the filling, mix the mascarpone cheese, lemon juice and zest and caster sugar together in a bowl until well combined. Do not mix the mixture too much as this will cause it to split. Taste the mixture and add more sugar, to taste.", "Spoon the mixture into the tin on top of the chilled biscuit mixture and chill in the fridge for at least 2 hours. ", "When ready to serve, either run a hot cloth or blowtorch round the outside of the tin and ease out the cheesecake. ", "For the sauce, blend most of the fruits with some icing sugar (to taste) in a food processor until smooth. Pass the sauce through a sieve.", "Place the cheesecake onto a plate, decorate the top with the sprigs of fresh mint and spoon the sauce around the side. Decorate with the remaining berries."]}, {"isVegetarian": false, "title": "Lemon chicken", "url": "www_bbc_co_uk_food_recipes_lemonchicken_11654", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemonchicken_11654_16x9.jpg", "ingredients": ["450g/1lb chicken breasts, no skin or bone - cut into strips", "1 egg white", "2 tsp cornflour", "good pinch salt", "sesame oil", "250ml/8fl oz groundnut oil", "3 lemons, juice and zest", "85ml/2fl oz chicken stock", "1 tbsp sugar", "1 tbsp light soy sauce", "splash of dry sherry (optional)", "1 clove garlic, crushed", "1 red chilli, finely chopped", "1 tsp cornflour or arrowroot - mixed with water", "small bunch spring onions, shredded", "seasoning"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Combine the egg white, cornflour, salt, a little sesame oil and chicken in a bowl - stir to make sure the chicken is well coated.  Leave for about 20 minutes.", "Heat a wok until very hot, add some groundnut oil and heat until smoking.  Remove from the heat and add the chicken - stir quickly to stop it from sticking and cook until the chicken turns white.  Drain the chicken over a heatproof bowl, set the chicken to one side, allow the oil to cool and discard.", "Wipe the wok clean and make the sauce. Add the stock, lemon juice and zest, sugar, soy and dry sherry together with the garlic and chilli. Bring to the boil and whisk in the cornflour or arrowroot mixture. Simmer gently for a few moments and then add the chicken. Stir fry to make sure the chicken is well coated and heated through properly.  ", "Add a little sesame oil as final seasoning and serve scattered with spring onions."]}, {"isVegetarian": false, "title": "Lemon chicken", "url": "www_bbc_co_uk_food_recipes_lemonchicken_89043", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 chicken breasts, skin removed, cut into strips", "3-4 tbsp cornflour, seasoned with salt and freshly ground black pepper", "1 tbsp vegetable oil", "small bunch spring onions, cut into 2cm/1in pieces ", "1 clove garlic, finely sliced", "25g/1oz fresh root ginger, finely sliced", "1 lemon, juice and finely sliced rind only", "1 tbsp light soy sauce", "85ml/3fl oz chicken stock", "dash dry sherry", "freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Roll the chicken strips in the seasoned cornflour and shake off the excess.", "Heat the vegetable oil in a frying pan, add the chicken and fry until the chicken is beginning to turn golden-brown. Add the spring onions, garlic, ginger and sliced lemon rind.   ", "Squeeze the juice of half a lemon into the pan. Add the soy sauce and chicken stock and a dash of dry sherry. Stir and leave to simmer for 5-6 minutes, or until the chicken is cooked through. Season with freshly ground black pepper. Stir well and serve."]}, {"isVegetarian": false, "title": "Lemon chicken casserole", "url": "www_bbc_co_uk_food_recipes_lemonchickencasserol_90144", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp honey", "1 lemon, zest and juice only, plus 1 lemon, sliced into thin rounds", "2kg/4lb 4oz free-range chicken, cut into 8 pieces", "salt and freshly ground black pepper", "125g/5oz butter", "1 tbsp olive oil", "4 garlic cloves, left whole, lightly crushed", "500ml/17fl oz hot chicken stock", "2 sprigs fresh thyme", "250g/9oz baby leaf spinach"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200/400F/Gas 6.", "Place the honey, lemon zest and lemon juice into a bowl and whisk until well combined. Add the chicken pieces and turn until they are completely coated in the mixture. Season well with salt and freshly ground black pepper and set aside for at least 10 minutes to marinate.", "Heat 40g/1½oz of the butter and half of the olive oil in a pan over a medium heat. When the butter is foaming, add half of the marinated chicken pieces and fry for 5-6 minutes, turning occasionally, until golden-brown. Set the chicken pieces aside on a warm plate.", "Repeat the process with another 40g/1½oz of butter, the remaining oil and the remaining chicken pieces. When the chicken pieces are golden-brown, set them aside.", "Add the garlic cloves, lemon slices and residual marinade juices to the pan and stir well, scraping any burned bits off the bottom of the pan with a wooden spoon.", "Return the cooked chicken pieces to the pan, then add the hot chicken stock and the thyme sprigs and stir well. Bring the mixture to the boil, then place into the oven to cook for 30-35 minutes, or until the chicken is tender and cooked through. Remove the chicken pieces from the pan and set aside on a warm plate.", "Continue to simmer the lemon sauce over a high heat for a further 5-10 minutes, or until the liquid has reduced to the consistency of thin syrup.", "Strain the sauce through a fine sieve, pressing the garlic pulp through the sieve using the back of a wooden spoon. Season the sieved liquid, to taste, with salt and freshly ground black pepper and set aside.", "Heat the remaining butter in a frying pan over a medium heat. When the butter is foaming, add the spinach and fry, stirring regularly, for 3-4 minutes, or until just wilted.", "To serve, place a portion of the wilted spinach into the centre of each plate. Place two pieces of chicken on top of each portion of spinach. Spoon over the lemon sauce and serve immediately."]}, {"isVegetarian": false, "title": "Lemon chicken stuffed with sun-dried tomatoes and apricot cheese", "url": "www_bbc_co_uk_food_recipes_lemonchickenstuffedw_88628", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 chicken breast, cut into three pieces", "5 sun-dried tomatoes, chopped", "75g/2¾oz Stilton with apricots, crumbled", "salt and freshly ground black pepper", "1 tbsp olive oil", "1 lemon, juice and zest only", "100g/3½oz spinach leaves, finely sliced", "½ lemon, juice only", "2 tbsp olive oil", "salt and freshly ground black pepper", "1 tbsp olive oil", "½ onion, finely chopped", "2 garlic cloves, finely chopped ", "1 orange pepper, cut into strips", "½ tsp chilli flakes", "1 tbsp caster sugar", "1 tbsp white wine vinegar", "1 orange, juice only", "1 lemon, halved"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the stuffed lemon chicken, lay out the three pieces of chicken breast on a sheet of cling film. Cover with another sheet of cling film and flatten the chicken with a rolling pin or meat mallet.", "Remove the cling film. Pile the chopped tomatoes and cheese into the centre of each chicken piece. Season with salt and freshly ground black pepper, then roll up the chicken around the stuffing, securing with a cocktail stick. ", "Heat the oil in an ovenproof frying pan and sear the stuffed chicken on all sides until golden-brown, about 3-4 minutes. Sprinkle over the lemon zest and squeeze over the juice. Transfer to the oven and roast for about 10-12 minutes, or until completely cooked through.", "For the citrus spinach, place the spinach into a bowl with the lemon juice, oil, salt and freshly ground black pepper and stir well.", "For the pepper sauce, heat the oil in a pan and gently fry the onion, garlic and orange pepper for 4-5 minutes.", "Add the chilli flakes, sugar, white wine vinegar and orange juice and simmer for 6-7 minutes, or until the sauce is reduced and sticky and the peppers are soft.", "To serve, heat a frying pan until hot and place the lemon halves, cut-side down, in the pan. Leave for 4-5 minutes, until charred.", "Place a bed of citrus spinach on a serving plate and top with the stuffed chicken (remove the cocktail sticks). Arrange the chargrilled lemon halves to one side and the pepper sauce in a small bowl on the other side."]}, {"isVegetarian": false, "title": "Lemon chicken", "url": "www_bbc_co_uk_food_recipes_lemonchicken_91444", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150ml/5½fl oz chicken stock", "2 lemons, zest and juice", "1 tbsp dry sherry", "1 garlic clove, left whole", "4 x 150g/5½oz chicken breasts, skin removed", "250ml/9fl oz chicken stock", "4 tbsp caster sugar", "4 lemons, zest and juice", "1 tbsp cornflour, mixed to a paste with a little water", "salt and freshly ground black pepper", "75g/2¾oz butter", "200g/7oz ready-made egg-fried rice ", "4 spring onions, trimmed, finely chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the chicken, mix together the chicken stock, lemon zest and juice, sherry and garlic clove in a large casserole. Bring to the boil, then reduce the heat until the mixture is just simmering.", "Add the chicken breasts and cover the casserole with a lid. Cook for 20-25 minutes, or until cooked through. Set aside to cool slightly. ", "For the lemon sauce, bring the chicken stock, sugar and lemon zest and juice to the boil in a pan, then continue to cook for 4-5 minutes.", "Whisk in the cornflour paste until the mixture is smooth. Season, to taste, with salt and freshly ground black pepper.", "Heat the butter in a frying pan over a medium heat. Add the cooled chicken breasts and fry for 2-3 minutes on each side, or until golden-brown on both sides. ", "To serve, place one chicken breast onto each of four serving plates. Pour over the lemon sauce. Spoon a portion of egg-fried rice alongside. Sprinkle over a little spring onion."]}, {"isVegetarian": false, "title": "Lemon chicken with squash mash and spicy stir-fried curly kale", "url": "www_bbc_co_uk_food_recipes_lemonchickenwithsqua_82107", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 chicken breast, skinned and flattened with a meat mallet", "2 tsp plain flour, seasoned with salt and freshly ground black pepper", "1 tbsp butter, melted", "½ lemon ", "1 tbsp chopped fresh parsley, to serve", "lemon wedges, to serve", "½ butternut squash, peeled and chopped", "50ml/2fl oz double cream", "salt and freshly ground black pepper", "1 tbsp butter", "1 tbsp olive oil", "3 spring onions, finely chopped", "125g/4½oz curly kale, chopped", "3 tbsp white wine", "1 tsp dried chilli flakes", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the lemon chicken, roll the chicken in the seasoned flour. ", "Melt the butter in a frying pan, add the floured chicken, squeeze over half the juice from the lemon and cook for 2-3 minutes. ", "Turn over, squeeze over the rest of the lemon and cook for 2-3 minutes or until the chicken is cooked through. Remove from the pan and keep warm.", "To make the butternut squash mash, boil the squash in salted water until soft. ", "Drain and blend in a food processor with the double cream, salt and freshly ground black pepper. ", "Melt the butter in a frying pan, add the blended butternut squash and sauté for 1-2 minutes.", "To make the spicy curly kale, heat the olive oil in a sauté pan and add the spring onions. ", "Cook gently until softened slightly, add the curly kale and cook for another minute, stirring frequently. ", "Add the white wine, chilli flakes, salt and freshly ground black pepper and leave to cook for 5 minutes or until all the liquid has been absorbed.", "To serve, place a pile of butternut squash mash onto a large plate, top with the lemon chicken and spoon the spicy curly kale onto the side. Sprinkle with chopped parsley and serve with wedges of lemon."]}]