[{"ingredients": ["325g / 11½oz (alrededor de 2) peras muy duras", "Fresas firmes de 500g / 1lb 2oz, sin cáscara", "400g / 14oz granulado o azúcar en polvo", "1 limón pequeño, solo jugo", "1 vaina de vainilla, solo semillas"], "method": ["Pele y ralle las peras, menos el núcleo y las pepitas, en una cacerola grande. Cubra con 500 ml / 18 fl oz de agua, lleve a ebullición y cocine durante unos 15 minutos, o hasta que los filamentos de pera estén tiernos y el agua casi se haya evaporado.", "Agregue las fresas y hierva durante otros cinco minutos, o hasta que las bayas estén muy tiernas y el líquido casi se haya evaporado nuevamente.", "Agregue el azúcar y el jugo de limón, lleve a ebullición y cocine hasta que la mezcla indique 105C / 220F en un termómetro de azúcar. Revuelva con frecuencia para verificar que la mezcla no se pegue en el fondo de la cacerola.", "Agregue las semillas de vainilla, luego deje enfriar durante 2-3 minutos. Coloque la mermelada en recipientes calientes y limpios mientras el atasco esté caliente y selle de inmediato.", "Deje la mermelada un día antes de comer, y después de abrir, guárdela en el refrigerador."], "url": "www_bbc_co_uk_food_recipes_whole_strawberry_and_05215", "title": "Toda la conserva de fresa y vainilla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Rinde 600ml / 20fl oz (alrededor de 2 jarras de mermelada)", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/whole_strawberry_and_05215_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1,5 kg / 3lb 5 oz patatas harinosas (como Desiree, King Edward o Maris Piper), peladas", "50g / 1¾oz de mantequilla", "100ml / 3½ fl oz de leche", "sal y pimienta", "2 cucharadas de mostaza integral"], "method": ["Corte las papas en cubos pequeños de tamaño uniforme y colóquelas en una sartén con agua fría y salada. Llevar a ebullición y cocinar hasta que estén tiernos (la duración de la cocción depende del tamaño que los corte).", "Escurra y devuelva los cubos de papa a la sartén. Agregue la mantequilla y la leche. Mash usando un triturador de papas, y sazone con sal y pimienta. Agregue la mostaza integral.", "Servir caliente."], "url": "www_bbc_co_uk_food_recipes_wholegrain_mustard_mash_74962", "title": "Puré de mostaza integral", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Salmón entero de 3 kg / 6½ lb, eviscerado y a escala", "1 cucharada de granos de pimienta enteros", "2 hojas de laurel", "1 limón", "sal", "agua", "1 pepino entero, en rodajas finas", "200ml / 7fl oz de mayonesa", "1 limón, solo jugo", "5g de eneldo, picado", "Condimento", "200ml / 7fl oz de mayonesa", "40g / 1½ oz de cohete salvaje, aproximadamente desgarrado", "2 cucharadas de semillas de sésamo", "2 limas frescas, cortadas a la mitad", "pimentón ahumado"], "method": ["Coloque el salmón en una sartén grande de lados profundos. Agregue los granos de pimienta enteros, las hojas de laurel, el jugo de limón, el limón entero y una buena pizca de sal.", "Llena la sartén con agua fría hasta cubrir el salmón. Cubra la bandeja con papel de aluminio, hierva, apague el fuego y deje enfriar.", "Retire la piel de la mitad del costado del salmón. Coloque las escamas en forma de pepino sobre la carne de salmón y sirva con las salsas de mayonesa y las limas sumergidas en el pimentón ahumado."], "url": "www_bbc_co_uk_food_recipes_wholepoachedsalmon_11557", "title": "Salmón escalfado entero", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 7-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina integral de 250g / 9oz", "Harina normal de 250g / 9oz", "2 cucharaditas de polvo de hornear", "½ cucharadita de sal", "200 g / 7oz de queso cheddar rallado", "100g / 4oz de parmesano rallado, o queso duro vegetariano similar", "Leche 400ml / 14fl oz", "1 huevo de gallinas camperas, golpeado"], "method": ["Precaliente el horno a 220C / 425F / Gas 7. Cubra una bandeja para hornear con papel pergamino.", "Coloque las harinas, el polvo de hornear, la sal, el queso cheddar y la mitad del parmesano en un tazón grande y mezcle para combinar. Agregue la leche y junte los ingredientes con sus manos o con una cuchara de madera. La mezcla será pegajosa en este punto.", "Incline la mezcla sobre una superficie ligeramente enharinada. Doble y amase para formar una masa suave.", "Aplanar o rodar ligeramente la masa a 2,5 cm / 1 pulgada de espesor. Dragar un cortador de 6cm / 2½ pulgadas en harina para asegurar un corte preciso y cortar 15 bollos. Colóquelos en la bandeja de hornear; es posible que deba hacerlo en dos lotes. Cepille la parte superior de los bollos con el huevo batido y espolvoree con el queso parmesano restante.", "Cocine por 15-17 minutos hasta que los bollos estén dorados. Sirve caliente con mantequilla."], "url": "www_bbc_co_uk_food_recipes_wholemeal_cheese_scones_12017", "title": "Bollos de queso integral", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Rinde alrededor de 15 bollos", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/wholemeal_cheese_scones_12017_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 salmón entero 2.5-2.75kg / 4lb 15¼oz-6lb 1oz", "1 cebolla picada", "2 hojas de laurel", "4 cucharadas de vinagre de vino blanco", "1 limón, descuartizado", "sal marina", "pimienta negra agrietada"], "method": ["Coloque el salmón en una caldera de pescado. Si no tiene uno, una lata grande para asar le irá bien.", "Agregue suficiente agua fría para cubrir el pescado (debe estar cubierto). Agregue la cebolla, las hojas de laurel, el vinagre y el limón y una buena pizca de sal y un poco de pimienta negra.", "Cubra con una tapa o papel de aluminio y deje que hierva sobre la estufa. Es más fácil y rápido colocar dos anillos debajo del pez. Una vez que esté hirviendo, apague el fuego y permita que los peces se queden en el agua hasta que se enfríen.", "Retire con cuidado el salmón y colóquelo sobre una tabla. Cuidadosamente raspe la piel y colóquela en un plato grande para servir. Sirva con un tazón de rodajas de limón y un cuenco de holandesa."], "url": "www_bbc_co_uk_food_recipes_wholepoachedsalmonan_74098", "title": "Todo el salmón escalfado y limón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/wholepoachedsalmonan_74098_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 x 2.5kg / 5lb 6oz de salmón entero, a escala y eviscerado", "1 limón, reducido a la mitad", "2 cucharaditas de pimienta negra", "2 hojas de laurel", "2 pepinos", "unas cuantas hojas de ensalada", "mayonesa, para tuberías"], "method": ["Coloque el salmón en una lata grande para asar o en un hervidor de pescado y cúbralo con agua. Exprima el jugo de limón y agregue las cáscaras a la lata, luego agregue los granos de pimienta y las hojas de laurel.", "Llevar a ebullición, luego retirar del fuego de inmediato. Déjelo a un lado para que el salmón se cueza lentamente en el calor residual durante aproximadamente 30 minutos, o hasta que esté cocido (la carne debe estar completamente opaca).", "Usando una rebanada de pescado, retire con cuidado el salmón de la lata y colóquelo en un plato grande para servir. Retire la piel del lado de la presentación, desde detrás de las branquias hasta la cola.", "Corta finamente los pepinos, luego divide cada rebanada en pequeños semicírculos. Coloque las rodajas de pepino sobre la carne de salmón expuesta en un patrón para imitar escamas de pescado.", "Rodea el salmón con hojas de ensalada.", "Para servir, vierta la mayonesa sobre y alrededor del salmón, según lo desee."], "url": "www_bbc_co_uk_food_recipes_wholepoachedsalmonwi_93188", "title": "Salmón escalfado entero con 'escamas' de pepino", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 8-10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal de 250g / 9oz, más extra para espolvorear", "10 g / ¼ oz de sal", "10 g / ¼ oz de bicarbonato de soda", "Harina integral de 250g / 9oz", "Copos de avena jumbo 150 g / 5½ oz", "2 cucharaditas de miel clara", "1 cucharadita de melaza negra", "375ml / 13fl oz de suero de leche", "125ml / 4fl oz de leche entera", "1 pepino, pelado, sin semillas y finamente cortado", "sal", "100ml / 3½fl oz de vinagre de vino blanco", "25 g / 1 oz de azúcar en polvo", "½ cucharada de semillas de mostaza", "puñado de eneldo, picado", "1 botella (75cl) de vino blanco seco", "manojo de flatleaf perejil", "2 puerros pequeños, en rodajas", "2 palitos de apio, en rodajas", "2 cebollas en rodajas", "1 cucharada de sal marina", "6 granos de pimienta negra", "2 hojas de laurel", "1 salmón salvaje entero, 3-3.5kg / 6lb 8oz-7lb, eviscerado y a escala", "sal y pimienta negra recién molida", "150g / 5½ oz de mantequilla orgánica sin sal de buena calidad", "4 huevos de pato de gallinas camperas", "4 cucharadas de alcaparras, enjuagadas", "pequeño puñado de perejil, picado", "2 cucharadas de cebollines picados", "jugo de limón, al gusto", "sal y pimienta negra recién molida", "mantequilla de buena calidad"], "method": ["Para el pan de trigo, precaliente el horno a 200 ° C / 390 ° F / Gas 6. Cubra una bandeja para hornear con papel para hornear.", "Tamiza la harina común, la sal y el bicarbonato de soda en un tazón grande y mezcla la harina integral y los copos de avena. Mezcle la miel y la melaza en el suero de leche, luego dobla rápidamente y ligeramente la leche de suero y la leche en los ingredientes secos. Mezcle los ingredientes con las manos, teniendo cuidado de no trabajar en exceso: cuando los ingredientes son pesados, la acción debe ser ligera.", "Divida la masa en cuartos con las manos enharinadas, luego moldee cada una en una ronda y colóquela en la bandeja para hornear. Espolvoree ligeramente con harina y marque una cruz en la parte superior de cada barra con un cuchillo. Hornee durante 20-30 minutos o hasta que los panes suenen huecos al golpearlos en la base. Transfiera a una rejilla de alambre, cubra con un paño húmedo sobre los panes y deje enfriar. (El pan de trigo se debe comer el mismo día o el siguiente: se hacen cuatro panes, pero el pan se congela bien). Baje el horno a 100C / 210F / Gas ¼.", "Mientras el pan se hornea, prepare la ensalada de pepino. Para la ensalada de pepino, espolvorea las rodajas de pepino con sal y deja reposar. Ponga el vinagre de vino en una sartén con 100 ml / 3½ fl oz de agua, las semillas de azúcar y mostaza. Calienta suavemente hasta que el azúcar se haya disuelto, luego hierve para reducir a la mitad. Retire del fuego. Enjuague y drene el pepino, luego mezcle en el líquido decapante con el eneldo. Dejar de lado.", "Coloque todos los ingredientes para el caldo de la cancha en una caldera de pescado grande con 6 litros / 10½ pintas de agua fría. Llevar a ebullición y cocine a fuego lento durante 20 minutos.", "Baja el salmón al caldo de la cancha. Regrese a ebullición, luego cubra el hervidor con fuerza para que no escape el vapor. Transfiera al horno y cocine por 25 minutos con la puerta del horno entreabierta.", "Mientras tanto, haz el aderezo. Para el aderezo, derrita la mantequilla y manténgase caliente. Baje los huevos de pato en una olla con agua hirviendo y cocine a fuego lento durante cuatro minutos. Levante los huevos fuera del agua con una espumadera y deje que se enfríen un poco con agua fría, luego retire con cuidado las conchas. Aplaste los huevos en un tazón con un tenedor, luego mezcle las alcaparras, las hierbas y la mantequilla tibia derretida. Sazonar con jugo de limón, sal y pimienta negra recién molida al gusto. Mezcle bien y mantenga el aderezo caliente.", "Retire el pescado del caldo de la corte tan pronto como finalice el tiempo de caza furtiva. Cortar en 6-8 piezas y servir con la ensalada de pepino y el aderezo caliente en cada plato, con pan de trigo y mantequilla de buena calidad en el lateral."], "url": "www_bbc_co_uk_food_recipes_wholepoachedwildsalm_86183", "title": "Salmón escalfado entero y aderezo de pato con pan de trigo y mantequilla de campo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 polluelos", "100g / 3½ oz champiñones", "200g / 7oz chalotes", "50g / 2oz de ajo", "50g / 2 oz de tomillo, finamente picado", "3 cucharadas de pan rallado", "100 g / 3½ oz de mantequilla", "Tocino de 25 g / 1 oz", "2 rebanadas de panceta para envolver", "100g / 3½oz de perejil de hoja plana", "2 dientes de ajo", "50g / 2oz de mantequilla", "sal y pimienta para probar", "1kg / 2¼lb patatas por ej. Jersey Royals", "100g / 3½ oz de panceta, frita y cortada en cubitos", "2 cucharadas de harina de maíz", "tomillo escogido", "1 manojo de zanahorias", "1 manojo de nabos bebé", "1 manojo de puerros", "100 g / 3½ oz de judías verdes"], "method": ["Para preparar el poussin, quítate las piernas, corta el cadáver para dejar el pecho sobre la corona. Raspe la espoleta y corte el hueso del ala.", "Quite los huesos del muslo de las piernas y corte el nudillo de la baqueta (puede dejar el hueso adentro, pero no le dejará mucho espacio para el relleno).", "Deja en la nevera hasta que esté listo para llenar con la farsa de hongos.", "Para la farsa de champiñones, pique finamente los champiñones, los chalotes, la panceta y el ajo.", "Freír la panceta hasta que la grasa comience a agotar en el tocino. Agregue la mantequilla, el ajo y los chalotes, cocine por unos minutos y luego agregue los champiñones y el tomillo.", "Cocine los champiñones hasta que estén blandos, agregue el pan rallado y sazone.", "Cuando esté frío, llena las patas de pollo. Nota: la consistencia debe ser flexible y no demasiado desmenuzable y seca.", "Vuelva a dar forma a las patas, luego envuélvalas en panceta y asegúrelas con palitos de cóctel.", "Para la mantequilla de hierbas, mezcle todos los ingredientes en una licuadora hasta que tenga un color verde brillante.", "Levanta la piel del pecho del poussin y rellena con la mantequilla. Tire de la piel hacia abajo, sazone y envuelva en papel de aluminio.", "Ase las piernas y la pechuga en un horno moderado (200C / 400F / Gas 6) durante 20 minutos o hasta que estén cocidos. (El pollo se cuece cuando los jugos se hacen transparentes cuando se perfora en la parte más gruesa con un pincho). Retire del horno y déjelo a un lado para que descanse.", "Para el rösti, pele y ralle las papas, exprima el exceso de agua, luego agregue el tocino, el tomillo y la harina de maíz. Condimentar con sal y pimienta.", "En una sartén pequeña caliente un poco de aceite y agregue la mezcla de papa. Freír en ambos lados para dar color.", "Para la guarnición de verduras, haga la emulsión agregando mantequilla a una sartén con agua, caliente hasta que la mantequilla se haya derretido, echada a un lado.", "Friegue y limpie todas las verduras, pállese y revuélvalas en agua helada.", "Cubra los frijoles y páselos por la cola, pállese y revuélvalos en agua helada.", "Cualquier verdura verde debe ponerse en agua hirviendo y luego cocinarse. Otras verduras pueden ponerse en agua fría y luego llevarlas a ebullición.", "Para servir, caliente el pollo en el horno, coma los vegetales en un poco de mantequilla derretida y caliente a través del rosti. Acomodar cuidadosamente en el plato y decorar con berros."], "url": "www_bbc_co_uk_food_recipes_wholeroastchickenpot_13472", "title": "Pollo asado entero, patatas y tocino rosti y verduras glaseadas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1,5 kg / 3½ lb de pollo entero", "4 cucharadas de yogurt natural sin endulzar", "1 cucharadita de sal masala", "4 cucharadas de crema individual", "2 cucharadas de pimentón medio caliente", "1 cucharadita de chile picante medio picante", "1 cucharadita de comino molido", "2 cucharadas de jugo de limón", "2 cucharadas de aceite vegetal", "1 cucharadita de sal", "½ cucharadita de cúrcuma", "1 cucharada de puré de tomate", "4 dientes de ajo, aplastados", "2 cucharaditas de raíz de jengibre pelado y finamente rallado", "Hojas de cilantro de 100g / 4oz, más o menos picadas", "3 chiles verdes con los dedos, más o menos picados", "1 diente de ajo, aproximadamente picado (opcional)", "½ cucharadita de sal", "1 cucharadita de jugo de limón", "1 cucharadita de azúcar demerara"], "method": ["Pincha el pollo por todos lados y haz unas hendiduras de unos 2 cm / ¾ pulgadas de largo sobre la piel.", "Mezcle todos los ingredientes del pollo restantes en una pasta suave y frote el adobo generosamente en toda la piel del pollo. Cubra y refrigere durante ocho horas o toda la noche.", "Precalentar el horno a 180C / 350F / Gas 4.", "Coloque el pollo en una lata para asar y cubra con papel de aluminio. Asar en el centro del horno durante 1½ horas. A mitad de la cocción, rocía con un poco del adobo.", "Retire el pollo del horno y déjelo en un lugar cálido para que descanse durante 20 minutos.", "Mientras tanto, para el chutney de cilantro, coloque todos los ingredientes en una licuadora y mezcle hasta que la mezcla se convierta en una pasta gruesa. Agregue 4-5 cucharadas de agua fría para facilitar la mezcla. Alternativamente, use una mano de mortero. Este chutney se puede almacenar en un recipiente hermético y no metálico durante un máximo de cuatro días en el refrigerador."], "url": "www_bbc_co_uk_food_recipes_wholetandoorichicken_74790", "title": "Pollo tandoori entero con chutney de cilantro", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Sirve 2-3", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/wholetandoorichicken_74790_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Remolacha pequeña herencia 900g / 2lb, recortada", "3 cucharadas de aceite de colza", "Filete de jabalí 900 g / 2lb", "sal y pimienta negra recién molida", "55 g / 2 oz de mantequilla", "1 cucharada de semillas de comino", "2 cucharadas de cebollines picados"], "method": ["Cocine la remolacha en agua hirviendo con sal durante unos 30 minutos (dependiendo del tamaño) hasta que esté cocida. Retirar del agua y dejar enfriar.", "En otra sartén, caliente dos cucharadas de aceite y fríe los filetes de jabalí durante unos 10 minutos, volteándolos con frecuencia.", "Sazonar con sal y pimienta, luego sacar y dejar reposar por 10 minutos. Reserve los jugos de pan.", "Mientras la carne está en reposo, deslice las pieles fuera de la remolacha y córtelas en rodajas.", "Caliente el aceite restante y la mantequilla en una sartén y agregue las rodajas de remolacha. Freír por unos cinco minutos y luego sazonar con sal y pimienta y agregar las semillas de comino. Revuelva y luego quite el fuego.", "Para servir, coloque la remolacha en un plato para servir. Cortar los filetes de jabalí y colocar la carne encima de la remolacha. Verter sobre los jugos de la sartén y espolvorear con cebollino picado."], "url": "www_bbc_co_uk_food_recipes_wild_boar_fillet_with_80335", "title": "Filete de jabalí con remolacha y semillas de comino", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Col blanca de 450g / 1lb, rallada", "200g / 7oz de col roja, rallada", "4 zanahorias ralladas gruesas", "2 remolachas dulces, toscamente ralladas", "2 remolachas amarillas ralladas gruesas", "1 membrillo, rallado grueso", "4 cucharaditas de sal", "1 hoja de laurel", "5 todas las bayas de especias", "5g semillas de alcaravea", "300ml / 10fl oz de agua hervida y enfriada", "Base de col agria de 300g / 10½oz (desde arriba)", "3 cucharadas de aceite de oliva", "1 pizca de pimienta negra recién molida", "2 pizca de sal", "1 pizca de azúcar en polvo", "10g de perejil picado, más extra para decorar", "2 cebollas tiernas en rodajas, solo verdes, más extra para decorar", "Lomo de jabalí 300 g / 10½ oz, limpiado de grasa y tendones", "Licor de membrillo 40ml / 1½fl oz", "5g de sal", "1 pizca de pimienta negra recién molida", "10g de mostaza integral", "100 g de lardo ahumado, cortado en cubitos", "300 g de setas silvestres mezcladas", "1 cucharadita de jugo de limón", "sal y pimienta negra recién molida", "350g / 12oz de salchichas de jabalí (alrededor de 6)", "3g de mejorana fresca picada, (o 1g seca)", "1 huevo, golpeado", "5 hojas sabias", "100 g / 3½ oz de carne de cerdo, empapada en agua con sal hasta que quede blanca y seca en un paño (alternativamente, use tocino rayado)", "aceite vegetal, para freír", "400ml / 14fl oz de vino blanco", "Licor de membrillo 100ml / 3½fl oz", "150 g / 5½ oz de azúcar en polvo, más extra para las piezas de membrillo", "3 cucharadas de jugo de limón", "1 vaina de vainilla, corte y semillas raspadas", "Anís de 2 estrellas", "3 vainas de cardamomo verde", "6 todas las bayas de especias", "10 bayas de enebro, ligeramente trituradas", "1 ramita de canela", "2 hojas de laurel", "2 dientes", "5 tiras de ralladura de naranja", "3 membrillos, carne cortada en trozos, núcleos descartados"], "method": ["Para la base de col agria de invierno, coloque todos los ingredientes en un bol y mezcle bien.", "Golpea todo con el extremo de un rodillo hasta que se rompa y se libere el jugo.", "Ponga la mezcla en un frasco conservador de 2 litros esterilizado, presiónelo un poco y recargue con agua fría para cubrir. (Asegúrese de que haya espacio en la parte superior del recipiente, pero las verduras están completamente cubiertas).", "Coloque el frasco en una bandeja o placa honda y déjelo en un lugar cálido por 3 días. (en las primeras 24 horas, puede pasar jugo por la tapa). Después de 3 días poner en la nevera o una despensa fría. El repollo está listo para comer. Si le gusta que sea más ácido, déjelo hasta por una semana.", "Para terminar el repollo, combine todos los ingredientes para la mezcla de repollo junto con la base justo antes de servir.", "Para el paquete de jabalí y salchicha, marina el lomo de jabalí en todos los ingredientes durante 2 a 4 horas en la nevera.", "Cuando esté marinado selle rápidamente el lomo en todos los lados, cocinando en una sartén de aceite caliente.", "Agregue el adobo y el calor para reducir el volumen a un glaseado pegajoso. (Tenga cuidado ya que el alcohol puede prenderse fuego.) Enfriar y reservar en la nevera.", "Para la carne de salchicha, primero cocine los champiñones. Caliente el lardo en una sartén hasta que se derrita y luego agregue los champiñones. Freír rápidamente, sazonar con jugo de limón, sal y pimienta.", "Guarde dos tercios de los champiñones y caliente antes de servir.", "Picar el resto de los champiñones cocidos y agregarlos a la carne de salchicha de jabalí, huevo y mejorana y mezclar bien para combinar.", "Para hacer el paquete, en la película adhesiva aplanar la carne de salchicha en un rectángulo uniforme del ancho del lomo y lo suficientemente largo como para envolver alrededor del lomo.", "Coloque el lomo encima de la carne de salchicha y envuelva la carne de salchicha alrededor. Enrolla y dale forma a una salchicha uniforme y lisa, envuelta en una película adhesiva.", "Enfriar en la nevera para establecer.", "Cuando el lugar frío salvia deja en una línea en la parte superior del rollo.", "Envuélvete en una capa de cerdo para crear un paquete apretado (puedes usar tocino rayado en su lugar).", "Para cocinar el paquete, precaliente el horno a 180C / 160C Fan / Gas 4.", "Caliente el aceite vegetal en una sartén resistente al horno lo suficientemente grande como para contener el paquete.", "Coloque el paquete en la sartén con las hojas de salvia hacia abajo y selle rápidamente hasta que estén doradas. Transfiera la sartén al horno y cocine durante 15 minutos. Saque y descanse en un lugar cálido durante 10 minutos (esto es muy importante).", "Para el membrillo escalfado, coloque todos los ingredientes excepto el membrillo en una sartén. Agregue 500ml / 18fl oz de agua y lleve a ebullición. Agregue el membrillo y cocine a fuego lento durante unos 15 minutos hasta que esté suave, pero no pastoso. Luego, cuele, reservando el líquido de cocción.", "Toma la mitad de los trozos de membrillo y ponlos en una licuadora. Agregue suficiente líquido de cocción para cubrir y mezcle hasta lograr un puré suave y espeso (agregue un poco más de líquido de cocción si es necesario)", "Mezcle los trozos de membrillo restantes con azúcar impalpable y cocine en una sartén caliente hasta que estén caramelizados.", "Para servir, vierta el puré caliente sobre un plato para servir y coloque las piezas de membrillo caramelizadas alrededor del plato. Tallar el paquete de jabalí en rodajas gruesas de 1 cm / ½ pulgadas y sazonar ligeramente con sal marina. Arregle 3 rebanadas por persona. Agregue un montón alto de ensalada agria de invierno, esparza alrededor de los champiñones silvestres recalentados, espolvoree con perejil picado y cebollas tiernas."], "url": "www_bbc_co_uk_food_recipes_wild_boar_loin_and_87384", "title": "Paquete de lomo de jabalí y salchicha, ensalada de col agria y membrillo escalfado", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["aceite de oliva, para freír", "1 cebolla, pelada y finamente picada", "2 zanahorias, peladas y finamente picadas", "2 palitos de apio, finamente cortados en cubitos", "2 dientes de ajo, pelados y finamente cortados", "harina, para quitar el polvo", "sal y pimienta negra recién molida", "750g / 1lb 10 oz cuello de jabalí o hombro, cortado en cubos de 3cm / 1in", "100g / 3½ oz de tocino", "1 hoja de laurel", "5cm / 2in tira de corteza de naranja", "375ml / 13fl oz de vino tinto, preferiblemente italiano", "2 cucharadas de puré de tomate", "4 ramitas de orégano, hojas recogidas y picadas", "Harina 300g / 10oz tipo 00", "½ cucharadita de sal", "3 huevos de gallinas camperas", "sémola, para quitar el polvo", "250 g / 9 oz de hongos porcini frescos, cortados a la mitad longitudinalmente", "aceite de oliva, para freír", "parmesano fresco, para servir"], "method": ["Precalentar el horno a 150C / 300F / Gas 2.", "Caliente el aceite en una cazuela o cacerola a prueba de horno, a fuego lento, a fuego medio-bajo. Agregue la cebolla, la zanahoria, el apio, el ajo y la hoja de laurel.", "Sazone la harina con sal y pimienta. Cubra ligeramente el jabalí en la harina sazonada. Agregue un poco de aceite de oliva a una sartén por separado a fuego alto y agregue las piezas de jabalí. Freír hasta que la carne esté dorada por todas partes; esto puede tener que hacerse por lotes para evitar llenar la sartén.", "Cuando los vegetales se hayan suavizado, agregue la panceta, la hoja de laurel y la cáscara de naranja a la sartén. Cocine por unos cinco minutos hasta que la mayor parte de la grasa de panceta haya desaparecido y las verduras se hayan dorado un poco alrededor de los bordes.", "Agregue la carne de jabalí dorada a las verduras. Vierta el vino tinto en la sartén utilizada para dorar la carne. Cocine a fuego medio, raspando el fondo de la sartén para aflojar los trozos carbonizados de carne.", "Agregue el puré de tomate al ragú y revuelva. Cocine por dos minutos revolviendo regularmente para evitar que se queme.", "Vierta el vino tierno en el ragú, agregue 200 ml / 7 fl oz de agua y cocine a fuego lento. Agregue las hojas de orégano y revuelva.", "Coloque la tapa en la sartén y colóquela en el horno precalentado durante 1 hora y media, o hasta que la carne se ablande y el líquido se reduzca. Verifique una o dos veces en este momento y revuelva para evitar que la carne en la superficie se seque.", "Mientras tanto, haz la pasta. Incline la harina sobre una superficie limpia y cree un pequeño pozo en el medio. Espolvorea sobre la sal.", "Romper los huevos en el pozo y, con un tenedor, comenzar a batir los huevos, trabajando lentamente en la harina. Una vez que se ha incorporado la mayor parte de la harina, use sus manos para amasar la masa durante aproximadamente cinco minutos. La masa debe ser suave y flexible. Si no, sigue amasando hasta que esté.", "Envuelva la pasta en film transparente y déjela reposar durante 5-10 minutos.", "Reduce a la mitad la masa y pasa la mitad por cada etapa de una máquina de pasta dos veces, comenzando con la configuración más ancha y bajando hasta que hayas pasado la configuración más delgada. Cubra la pasta con un poco de harina de sémola para evitar que se pegue y deje reposar durante unos minutos para que se seque ligeramente. Repita con la pasta restante.", "Corte las hojas de pasta con el cortador de tallarines o, si las corta a mano, tome uno de los extremos cortos de la pasta y doble sobre una tira de 5 cm. Siga doblando hasta que tenga un paquete de pasta, luego corte el paquete en tiras anchas de 1 cm / ½ pulgadas, cortando desde el extremo corto para producir tiras largas de pasta. Cubra las tiras en un poco más harina de sémola para evitar que se peguen.", "Cuando esté listo para cocinar, hierva una olla grande de agua y agregue una cantidad generosa de sal. Coloque la pasta y cocine durante unos tres minutos antes de escurrir. Vístase con un poco de aceite de oliva si no come de inmediato.", "Antes de servir, agregue un poco de aceite de oliva a una sartén a fuego medio-alto. Una vez que haya fumado, agregue las setas a la mitad y saltee durante 2-3 minutos.", "Para servir, incline la pasta en el ragú terminado y sirva en porciones cubiertas con parmesano recién rallado y champiñones fritos."], "url": "www_bbc_co_uk_food_recipes_wild_boar_rag_with_fresh_39141", "title": "Jabalí ragú con pasta fresca", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/wild_boar_rag_with_fresh_39141_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["700g / 1lb 9oz de hombro de jabalí sin espinas", "4-5 cucharadas de aceite de girasol", "4 lonchas de tocino ahumado o panceta ahumado sin corteza, cortadas en rodajas de 1cm / ½ en rodajas", "1 cebolla grande, finamente picada", "4 dientes de ajo, aplastados", "75g / 2½oz de aceitunas negras deshuesadas, enjuagadas, escurridas y rebanadas", "2 cucharaditas de bayas de enebro, ligeramente trituradas en mortero", "500ml / 18fl oz de vino tinto", "400 g / 14 oz pueden cortar tomates", "2 cucharadas de puré de tomate", "1 cubo de caldo de carne", "2 hojas de laurel grandes", "3 ramitas espesas tomillo", "1 tallo de romero, alrededor de 12cm / 4½ pulgadas de largo, hojas finamente picadas", "2 cucharaditas de azúcar en polvo", "sal marina escamada y pimienta negra recién molida", "pasta pappardelle recién hecha, para servir", "virutas de parmesano, para servir"], "method": ["Corte el jabalí en trozos gruesos, cada uno alrededor de 2.5 cm / 1 in. Recorte cualquier grasa o tendón muy duro sobre la marcha. Sazone la carne muy bien con sal y pimienta. Caliente dos cucharadas de aceite en una sartén grande.", "Freír el jabalí en dos tandas a fuego medio-alto hasta que se dore bien por todos lados, volteándolo de vez en cuando y agregando más aceite si es necesario. Tan pronto como el jabalí se dore, transfiéralo a una cazuela a prueba de llamas grande o una cacerola grande.", "Vierta un poco más de aceite en la sartén en la que el jabalí estaba dorado y fríe el tocino durante 2-3 minutos, o hasta que la grasa se fríe y se dore. Dispersar sobre la carne. Agregue un poco más de aceite a la sartén y freír la cebolla picada a fuego lento durante cinco minutos, revolviendo a menudo hasta que comience a ablandarse.", "Revuelva el ajo, las aceitunas y las bayas de enebro trituradas en la sartén y cocine durante dos minutos más, revolviendo. Agregue a la cazuela a prueba de llamas con la carne y vierta sobre el vino.", "Agregue los tomates, el puré de tomate y 500ml / 18fl oz de agua fría. Revuelva sobre el cubo de caldo, agregue todas las hierbas y el azúcar y cocine a fuego lento.", "Revuelva bien, cubra ligeramente con una tapa, reduzca el fuego a bajo y deje hervir a fuego lento muy suavemente durante 2 horas y media, o hasta que el jabalí esté completamente tierno y se deshaga.", "Retire la tapa de vez en cuando y revuelva. Si el líquido se reduce demasiado, agregue un poco de agua adicional. La salsa debe ser bastante espesa cuando hayas terminado, pero no seca en absoluto. Retire el tomillo y los tallos de romero y las hojas de laurel. Sazone al gusto con sal y pimienta.", "Mezcle el ragù con la pasta de pappardelle recién hecha y espolvoree con algunas virutas de parmesano para servir."], "url": "www_bbc_co_uk_food_recipes_wild_boar_rag_76073", "title": "Ragú de jabalí", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 naranjas de Sevilla", "2 patos salvajes", "sal y pimienta negra recién molida", "Licor de naranja 50ml / 2fl oz", "200ml / 7fl oz de vino blanco", "20 g / oz de mantequilla", "Col de Saboya de 1,5 kg / 3¼ lb", "50ml / 2fl oz de aceite vegetal", "3 zanahorias, cortadas en cubitos", "2 dientes de ajo, triturados y muy finamente picados", "Lonchas de tocino ahumado 350g / 12oz, reducido a la mitad", "200 g / 7 oz de apionabos, pelados y cortados en cubitos", "sal y pimienta negra recién molida", "2 naranjas sevillanas, peladas y divididas en segmentos"], "method": ["Para el pato, precalentar el horno a 230C / 450F / Gas 8.", "Exprime las naranjas de Sevilla, reserva el jugo y rellena los patos con las pieles. Truss los patos y condimentar la piel con sal y pimienta. Coloque en una rejilla se sentó en una bandeja de asar.", "Ase los patos en el horno caliente durante 45 minutos a una hora; deben estar poco subestimados. Vierta la grasa de la sartén. Vierta el licor de naranja sobre los patos y prepárelo para encender el pato. Colóquelos en un plato, con la pechuga hacia abajo, y manténgalos en un lugar cálido.", "Escurra la grasa restante de la bandeja de asar, luego vierta el vino, desglasa la sartén raspando los jugos del fondo. Caliente y reduzca el volumen a una salsa espesa. Agregue el jugo de naranja, caliente nuevamente para reducir el volumen a la mitad, luego bata la mantequilla y revise el condimento.", "Para la col de col rizada con tocino ahumado, deseche las hojas de repollo externas de color verde oscuro. Apila las hojas en grupos de tres y quita las venas medias grandes con un cuchillo afilado. Picar groseramente.", "Calienta la mitad del aceite en una sartén grande. Ponga las zanahorias y cocine hasta que estén tiernas, luego mezcle el ajo y cocine por unos minutos, revolviendo continuamente. Transfiera las verduras a un recipiente con una espumadera.", "Freír el tocino en la misma sartén hasta que esté dorado y crujiente, luego levantarlo con la cuchara ranurada y poner con la zanahoria.", "Cocine el apio nabo en la grasa de tocino hasta que esté ligeramente dorado y tierno y ponga las zanahorias y el tocino.", "Agregue el aceite vegetal restante a la sartén. Cuando esté caliente, cocine el repollo, sazone con sal y revuelva bien para que el repollo no se queme.", "Cubra con una tapa ajustada y cocine a fuego alto, agitando la sartén enérgicamente. El calor hará que la col se encoja y pierda volumen.", "Cocine hasta que estén tiernos, luego mezcle el tocino y las otras verduras. Verifica el condimento.", "Para servir, esculpe los patos, colóquelos en un plato para servir con los segmentos de naranja y cúbralos con la salsa. Acumula el repollo al lado."], "url": "www_bbc_co_uk_food_recipes_wild_duck_with_orange_75399", "title": "Pato salvaje con jugo de naranja y repollo savoy con tocino ahumado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pato salvaje", "5cm / 2in cuadrado de grasa de cerdo trasero", "sal marina y pimienta negra recién molida", "50g / 1¾oz de mantequilla", "3 chalotes, finamente cortados en cubitos", "1 ramita de tomillo", "salpicaduras de vinagre de vino tinto", "150ml / 5fl oz puerto", "150ml / 5fl oz de vino tinto", "50ml / 2fl oz cassis", "50ml / 2fl oz de jugo de grosella negra", "1 cucharada de grosellas negras"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Truss el pato y coloque el cuadrado de la grasa de la espalda sobre el pecho. Coloque el pájaro en una lata de asar y póngalo en el horno. Después de 10 minutos, retire la grasa para permitir que el seno se dore.", "Cocine por otros 40 minutos, rociando el ave de vez en cuando, luego retírelo del horno y déjelo reposar en un lugar cálido.", "En una cacerola, derrita la mitad de la mantequilla y cocine suavemente las chalotas con el tomillo durante 10 minutos. Agregue el vinagre y deje que burbujee durante 30 segundos y luego vierta en el puerto, el vino y cassis. Reduzca a un almíbar fino, luego agregue el jugo de grosella negra y cocine a fuego lento durante cinco minutos.", "Agregue las grosellas negras, caliente suavemente, luego mezcle con la mantequilla restante y retire la sartén del fuego.", "Esculpa el pato descansado, coloca las rodajas en platos calientes y luego coloca la salsa alrededor del pato. Sirve con chips de juego y berros."], "url": "www_bbc_co_uk_food_recipes_wild_duck_with_63250", "title": "Pato salvaje con grosella negra y salsa de cassis", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["botón de mantequilla", "3 chalotes, finamente picados", "500g / 1lb 2oz de risotto carnaroli de arroz", "1.5 litres / 2½ pintas de caldo de verduras calientes", "3 cucharaditas de tomillo finamente picado", "2 cucharadas de mascarpone", "3 cucharadas de queso parmesano rallado", "125g / 4½oz de mantequilla fría, cortada en cubitos", "vinagre de cabernet sauvignon, al gusto", "aceite de oliva, para freír", "1kg / 2lb 4oz champiñones", "150 g / 5½ oz de ceps secos (hongos porcini)", "100g / 3½oz de caldo de setas", "1,75 litros / 3 pintas de caldo de ternera", "1,75 litros / 3 pintas de caldo de pollo blanco", "20 hongos morel", "2 cucharadas de chalote picado", "4 cucharaditas de vino blanco", "200ml / 7fl oz de caldo de pollo", "40g / 1½ oz de ajo silvestre", "virutas de parmesano", "cohete salvaje", "Olla de ternera o becerro de 240 g / 9 oz", "sal y pimienta", "aceite de oliva, para freír", "botón de mantequilla"], "method": ["Para el risotto, caliente la mantequilla en una sartén. Fríe los chalotes suavemente hasta que se ablanden. Agregue el arroz y revuelva para cubrir la mantequilla y los chalotes. Cocine hasta que el arroz sea translúcido.", "Agregue el caldo y el tomillo y cocine durante siete minutos. Vierta el risotto en una bandeja para hornear y póngalo a un lado para que se enfríe.", "Para el caldo de champiñones, caliente el aceite de oliva en una sartén grande de base pesada. Agregue los champiñones y fríalos hasta que estén dorados.", "Agregue los ceps secos, caldo de setas y caldo. Llevar a ebullición y continuar cocinando a fuego alto hasta que el volumen de líquido se haya reducido a la mitad. Cuele los champiñones, déjelos a un lado y devuelva el líquido a la sartén. Continúe cocinando a fuego alto hasta que el volumen de líquido se reduzca a la mitad nuevamente. Retire del fuego y reserve para más tarde.", "Para las colmenillas, recorte el borde blanco alrededor de la base de las colmenas, luego remoje en agua tibia para eliminar la arena que pueda estar dentro de las setas. Desagüe.", "Calentar un poco de aceite de oliva en una sartén a fuego alto, y freír las colmenillas con la chalota picada hasta que estén doradas. Desglasar la sartén con el vino blanco y cubrir con una tapa. Cocine hasta que el vino se haya evaporado, luego agregue el caldo de pollo y cocine con una tapa hasta que el caldo se haya evaporado y los champiñones estén glaseados. Retire del fuego y reserve para más tarde.", "Para la guarnición, lava y centrifuga todo el ajo silvestre, luego quita todos los tallos. Reserve 12 de las hojas más pequeñas para la guarnición, pique finamente el resto y reserve para después.", "Para las mollejas, utilizando un cuchillo afilado, retire la piel / membrana externa de las mollejas. Condimentar con sal y pimienta.", "Calentar un poco de aceite y un poco de mantequilla en una sartén a fuego alto. Cuando la mantequilla esté espumosa, agregue las mollejas y fría hasta que estén doradas y crujientes en el exterior y los jugos salgan claros (no lechosos) cuando inserte un cuchillo en la parte más gruesa. Retire de la sartén y reserve para más tarde.", "Para terminar el risotto, caliente una sartén grande a fuego medio y agregue 400 g / 14 oz del arroz risotto cocido y refrigerado. Vierta 360ml / 12fl oz del caldo de hongos y cocine hasta que el arroz esté al dente, luego retírelo del fuego y agregue el ajo silvestre picado, el mascarpone, el parmesano rallado y la mantequilla cortada en cubitos. Siga revolviendo hasta que todos los ingredientes estén combinados y calientes.", "Agregue unas gotas de vinagre de cabernet sauvignon y sazone al gusto con sal y pimienta. Coloque el risotto en cuatro cuencos y adorne con mollejas, colmenillas, virutas de parmesano, rúcula y hojas de ajo silvestre crudas. Rocíe cualquier jugo que quede en la sartén sobre el risotto, ya que está lleno de sabor."], "url": "www_bbc_co_uk_food_recipes_wild_garlic_roasted_66193", "title": "Ajo silvestre, molleja asada y risotto de morilla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500 g / 1 libra de cebollas de 2 oz, en rodajas finas", "400g / 14oz de ajo silvestre, más 25 g / 1 oz de tallos de ajo silvestre", "1 ramita de tomillo fresco", "50g / 1¾oz de bulbos de ajo, sin pelar", "50g / 1¾oz de mantequilla", "Papas de 150g / 5½oz, peladas y muy finas en rodajas", "Crema doble de 25 g / 1 oz", "sal", "aceite de oliva, para freír", "Tocino pancetta ahumado 50 g / 1 oz", "1 patata cerosa pequeña, cortada en cubos de 1cm / ½ en pulgadas, con la piel toscamente picada", "1 ramita de tomillo fresco", "1 diente de ajo, aplastado", "botón de mantequilla", "50ml / 2fl oz de crema agria", "aceite de ajo silvestre, opcional", "puñado de hojas pequeñas de ajo silvestre"], "method": ["Coloque 400 g / 14 oz cebollas, 400 g / 14 oz ajo silvestre y el tomillo en una olla grande con 800 ml / 1½ pintas de agua y llevar a ebullición. Cocine a fuego lento durante 30 minutos, retire del fuego, cubra y deje en infusión durante 2 horas.", "Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4. Envuelva los bulbos de ajo en papel de cocina y tueste durante 30-40 minutos, o hasta que se ablanden. Cuando esté lo suficientemente frío como para manipularlo, exprima la carne de ajo en un recipiente y déjela a un lado.", "Para las papas con grasa de tocino, caliente 2 cucharaditas de aceite de oliva en una sartén a fuego medio. Freír la panceta, los cubitos de patata, el tomillo y el ajo picado durante 3-6 minutos, o hasta que estén dorados y crujientes. Retirar del fuego, escurrir sobre papel de cocina y reservar.", "Para la piel crujiente, derrita la mantequilla en una cacerola pequeña y vierta sobre la piel de la papa. Sazonar con sal. Llene una pequeña olla de fondo grueso con aceite un tercio lleno. Caliente a 180 ° C (un cubo de pan debe dorarse en 1 minuto cuando lo deje caer) PRECAUCIÓN: El aceite caliente puede ser peligroso. No dejes desatendido Fríe la piel de papa hasta que quede crujiente, luego retírala con una espumadera y déjala escurrir sobre papel de cocina.", "Para la sopa, derrita la mantequilla en una cacerola grande a fuego lento y cocine las cebollas restantes de 100 g / 3½ oz durante 5 minutos, o hasta que se ablanden. Agregue las rodajas de patata y el ajo asado y cocine sin colorear hasta que la papa esté suave.", "En una cacerola separada, caliente la crema doble con el caldo de ajo silvestre, luego vierta sobre la cebolla y la mezcla de papa en rodajas. Agregue los tallos de ajo silvestre restantes y deje que hierva. Mezcle la sopa en una licuadora, cuele a través de un colador de nuevo en la sartén y sazone con sal.", "Para servir, coloque una cucharada de crema agria en el centro de cada uno de los cuatro cuencos poco profundos, cubra con aceite de ajo silvestre, si usa, luego las papas con grasa de tocino, las pieles crujientes y las hojas de ajo silvestre y rocíe la sopa alrededor de los bordes del bochas."], "url": "www_bbc_co_uk_food_recipes_wild_garlic_soup_with_17660", "title": "Sopa de ajo silvestre con papas con grasa de tocino y crema agria", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["75g / 2¾oz de mantequilla", "150ml / 5fl oz de caldo de pollo ligero", "1 cabeza de apio, cada tallo cortado en bastones de 2 pulgadas", "6 calabacines para bebés, divididos a la mitad longitudinalmente", "150 g / 5½ oz de setas", "algunas ramitas de tomillo", "splash vino de Madeira", "dash oil", "3 vieiras de rey", "4 cucharadas de aceite de oliva", "2 cucharadas de vinagre de vino blanco", "1 cucharadita de mostaza Dijon", "1 diente de ajo, aplastado", "1 huevo de gallinas camperas", "2 ramitas de estragón, finamente picadas", "sal y pimienta negra recién molida"], "method": ["Derrita 50 g / 1¾oz de mantequilla en una cacerola a fuego medio y luego agregue el caldo. Agregue el apio y el calabacín y cocínelos hasta que estén tiernos.", "Para hacer el aderezo, ponga a hervir una olla de agua, reduzca a fuego lento, agregue el huevo y cocine durante 5 minutos hasta que hierva.", "Mientras tanto, mezcle el aceite, el vinagre, la mostaza, el ajo y la temporada. Rompe la yema del huevo duro en el aderezo y bate. Picar finamente los blancos y revolver en el aderezo. Agregue el estragón y reserve.", "Derretir la mantequilla restante de 25 g / 1 oz en una sartén y saltear los champiñones y el tomillo. Agregue un poco de Madeira y cocine hasta que se reduzca.", "En una sartén por separado, caliente el aceite a fuego alto y fríe las rebanadas de vieiras en un lado hasta que estén doradas; esto tomará 2-3 minutos. Rebana en un ángulo.", "Para servir, espolvorea los champiñones entre dos tazones, cruza la parte superior con el apio y los calabacines, coloca una cuchara sobre la vinagreta y encima con las rebanadas de vieiras."], "url": "www_bbc_co_uk_food_recipes_wild_mushroom_and_03692", "title": "Seta salvaje y calabacín estofado y apio con vinagreta de huevo y estragón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina de pasta 300g / 10½oz '00'", "4 huevos de gallinas camperas", "25 g / 1oz de mantequilla sin sal", "100 g / 3½ oz de champiñones silvestres, limpios", "1 ramita de tomillo fresco", "1 pechuga de perdiz (aproximadamente 100-150 g / 3½-5½ oz), sin piel", "150ml / 5fl oz de crema doble", "sal y pimienta negra recién molida", "2 cucharadas de aceite de oliva", "50 g / 1¾oz de mantequilla sin sal", "4 pechos de perdiz, piel en", "250 g / 9 oz de setas", "200ml / 7fl oz stock de carne de jus", "100ml / 3½ fl oz crema doble", "selección de hierbas frescas"], "method": ["Para los ravioles, coloque la harina y los huevos en un procesador de alimentos y mezcle hasta que la mezcla se una. Retire de la licuadora y amasar hasta que se forme una masa suave. Envuelva la película adherida y colóquela en el refrigerador para que descanse durante al menos 1 hora.", "Mientras tanto, caliente una sartén mediana y agregue la mantequilla, una vez derretida agregue los champiñones y el tomillo. Cocine por 1-2 minutos.", "Coloque los champiñones cocidos, la perdiz y la crema en un procesador de alimentos, sazone con sal y pimienta y mezcle hasta que quede suave.", "Divida la masa de pasta descansada en 2 y pase a través de una máquina de pasta. Comience con la máquina de pasta en su posición más amplia y pase la masa por los rodillos. No se doble, pero repita este proceso, disminuyendo la inclinación del rodillo grado por grado con cada pasada, hasta llegar a la configuración más delgada. Estirar dos hojas de pasta y cortar círculos de 6-8 cm / 2½-3¼ pulgadas de ancho.", "Coloque 1 cucharadita de la mezcla en el centro de un círculo y con un cepillo de pastelería, cepille alrededor del borde con agua. Coloque otro círculo en la parte superior y selle. Repite este proceso con los ingredientes restantes (deberías poder hacer 10-12 ravioles).", "Para la salsa, precaliente el horno a 200C / 180C Fan / Gas 6.", "Caliente una sartén mediana y agregue el aceite y la mitad de la mantequilla, una vez caliente, agregue la pechuga de perdiz y cocínela por el lado de la piel durante 2-3 minutos, voltee y coloque en el horno durante 4-6 minutos.", "Caliente una sartén mediana y agregue la mantequilla restante, una vez caliente agregue los champiñones y cocínelos durante 1-2 minutos, agregue el caldo y continúe cocinando durante 2 minutos. Justo antes de servir, termine la salsa con la crema.", "Llevar a ebullición una cacerola grande de agua salada. Agregue los ravioles y cocine hasta que floten en la parte superior.", "Coloque los raviolis en la salsa y sirva en un tazón grande con los champiñones encima. Talla la perdiz y ponla encima. Adorne con hierbas frescas."], "url": "www_bbc_co_uk_food_recipes_wild_mushroom_and_38111", "title": "Raviolis de setas y setas", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Pasta de copos de 250g / 9oz", "50 g / 1¾oz de mantequilla sin sal", "50g / 1¾oz de harina natural, más extra para espolvorear", "300ml / 10fl oz de leche entera", "1 cucharada de mostaza Dijon", "1 cucharadita de tomillo fresco, solo hojas", "3 huevos de gallinas camperas, separados, más 1 clara de huevo", "pizca de cayena", "150 g / 5½ oz de Stinking Bishop, u otro queso con mucho sabor, picado", "75g / 2½oz de mantequilla sin sal", "300g / 10½ oz de champiñones silvestres, limpios", "1 diente de ajo, picado", "1 chalote de plátano, picado", "Nueces tostadas 75g / 2½oz, aplastadas", "trufa negra o blanca, afeitada"], "method": ["Precaliente el horno a 190C / 170C Fan / Gas 5.", "Empolva ligeramente una superficie de trabajo con harina. Estirar la masa para alinear una lata de tarta de 23cm / 9in. Pincha la base de la masa con un tenedor, pero no la recortes. Cubra la masa con papel de hornear, rellene con frijoles para hornear y hornee \"a ciegas\" durante 15-20 minutos. Retire con cuidado el papel y los frijoles y devuelva la caja de repostería al horno durante 5-10 minutos. Dejar enfriar en una bandeja para hornear. Recorta los pasteles.", "Mientras tanto, derrita la mantequilla en una olla grande. Agregue la harina y cocine por 2-3 minutos. Agregue la leche gradualmente, batiendo todo el tiempo, hasta que tenga una mezcla suave. Agregue la mostaza, el tomillo, las yemas de huevo, la cayena y la mitad del queso. Esparce el resto del queso en la caja de pastelería.", "En un tazón de vidrio grande y limpio, bata las claras de huevo con un batidor de mano eléctrico hasta que se formen suaves picos. Doble en la crema pastelera. Vierta en la caja de pastelería. Hornea por 20-25 minutos.", "Para los hongos silvestres, derrita la mantequilla en una sartén. Agregue los champiñones, el ajo y los chalotes y cocine por 2-3 minutos.", "Para servir, transfiera la tarta a un plato o tablero. Cubra con los champiñones, las nueces tostadas y las virutas de trufa."], "url": "www_bbc_co_uk_food_recipes_wild_mushroom_and_55565", "title": "Seta salvaje y tarta de Obispo hediondo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]