[{"isVegetarian": true, "title": "Chocolate brownie meringue cake with raspberry cream", "url": "www_bbc_co_uk_food_recipes_chocolate_brownie_64092", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_brownie_64092_16x9.jpg", "ingredients": ["200g/7oz good-quality dark chocolate roughly chopped ", "200g/7oz unsalted butter, softened, plus extra for greasing", "250g/8¾oz icing sugar", "3 free-range eggs", "110g/4oz plain flour", "4 free-range egg whites", "200g/7oz caster sugar", "½ tsp cream of tartar", "100g/3½oz hazelnuts, roasted, chopped", "300ml/10½fl oz whipping cream", "100g//3½oz icing sugar", "200g/7oz raspberries ", "", "handful hazelnuts, chopped", "handful pistachios, chopped"], "serves": "Serves 16", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5. Grease and line two 23cm/9in sandwich tins", "For the brownie base, melt 180g/6¼oz of the chocolate in a bowl set over a pan over simmering water. Chop the remaining chocolate and set aside.", "Meanwhile, cream the butter and icing sugar together in a separate bowl until light, creamy and fluffy. Slowly whisk in the eggs, one at a time, until well combined. ", "Gradually beat in the flour until the mixture is very smooth. Slowly pour in the melted chocolate and fold it into the mixture, then fold in the chopped chocolate.", "Pour the brownie mixture into the prepared sandwich tins and bake for 10-12 minutes. Reduce the oven temperature to 170C/325F/Gas 3. ", "Meanwhile for the meringue topping, whisk the egg whites and cream of tartar in a bowl until soft peaks form when the whisk is removed. Slowly whisk the sugar until smooth and glossy, then fold in the chopped hazelnuts with a metal spoon.", "Spoon the meringue topping onto the cooked brownie base. Use a palette knife to smooth the meringue mixture in one sandwich tin and use a skewer to make peaks in the meringue mixture in the other tin.", "Return the sandwich tins to the oven for a further 30 minutes, or until the meringue is golden-brown. Remove from the oven and set aside to cool. Carefully remove the cakes from the tin and set aside to cool completely on a wire rack.", "For the filling, whip the cream and icing sugar together in a bowl until stiff peaks form when the whisk is removed. Fold in the raspberries.", "To assemble, place the flat meringue brownie, meringue-side down onto a cake stand or large plate, spoon over the raspberry cream and top with the remaining cake, brownie-side down. Sprinkle over the chopped hazelnuts and pistachios."]}, {"isVegetarian": true, "title": "Lower-fat chocolate brownies", "url": "www_bbc_co_uk_food_recipes_chocolate_brownies_32438", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_brownies_32438_16x9.jpg", "ingredients": ["125g/4½oz reduced-fat sunflower spread", "2 free-range eggs", "125g/4½oz light soft brown sugar", "75g/2¾oz self-raising flour", "50g/1¾oz cocoa powder, sieved, plus extra to decorate", "50g/1¾oz plain dark chocolate, chopped", "1 tsp chocolate extract", "pinch salt"], "serves": "Makes 9 brownies", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/170C Fan/Gas 5. Grease and line an 18cm/7in square deep cake tin.", "Beat together the sunflower spread, eggs and sugar. Stir in the flour and cocoa powder, then add the chocolate and chocolate extract. Stir in 1 teaspoon of boiling water and a pinch of salt.", "Transfer the mixture to the prepared tin and bake for 30 minutes, or until a skewer comes out clean when inserted in the centre. ", "Leave to cool in the tin then cut into 9 squares. Dust with a little cocoa powder and serve."]}, {"isVegetarian": true, "title": "Chocolate buttercream icing", "url": "www_bbc_co_uk_food_recipes_chocolate_buttercream_11918", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_buttercream_11918_16x9.jpg", "ingredients": ["50g/1¾oz good-quality dark chocolate (minimum 70% cocoa solids)", "100g/3½oz unsalted butter, softened", "200g/7oz icing sugar", "1 tsp vanilla extract", "milk, to loosen"], "serves": "Makes enough to fill and top one 20cm/8in cake", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the chocolate in a bowl set over a pan of simmering water. (Do not allow the base of the bowl to touch the surface of the water.) Allow to cool until the chocolate no longer feels hot to the touch.", "Beat the butter in a bowl until soft, then gradually beat in the icing sugar. Add the vanilla extract and beat again.", "Fold in the melted chocolate until completely incorporated (add a few drops of milk if the mixture is a little stiff). ", "This icing can be kept in the fridge for a few days. Bring to room temperature and beat again until smooth before icing your cake."]}, {"isVegetarian": true, "title": "Chocolate, cardamom and hazelnut babka", "url": "www_bbc_co_uk_food_recipes_chocolate_cardamom_and_62885", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_cardamom_and_62885_16x9.jpg", "ingredients": ["120ml/3¾fl oz full-fat milk", "50g/1¾oz caster sugar", "1½ tsp fast-action yeast", "1 large free-range egg", "280g/10oz strong white flour, plus extra for dusting", "½ tsp salt", "1 tsp ground green cardamom seeds", "60g/2¼oz unsalted butter, softened, plus extra for greasing", "60g/2oz dark chocolate, chopped into small pieces", "15g/½oz white chocolate, chopped into small pieces", "25g/1oz hazelnuts, chopped into small pieces", "1 large free-range egg yolk", "130g/4⅔oz caster sugar"], "serves": "Makes 1 loaf", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the dough, combine the milk, half the sugar and the yeast in a jug. Add the egg and lightly beat to combine.", "In a large bowl, mix the flour, salt, cardamom and the remaining sugar until well combined. Add the milk mixture and combine. Knead in the bowl until you have a smooth dough.", "Rub about 10g/¼oz of the butter onto a clean work surface. Tip the dough out and knead in another 20g/¾oz butter until well combined and the dough forms a smooth ball. Transfer the dough to a lightly buttered bowl and cover with cling film. Prove in a warm place until doubled in size.", "For the glaze, heat the caster sugar and 112ml/3¾fl oz water in a saucepan. When the sugar has dissolved, set it aside to cool.   ", "Tip the dough out onto the work surface and roll out into a rectangle approximately 26x35cm/10½x14in.", "Spread the remaining butter on the dough and sprinkle over the chocolate and hazelnuts. Roll it up like a sausage and pinch the edges together to seal. Using a sharp knife, cut the dough lengthways to make two strands. Pinch the two pieces together at one end and then tightly braid together. Transfer to a loaf tin, cover with a proving bag and put in a warm place to prove until doubled in size.", "Preheat the oven to 190C/170C Fan/Gas 5.", "Whisk the egg yolk with 2 teaspoons water then brush onto the proved loaf.", "Bake for 27 minutes, or until golden-brown. Leave to cool a little in the tin, then  brush the sugar syrup onto the loaf. Remove from the tin and leave to cool completely on a wire rack."]}, {"isVegetarian": true, "title": "Chocolate cake (Schokogugelhupf)", "url": "www_bbc_co_uk_food_recipes_chocolate_cake_20610", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz butter, plus 2 tsp, softened", "50g/2oz ground almonds, plus 1 tbsp for dusting", "150g/5½oz dark chocolate, broken into pieces", "150g/5½oz icing sugar, sifted", "4 eggs, separated", "125g/4½oz self-raising flour", "½ tsp baking powder", "125g/4½oz dark chocolate", "40g/1½oz butter", "1 tbsp golden syrup", "15–20g/¾oz flaked or slivered almonds", "sugar crystals (optional)"], "serves": "Serves 10", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the cake, grease the cake tin with the two teaspoons of butter. Sprinkle the tablespoon of almonds into the tin and shake until the inside of the tin is completely coated with a light dusting of almonds.", "Melt the chocolate in a heatproof bowl set over a pan of simmering water. Remove the bowl from the heat and stir the chocolate until smooth, then leave to cool for at least 15 minutes.", "Preheat the oven to 190°C/375F/Gas 5. ", "Put the butter and icing sugar in a large bowl and cream them together until smooth and light. Add the egg yolks, one at a time, beating well between each addition. Beat in the cooled chocolate, then the 50g/2oz of ground almonds, flour and baking powder.", "Whisk the egg whites in a large, clean bowl with an electric hand-whisk until they are stiff but not dry. Stir about two heaped tablespoons of the egg whites into the chocolate mixture to loosen it, then gently fold in the rest with a metal spoon.", "Pour the mixture into the cake tin and bake in the centre of the oven for 35–40 minutes, until it is well risen and beginning to shrink away from the sides of the tin. Leave the cake to stand for 2 or 3 minutes, then gently run a knife around the sides and turn it out on to a wire rack to cool.", "To make the icing, melt the chocolate with the butter and syrup in a heatproof bowl over a pan of simmering water. Remove from the heat and stir until smooth, then leave to cool for 5 minutes. ", "Slowly drizzle the icing over the cake and allow it to slide slowly down the sides. If the icing moves too quickly or doesn’t cover the cake properly, let it cool for a few more minutes and then try again. Work slowly to get the best coverage. Leave the iced cake to stand for 10 minutes, then scatter with the almonds and sugar crystals if using. ", "Set aside for an hour or so until the icing is set before serving."]}, {"isVegetarian": true, "title": "Chocolate sponge cake", "url": "www_bbc_co_uk_food_recipes_chocolate_cake_48307", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_cake_48307_16x9.jpg", "ingredients": ["50g/2oz cocoa powder", "6 tbsp boiling water", "3 free-range eggs", "4 tbsp milk", "175g/6oz self-raising flour", "1 rounded tsp baking powder", "100g/4oz baking spread or soft butter", "300g/10oz natural caster sugar", "150g/5oz dark chocolate, broken into small pieces", "150ml/5fl oz double cream", "3 tbsp apricot jam", "icing sugar, to dust"], "serves": "Serves 8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4 and grease and line two 20cm/8in sandwich tins with baking parchment.", "Put the cocoa powder and boiling water into a large bowl and mix well to make a paste. Add the remaining ingredients and beat again until combined. This can also be done in a food processor, but take care not to over whisk. Divide the cake mixture between the prepared tins. Bake for about 25-30 minutes, or until well risen and shrinking away from the sides of the tin.", "Meanwhile, for the icing and filling, measure the chocolate and cream together in a bowl and stand the bowl over a pan of simmering water for about 10 minutes, or until melted. Stir from time to time. Set aside and leave until cool and almost set.", "Once baked, remove the cakes from the oven and allow to cool completely. Spread the tops of each cake with apricot jam. Fill the cakes with half of the icing and spread the remainder on top. Draw large “S” shapes over the cake with a palatte knife to give a swirl effect. Dust with icing sugar and serve in slices."]}, {"isVegetarian": true, "title": "Chocolate cardamon orange shortbread", "url": "www_bbc_co_uk_food_recipes_chocolate_cardamon_78064", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["10 cardamom pods", "50g/1¾oz golden caster sugar", "35g/1oz soft light brown sugar", "2 oranges, zest only", "170g/6oz unsalted butter, softened", "245g/9oz plain flour", "pinch of salt", "50g/1¾oz toasted flaked almonds, finely chopped ", "200g/7oz dark chocolate (preferably orange and almond flavoured) finely chopped", "icing sugar, to sprinkle"], "serves": "Makes 8–12 biscuits", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Remove the seeds from the cardamom pods and grind in a pestle and mortar. Put in a bowl with the sugars and orange zest. Mash them together using the back of a spoon so the oils get into the sugar and you can smell the orange and cardamom.", "Add the softened butter and mix until combined. Add the flour and salt then mix with your hands until only just combined (do not over-work the dough). Divide into two pieces.", "Add the half the almonds and 50g/1¾oz of the chocolate to one piece of dough. Mix it in with your hands.", "Flatten both pieces of dough, wrap in cling film and put in the fridge for 20–30 minutes.", "Preheat the oven to 180C/160C Fan/Gas 4.", "On a lightly floured surface roll out both pieces of dough to 1.25cm/½in thick. Cut out biscuits using star, heart-shaped or other Christmas cutters.", "Transfer the biscuits to a lined baking tray, leaving a little space between them, and put in the freezer for 10 minutes.", "Bake for 20–25 minutes until golden-brown. Leave to cool on a wire rack.", "Sprinkle the chocolate and almond shortbread with icing sugar.", "Gently melt the remaining chocolate in a heatproof bowl set over a saucepan of simmering water.", "Dip the corners or sides of the plain orange shortbread into the chocolate then sprinkle with the remaining toasted almonds. Lay on a silicone sheet or baking paper to set. Store them in a glass jar or wrap in clear plastic and make them into gifts."]}, {"isVegetarian": true, "title": "Chocolate hazelnut spread brownies", "url": "www_bbc_co_uk_food_recipes_chocolate_brownies_83180", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_brownies_83180_16x9.jpg", "ingredients": ["100g/3½oz plain flour", "50g/1¾oz cocoa powder", "¾ tsp baking powder", "pinch salt", "300g/10½oz dark chocolate, at least 70% cocoa solids", "250g/9oz butter", "250g/9oz granulated sugar", "4 free-range eggs", "100g/3½oz hazelnuts, roughly chopped", "100g/3½oz chocolate hazelnut spread (optional)", "50ml/2fl oz hazelnut liqueur (optional)"], "serves": "Serves 10", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 170C/150C Fan/Gas 3. Line a 30x20cm/12x8in straight sided brownie tin with foil or non-stick baking parchment.", "Sieve the flour, cocoa and baking powder together in a bowl and add a good pinch of salt. Break 250g/9oz of the chocolate into a heatproof bowl and place over a barely simmering saucepan of water, making sure the bowl does not touch the water. Leave to melt, stirring regularly. ", "When the chocolate has melted, remove and leave to cool slightly. Roughly chop the remaining chocolate and set aside.", "Beat the butter and sugar together in a bowl until very light and fluffy. Add the eggs, one at a time, then pour in the chocolate. Mix thoroughly, then add a third of the flour mixture. Stir to combine, then repeat with the other two-thirds of flour. ", "Add half of the hazelnuts and all the reserved chopped chocolate and stir to combine, then scrape the mixture into the prepared tin. ", "Whisk the chocolate spread and hazelnut liqueur together (if using), until you have a smooth, spoonable paste. Make little wells in the brownie mix and add spoonfuls of the mixture. ", "Sprinkle over the remaining hazelnuts and press down lightly. Bake in the preheated oven for around 30 minutes, testing after 25 minutes. When the brownies are done a wooden skewer should come out with a few crumbs attached – it shouldn’t be wet, but it shouldn’t be completely clean either.", "Leave to cool in the tin. If you can bear to wait, put the brownie tin in the fridge to rest overnight before cutting them – it will help them settle into a consistency that isn’t too cake-like. Cut into squares and store in an airtight tin."]}, {"isVegetarian": true, "title": "Chocolate, cherry and hazelnut brownies", "url": "www_bbc_co_uk_food_recipes_chocolate_cherry_and_80567", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz unsalted butter, plus knob for greasing", "300g/10½oz dark chocolate (minimum 70% cocoa solids)", "450g/1lb caster sugar", "5 large free-range eggs", "200g/7oz plain flour", "1 tsp salt", "1 x 225g/8oz jar maraschino cocktail cherries, drained, chopped", "150g/5½oz blanched hazelnuts, roughly chopped", "200g/7oz white chocolate, chopped into rough chunks", "15 fresh cherries ", "icing sugar, for dusting"], "serves": "Makes 12-16 brownies", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C fan/350F/Gas 4. Grease and line the bottom and sides of a 30x23cm/12x9in baking tin with butter.", "Put the dark chocolate and butter in a small saucepan and heat until just melted.  Remove from the heat and leave to cool slightly.  ", "In a large mixing bowl, beat the sugar and eggs together until light and frothy.", "In a separate bowl, combine the flour with the salt.  ", "Once the chocolate has cooled slightly, add it to the sugar and egg mixture and mix until combined.  Gradually add the flour and salt mixture, mixing well between each addition.  ", "Stir in the cocktail cherries, hazelnuts and 150g/5½oz of the white chocolate. Mix until evenly distributed then pour into the greased and lined tin and smooth the mixture into the corners.  ", "Melt the remaining 50g/1¾oz white chocolate and place evenly distributed blobs of chocolate on top of the brownie mixture. Use a cocktail stick to swirl the blobs of chocolate into the mixture. Place a fresh cherry at the base of each swirl. ", "Place on the middle shelf in the oven and bake for approximately 35-40 minutes, or until just set.  Be careful not to overbake the brownies.", "Leave to cool in the tin for 10 minutes, then remove carefully and place on the wire rack to cool.  When cooled cut into 12-16 pieces  and arrange in a mound of fudgy goodness on a pretty plate liberally dusted with icing sugar."]}, {"isVegetarian": true, "title": "Chocolate chip cookie dough pots", "url": "www_bbc_co_uk_food_recipes_chocolate_chip_cookie_83680", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_chip_cookie_83680_16x9.jpg", "ingredients": ["150g/5½oz plain flour", "½ tsp fine sea salt", "½ tsp bicarbonate of soda", "110g/4oz soft unsalted butter", "85g/3oz soft light brown sugar", "1 tsp vanilla paste or extract", "1 large free-range egg", "170g/6oz dark chocolate chips", "ice cream or, crème fraiche, to serve"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. ", "Measure the flour, salt and bicarbonate of soda into a bowl, forking together to mix.", "With an electric mixer, or by hand, beat the butter and sugar until you have a light and creamy mixture, then add the vanilla paste or extract and the egg, beating again to incorporate.", "Gently fold in the flour mixture, then, once it’s all mixed in, fold in the chocolate chips.", "Divide the dough between 6 ramekins (you will need about 4½ tablespoons of batter for each one). Using a small offset spatula or the back of a teaspoon, spread the mixture to cover the bottom of the ramekins, and smooth the tops.", "Place the ramekins on a baking sheet and bake in the oven for 13–15 minutes. They will still be quite gooey inside, but the top will be set, and they should be golden brown at the edges and just beginning to come away from the sides of the ramekins.", "Leave to cool for 5–10 minutes before serving. You can spoon a scoop of ice cream on top of each one or serve with cream or crème fraîche on the side. They will set as they cool down, so don’t dally now."]}, {"isVegetarian": true, "title": "Chocolate éclairs", "url": "www_bbc_co_uk_food_recipes_chocolate_clairs_03600", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_clairs_03600_16x9.jpg", "ingredients": ["4 tbsp water", "4 tbsp whole milk", "50g/2oz unsalted butter, at room temperature", "1 tsp caster sugar ", "pinch sea salt", "100g/4oz plain flour", "4 medium free-range eggs, beaten", "20g/¾oz unsweetened chocolate, 100% cocoa solids ", "450g/1lb pastry cream (crème patissière), at room temperature (see Top recipe tip below)", "1 tbsp strong cocoa powder, sifted", "200g/7oz white fondant icing", "1 tbsp cocoa powder ", "1-2 tsp water"], "serves": "Makes about 12 éclairs", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 170C/325F/Gas 3.", "For the choux pastry, place the water, milk, butter, sugar and salt in a medium saucepan over a high heat and bring the mixture to a boil.", "Remove the pan from the heat and, using a wooden spoon, quickly beat in the flour until the mixture is completely smooth.", "Turn the heat down to medium, return the pan to the hob and cook for about one minute, beating all the time, or until the mixture comes away from the edge of the pan.", "Remove the pan from the heat and gradually beat in the eggs until you have a smooth, dropping consistency. (You are looking for the mixture to just drop from the spoon, not run off it; you may not need all of the egg to reach this stage. )", "Transfer the paste to a large piping bag fitted with a 1.5cm/½in fluted nozzle and let the mixture to cool for about five minutes in the bag to stiffen slightly before you begin the piping.", "Line a large baking tray with greaseproof paper and pipe on 12 éclairs, each about 15cm/6in long. Alternatively, for a more professional and uniform finish, pipe four rows of pastry, each about 36cm/14in long, onto a non-stick tray and freeze. Cut the frozen strips into three and either defrost and cook as below, or bake from frozen and add five minutes to the cooking time.", "Bake the éclairs in the preheated oven for 30-35 minutes or until golden-brown, then transfer to a rack and leave to cool.", "For the filling, melt the chocolate in a bowl over a pan of simmering water. Do not let the bottom of the bowl touch the water or the chocolate will burn.", "Pour the melted chocolate into the pastry cream, mix in the cocoa powder and whisk together to a smooth consistency. You could chill the mixture at this point for 30 minutes, then whisk again before you fill the éclairs, to give a creamier mouth-feel to the filling.", "When you are ready to fill the éclairs, transfer the filling to a piping bag fitted with a 0.5cm/¼in nozzle. Pierce the underside of each éclair four times with the tip of the nozzle, gently squirting a little of the filling into the éclair as you do so. ", "For the glaze, gently warm the fondant in a small pan over a low heat until it reaches body temperature.", "Stir in the cocoa powder and enough of the water to make a smooth paste, then transfer to a piping bag fitted with a 1.5cm/½in nozzle. ", "Pipe the glaze onto the top of each éclair, removing any excess with the back of your finger, then place in the fridge for the glaze to set before serving."]}, {"isVegetarian": true, "title": "Chocolate coffee cake", "url": "www_bbc_co_uk_food_recipes_chocolate_coffee_cake_72340", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz dark chocolate (at least 70% cocoa solids)", "250g/9oz unsalted butter", "1 tbsp good-quality instant coffee", "150g/5oz self-raising flour ", "½ tsp bicarbonate of soda", "80g/3oz cocoa powder ", "500g/1lb 2oz caster sugar ", "4 free-range eggs ", "2 tbsp sunflower oil", "125ml/4fl oz milk ", "150g/5oz plain flour", "100g/3½oz chocolate (at least 70% cocoa solids)", "50g/2oz unsalted butter", "6 tbsp double cream", "50g/2oz icing sugar "], "serves": "Makes 1 cake", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 170C/340F/Gas 3½. Grease a 24cm/10in diameter cake tin and line it with baking paper. ", "For the cake, place the chocolate, butter and coffee into a bowl set over a pan simmering water, making sure the bowl does not touch the water. ", "Stir until melted and smooth then remove from the heat and set aside.", "Mix together the flour, bicarbonate of soda and cocoa into a large bowl. Stir in the sugar and make a well in the middle. ", "Add the beaten eggs, oil and milk into the well and stir gently to combine all the ingredients. ", "Add the chocolate and butter mixture and stir to combine. The mixture will be wet and sloppy. ", "Pour into the prepared baking tin and cook for one hour or until firm.", "Leave to cool completely before turning out of the tin.", "For the icing, place all ingredients in a pan. Heat gently and stir until smooth.", "Once cake and icing have cooled, spread the icing over the cake using a palette knife. "]}, {"isVegetarian": true, "title": "Double chocolate cookies", "url": "www_bbc_co_uk_food_recipes_chocolate_cookies_14418", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125g/4½oz butter, softened, roughly chopped", "1 free-range egg yolk ", "60g/2¼oz soft brown sugar", "1 tbsp honey", "pinch salt", "130g/4¾oz plain flour", "45g/1½ oz cocoa powder ", "pinch baking powder", "100g/3½oz white chocolate, broken into pieces"], "serves": "Makes 10-12", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 4 and line a baking tray with baking paper.", "In a large bowl, beat the butter, egg yolk, sugar, honey and salt together until smooth.", "Gradually sift in the flour, cocoa powder and baking powder and mix until smooth, but be careful not to overwork the mixture. Add the white chocolate and combine.", "Roll the dough into a cylinder roughly 3cm/1¼in in diameter. Wrap in baking paper and refrigerate for 45 minutes, or until firm.", "Cut the roll into 5mm/¼in slices and place on the baking tray, leaving a gap between the cookies.", "Bake for 15 minutes; they should still be a little soft when you remove them from the oven. Leave to cool slightly before serving. "]}, {"isVegetarian": true, "title": "Chocolate cookies with scarlet fruit", "url": "www_bbc_co_uk_food_recipes_chocolate_cookies_with_95245", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_cookies_with_95245_16x9.jpg", "ingredients": ["200g/7oz dark chocolate at least 70% cocoa solids", "75g/3oz butter", "225g/8oz light muscovado sugar", "2 free-range eggs ", "vanilla extract", "50g/2oz skinned hazelnuts ", "150g/5¼oz self-raising flour ", "handful of fresh cherries and raspberries, to serve"], "serves": "Makes 12 large biscuits", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Snap the chocolate into pieces in a small heatproof glass bowl. Place the bowl over a small pan of simmering water, with the base of the bowl not quite touching the water. Allow the chocolate to melt. Don't be tempted to stir it, other than to occasionally push any unmelted chocolate down into the liquid chocolate to encourage it to melt. Turn off the heat as soon as the chocolate has melted.", "Cream the butter and sugar together in a food processor until smooth and creamy. Break the eggs and vanilla extract in a small bowl or jug, whisk just enough to break up the eggs, then add the mixture gradually to the butter and sugar, beating constantly. It is worth scraping down the sides of the bowl with a rubber spatula from time to time to ensure a thorough mixing. Add the melted chocolate and continue to mix.", "Toast the hazelnuts in a shallow pan until golden, shaking regularly so they colour evenly. Grind the nuts coarsely using a pestle and mortar to the texture of gravel, then remove half and continue grinding the other half until it resembles fine breadcrumbs. Add the flour and both textures of nut to the cookie mixture. Stop beating as soon as everything is combined.", "Place large, heaped tablespoons of the mixture on to a baking tray lined with baking parchment. You should get twelve large biscuits. The mixture is fine to sit for a few minutes if you are cooking them in two batches. Don't be tempted to flatten the cookies, they will do so in the oven anyway.", "Bake the cookies for 10-12 minutes. The cookies will have spread and be very soft to the touch. Remove them from the oven and set aside to cool a little. As soon as they are cool enough to move without breaking, slide a palette knife underneath and carefully lift them onto a cooling rack.  Serve with a handful of cherries and raspberries."]}, {"isVegetarian": false, "title": "Chocolate crispy cakes", "url": "www_bbc_co_uk_food_recipes_chocolate_crispy_cakes_25316", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_crispy_cakes_25316_16x9.jpg", "ingredients": ["5 caramel nougat chocolate bars, such as Mars bars, chopped", "150g/5oz butter, chopped, plus extra for greasing", "100g/3½oz rice pops, such as Rice Krispies", "75g/3oz plain chocolate"], "serves": "Makes 16-20", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Grease a 20cm/8in square, deep-sided tin with butter.", "Suspend a large heatproof bowl over a pan of simmering water (do not allow the base of the bowl to touch the water). ", "Add the Mars bars and butter to the bowl and stir until melted, smooth and well combined. The mixture will curdle at first, but keep stirring (or use a whisk) and it will eventually become smooth.", "Remove the bowl from the heat, add the Rice Krispies and fold until coated in the chocolate mixture.", "Spoon the mixture into the prepared tin and press down to form an even layer, pushing the mixture into the corners and sides of the tin. Set aside to cool.", "Meanwhile, suspend another heatproof bowl over the pan of simmering water (do not allow the base of the bowl to touch the water). Melt the chocolate in the bowl, then drizzle or spread it over the cooled chocolate crispy cake. Set aside to cool and harden.", "Chill the chocolate crispy cake in the fridge until set, preferably overnight. Cut into squares while still in the tin, then remove from the tin, pile onto a plate and serve."]}, {"isVegetarian": true, "title": "Chocolate creation showstopper", "url": "www_bbc_co_uk_food_recipes_chocolate_creation_12531", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_creation_12531_16x9.jpg", "ingredients": ["125g/4½oz sifted cocoa powder", "6 large free-range eggs", "100ml/3½fl oz milk", "350g/12oz self-raising flour", "1 tbsp baking powder", "200g/7oz softened butter, plus extra for greasing", "550g/1lb 2oz caster sugar", "400g/14oz white chocolate", "300ml/10fl oz double cream", "300g/10½oz full-fat cream cheese", "6 tbsp apricot jam", "200g/7oz plain chocolate (70% cocoa solids)", "200g/7oz plain chocolate (68-70% cocoa solids)"], "serves": "Makes 1 three-tiered cake", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4 (fan 160C). Grease and line two 20cm/8in deep sandwich tins, one 15cm/6in cake tin and one 10cm/4in cake tin with baking parchment.", "For the chocolate cakes, blend the cocoa powder and 200ml/7fl oz boiling water in a large bowl. Add the remaining cake ingredients and beat until the mixture has become a smooth, thickish batter. ", "Divide the cake mix between the prepared tins, filling the sandwich tins half full and the two cake tins two-thirds full.  Level the surfaces.", "Place all four tins on the middle shelf of the preheated oven and cook the sandwich tins for about 25-30 minutes, the 10cm/4in cake tin for 35-40 minutes and the 15cm/6in cake for 45-50 minutes, or until well-risen and the tops of the cakes spring back when lightly pressed with a finger. (If the tins won't fit on the same shelf place the 15cm/6in cake on the shelf above and move it down to the middle shelf as soon as possible - this may reduce the cooking time slightly.) Leave to cool in the tins for a few minutes and then turn out onto a wire rack, peel off the parchment and leave to cool completely.", "For the white chocolate ganache, break the white chocolate into pieces. Heat the cream in a pan until just hot enough to melt the chocolate. Drop the chocolate pieces into the cream and stir until they have all melted. ", "Remove from the heat and leave to cool until stone cold. Beat the cream cheese in a bowl to soften it, then gradually beat in the cold chocolate cream mixture. You may need to set aside the mixture in the fridge for 15 minutes to thicken up.", "To assemble, cut the 15cm/6in and 10cm/4in cakes in half horizontally and sandwich them together with some of the white chocolate ganache. Sandwich the 20cm/8in cakes together with more of the white chocolate ganache and stack the cakes on top of each other with the sandwiched 10cm/4in cake on top, the sandwiched 15cm/6in cakes in the middle and the 15cm/6in sandwiched cake on the bottom. Set aside the rest of the ganache.", "Warm the apricot jam in a small pan and brush it all over the stacked cakes. Using a palette knife, spread the remaining white chocolate ganache over the cakes to cover. If your kitchen is hot you may need to place the cakes in the fridge to allow the ganache to set.", "For the chocolate lace collars, break 150g/5½oz of the plain chocolate into a bowl set over a pan of simmering water. Stir until the chocolate reaches a melting temperature of 47C/115F (use a kitchen thermometer to check).  Remove the bowl from the heat, add the remaining 50g/1¾oz of chocolate and stir until the chocolate has cooled to 31C/90F.  ", "Cut two strips of greaseproof paper or acetate 10cm/4in wide and long enough to wrap around the middle-sized and the large cakes. (They will need to be about 10x55cm/4x22in for the middle cake and about 10x70cm/4x28in long for the large cake.) Place the strips on a work surface.  ", "Pour the chocolate into a piping bag fitted with a writing nozzle and let the chocolate fall out of the bag while swirling up and down the strips of greaseproof to create a lace effect. (Don’t worry if the chocolate falls outside of the paper strips, just be sure to move the strips of paper before they set so that they don’t stick to the work surface). Leave to cool until just set and firm enough to wrap around the base and middle layer of the cake leaving the acetate on (about 15 minutes).", "Leave to set completely (about one hour) before peeling off the greaseproof or acetate paper.  Don’t be tempted to set the chocolate collars in the fridge as this will cause the chocolate to be dull and not have a shine when you remove the paper. Decorate the outside of the bottom and middle cakes with the chocolate lace collars. ", "For the chocolate curls, break the plain chocolate into a bowl set over a pan of simmering water. Stir until the chocolate melts and then pour over a cold marble or granite surface. Leave to cool until just set. Using a cheese slicer, gently slice from the top of the chocolate down to the bottom, to create chocolate curls. Sprinkle the curls over the top tier of the cake.  "]}, {"isVegetarian": true, "title": "Chocolate custard tarts", "url": "www_bbc_co_uk_food_recipes_chocolate_custard_tarts_55591", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz strong white flour ", "150g/5½oz plain flour\t\t\t\t", "2 free-range medium eggs", "100ml/3½fl oz cold water\t\t\t\t", "250g/9oz unsalted butter", "pinch of salt", "90g/3½oz caster sugar ", "3 free-range egg yolks ", "1 tbsp cornflour", "pinch of salt", "250ml/9fl oz whole milk", "1 vanilla pod", "1 cinnamon stick", "unsalted butter, for greasing", "100g/3½oz dark chocolate", "100ml/3½fl oz double cream "], "serves": "Makes 12", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the puff pastry, put the flours, eggs and water in a large bowl and gently mix everything to a stiff dough. Transfer the dough to a lightly floured surface and knead it well for 10 minutes. The dough should feel tight but elastic so the kneading will take a bit of effort. When the dough is smooth, shape it into a ball and put it in a plastic bag in the fridge to chill, for at least 30 minutes, but you can leave it overnight at this stage. ", "Flatten the butter out into a rectangle about 1cm/½in thick and chill for about one hour to harden the butter again, if needs be. ", "Roll out the dough in a rectangular shape, also about 1cm/½in thick. Put the butter on the top so that it covers the bottom two-thirds of the dough. Make sure that it is positioned neatly and comes almost to the edges. Fold in the edges slightly so the butter does not escape during the rolling and folding process, a little fold will do. ", "Fold the exposed dough at the top down over one-third of the butter, then gently cut off the exposed bit of butter and put it on the top of the dough you have just folded down. Fold the bottom half of the dough up. You will now have a sandwich of two layers of butter and three of dough. ", "Turn the square of pastry round a quarter turn (90 degrees). Roll out the dough into a rectangle as before. Fold one-third of the dough down and then the bottom one-third up on top to make a neat square. This is called a single turn.  Place the dough in a plastic food bag, or wrap in cling film and chill in the fridge for another hour. Repeat this process twice more, making sure you chill the pastry for an hour in between each turn.   ", "Chill in the plastic food bag or cling film overnight. Your dough is now ready to use.", "Heat the oven to 200C/400F/Gas 6. Butter the holes in a 12-hole muffin tin. ", "Roll out the pastry to a rectangle and cut out 12 discs using a 9cm/3½in cutter. Press each pastry disc into the muffin tin holes, line with baking parchment, fill with a few baking beans and blind bake for 10-15 minutes. ", "Allow to cool completely in the tin. Leave the oven at the same temperature.", "To make the custard, whisk the sugar, egg yolks, cornflour and salt together and set aside. Put the milk in a large, heavy-based pan with the vanilla pod (split in half, with the seeds scraped into the milk) and the cinnamon stick. ", "Bring to the boil and then remove from the heat. Pass the hot milk through a sieve to remove the cinnamon stick and vanilla pod, then pour the hot milk over the egg mixture and whisk together. ", "Return this mixture to the pan. Put back on a gentle heat and cook, stirring continuously, until the mixture becomes thick. Remove from the heat immediately and beat for a minute to get rid of any lumps. Leave to cool.", "Gently melt the chocolate in a bowl suspended over a pan of simmering water (without letting the bowl touch the water). Mix the melted chocolate together with double cream in a bowl to produce a smooth ganache. ", "Spoon the cooled custard into each of the cooled pastry cases, filling them about three-quarters full. Then, using a teaspoon, dip the handle of the spoon into the warm chocolate ganache, and carefully swirl a little chocolate into each of the custard tarts.", "Place the tarts back into the preheated oven and bake for a further 10 minutes.", "Cool and dust with icing sugar to serve. "]}, {"isVegetarian": true, "title": "Chocolate cheesecake with white chocolate icing", "url": "www_bbc_co_uk_food_recipes_chocolate_digestive_43476", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 400g/14oz packet chocolate digestives, crushed to fine crumbs", "75g/3oz butter, melted and cooled slightly", "800g/1lb 12oz cream cheese", "icing sugar, to taste", "400g/14oz milk chocolate (35% cocoa solids), or you can use a mixture of 300g/10½oz milk chocolate and 100g/3½oz dark chocolate (70% cocoa solids)", "1 tsp vegetable oil", "100g/3½oz white chocolate"], "serves": "Serves 10", "time": {"preparation": "over 2 hours", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 120, "preparationMins": 120}, "recommendations": 0, "method": ["Mix the crushed biscuits and butter together in a bowl with the back of a wooden spoon until well combined. ", "Spoon the mixture into a 23cm/9in springform tin and press down very hard all the way around the base until flat and even.", "Mix the cream cheese and icing sugar together in a bowl.", "Meanwhile melt the chocolate in a heatproof bowl set over a pan of simmering water, making sure the bottom of the bowl does not touch the water.", "Pour a quarter of the chocolate into a jug, stir in the oil, then set aside and keep warm. (The chocolate can also be reheated in the microwave for 20 seconds if it cools down.)", "Place a large dollop of the cream cheese mixture into the bowl of remaining chocolate and stir until well combined. Keep adding the mixture, one dollop at a time, and mixing it vigorously until the chocolate mixture becomes smooth and silky and you have added all of the cream cheese.", "Pour the mixture onto the biscuit base and use the back of a large spoon to smooth the top, pressing down so that no gaps remain. Chill the cheesecake in the fridge for 20 minutes, or until the chocolate top begins to firm. The cheesecake can also be placed into the freezer for 10 minutes to set.", "Melt the white chocolate in a heatproof bowl set over a pan of simmering water and make sure the jug of milk chocolate is nice and runny. ", "Remove the cheesecake from the fridge and pour the milk chocolate on top, spreading it out as you go until the top is completely covered. (For a smooth finish, pick up the cheesecake and tilt it back and forth, letting the chocolate run over and cover the cream cheese filling.)", "Drizzle white chocolate lines across the top about 2cm/¾in apart. The neatest way to do this is by putting the chocolate into a piping bag fitted with a very small nozzle. ", "Place the cheesecake so the lines are running towards you, then take a cocktail stick and drag it from left to right, making lines from left to right 2cm/¾in apart to form a grid. Drag the cocktail stick once again from right to left between the toothpick lines that you have just made. You will need to do this quite quickly so the chocolate lines are still runny. Leave the cheesecake in a cool place to set for about two hours.", "Run a sharp knife around the inside of the tin and carefully remove the cake. Serve in wedges with a drizzle of single cream."]}, {"isVegetarian": true, "title": "Chocolate dipped chocolate shortbread", "url": "www_bbc_co_uk_food_recipes_chocolate_dipped_11340", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz butter", "140g/5oz caster sugar", "1 free-range egg yolk", "2 tsp vanilla extract", "250g/9oz plain flour", "25g/1oz cocoa powder", "pinch salt", "100g/3½oz dark chocolate, finely chopped", "200g/7oz dark chocolate (at least 70% cocoa solids), finely chopped ", "200g/7oz milk chocolate, finely chopped", "200g/7oz white chocolate, finely chopped"], "serves": "Makes 18 biscuits", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat oven to 190C/375F/Gas 5. Line a baking tray with baking parchment.", "With a handheld electric mixer, beat together the sugar and butter in a large mixing bowl. Beat in the egg and the vanilla extract. ", "In another bowl, sift together the flour, cocoa and salt. Stir into the butter mixture, then stir in the chopped chocolate.", "Roll teaspoonfuls of dough into balls and place on the lined baking tray at least 2.5cm/1in apart. Flatten slightly with the back of spoon.", "Bake the biscuits for 10 minutes. Allow to cool for a minute on the tray, then transfer to a wire rack to cool completely.", "Meanwhile, melt the three types of chocolate separately in a microwave (at least a minute). Alternatively, melt the chopped chocolate in a bowl suspended over a pan of simmering water (do not allow the bottom of the bowl to touch the water). ", "Dip the cooled biscuits halfway into one type of chocolate, then allow the excess to run off before placing on a sheet of baking parchment to set. "]}, {"isVegetarian": true, "title": "Chocolate espresso cake", "url": "www_bbc_co_uk_food_recipes_chocolate_espresso_cake_56805", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["185g/6½oz butter, softened", "185g/6½oz dark chocolate ", "340g/11¾oz caster sugar", "3 free-range eggs", "140g/5oz ground almonds", "200g/7oz self-raising flour ", "250ml/9fl oz hot strong espresso, sweetened with 2 tbsp caster sugar ", "whipped cream, to serve "], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat a fan assisted oven to 180C/350F/Gas 4. ", "Lightly oil a 20cm/8in non-stick spring-form tin and line the base with baking paper.", "Gently heat the butter and chocolate over a low heat and stir until melted. ", "Beat together the sugar and eggs until pale and thick, using an electric beater. ", "Quickly fold the chocolate, almonds and flour into the egg mixture until smooth.", "Spoon the mixture into the prepared cake tin and bake in the oven for 50 minutes to one hour, or until just firm. ", "When cooked, remove the cake from the oven and leave to cool for 20 minutes before removing from the tin. ", "Meanwhile, place the sweetened espresso coffee into a saucepan, bring to the boil and simmer for a minute until syrupy.", "Remove the baking paper from the cake and place it on a serving plate. ", "Serve the warm cake with a dollop of whipped cream and a trickle of the hot espresso sauce."]}, {"isVegetarian": true, "title": "Chocolate fondant puddings with lime syrup and coconut custard", "url": "www_bbc_co_uk_food_recipes_chocolate_fondant_78091", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_fondant_78091_16x9.jpg", "ingredients": ["1 tsp cocoa powder", "1 tsp plain flour", "150g/5oz plain chocolate, minimum 70% cocoa solids, broken into pieces", "150g/5oz butter, plus extra for greasing", "3 large free-range eggs", "3 large free-range egg yolks", "50g/2oz caster sugar", "2 limes, finely grated zest only", "25g/¾oz self-raising flour", "225g/8oz lime marmalade", "1 lime, zest and juice, plus 1 lime, juice only", "300ml/10½fl oz coconut milk", "100ml/3½fl oz double cream", "3 free-range egg yolks", "2 tsp cornflour", "clotted cream, crème fraiche or vanilla ice cream, to serve"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["For the chocolate fondants, generously grease six 175ml/6fl oz dariole moulds with butter, then line the base of each with a small circle of baking parchment.", "Mix together the cocoa powder and plain flour in a bowl and sift a little into each dariole mould, rolling them around to coat the base and sides. Shake out any excess.", "Bring a little water to a simmer in a saucepan. Suspend a heatproof bowl over the water (do not allow the base of the bowl to touch the surface of the water). Add the chocolate and butter to the bowl and stir until smooth and melted.", "Remove the bowl from the heat and set aside to cool for 10 minutes.", "Meanwhile, whisk the eggs, egg yolks, caster sugar and lime zest together in a bowl, using an electric whisk. (When the mixture is pale and thick, and the whisk leaves a trail across the mixture when lifted out, the mixture is ready.)", "Gently fold in the melted chocolate mixture using a large, metal spoon, until just combined.", "Sift in the self-rising flour and carefully fold in until just combined.", "Pour the fondant mixture into the prepared dariole moulds, cover each with cling film and chill in the fridge for at least 30 minutes and up to eight hours.", "Meanwhile, for the lime syrup, gently heat the lime marmalade and lime juice in a small saucepan until just simmering. Continue to simmer for 3-4 minutes, or until the volume of syrup has reduced by about one-quarter, stirring occasionally. (The syrup will thicken further while cooling.)", "Remove the lime syrup from the heat, and set aside to cool completely but do not chill. (If the syrup thickens too much on cooling, stir in a little cold water and warm through gently before using.)", "For the coconut custard, gently heat the coconut milk and double cream in a saucepan until just simmering.", "Whisk the egg yolks and cornflour together in a bowl until smooth, pale and well combined. ", "Pour the warm coconut and cream mixture over the egg-yolk mixture and whisk until smooth and well combined. Return the custard mixture to the saucepan and heat gently, stirring constantly, until the custard thickens enough to coat the back of a spoon. Remove from the heat and keep warm.", "To cook the chocolate fondants, preheat the oven to 200C/400F/Gas 6. Remove the fondants from the fridge to bring them up to room temperature, and discard the cling film. Place the dariole moulds onto a sturdy baking tray.", "Bake the chocolate fondants for 11 minutes, or until the sponge has risen but the puddings retain a slight wobbly (they should still be liquid in the very centre; see tip below). Remove the chocolate fondants from the oven.", "To serve, spoon a circle of coconut custard into the centre of each of four dessert plates. Decorate the custard with dots of lime syrup, using the point of a knife. Using a folded, dry tea towel or oven glove to protect your hand, loosen the chocolate fondant from the sides of each dariole mould using a blunt, round-edged knife and turn out onto the dessert plates. Remove the circle of baking parchment and top the fondants with quenelles of crème fraiche, clotted cream or vanilla ice cream, if using.  Sprinkle with lime zest and serve immediately."]}, {"isVegetarian": true, "title": "Chocolate fondant with salted caramel brittle and caramel sauce", "url": "www_bbc_co_uk_food_recipes_chocolate_fondant_with_28686", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["110g/4oz dark soft brown sugar", "110g/4oz butter", "½ tsp fleur de sel (or sea salt)", "175ml/6fl oz double cream", "100g/3½oz caster sugar", "50g/1¾oz butter, plus extra for greasing", "½ tsp fleur de sel (or sea salt)", "100g/3½oz blanched hazelnuts ", "125g/4½oz dark chocolate, broken into pieces", "125g/4½oz butter, plus extra for greasing", "4 free-range eggs", "100g/3½oz caster sugar", "60g/2oz plain flour", "4 salted caramel chocolates", "cocoa powder, for dusting", "500g/1lb 2oz vanilla ice cream", "200g/7oz fresh raspberries"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the caramel sauce, place the sugar, butter and salt in a saucepan and heat until the sugar has melted, then add the cream. ", "Bring it to the boil and let it simmer for three minutes until thick. Transfer to a bowl and chill in the fridge for two hours.", "For the salted caramel brittle, place the sugar, butter, salt and four tablespoons of water in a heavy-based frying pan and gently heat without stirring. Increase the heat until the caramel turns a light golden-brown. Remove from the heat.", "Using a spoon or pallet knife smear a line of caramel in the centre of each serving plate.", "Line a baking tray with parchment paper. Add the hazelnuts to the pan and tip onto the prepared baking tray. Set aside to cool. ", "Once cold, break the caramel into pieces and set aside.", "For the chocolate fondant, preheat a flat baking sheet in the oven set to 220C/450F/Gas 7. Grease four dariole moulds.", "Place the chocolate and butter into a bowl over a pan of simmering water and allow to melt.", "Meanwhile break the eggs into a large bowl, add the sugar and whisk for two minutes or until pale and fluffy, then mix in the flour.", "Once the chocolate has melted, pour it over the eggs and sugar and stir in well.", "Spoon some of the mixture into the moulds drop the salted caramel chocolates in and add another spoonful of the mix. Only fill them three-quarters full.", "Place the fondants on a baking tray and cook in the oven for six minutes", "To serve, remove the fondants from their moulds and place in the centre of the plates prepared with lines of caramel. Place a quenelle of ice cream on each side of the puddings and garnish with caramel brittle. Dust with cocoa powder. Drizzle some of the caramel sauce around the plate and dot with raspberries."]}, {"isVegetarian": true, "title": "Chocolate fondant with poached cherries and chocolate bar ice cream", "url": "www_bbc_co_uk_food_recipes_chocolate_fondant_with_29611", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200ml/7fl oz full-fat milk", "70g/2½oz caster sugar ", "100g/3½oz egg yolks ", "200ml/7fl oz double cream", "3 chocolate and peanut bars, chopped", "200g/7oz fresh cherries, stones removed", "200ml/7oz caster sugar ", "125g/4½oz unsalted butter, plus extra for greasing", "125g/4½oz dark chocolate (minimum 70% cocoa solids)", "35g/1¼oz ground almonds", "4 free-range eggs, separated", "100g/3½oz caster sugar", "60g/2¼oz flour", "200g/7oz white chocolate, melted", "4 tbsp icing sugar", "100g/3½oz toasted hazelnuts, roughly chopped", "8 sprigs chocolate mint (use normal mint if chocolate mint is unavailable)"], "serves": "Serves 8", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For chocolate bar ice cream, warm the milk in a saucepan until it reaches 80C/175F on a cook’s thermometer.", "Put the caster sugar and egg yolks into a bowl and whisk together, then pour the warm milk onto them, whisking all the time. Return the mixture to the saucepan and cook until it reaches 83C/180F and thickens slightly. Remove from the heat and whisk in the double cream. Set aside to cool to 60C/140F, then stir in the chocolate bars and allow to melt.", "Transfer to an ice cream maker and churn according to the manufacturer’s instructions until frozen.  ", "For the poached cherries, place the cherries, 200ml/7fl oz water and sugar in a large saucepan and cook for 6-8 minutes. The cherries should be soft but retain their shape. Allow to cool before serving.", "For the chocolate fondant, preheat the oven to 220C/200C fan/Gas 7 and grease 8 dariole moulds with softened butter, using a pastry brush. ", "Melt the butter and chocolate together in a heatproof bowl sat over a pan of gently simmering water. In a separate bowl, beat the eggs and sugar for 2 minutes, or until they reach the ribbon stage (this is when the mixture leaves a trail on the surface the whisk is removed).", "Fold the chocolate mixture into the egg mixture then fold in the flour, divide the mixture between the prepared moulds. Place on a baking sheet and cook for 8 minutes.", "To garnish, paint a line of melted white chocolate across the centre of each serving plate and dust with icing sugar.", "Turn out the hot fondants into the centre of each plate (on top of the white chocolate) and add some poached cherries. Place a quenelle of ice cream on the side and garnish with the chopped hazelnuts and chocolate mint."]}, {"isVegetarian": true, "title": "Chocolate, orange and spice fondue", "url": "www_bbc_co_uk_food_recipes_chocolate_fondue_73345", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_fondue_73345_16x9.jpg", "ingredients": ["250ml/9fl oz whipping cream", "50ml/2fl oz milk", "piece paired orange zest", "1 cinnamon stick, broken up", "½ vanilla pod, split lengthways", "1 chipotle chilli, split", "few cloves", "1 tsp allspice berries, lightly crushed", "2 blades mace", "½ tsp peppercorns, lightly crushed", "1 tbsp ground ginger", "350g/12oz dark chocolate ", "generous pinch of salt", "100ml/3½fl oz syrup from a jar of stem ginger", "1-2 tbsp rum, brandy or ginger wine (optional)", "cubes madeira cake", "cubes leftover Christmas pudding or cake", "pieces of fruit, such as mango, physalis, mandarin segments or pears"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Put the whipping cream and milk into a saucepan along with the orange zest, cinnamon stick, vanilla pod, chilli, cloves, allspice berries, mace, peppercorns and ginger. ", "Slowly bring up to the boil, then remove from the heat and leave to infuse until the cream returns to room temperature. Strain through a sieve into a clean saucepan. ", "Break up the chocolate and it add to the cream. Melt the chocolate into the cream over a gentle heat until the chocolate has melted, whisking regularly and then constantly towards to the end until you have a smooth sauce. ", "Transfer to a fondue bowl and leave to stand for 10 minutes, then if necessary, start reheating very gently with a tea light or fondue burner underneath. Keep an eye on this while eating as you do not want it to start over-heating – it will split.", "Serve with cubes of madeira cake, leftover Christmas pudding or cake, or any fruit."]}, {"isVegetarian": true, "title": "Chocolate fondant with chocolate and caramel sauce", "url": "www_bbc_co_uk_food_recipes_chocolate_fondant_with_60044", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125g/5½oz butter, cut up, plus extra for greasing", "125g/5½oz dark chocolate (minimum 70% cocoa solids), broken into pieces", "4 free-range eggs", "80g/2¾oz caster sugar", "60g/2¼oz plain flour", "4 round soft-centred caramel chocolates", "80g/2¾oz unsalted butter", "80g/2¾oz caster sugar", "400ml/14fl oz double cream", "150g/5½oz dark chocolate (72% cocoa solids), broken into pieces", "50g/1¾oz butter", "4 scoops of vanilla ice cream", "4 sprigs of chocolate mint"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/200C Fan/Gas 7. Grease 4 dariole (circular) moulds with butter.", "For the fondants, melt the butter and chocolate in a bowl over a bain-marie, making sure the bowl doesn't touch the water. Leave to cool for 1 minute.", "Meanwhile, whisk the eggs and sugar until they have doubled in size and are pale in colour. Pour the cooled chocolate mixture over the egg mixture (if you do this when it is too hot it will scramble the eggs). Sift in the flour, then carefully fold it in.", "Quarter-fill the dariole moulds with the chocolate mixture. Drop a chocolate in each pot, then spoon the remaining chocolate mixture over the top, leaving a gap as they will rise. Bake for 5–6 minutes.", "Meanwhile, for the caramel sauce, melt the butter in a medium saucepan and add the sugar. Cook until the sugar has dissolved. Add the cream and cook until you have a thick, glossy sauce.", "For the chocolate sauce, bring 100ml/3½fl oz water to the boil in a medium saucepan. Add the chocolate and whisk until smooth. Add the butter and whisk to combine.", "Drizzle the caramel and chocolate sauces around the fondants on individual dessert plates. Serve with the ice cream and chocolate mint."]}]