[{"ingredients": ["150 g / 5½ oz Anya patatas", "2 cucharaditas de mantequilla", "1 cucharada de perejil picado", "1 rebanada de pan, sin corteza", "30g / 1oz de queso azul", "4 hojas sabias", "Filete de filete 100 g / 3 ½ oz", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "1 cucharada de aceite de oliva", "2 cucharaditas de mantequilla", "1 diente de ajo, picado", "2 cucharadas de vino tinto", "55 g / 2 oz de setas", "3-5 zanahorias baby, tops recortados", "1 cucharada de perejil picado"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Ponga a hervir una olla de agua con sal. Agregue las papas y hierva hasta que estén tiernas.", "Escurra las papas y colóquelas en un tazón. Agregue la mantequilla y el puré juntos. Revuelva a través del perejil. Mantener caliente", "Coloque el pan, el queso azul y las hojas de salvia en un procesador de alimentos y mezcle. Presione la mezcla de queso en un lado del filete. Sazonar con sal y pimienta negra recién molida.", "Calentar el aceite de oliva en una sartén a prueba de horno a fuego alto y freír el bistec, con la costra hacia arriba, hasta que se dore en la parte inferior. Transfiera al horno para terminar de cocinar por cuatro minutos.", "Caliente el aceite y la mantequilla en una sartén. Agregue el ajo y cocine por un minuto.", "Agregue el vino tinto y cocine para reducir el vino a la mitad. Agregue los champiñones y cocine a fuego lento durante dos minutos. Agregue las zanahorias pequeñas y cocine a fuego lento durante otros tres minutos. Revuelva a través del perejil picado.", "Para servir, coloca el puré en el centro de un plato para servir, coloca el bistec encima y rocía la salsa."], "url": "www_bbc_co_uk_food_recipes_filletsteakwithablue_84475", "title": "Solomillo con una costra de queso azul servido con patatas aplastadas de Anya", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50 g / 2 oz de semillas de mostaza blanca", "50 g / 2 oz de semillas de mostaza negra", "75g / 3oz azúcar moreno claro", "2 cucharaditas de pimienta de Jamaica", "pellizcar canela molida", "1 cucharadita de sal gruesa", "1 cucharadita de pimienta negra", "1 cucharadita de pimentón", "½ cucharadita de cúrcuma", "125ml / 4fl oz de vinagre de vino tinto", "3 cucharadas de cerveza negra", "25g / 1oz de mantequilla", "2 cebollas rojas grandes, en rodajas", "1 ramita de tomillo fresco", "15g / ½ oz de mantequilla", "2 cucharadas de aceite de oliva, más extra para aderezar", "Filetes de solomillo de 4 x 200 g / 7oz", "sal y pimienta negra recién molida", "2 panes de ciabatta", "2 cabezas de lechuga Little Gem, hojas separadas", "½ limón, solo jugo", "2 tomates grandes de carne de res en rodajas gruesas"], "method": ["Coloque todos los ingredientes secos en un procesador de alimentos y mezcle hasta que las semillas estén casi aplastadas. Con el motor todavía en funcionamiento, agregue gradualmente el vinagre y mezcle hasta que esté bien mezclado.", "Agregue la cerveza fuerte y mezcle brevemente.", "Transfiera la mostaza a un recipiente y deje reposar durante una hora para espesar, luego transfiera a recipientes secos esterilizados.", "Cubra la superficie de cada uno con un disco de papel encerado, con la cara encerada hacia abajo, y déjelo hasta que esté frío. Cubra los frascos fríos con tapas herméticas, etiquetas y almacene en un lugar fresco y oscuro. La mostaza debe conservarse durante 3-6 meses.", "Precalentar el horno a 200C / 400F / Gas 6.", "Para las cebollas, caliente una sartén por separado hasta que esté caliente y agregue la mantequilla y el aceite, luego agregue las cebollas y el tomillo. Reduzca el fuego y cocine lentamente durante 12-15 minutos, hasta que esté caramelizado.", "Mientras tanto, para el sándwich, caliente una sartén a prueba de horno hasta que esté caliente y agregue la mitad de la mantequilla y el aceite.", "Sazonar los filetes con pimienta negra recién molida. Agregue a la sartén caliente y cocine por 2-4 minutos en un lado. Dé la vuelta al bistec y transfiéralo al horno durante 3-4 minutos, o hasta que esté cocido a su gusto.", "Retire los filetes de la sartén, sazone con sal y deje reposar por unos minutos. Reduzca la temperatura del horno a 180C / 355F / Gas 4.", "Coloque la chapata en el horno durante cinco minutos, solo para calentarla.", "Viste las hojas de Little Gem con un poco de limón y un poco de aceite de oliva.", "Para servir, corte el pan de ciabatta por la mitad, luego divídalo longitudinalmente y colóquelo en una tabla.", "Corte el filete en un ángulo en rebanadas gruesas de 1 cm / ½.", "Extienda la mostaza en el fondo del pan y cubra con la lechuga aderezada."], "url": "www_bbc_co_uk_food_recipes_filletsteaksandwichw_85715", "title": "Sándwich de solomillo con cebolla roja caramelizada y mostaza fuerte casera", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 bistecs de filete de 175 g / 6 onzas, machacados finamente con un mazo de carne o un rodillo", "sal y pimienta negra recién molida", "50g / 2oz de mantequilla", "2 cucharadas de aceite de oliva", "aceite vegetal, para freír", "3 papas para hornear grandes, peladas y cortadas en cerillas", "75g / 3oz de mantequilla", "2 chalotes, en rodajas", "150g / 5 oz champiñones, en rodajas", "1 diente de ajo, picado", "150ml / 5fl oz de vino blanco", "300ml / 10fl oz de caldo de pollo reducido", "pequeño manojo de estragón fresco, hojas recogidas"], "method": ["Para el bistec, sazonar bien los filetes con sal y pimienta negra recién molida.", "Caliente una sartén hasta que esté humeando, agregue la mantequilla y el aceite de oliva y fríe los filetes en ambos lados durante 2 a 3 minutos (para el medio), o hasta que estén cocidos a su gusto.", "Caliente el aceite vegetal en una sartén profunda a 190 ° C / 375 ° F, y controle con un termómetro para alimentos. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión.) Agregue las papas Matchstick y fríalos durante 3-4 minutos, o hasta que estén doradas y cocidas. Retirar con una cuchara ranurada y escurrir sobre papel de cocina, luego sazonar, al gusto, con sal y pimienta negra recién molida.", "Para la salsa, caliente una sartén limpia hasta que esté humeando, agregue 25 g / 1 oz de la mantequilla y fría los chalotes durante 2-3 minutos, o hasta que estén dorados. Agregue los champiñones y el ajo y cocine durante un minuto, luego vierta el vino y cocine a fuego lento durante 2-3 minutos.", "Agregue el caldo de pollo y cocine a fuego lento durante 10-12 minutos, o hasta que el líquido se haya reducido a la mitad. Agregue la mantequilla restante hasta que la salsa esté suave y cremosa. Agregue las hojas de estragón y condimente, al gusto, con sal y pimienta negra recién molida.", "Para servir, apile las papas fritas en platos para servir, coloque el bistec al costado y póngalo sobre la salsa."], "url": "www_bbc_co_uk_food_recipes_filletsteakwithchate_90362", "title": "Solomillo con salsa Chateaubriand y papas fritas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 cucharadas de vinagre de vino blanco", "1 hoja de laurel", "1 chalote pequeño, finamente picado", "1 ramita de estragón fresco", "1 ramita de perejil fresco", "2 yemas de huevo de gallinas camperas", "sal y pimienta negra recién molida", "100g / 3½oz de mantequilla fría, cortada en cubos", "1 cucharadita de estragón fresco picado", "1 cucharadita de perejil fresco picado", "Filetes de solomillo de 4 x 150 g / 5¼ oz", "4 cucharaditas de aceite vegetal", "sal y pimienta negra recién molida", "aceite vegetal, para freír", "4 papas grandes de Maris Piper, peladas y cortadas en trozos grandes, sancochadas en caldo de verduras (o agregue 1 cubo de caldo de verduras al agua hirviendo)", "4 puñados de hojas de ensalada mixtas, para servir"], "method": ["Para la salsa bearnesa, llevar el vinagre de vino blanco, laurel, chalota, estragón y perejil a ebullición en una sartén no reactiva de base pesada. Sazonar, al gusto, con sal y pimienta negra recién molida. Continúe cocinando a fuego lento hasta que el volumen del líquido se haya reducido en dos tercios (solo debe haber una cucharada de líquido restante en la sartén). Cuele el líquido restante de inmediato en un recipiente frío.", "En un recipiente resistente al calor, mezcle las yemas de huevo con una pizca de sal hasta que estén bien combinadas. Agregue una cucharadita de líquido reducido y un cubo de mantequilla.", "Suspenda el recipiente a prueba de calor sobre una fuente de agua hirviendo a fuego lento (no permita que la base del recipiente toque la superficie del agua). Batir la mantequilla y el líquido reducido en la mezcla de yema de huevo y sal, batiendo continuamente, hasta que se combinen bien. Agregue los cubos restantes de mantequilla, uno a la vez, batiendo hasta que cada uno se haya incorporado a la mezcla antes de agregar el siguiente.", "Cuando toda la mantequilla se haya incorporado a la mezcla y la salsa esté suave, mezcle el estragón y el perejil y sazone nuevamente, al gusto. Dejar de lado.", "Para el bistec y las patatas fritas, precaliente el horno a 220 ° C / 425 ° F / Gas 7. Cepille cada filete entero con un poco de aceite, luego sazone, al gusto, con sal y pimienta negra recién molida.", "Calentar una sartén a fuego medio hasta que esté caliente. Agregue los filetes de filete y fría por 1-2 minutos en cada lado.", "Transfiera los filetes a una bandeja para hornear y tápelos en el horno por otros 5-6 minutos (por poco comunes) o por más tiempo para que queden de medios a bien hechos. Retire del horno y deje reposar durante 8-10 minutos.", "Mientras tanto, caliente el aceite en una freidora a 180 ° C. Alternativamente, caliente el aceite en una sartén profunda de base pesada hasta que la miga de pan chisporrotee y se ponga marrón cuando se la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión.) Baje cuidadosamente las papas fritas sancochadas secas en el aceite caliente y fría durante 6-8 minutos, o hasta que estén crujientes y doradas. Retire de la sartén con una espumadera y déjela a un lado para escurrir sobre papel de cocina.", "Para servir, coloque un filete de solomillo en cada uno de los cuatro platos para servir. Arregle algunas de las fichas en una pila al lado. Rocíe la salsa bearnesa sobre el bistec. Sirve las hojas de ensalada al lado."], "url": "www_bbc_co_uk_food_recipes_filletsteakwithcrunc_91268", "title": "Solomillo con patatas crujientes y salsa bearnesa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 filetes de solomillo de buey de 2 x 225 g / 8 oz", "sal y pimienta negra recién molida", "3 cucharadas de aceite de oliva", "115 g / 4 oz de hongos hongos, limpios", "2 chalotes, pelados y finamente picados", "1 diente de ajo, finamente picado", "200ml / 7fl oz de vino tinto", "2 cucharaditas de hojas de tomillo fresco finamente picado"], "method": ["Frote los filetes de carne con sal y pimienta negra recién molida y unte con dos cucharadas de aceite. Calentar una sartén hasta que esté humeante y agregar los filetes, freír durante 3-4 minutos en ambos lados (por raro), o hasta que esté cocido a su gusto. Transfiera a platos calientes para descansar.", "Reduzca el fuego, agregue el aceite restante a la sartén y fría los chalotes y el ajo durante 2-3 minutos, o hasta que comiencen a ablandarse. Agregue las colmenillas y fría por 1-2 minutos, luego sazone con sal y pimienta negra recién molida.", "Vierta el vino y mezcle las hojas de tomillo picadas, luego deje hervir a fuego lento durante 5-6 minutos, o hasta que el líquido se haya espesado.", "Vierta el champiñón y la salsa de vino tinto sobre los filetes y sirva."], "url": "www_bbc_co_uk_food_recipes_filletsteakwithmorel_89193", "title": "Solomillo de ternera con champiñones y salsa de vino", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/filletsteakwithmorel_89193_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filete de res de 150 g / 5½ oz", "2 lanzas de espárragos", "1 cucharadita de aceite de oliva", "sal y pimienta negra recién molida", "55ml / 2fl oz de vino tinto", "1 cucharada de salsa Worcestershire", "1 cucharadita de mostaza Dijon", "Crema doble 55ml / 2fl oz", "½ pizca de pimienta negra recién molida"], "method": ["Cortar un bolsillo en el filete y cosas con las lanzas de espárragos. Frote la carne con aceite de oliva, sal y pimienta negra recién molida, al gusto.", "Caliente una sartén pequeña a fuego alto. Agregue el bistec y fría por dos minutos en cada lado (o más, de acuerdo con el gusto) y déjelo a un lado en un plato caliente.", "Mientras tanto, para hacer la salsa, coloque el vino, salsa Worcestershire, mostaza, crema y pimienta en una olla pequeña. Llevar a ebullición y reducir durante cinco minutos, o hasta que espese.", "Sirve el bistec con la salsa derramada."], "url": "www_bbc_co_uk_food_recipes_filletsteakwithredwi_78674", "title": "Solomillo con salsa de vino tinto", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filetes de solomillo de 4 x 200 g / 7oz", "sal y pimienta recién molida", "3 cucharadas de aceite de oliva", "400ml / 14fl oz de vino tinto", "600 ml / 1 pinta de caldo de res fresco", "20g / ¾oz de mantequilla fría, cortada en cubitos", "2 cucharadas de pesto", "2 yemas de huevo", "1 cucharadita de mostaza", "2 cucharadas de pan rallado fresco", "Salsa Worcestershire", "salsa de tabasco", "100ml / 3½ fl oz de leche", "100 ml / 3½ fl oz de cerveza", "115g / 4oz de queso Stilton"], "method": ["Sazone los filetes y colóquelos en una sartén caliente con aceite de oliva. Cocine por ambos lados durante un total de 5 -6 minutos, retírelo de la sartén y manténgalo caliente.", "Mantenga la sartén a fuego completo y agregue vino. Hierva para reducir a la mitad, luego agregue el caldo de carne y reduzca.", "Para la rarebit, coloque las yemas de huevo, la mostaza y las migas de pan en un tazón junto con un poco de salsa Worcestershire y una pizca de Tabasco. Agregue la leche y la cerveza y sazone. Rallar queso Stilton y doblar. Mezclar todo hasta que se forme una pasta muy espesa.", "Precalentar la parrilla a fuego alto. Filetes superiores con rarebit y coloque debajo de la parrilla hasta que estén dorados en la parte superior. Retire de la parrilla y coloque en cuatro placas.", "Sazone la salsa reducida y agregue la mantequilla para dar un glaseado. Para finalizar, agregue pesto a la salsa, vierta alrededor de los filetes y sirva."], "url": "www_bbc_co_uk_food_recipes_filletsteakwithstilt_73601", "title": "Solomillo con Stileton rarebit", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 hojas de pasta filo", "2 cucharadas de aceite de oliva", "Filete de salmón 100g / 3½ oz, desollado, picado", "1 cucharadita de alcaparras, escurridas", "½ limón, solo ralladura", "2 cucharadas de perejil fresco picado", "sal y pimienta negra recién molida", "1 cucharada de semillas de sésamo", "25g / 1oz de mantequilla", "½ cebolla, finamente picada", "2 cucharaditas de mostaza Dijon", "55g / 2oz de guisantes frescos o congelados (descongelados)", "½ limón, solo jugo", "100ml / 3½ fl oz crema doble", "sal y pimienta negra recién molida", "perejil fresco, picado, para adornar"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Cepille las hojas de filo con un poco de aceite de oliva y póngalas una encima de la otra sobre una bandeja para hornear.", "Mezcle el salmón, las alcaparras, la ralladura de limón y la mitad del perejil en un tazón pequeño. Sazone con sal y pimienta negra recién molida, al gusto, y mezcle la mezcla en el centro de las hojas de filo. Pase la masa alrededor del relleno para formar una salchicha y corte los extremos de la masa. Cepille con un poco más de aceite de oliva y espolvoree semillas de sésamo. Coloque en el horno durante diez minutos o hasta que la masa esté dorada y el salmón esté bien cocido.", "Para los guisantes, derrita la mantequilla en una olla pequeña. Agregue la cebolla y fríasela suavemente durante 3-4 minutos o hasta que se suavice pero no se dore.", "Agregue la mostaza, los guisantes, el jugo de limón y la crema, y ​​el saesón, al gusto, con sal y pimienta negra recién molida. Llevar a ebullición y cocine a fuego lento durante cinco minutos o hasta que los guisantes estén cocidos y el líquido se haya reducido a la mitad.", "Para servir, coloque los guisantes en un plato para servir y cubra con el paquete de salmón.", "Adorne con perejil fresco picado y sirva."], "url": "www_bbc_co_uk_food_recipes_filobakedsalmonwithp_88146", "title": "Filo de salmón al horno con guisantes, crema y mostaza", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de azúcar en polvo", "15g / ½ oz de mantequilla", "1 melocotón, cortado en 6 cuñas", "4 hojas de pasta de filo lista para usar", "mantequilla derretida, para cepillar"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Derrita la mantequilla y el azúcar en una sartén a prueba de horno a fuego medio.", "Agregue las cuñas de durazno, con el lado del corte hacia abajo y cocine durante cinco minutos.", "Cepilla una hoja de la masa con la mantequilla derretida y atorníllala en una bola. Repita con las tres hojas restantes de filo y coloque las bolitas sobre los duraznos.", "Transfiera la sartén al horno y hornee durante 10 minutos, o hasta que la masa esté crujiente y dorada."], "url": "www_bbc_co_uk_food_recipes_filofruitcroustade_84440", "title": "Croustade de fruta de filo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Aceite de oliva, para freír", "Perilla de mantequilla", "150 g / 5¼ oz de champiñones castaños", "1 diente de ajo", "Sal y pimienta negra recién molida", "150 g / 5¼ oz de puerros, podados, bien lavados, escurridos y toscamente picados", "250g / 9oz de queso ricotta", "250g / 9oz de queso crema con toda su grasa", "5 tomates, desollados, sin semilla y picados", "18 piezas filo pastelería (23cm x 15cm / 9in x 6in)", "2 cucharadas de aceite de oliva", "1 cebolla grande, en rodajas", "75 g / 3 oz de champiñones castaños, en rodajas", "2 dientes de ajo, aplastados", "100ml / 3½fl oz de caldo de verduras", "200ml / 7¼fl oz de vino tinto", "Buen glug de puerto", "25 g / 1 oz de mantequilla fría, en cubos"], "method": ["Caliente un poco de aceite de oliva en una sartén, agregue la mantequilla, y cuando esté derretido y espuma, freír los champiñones con el ajo y condimentar por un par de minutos. Escurrir bien en un colador grande.", "Repita el primer paso con los puerros, una vez que los haya recortado y lavado. Drene todo el tiempo que pueda, esto hace que el relleno sea bueno y sólido.", "Mezcle los quesos juntos en un tazón grande con una buena cantidad de aderezo hasta que quede suave (ayuda a calentar el queso en un microondas para ablandarlo).", "Agregue los champiñones, los puerros y los tomates, luego relájese por dos horas.", "Precalentar el horno a 200C / 400F / Gas 6.", "Coloque seis piezas de hojaldre en una superficie ligeramente enharinada y cepille con mucha mantequilla derretida, luego cúbralo con otra capa y cepille nuevamente. Agregue una capa final, pero esta vez solo cepille los bordes de la masa.", "Divida el relleno frío entre los seis rectángulos y colóquelo en forma de salchicha hacia el borde inferior de la masa.", "Dobla el borde inferior sobre el relleno, dobla los lados y enrolla en un paquete apretado y cepilla con mantequilla.", "Coloque los strudel en una bandeja para hornear y cocine en el horno durante 25 minutos.", "Para hacer la salsa, caliente el aceite en una sartén y cocine la cebolla, los champiñones y el ajo con un aderezo hasta que estén blandos.", "Agregue el stock y reduzca a casi nada.", "Agregue el vino y el puerto y reduzca por al menos la mitad.", "Justo antes de servir, mezcle la mantequilla para darle un gran brillo.", "Para servir, vierta un poco de salsa en cada plato y sentarse un strudel en la parte superior."], "url": "www_bbc_co_uk_food_recipes_filostrudelwithportw_73185", "title": "Filo strudel con salsa de vino de Oporto", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/filostrudelwithportw_73185_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["125g / 4½oz de harina de pan blanco fuerte, más extra para espolvorear", "125g / 4½oz de harina de pan integral fuerte", "½ cucharadita de sal", "½ cucharadita de azúcar", "1 cucharadita de levadura seca de acción rápida", "170ml / 6fl oz agua caliente hervida", "rellenos variados de su elección, como manzana seca, pasas, hierbas frescas picadas, ajo picado, semillas o tomates secados al sol"], "method": ["En un tazón, mezcle las harinas blancas y las integrales. Agregue la sal, el azúcar y la levadura y vuelva a mezclar hasta que estén bien combinados.", "Haz un pozo en el centro de los ingredientes secos. Poco a poco vierta el agua tibia en el centro, trayendo los ingredientes secos en el charco de agua con un tenedor. Siga revolviendo hasta que la mezcla se una como masa. Es posible que no necesite usar toda el agua: trate de no permitir que la masa se vuelva demasiado pegajosa.", "Convierta la masa en una superficie de trabajo ligeramente enharinada y amasar bien hasta que quede suave y elástica, durante aproximadamente 10 minutos.", "Divida la masa en tres pedazos de igual tamaño y enrolle cada uno en una bola. Amase un tipo de relleno en cada una de las bolas de masa, para que cada bola de masa tenga un sabor diferente y los sabores estén ocultos. Luego rasga cada bola en dos para hacer seis bollos en total.", "Coloque los bollos en una bandeja para hornear ligeramente engrasada para que casi se toquen. Coloque la bandeja de horno en un horno frío, luego encienda el horno a 230 ° C / 450 ° F / Gas 8 y hornee los panecillos durante 15-20 minutos, o hasta que se hayan levantado y estén dorados. Dejar de lado para enfriar en una rejilla de alambre."], "url": "www_bbc_co_uk_food_recipes_find-the-filling_buns_43954", "title": "Encontrar los bollos de relleno", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 6 bollos", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 hojas de pasta filo lista para usar", "mantequilla derretida", "2 huevos de gallinas camperas", "30ml / 1¼fl oz de crema", "30ml / 1¼fl de onza de leche", "85g / 3 oz de azúcar", "esencia de vainilla, algunas gotas"], "method": ["Caliente el horno a 220C / 425F / Gas 7.", "Cubra una bandeja de crepe con pasta filo y unte la pasta. Agregue otra hoja y así sucesivamente para hacer una caja de flan.", "Mezcle los huevos, la crema, la leche, el azúcar y la vainilla juntos y viértelos en la caja de flan.", "Hornee en el horno durante 5-8 minutos o hasta que estén dorados."], "url": "www_bbc_co_uk_food_recipes_fineeggcustardflan_77070", "title": "Flan de flan de huevo fino", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal 150g / 5½ oz", "1 cucharadita de polvo de hornear", "2 cucharadas de azúcar en polvo", "pizca de sal", "4 huevos grandes de gallinas camperas", "600 ml / 20 fl oz de leche", "25g / 1oz de mantequilla, derretida", "azúcar en polvo, para quitar el polvo", "compota de frutas", "crema agria de oro crema fresca"], "method": ["Coloque la harina, el polvo de hornear, el azúcar y la sal en un tazón grande. Haz un pozo en el centro y rompe los huevos. Usando un batidor, gradualmente trabaje en toda la harina hasta que tenga una pasta espesa. Luego vierta gradualmente toda la leche, batiendo sobre la marcha, hasta que esté todo incorporado.", "Deje reposar la mezcla durante al menos media hora; la encontrará un poco espesa.", "Aproximadamente 10 minutos antes de que esté listo para cocinar el panqueque, precaliente el horno a 200C / 180C Fan / Gas 6.", "Cubra una bandeja para hornear o un plato para hornear con la mantequilla derretida y vierta la mezcla. Hornea por unos 30 minutos. Está listo cuando está bien levantado y comienza a ponerse dorado, pero aún pastoso por debajo.", "Para servir, espolvorear con azúcar glas, cortar en 6 piezas y cubrir cada pieza con compota de frutas y crema fresca."], "url": "www_bbc_co_uk_food_recipes_finnish_pancakes_26537", "title": "Panqueques finlandeses", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/finnish_pancakes_26537_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["300g / 10½oz de guisantes partidos", "pellizcar bicarbonato de soda", "1 pequeño corvejón de jamón", "2 cebollas, una izquierda entera con 2 dientes atrapados y una en cubitos", "1 cuchilla de maza", "2 hojas de laurel", "1 zanahoria, en cubitos", "1 cucharada de mostaza caliente", "100 ml / 3½ fl oz crema doble (opcional)", "sal y pimienta negra recién molida"], "method": ["Coloque los guisantes partidos en un recipiente con el bicarbonato de soda. Cúbralo con agua fría y déjelo en remojo toda la noche.", "Coloque el corvejón del jamón en una olla grande, cúbralo con 1½-2 litros / 2½-3½ pintas de agua fría y deje que hierva. Tan pronto como haya alcanzado el punto de ebullición, retírelo del fuego. Escurra, lave el corvejón del jamón y la sartén para eliminar la espuma con almidón.", "Vuelva a poner el jamón en la sartén y vuelva a cubrir con agua. Agregue la cebolla entera tachonada con clavos de olor, macis y hojas de laurel a la sartén. Llevar a ebullición, luego cocine a fuego lento durante 1 hora.", "Enjuaga los guisantes partidos y ponlos en una cacerola, lleva a ebullición y hierve por 10 minutos. Escurra los guisantes y agregue a la bandeja de jamón junto con la cebolla picada y la zanahoria. Cocine a fuego lento hasta que los guisantes estén tiernos, esto debería tomar entre 45 minutos a 1 hora. Rellene con más agua si es necesario.", "Retire el corvejón del jamón, la cebolla entera, la bahía y la maza. Rompe el corvejón del jamón, descarta la piel y el hueso y tira la carne en pedazos.", "Agregue la mostaza a la sopa y sazone con sal y pimienta. Use una batidora para mezclar con un puré áspero, agregue la carne de corvejón de jamón en la sopa y caliente.", "Látiga ligeramente la crema si la usas y dobla suavemente en la sopa. Sirve con pan grueso."], "url": "www_bbc_co_uk_food_recipes_finnish_pea_soup_71758", "title": "Sopa de guisantes finlandesa", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["400g / 14oz tipo 1 o harina 00", "80g / 3oz de masa fermentada, refrescado", "240ml / 9fl oz de agua, a temperatura ambiente", "10g / ⅓oz de sal fina", "Masa 280g / 10oz, desde arriba", "Tomates 100g / 3½ oz, pelados y triturados", "80g / 3oz fior di latte o mozarella", "algunas hojas frescas de albahaca", "1 cucharadita de aceite de oliva virgen extra", "exprimir jugo de limón", "sal", "Masa 280g / 10oz, desde arriba", "100g / 3½ oz pakow", "80g / 3oz fior di latte o mozzarella", "30 g / 1 oz de requesón ahumado (disponible en línea), rallado", "1 cucharadita de aceite de oliva virgen extra", "1 chile rojo o verde fresco, en rodajas finas", "sal"], "method": ["Para hacer la masa, incline la harina en un tazón grande y haga un pozo en el medio. Agregue el iniciador de masa fermentada y el agua, mezcle para unir, agregando la sal justo antes de que se mezcle completamente. Voltee la masa sobre una superficie de trabajo limpia y amasar hasta que quede lisa.", "Haga rodar la masa en forma de bola y colóquela en un bol ligeramente engrasado. Cubra con una película adhesiva y deje a temperatura ambiente durante 5 horas o hasta que se haya duplicado.", "2 horas antes de cocinar, mueva la masa en una bandeja de horno engrasada grande, manteniéndola de la misma manera. Cubra con una película adhesiva y déjela durante otras 2 horas.", "Precaliente el horno a 220C / 200C Fan / Gas 7 y engrase dos bandejas para hornear con aceite.", "Para hacer la pizza a base de tomate, estire la mitad de la masa con las manos hasta un disco de 28cm / 11 pulgadas y colóquela en una bandeja engrasada para hornear. Extienda con 1 cucharada de los tomates triturados y cocine durante 10 minutos. Raspe el fior di latte y cocine durante 3-5 minutos más.", "Coloque las hojas de albahaca en un tazón pequeño con aceite, jugo de limón y sal.", "Esparce las hojas de albahaca sobre la pizza cocida, corta en 8 y sirve.", "Para hacer la pizza de base blanca, estire la mitad de la masa con las manos hasta un disco de 28cm / 11 pulgadas y colóquela en una bandeja engrasada para hornear. Rompa el fior di latte y cocine durante 10 minutos.", "Mientras tanto, precalentar la parrilla a su nivel más alto y asar el pak choi durante 2 minutos en cada lado. Vístete con un poco de aceite de oliva y sal.", "Cuando la pizza esté cocida, cubra con el pak choi, el ricotta ahumado y el chile. Cortar en 8 rebanadas y servir."], "url": "www_bbc_co_uk_food_recipes_fior_di_latte_pizza_90653", "title": "Fior di latte pizza", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Hace 2 pizzas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharadita de semillas de hinojo", "2 cucharaditas de semillas de comino", "4 cebollas de primavera, en rodajas finas", "2 chiles rojos, finamente picados (eliminar las semillas por menos calor)", "3 cucharadas de hojas y tallos de cilantro fresco finamente picado", "2 limas, solo jugo", "2 cucharadas de salsa de ostras", "¼ cucharadita de anís estrellado molido", "1 cucharada de vinagre de sidra", "1 cucharada de salsa de soja oscura", "600g / 1lb 5 oz de gambas de tigre crudas, peladas, descongeladas si se congelan", "1 cucharadita de aceite de oliva ligero", "3 pak choi, más o menos picados", "1 cucharadita de jengibre fresco rallado", "1 cucharada de salsa de soja ligera", "¼ cucharadita de aceite de sésamo tostado"], "method": ["Tueste las semillas de hinojo y comino en una sartén pequeña durante 1-2 minutos, o hasta que estén fragantes. Aplastar con una mano de mortero y la punta en un tazón. Agregue las cebollas de primavera, los chiles, el cilantro, el jugo de lima, la salsa de ostras, el anís estrellado, el vinagre y la salsa de soja. Agregue las gambas y deje marinar durante 10 minutos.", "Precalentar la parrilla a su configuración más alta.", "Extienda las gambas en una parrilla y ase de 3 a 4 minutos, o hasta que estén doradas y cocidas. Mantener caliente", "Para hacer las verduras salteadas, caliente el aceite en una sartén antiadherente a fuego alto. Agregue el pak choi, el jengibre y la salsa de soja y cocínelos durante 4-5 minutos, o hasta que se marchiten. Agregue el aceite de sésamo.", "Sirva los verdes con gambas inmediatamente."], "url": "www_bbc_co_uk_food_recipes_firecracker_prawns_with_47781", "title": "Gambas Firecracker con verduras salteadas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/firecracker_prawns_with_47781_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["12 gambas grandes, en el caparazón", "¼ cucharadita de sal de ajo", "2-3 zanahorias grandes cortadas en 24 porras muy delgadas, cada 1cm / ¼in más larga que las gambas", "700ml / 1¼ pinta de suero de leche", "aceite vegetal, para freír", "Harina normal 175g / 6oz", "50g / 2oz de polenta", "1 cucharada de chile en polvo", "2-3 cucharaditas de sal marina", "pizca de pimienta negra", "85ml / 3fl oz de mayonesa", "2 cucharaditas de salsa de chile picante, o al gusto"], "method": ["Retire las conchas de las gambas, dejando la cola intacta. Haga una incisión con un cuchillo afilado en la parte posterior de cada gamba. Enjuague la veta de la gamba. Con un pincho filoso, haga un agujero en el centro de la gamba, de arriba a abajo.", "Espolvoree las gambas con la sal de ajo.", "Pase dos bastones de zanahoria por el agujero que ha hecho en la parte posterior de los langostinos. (Las tiras de zanahoria deben sobresalir del extremo superior de las gambas).", "Coloque las gambas y el suero de leche en un recipiente y déjelos en remojo durante 30 minutos, revolviendo ocasionalmente.", "Calentar el aceite en una sartén profunda de base pesada hasta que la miga de pan chisporrotee y se ponga marrón cuando se la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Mientras tanto, tamice la harina, la polenta, el chile en polvo, la sal y la pimienta negra recién molida en un plato grande.", "Retire una gamba del suero de leche (asegúrese de que haya un montón de suero de leche).", "Dragar la gamba con la harina especiada y la mezcla de polenta para cubrir. No sacuda el exceso.", "Repita con cinco gambas más, luego coloque las gambas recubiertas con cuidado en el aceite caliente. Fríe durante unos 2-4 minutos, girando las gambas de vez en cuando para mantenerlas en movimiento, hasta que estén crujientes y doradas por todas partes, luego retíralas con una espumadera y escurre sobre papel de cocina.", "Repita este proceso de dragado y freír las seis gambas restantes. (La cola del camarón debe sobresalir de un extremo y la zanahoria del otro, para parecerse a un petardo).", "Para la salsa de inmersión, mezcle la mayonesa y la salsa de chile picante en un tazón.", "Para servir, coloque el tazón de salsa en el centro de un plato de servir grande. Coloque las gambas 'petardos' alrededor del tazón y sirva."], "url": "www_bbc_co_uk_food_recipes_firecrackershrimp_89800", "title": "Gambas 'Firecracker'", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina común 110g / 4oz", "175ml / 6fl oz perry (sidra de pera)", "2 cucharadas de aceite de colza", "1 clara de huevo de rango libre, pegada a picos rígidos", "6 patatas grandes Maris Piper, cortadas en pedacitos", "sal al gusto", "5 cucharadas de aceite de colza", "400 g / 14oz de guisantes frescos o congelados", "50g / 1¾oz de mantequilla", "2 cucharadas de pasta de wasabi", "2 litros / 3½ pintas de aceite de girasol, para freír", "1 filete de abadejo, cortado en pedazos"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para el bateador, mezcle todos los ingredientes del batido aparte de la clara de huevo. Dejar reposar en la nevera durante 20 minutos.", "Corta las papas en tu forma de chip favorita. Hierva durante 10 minutos en una sartén con agua con sal, o hasta que las papas estén suaves hasta la punta de un cuchillo. Drene y transfiera a un plato del horno una vez que esté completamente seco. Sazonar con sal y mezclar con el aceite de colza. Hornee durante 25-30 minutos o hasta que estén dorados y crujientes.", "Para los puré de guisantes wasabi, agregue los guisantes, la mantequilla y 300 ml / 10 fl oz de agua a una sartén y cocine a fuego moderado hasta que el agua se haya evaporado. Agregue la pasta de wasabi y machaque los guisantes con un tenedor. Manténlos calientes hasta que estés listo para servir.", "Para terminar la mezcla, bata la clara de huevo en un bol hasta que se formen picos rígidos cuando se quite la batidora del bol. Dóblalo en la masa.", "Llene a la mitad una sartén con aceite de girasol y llévela a una temperatura de 180 ° C / 350 ° F, que puede verificar con un termómetro de azúcar o use una freidora a la misma temperatura.", "Voltea los trozos de colín en la masa y luego, con cuidado, bájalos en el aceite caliente, uno a la vez. Freír individualmente hasta que estén doradas. Descanse el pescado en papel de cocina para eliminar el exceso de aceite y sirva con las patatas fritas y los guisantes."], "url": "www_bbc_co_uk_food_recipes_fish_and_chips_69749", "title": "Pescado y patatas fritas Perry-battered con wasabi guisantes blandos", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 yemas de huevo", "1 cucharada de mostaza Dijon", "3 cucharadas de vinagre de vino blanco", "200ml / 7fl oz de aceite vegetal, más extra para freír", "exprimir jugo de limón", "½ cebolla roja picada", "1 cucharada de pepinillos, más o menos picados", "1 cucharada de alcaparras, más o menos picadas", "pequeño puñado de perejil, finamente picado", "4-5 aceitunas verdes, picadas", "12 cucharadas de harina natural", "6 cucharadas de harina de maíz", "200 ml / 7 fl oz de ale", "pizca de sal", "8 papas grandes Maris Piper, peladas y cortadas en trozos gruesos", "4 x 150 g / 5½ oz de filetes de bacalao (o eglefino)"], "method": ["Primero prepara la salsa tártara. Batir las yemas de huevo, la mostaza y el vinagre y verter gradualmente el aceite en un flujo constante hasta que tenga una mayonesa espesa y cremosa. Sazonar al gusto y agregar un chorrito de limón.", "Agregue la cebolla, los pepinillos, las alcaparras, el perejil y las aceitunas. La salsa debe ser bastante picante y gruesa y tener la consistencia de crema doble muy espesa.", "Para hacer la mezcla, mezcle las harinas y bata la cerveza hasta que tenga una consistencia doble de crema. Añade una pizca de sal.", "Caliente el aceite en una freidora a 140C (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión). Cocine las fichas durante 8-9 minutos y déjelas a un lado en papel de cocina.", "Aumente el calor a 190C. En tandas, sumerja los filetes de pescado en la mezcla y vierta cuidadosamente en el aceite caliente. Agite suavemente la canasta para que los filetes no se peguen y cocine durante unos 3-5 minutos. No sobrecargue la canasta o el aceite se enfriará y obtendrá una masa empapada. Retire y escurra sobre papel de cocina.", "Regrese las papas fritas a la freidora por otros 2-3 minutos y escurra sobre papel de cocina. Sirva con el pescado machacado y la salsa tártara."], "url": "www_bbc_co_uk_food_recipes_fish_and_chips_with_02619", "title": "Pescado y patatas fritas con salsa tártara", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fish_and_chips_with_02619_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["aceite vegetal, para freír", "15 g / ½ oz de levadura fresca", "azúcar pizca", "300ml / 10fl oz de cerveza", "1 cucharadita de vinagre de sidra", "Harina normal de 200g / 7oz", "pizca de sal", "1 lenguado grande de solla o limón, pelado, deshuesado y cortado en tiras", "300g / 10½oz de patatas harinas (como Maris Piper), peladas, cortadas en trozos de 1cm / ½ en gruesas y enjuagadas en agua fría", "½ limón, cortado en trozos, para servir", "50 g / 1¾oz de guisantes congelados descongelados", "50g / 1¾oz de yogurt natural", "pizca de copos de chile", "1 cucharada de menta fresca picada", "sal y pimienta negra recién molida"], "method": ["Para el pescado y las patatas fritas, caliente el aceite en una freidora a 190 ° C, o llene la mitad de una sartén profunda con aceite y caliente hasta que la miga de pan chisporrotee y se ponga marrón cuando la deje caer (Precaución: el aceite caliente puede ser peligroso. no dejes desatendida.)", "Espolvorea la levadura y el azúcar en un tazón. Vierta la cerveza y el vinagre y mezcle la harina y la sal. Deja fermentar. Está listo para usar cuando la mezcla comienza a burbujear.", "Sumerja el pescado en la mezcla y fría hasta que esté dorado y cocido (aproximadamente 3-4 minutos). Retire con una espumadera y escurra sobre papel de cocina.", "Agregue las papas a la freidora y fríe durante 3-4 minutos, o hasta que estén doradas y crujientes. Retire de la sartén con una espumadera y déjela a un lado para escurrir sobre papel de cocina.", "Para los guisantes, coloque los guisantes, el yogur, los copos de chile, la sal y la pimienta en una licuadora y mezcle hasta que estén casi suaves.", "Mezcle la menta justo antes de servir y sirva inmediatamente con el pescado y las papas fritas."], "url": "www_bbc_co_uk_food_recipes_fish_and_chips_with_26404", "title": "Pescado y patatas fritas con guisantes triturados", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]