[{"ingredients": ["6 tomates de vid, cortados por la mitad", "2 cucharadas de aceite de oliva", "Sal y pimienta negra recién molida", "4 ramitas de tomillo fresco", "4 pechugas de pollo sin piel, con un ala adjunta", "Mozzarella 110 g / 4 oz, preferiblemente búfalo, cortado en 8 rebanadas gruesas", "Harina normal de 75g / 3oz", "2 huevos de gallinas camperas, golpeados", "Pan rallado panko japonés de 75g / 3oz (disponible en supermercados japoneses), o pan rallado seco", "Aceite vegetal, para freír", "2 berenjenas, cortadas a la mitad, cortadas en trozos grandes", "3 ramitas de romero fresco, solo hojas", "2 cucharadas de aceite de oliva", "Sal y pimienta negra recién molida", "60g / 2½ oz de hojas frescas de albahaca", "50g / 2oz de piñones, tostados", "50g / 2oz de queso parmesano, recién rallado", "2 dientes de ajo", "125-175 ml / 4½ -5 fl oz de aceite de oliva virgen extra, al gusto"], "method": ["Para los tomates tostados, precaliente el horno a 150C / 300F / Gas 1.", "Coloque los tomates, con los lados cortados hacia arriba, en una bandeja de asar. Rocíe con el aceite de oliva y sazone, al gusto, con sal y pimienta negra recién molida. Dispersión sobre las ramitas de tomillo.", "Ase los tomates en el horno durante dos horas, o hasta que estén ligeramente secos. Retirar del horno y reservar para enfriar.", "Para el pollo relleno de mozzarella, aumente la temperatura del horno a 200C / 400F / Gas 6. Caliente el aceite en una freidora a 190C. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Corta una hendidura profunda en el costado de cada pechuga de pollo, luego coloca el cuchillo alrededor de los bordes del pecho para crear un \"bolsillo\" en el centro.", "Sazonar las rodajas de mozzarella, al gusto, con sal y pimienta negra recién molida. Inserta dos rebanadas de mozzarella en el bolsillo de cada pechuga de pollo.", "Espolvorea la harina en un plato. Batir los huevos en un tazón. Espolvoree las migas de pan en otro plato.", "Seca cada pechuga de pollo rellena primero en la harina, luego sumérgelas en el huevo, luego enróllalas en el pan rallado hasta que estén completamente cubiertas.", "Con cuidado, baje las pechugas de pollo cubiertas en el aceite caliente y fría por 2-3 minutos, o hasta que estén doradas. Retire de la sartén con una cuchara ranurada y transfiera a una bandeja de asar. Hornee en el horno durante 15-20 minutos, o hasta que el pollo esté bien cocido.", "Para la berenjena, mezcle las piezas de berenjena, hojas de romero y aceite de oliva hasta que el aceite cubra las berenjenas. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Caliente una sartén hasta que esté caliente, luego cocine las piezas de berenjena por 30-45 segundos en cada lado, volteándolas regularmente, hasta que aparezcan marcas carbonizadas en las piezas de berenjena y que estén cocidas.", "Para el pesto, mezcle la albahaca, los piñones, el parmesano y el ajo en un procesador de alimentos con un puré texturizado. (Alternativamente, triture el pesto en un mortero)", "Agregue el aceite de oliva para aflojar la mezcla y mezcle de nuevo hasta que esté bien combinado.", "Para servir, coloque una pechuga de pollo rellena de mozzarella en el centro de cada una de las cuatro placas de servir. Coloque las berenjenas y los tomates asados ​​al lado. Rocíe sobre el pesto."], "url": "www_bbc_co_uk_food_recipes_mozzarella-stuffed_90052", "title": "Pollo relleno de mozzarella con tomates asados, berenjenas y pesto de albahaca", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 pechugas de pollo deshuesadas y despellejadas", "aerosol de aceite de cocina controlado en calorías", "1 cebolla mediana, finamente cortada", "2 dientes de ajo, aplastados", "400g de tomates cortados en lata", "3 cucharadas de puré de tomate", "1½ cucharadita de orégano seco", "85g / 3oz de aceitunas verdes o negras sin hueso", "2 paquetes de 125 g de mozzarella reducida en grasa, cortada en rodajas y escurrida en papel de cocina", "aerosol de aceite de cocina controlado en calorías", "1 cebolla mediana, finamente picada", "1 diente de ajo, aplastado", "2 x 400 g de judías de hojalata, escurridas", "buen jugo de limón exprimido", "sal marina y pimienta negra recién molida"], "method": ["Sazone las pechugas de pollo con sal y pimienta. Rocíe una sartén antiadherente a prueba de llamas grande y profunda o saltee la sartén con aceite y colóquelo a fuego alto. Cocine el pollo en cada lado por 3 minutos o hasta que esté ligeramente dorado. Transfiere a un plato.", "Reduzca el fuego a bajo, rocíe un poco más de aceite de cocina en la sartén y cocine la cebolla durante 4-5 minutos, revolviendo hasta que esté suave y ligeramente dorado. Agregue el ajo y cocine por unos segundos.", "Vierta los tomates. Agregue el puré de tomate, el orégano, las aceitunas y 300 ml / 10 fl oz de agua fría. Llevar a ebullición y cocinar durante 5 minutos, revolviendo regularmente. Reduzca el fuego a fuego lento y agregue el pollo. Cocine por 10 minutos, revolviendo ocasionalmente, hasta que el pollo esté tierno y cocido. Sazone al gusto.", "Precalentar la parrilla a su temperatura más alta. Cubra el pollo y la salsa con la mozzarella en rodajas. Espolvorear con pimienta negra molida. Coloque debajo de la parrilla caliente y cocine por 2-3 minutos o hasta que el queso se derrita.", "Para el puré de frijoles de mantequilla, rocíe una olla pequeña antiadherente con aceite de cocina y coloque a fuego medio. Agregue la cebolla y cocine por 3 minutos. Agregue el ajo y cocine por 1 minuto más.", "Pon los frijoles en un procesador de alimentos con 100 ml / 3½ fl oz de agua, una buena pizca de sal y pimienta. Agregue la cebolla cocida y el ajo y mezcle hasta obtener un puré espeso. Vuelva a colocar la cuchara en la cacerola y caliente, revolviendo constantemente hasta que esté caliente. Agregue un buen apretón de limón y sazone al gusto.", "Divida el puré de manteca entre 4 platos y agregue el pollo y la salsa. Sirva con vegetales o ensalada recién hecha."], "url": "www_bbc_co_uk_food_recipes_mozzarella_chicken_with_82882", "title": "Pollo mozzarella con puré de frijoles", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mozzarella_chicken_with_82882_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 cucharadas de aceite de oliva", "1 cebolla grande, finamente picada", "2 dientes de ajo, finamente picados", "1 cucharadita de orégano seco", "100ml / 3½fl oz de vino tinto o blanco", "1 x 400 g de tomates de hojalata", "pizca de azúcar (opcional)", "2 cucharadas de vinagre balsámico", "500g / 1lb 2oz de tomates frescos de ciruela, cortados a la mitad", "sal y pimienta negra recién molida", "750 g / 1 libra de carne picada de pollo de 10 onzas, compuesta de media carne de pechuga y mitad de carne de muslo", "aceite de oliva, para freír", "1 cebolla pequeña, finamente picada", "1 diente de ajo, finamente picado", "1 cucharadita de orégano seco", "50g / 1¾oz de pan rallado", "1 huevo de gallinas camperas, golpeado", "Crema doble 50ml / 2fl oz", "30 g / 1 oz de queso parmesano, finamente rallado", "generosa ralladura de nuez moscada", "20 mini bolas de mozzarella, más extra para cubrir", "16 hojas de albahaca", "Pappardelle 200g / 7oz", "75g / 2¾oz de queso parmesano, rallado", "algunas hojas de albahaca"], "method": ["Ponga 2 cucharadas de aceite de oliva en una olla grande y agregue la cebolla. Freír suavemente hasta que esté muy suave y translúcido, luego agregue el ajo y el orégano. Cocine por un minuto más y luego vierta el vino. Deje que burbujee durante un minuto o dos, luego baje el fuego y agregue los tomates enlatados. Condimentar con sal y pimienta. Deje hervir a fuego lento, tapado, todo el tiempo que pueda, pero al menos durante 1 hora, revise regularmente y agregue un chorrito de agua si parece que se está secando. Después de los primeros 20 minutos, revise los tomates para obtener dulzura y agregue una pizca de azúcar si cree que lo necesitan.", "Precalentar el horno a 200C / 180C Fan / Gas 6.", "Mientras tanto, ponga el aceite de oliva restante y el vinagre balsámico en una lata de tueste y sazone con sal y pimienta. Mezcle, luego cubra los tomates frescos en la mezcla de aceite de oliva. Asar durante unos 30 minutos o hasta que estén blandos.", "Coloque los tomates tostados en un colador y presione la carne dentro de la cacerola de tomate, extraiga todo el delicioso sabor de estas bellezas. Mantenga el horno encendido para cocinar las albóndigas.", "Para hacer las albóndigas, coloque la carne picada de pollo en un tazón grande y sazone con sal y pimienta. Caliente el aceite de oliva en una sartén pequeña y agregue la cebolla. Freír suavemente hasta que esté suave y translúcido. Agregue el ajo y cocine por un minuto más. Dejar enfriar un poco y luego agregar al pollo.", "Agregue el orégano, el pan rallado, el huevo, la crema, el parmesano y la nuez moscada al pollo. Mezcle muy bien. Divida la mezcla en 20 bolas.", "Escurra bien las bolas de mozzarella. Aplane cada albóndiga. Envuelva cada bola de mozzarella en una hoja de albahaca y póngala en el medio de la albóndiga. Envuelva la carne alrededor de la mozzarella y la albahaca hasta que esté completamente cerrada. Forma suavemente en una esfera.", "Calentar un poco de aceite de oliva en una sartén grande y freír las albóndigas en cada lado hasta que estén bien doradas.", "Transfiera las albóndigas a un plato resistente al horno y vierta sobre la salsa de tomate; no estarán completamente cubiertas. Cortar la mozzarella restante y colocar sobre la salsa, luego rallar más parmesano. Hornee en el horno precalentado durante unos 20-25 minutos hasta que esté caliente.", "Mientras las albóndigas se hornean, cocine la pasta de acuerdo con las instrucciones del paquete. Servir juntos, con más queso parmesano rallado si lo desea. Algunas hojas alegres de albahaca en la parte superior también se ven bien."], "url": "www_bbc_co_uk_food_recipes_mozzarella_stuffed_57353", "title": "Albóndigas de pollo rellenas de mozzarella con salsa de tomate asado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "½ berenjena, cortada longitudinalmente", "½ pimienta romero, cortada en rodajas a lo largo", "Bolas mini de mozzarella de 100 g / 3½ oz", "pequeñas hojas de albahaca fresca picada", "pequeñas hojas de perejil fresco, picadas", "1 cucharada de aceite de oliva", "½ limón, solo jugo", "vinagre balsámico, para rociar (opcional)"], "method": ["Para la ensalada, caliente una cucharada de aceite de oliva en una sartén a fuego medio y fría las rodajas de berenjena y pimiento hasta que estén suaves y doradas. Deje que se enfríe un poco.", "Coloque la mozzarella y las hierbas juntas en un recipiente y mezcle. Agregue las verduras.", "Para el aderezo, coloque el aceite de oliva y el jugo de limón en un recipiente y mezcle.", "Para servir, transfiera la mezcla de ensalada a un recipiente para servir y vierta sobre el aderezo. Rocíe con vinagre balsámico si lo desea."], "url": "www_bbc_co_uk_food_recipes_mozzarellaandmediter_84429", "title": "Ensalada de mozzarella y vegetales mediterráneos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50g / 1¾oz de pan rallado", "1 cucharada de hierbas frescas mezcladas picadas (perejil, perifollo, cebollín)", "75 g / 2¼ oz mozzarella", "Filete de res 150 g / 5½ oz", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "25g / 1oz de mantequilla", "1 ramita de romero fresco", "2 dientes de ajo, aplastados", "100 g / 3½ oz de papas de manzana de abeto rosadas, divididas a la mitad y blanqueadas durante cinco minutos en agua hirviendo", "500ml / 18fl oz de aceite vegetal", "100g / 3½ oz de harina de auto crianza", "1 cucharadita de polvo de hornear", "1 huevo de gallinas camperas", "50 ml / 2 fl oz de agua de manantial", "½ cebolla, rebanada gruesa y separada en anillos", "pizca de sal", "100g / 3½oz de tomates cherry", "1 cucharada de aceite de oliva", "25g / 1oz de mantequilla", "1 cucharada de aceite de oliva", "½ diente de ajo, picado", "½ cebolla, finamente picada", "50g / 1¾oz de champiñones", "1 cucharadita de mostaza de grano", "100ml / 3½ fl oz crema doble", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para la carne, coloque las migas de pan y las hierbas en un recipiente y mezcle.", "Agregue la mozzarella para cubrir con las hierbas y el pan rallado y reserve.", "Caliente una sartén a prueba de horno hasta que fume. Frote la carne con el aceite de oliva y sazone con sal y pimienta negra recién molida. Coloque la carne en la plancha y cocine durante dos minutos en cada lado, para dorar la carne.", "Coloque la mozzarella con su pan rallado en la carne. Transfiera al horno para asar durante cinco minutos, o hasta que la carne esté cocida a su gusto, luego descanse en un plato caliente por un minuto.", "Para hacer la patata salteada, caliente el aceite y la mantequilla en una sartén. Agregue el romero y el ajo y fría por un minuto.", "Agregue las papas y fría a fuego medio, girando las papas regularmente, hasta que estén doradas.", "Para hacer los aros de cebolla, caliente el aceite en una cacerola honda profunda y pesada hasta que la miga de pan chisporrotee el aceite. (PRECAUCIÓN: el aceite caliente puede ser peligroso; ¡no lo deje sin supervisión!)", "Coloque la harina, el polvo de hornear, el huevo y el agua de manantial en un tazón grande y agítelos para hacer una mezcla.", "Sumerja los aros de cebolla en la mezcla y luego colóquelos con cuidado en el aceite caliente y fríelos durante 2-3 minutos, hasta que estén cocidos y dorados. Retire con cuidado con una cuchara ranurada y escurra sobre los paños de cocina y espolvoree con sal.", "Para hacer el tomate asado, coloque los tomates en una bandeja para hornear pequeña, rocíe con aceite y sazone, al gusto, con sal y pimienta negra recién molida. Coloque en el horno y tueste durante diez minutos hasta que esté cocido y suave.", "Para hacer la salsa de champiñones, caliente la mantequilla y el aceite en una sartén mediana a fuego medio. Agregue el ajo y la cebolla y fría por 4-5 minutos, hasta que se ablanden.", "Agregue los champiñones y la mostaza y fría por dos minutos.", "Agregue la crema, lleve a ebullición, reduzca el fuego y cocine a fuego lento durante cinco minutos, hasta que la salsa se espese. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, coloque la carne de vaca cubierta de queso en el centro de un plato caliente y sirva las patatas salteadas, los aros de cebolla y los tomates asados ​​en pilas al lado. Vierta sobre la salsa de champiñones."], "url": "www_bbc_co_uk_food_recipes_mozzarellacrustbeeff_80165", "title": "Filete de res mozzarella con patata salteada, aros de cebolla, tomate asado y salsa de champiñones", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 champiñón grande o 4 champiñones, en rodajas finas", "½ berenjena, en rodajas finas", "½ cucharadita de aceite de oliva", "1 rollo integral, cortado por la mitad", "50g / 1¾oz de pimiento rojo asado de una jarra (no en aceite), escurrido, rebanado", "30 g / 1 oz de mozzarella, en rodajas", "1 cebolla roja delgada en rodajas", "pellizcar el orégano seco", "puñado de cohetes", "sal y pimienta negra recién molida"], "method": ["Coloque las setas en rodajas y las berenjenas en un recipiente apto para microondas. Rocíe el aceite de oliva y sazone con sal y pimienta negra recién molida. Cúbralo con film transparente y cocínelo en el microondas a temperatura alta durante 2 minutos, hasta que los champiñones y las berenjenas estén cocidos al vapor y estén tiernos.", "Deje que se enfríen un poco, luego apile sobre el rollo rebanado. Cubra con la pimienta asada, la mozzarella y la cebolla roja. Sazonar con una pizca de orégano seco y apilar en el cohete."], "url": "www_bbc_co_uk_food_recipes_mozzarella_aubergine_83704", "title": "Rollo de mozzarella, berenjena, champiñones y pimienta asada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Jengibre fresco de raíz de 2½cm / 1in, pelado y rallado", "2 cucharadas de mirin", "½ cucharadita de pimienta Sichuan molida", "¼ cucharadita de sal marina molida", "½ cucharadita de hojuelas de chile secas trituradas", "Muslos o muslos de pollo de corral a 400 g / 14 oz", "Cebollas de primavera de 110 g / 4 oz, dos finamente rebanadas y el resto en rodajas en piezas de 2½ cm / 1 in", "2 cucharadas de aceite vegetal", "½ cucharadita de pimienta Sichuan molida", "½ cucharadita de hojuelas de chile secas trituradas", "1 cucharada de salsa de soja ligera", "1 cucharada de vinagre de arroz", "1 cucharada de aceite de sésamo tostado", "2 cucharadas de aceite sin sabor, como aceite vegetal", "1 chalota de plátano, en rodajas", "1 diente de ajo, en rodajas", "Camarón bebé seco de 25 g / 1 oz", "1 cabeza Gai Lan (brócoli chino), cortada en florecillas", "2 cucharadas de salsa de soja ligera", "2 cucharadas de vinagre de arroz negro", "2 cucharadas de aceite de sésamo tostado", "400g / 14oz de arroz integral", "50 g / 1¾oz de semillas de sésamo, tostadas"], "method": ["En un tazón, mezcle el jengibre rallado, mirin, pimienta de Sichuan molido, sal marina molida y chiles secos triturados juntos. Frote la mezcla por todo el pollo.", "Coloque los pedazos de cebolla de 2½ cm en un plato poco profundo y resistente al calor. Coloque los muslos de pollo (o muslos) en la parte superior.", "Llene un wok o una sartén grande con 1 litro / 1¾ pintas de agua y coloque un estante de vapor de acero inoxidable sobre la parte superior. Llevar el agua a fuego lento.", "Coloque el plato resistente al calor con el pollo sobre la rejilla, cubra la olla con una tapa y cocine a fuego medio durante 25 minutos, o hasta que el pollo esté bien cocido. (El pollo se cocina cuando los jugos se vuelven transparentes cuando se perfora la parte más gruesa de la carne). Reserve los jugos de cocción del plato.", "Quite el pollo del fuego y cuidadosamente triture el pollo del hueso con un cuchillo y un tenedor (el pollo estará muy caliente). Corta y tritura la piel en trozos del tamaño de un bocado. Coloque en un plato para servir.", "Mientras tanto, coloque el arroz integral en un colador y lave hasta que el agua salga clara. Coloque el arroz en una sartén y agregue 500 ml / 18 fl oz de agua. Coloque a fuego alto y lleve a ebullición, luego baje el fuego a bajo y cubra con la tapa. Cocine por 15-20 minutos, o hasta que el arroz haya absorbido toda el agua. Apague el fuego y esponje el arroz con un tenedor. Mantenga en la sartén caliente hasta que esté listo para servir.", "Para el aderezo, caliente un pequeño wok o sartén y agregue el aceite vegetal. En un tazón pequeño y resistente al calor, agregue el pimiento molido de Sichuan y las hojuelas de chile. Vierta el aceite caliente sobre las especias, chisporroteándolas, y luego agregue la salsa de soja, el vinagre de arroz y el aceite de sésamo tostado. Agregue cuatro cucharadas de los jugos de cocina reservados. Cuchara esta salsa sobre el pollo.", "Para el brócoli salteado, caliente el wok, una vez caliente, agregue el aceite. Agregue la chalota, el ajo y los camarones y cocine durante 1-2 minutos. Agregue el brócoli y cocine durante 2-3 minutos más. Agregue los ingredientes restantes y cocine durante 1-2 minutos más.", "Para servir, esparza las cebolletas finamente cortadas sobre el pollo. Sirva el arroz en cuatro tazones y adorne con algunas semillas de sésamo tostadas. Coloque los jugos de cocción reservados restantes del pollo en un tazón pequeño, sírvalos en un lado, para humedecer y dar sabor al arroz. Sirva el brócoli junto con el pollo."], "url": "www_bbc_co_uk_food_recipes_mouthwatering_chicken_34426", "title": "Pollo delicioso", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["8 rebanadas de pan blanco", "8 hojas grandes de albahaca fresca", "1 bola de mozzarella de 150 g / 5 oz, cortada en cuatro rodajas gruesas y redondas", "2 cebollas tiernas, finamente cortadas", "2 cucharadas de harina, condimentada con sal y pimienta negra recién molida", "2 huevos de gallinas camperas, batidos con un chorrito de leche y condimentados con sal y pimienta negra recién molida", "2 cucharadas de aceite de oliva, para freír", "copos de sal marina", "chutney de tomate"], "method": ["Use un cortador de pasteles de 10 cm / 4 pulgadas para cortar círculos de las rebanadas de pan.", "Coloque una hoja de albahaca en cada uno de los cuatro círculos de pan.", "Coloque una rodaja de mozzarella en cada hoja de albahaca, luego cubra con otra hoja de albahaca.", "Espolvoree algunas de las cebollas de primavera en la parte superior y sazone bien con sal y pimienta negra recién molida.", "Cubra cada uno con uno de los cuatro círculos de pan restantes y presione los bordes del pan para sellar el emparedado.", "Separe los sándwiches en la harina sazonada para cubrir ligeramente, luego sumérjalos en la mezcla batida del huevo para cubrir completamente.", "Caliente el aceite de oliva en una sartén antiadherente grande a fuego medio.", "Freír los sándwiches durante 3-4 minutos por cada lado, o hasta que estén crujientes y dorados por todas partes.", "Para servir, coloque dos sándwiches en cada uno de los cuatro platos, espolvoree con copos de sal marina y sirva con una cucharada de chutney de tomate."], "url": "www_bbc_co_uk_food_recipes_mozzarellaencarozza_89236", "title": "Mozzarella en el carro", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 rebanadas de pan blanco crujiente", "Mozzarella de búfala 100 g / 3½ oz, en rodajas", "½ tomate de ternera, en rodajas", "1 huevo de gallinas camperas, golpeado", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva"], "method": ["Coloque una rebanada de pan en un plato y cubra con la mozzarella en rodajas y el tomate en rodajas. Coloque la otra rebanada de pan encima para hacer un emparedado.", "Batir el huevo en un bol con un poco de sal y pimienta negra recién molida. Sumerja el sándwich en el huevo batido.", "Calentar el aceite de oliva en una sartén, agregar el sándwich y freír durante 2-3 minutos en cada lado, o hasta que se dore. Retirar del fuego, cortar a la mitad y servir en un plato."], "url": "www_bbc_co_uk_food_recipes_mozzarellaincarrozza_87988", "title": "Mozzarella en el carro", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Mozzarella de búfalo de 450 g / 16 oz, desgarrada en trozos grandes, aproximadamente 50 g / 2 oz cada uno", "harina común, condimentada con sal y pimienta recién molida", "2 huevos de gallinas camperas, golpeados", "pan rallado fresco, para rodar", "200ml / 7fl oz de aceite vegetal, para freír", "200g / 7oz de tomates cherry, cortados a la mitad", "10 anchoas en conserva, enjuagadas y escurridas, finamente picadas", "sal y pimienta negra recién molida", "100ml / 3½fl oz de aceite de oliva", "½ limón, solo jugo", "1 cucharada de hojas frescas de tomillo", "1 diente de ajo, aplastado", "1 cucharada de piñones", "2 cucharadas de vinagre de vino tinto"], "method": ["Precalentar el horno a 180C / 355F / Gas 4.", "Ensarte dos pedazos de mozzarella en cada uno de los cuatro pinchos de madera, que se han remojado en agua durante diez minutos, o hasta que se haya agotado toda la mozzarella.", "Arrastre cada brocheta de mozzarella en la harina sazonada, luego sumerja en el huevo batido para cubrir.", "Sumerja y mueva la mozzarella en las migas de pan para cubrir completamente el queso.", "Caliente el aceite en una sartén honda hasta que esté casi caliente. Agregue los pinchos y fríelos, volteándolos regularmente, hasta que estén crujientes y dorados por todas partes.", "Retire con cuidado del aceite con una espumadera y escurra sobre papel de cocina.", "Para la salsa de tomate y anchoa, coloque los tomates, con el lado cortado hacia arriba, en un plato para horno poco profundo.", "Coloque las anchoas encima de los tomates y sazone con sal y pimienta recién molida.", "Rocíe sobre el aceite de oliva, luego colóquelo en el horno para asar durante 20 minutos, o hasta que se ablanden.", "Una vez que los tomates estén cocidos, agregue el jugo de limón, el tomillo, el ajo, los piñones y el vinagre de vino tinto y mezcle suavemente con una cuchara.", "Para servir, coloque una cucharada de salsa de tomate y anchoa en cada plato y sirva con un pincho de mozzarella en la parte superior."], "url": "www_bbc_co_uk_food_recipes_mozzarellaskewerswit_85482", "title": "Brochetas de mozzarella con tomates asados", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 zanahorias picadas", "25g / 1oz de mantequilla", "Crema doble de 150 ml / 1/4 de pinta", "2 cucharadas de vino blanco", "Sal y pimienta negra recién molida", "Para 'Mr Carrot'", "1 zanahoria, recortada"], "method": ["Para las zanahorias en crema, coloque las zanahorias picadas en una sartén con agua salada hirviendo y deje hervir durante seis minutos o hasta que se ablanden y luego drene.", "Derrita la mantequilla en una sartén, agregue las zanahorias cocidas y agregue la mantequilla derretida. Agregue la crema y el vino y cocine a fuego lento durante cinco minutos. Sazonar bien con sal y pimienta negra recién molida y una cuchara en un plato para servir.", "Para 'Mr Carrot', coloca una zanahoria en una sartén de agua salada hirviendo y hierve durante cinco minutos o hasta que esté tierna y escurra.", "Para servir, coloque 'Mr Carrot' de pie verticalmente en las zanahorias a la crema."], "url": "www_bbc_co_uk_food_recipes_mrcarrotoncreamedcar_88122", "title": "'Mr Carrot' en zanahoria con crema", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 pimientos rojos asados ​​(sacudido está bien)", "Nueces de 75 g / 2½ oz", "75g / 2½oz de pan rallado blanco", "1 cucharada de tahini", "1 cucharada de melaza de granada", "4 cucharadas de aceite de oliva virgen extra", "hojas de menta fresca, para adornar", "sal y pimienta negra recién molida"], "method": ["Mezcle los pimientos rojos en un procesador de alimentos hasta que quede suave y ponga en un tazón grande.", "Mezcle la mayoría de las nueces hasta que tenga migajas finas y agregue al puré de pimienta. Mezcle las migas de pan y sazone bien.", "Agregue la melaza de tahini y granada y afloje con aceite de oliva y un chorro de agua, si es necesario.", "Arregle en un plato para servir y decore con menta fresca y las nueces restantes"], "url": "www_bbc_co_uk_food_recipes_muhammara_red_pepper_dip_65246", "title": "Muhammara (salsa de pimiento rojo)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["175g / 6oz de arroz basmati blanco", "175g / 6oz pequeñas lentejas marrones", "75g / 3oz de mantequilla", "1 cucharadita de canela molida", "1 cucharadita de pimienta de Jamaica molida", "sal al gusto", "1 cucharadita de pimienta negra recién molida", "300ml / 10½ fl oz de aceite de girasol", "4 cebollas grandes, cortadas a la mitad y en rodajas en rondas muy finas", "gran puñado de cilantro fresco picado"], "method": ["Lavar el arroz muy bien en varios cambios de agua fría, hasta que el agua salga limpia. Coloque en una cacerola, luego cubra con agua tibia. Agregue sal, al gusto, y lleve a ebullición y cocine a fuego lento durante 10-12 minutos.", "Pon las lentejas en una olla aparte y cubre generosamente con agua. Llevar a ebullición, reducir el fuego a fuego lento y cocinar durante unos 10 minutos o hasta que las lentejas todavía estén un poco duras. Escurrir inmediatamente y dejar de lado.", "Mientras las lentejas se cocinan, prepara las cebollas caramelizadas. Calentar el aceite en una sartén grande. Dependiendo del tamaño de su sartén, es posible que deba cocinarlos en dos lotes. Cuando el aceite esté caliente, agregue suficiente cebolla rebanada para hacer una sola capa, y cocine a fuego medio, revolviendo ocasionalmente. Hacia el final de la cocción, cuando las cebollas estén comenzando a dorarse, revuélvalas constantemente para evitar que se quemen. El tiempo de cocción será de aproximadamente 30 minutos. Cuando esté bien dorado, quite las cebollas con una cuchara ranurada, y luego fría el resto de las cebollas.", "Derrita la mantequilla en una cacerola y agregue las especias. Agregue las lentejas y el arroz drenados y un tercio de las cebollas fritas. Agite suavemente todos juntos. Vierta suficiente agua en la cacerola para cubrir el arroz y las lentejas en aproximadamente 0.5 cm / ¼ de pulgada y sazone al gusto con sal y pimienta negra recién molida. Cubra la parte superior con un poco de pergamino húmedo para hornear cortado en la forma de la sartén o de papel de aluminio para que toque la superficie.", "Coloque una tapa en la sartén y hierva a fuego alto. Después de cinco minutos baje el fuego a bajo, luego cocine por otros cinco minutos. Toda el agua ahora debería haber sido absorbida y los granos de arroz estarán parados. Servir cubierto con las cebollas fritas restantes y espolvoreado con el cilantro picado."], "url": "www_bbc_co_uk_food_recipes_mujaddarah_80248", "title": "Mujaddarah", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200 ml de jugo de manzana fresca", "1 cucharada colmada de azúcar mascabado", "media naranja tachonada con 3-4 dientes", "1 ramita de canela", "500 ml de sidra", "Licor de naranja 50ml", "1 bolsa de té de hierbas con limón y jengibre"], "method": ["Ponga el jugo de manzana y el azúcar en una sartén y revuelva. Caliente juntos hasta que el azúcar se disuelva. Agregue la ramita de canela y la media naranja tachonada con clavos de olor. Agregue la sidra y el licor de naranja y caliente suavemente", "Coloque la bolsita de té de limón y jengibre y déjela infundir durante 2 minutos y luego retírela. Caliente, no hierva, durante 10 minutos para que todos los sabores se infundan. Sirve caliente. Si se prepara previamente, elimine las especias y la fruta y manténgase caliente."], "url": "www_bbc_co_uk_food_recipes_mulled_cider_54895", "title": "La sidra caliente con especias", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 manzanas, peladas, sin corazón y cortadas en octavos", "3 peras, peladas, sin corazón y descuartizadas", "Cáscara de naranja 5cm / 2in, tachonada con 3 dientes", "1 ramita de canela", "½ vaina de vainilla, dividida longitudinalmente", "1 cucharada de edulcorante, o 3 cucharadas de azúcar", "375ml / 13fl oz (½ botella) de vino tinto, como Rioja", "250 g / 9 oz de cerezas negras congeladas", "50 g / 1oz de pasas", "crema de leche baja en grasa, para servir (opcional)"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Coloque todo en un plato poco profundo y resistente al horno y hornee por 45 minutos, revolviendo 2 o 3 veces. El vino lentamente pochará la fruta, dejándola intacta y gloriosamente púrpura. Deje que se enfríe un poco antes de servir con una cucharada de crema baja en grasa, si se usa."], "url": "www_bbc_co_uk_food_recipes_mulled_fruit_salad_08855", "title": "Vino caliente fruta al horno", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mulled_fruit_salad_08855_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 palito de canela, aplastado", "½ cucharadita de dientes enteros", "½ cucharadita de jengibre molido", "¼ cucharadita de nuez moscada molida", "20g / ¾oz de levadura de acción rápida seca", "625g / 1lb 7oz de harina de pan blanco fuerte, más extra para espolvorear", "75g / 2¾oz de azúcar en polvo", "Una pizca de sal marina", "500 g / 1 libra de mantequilla fría de 2 onzas, cortada en rectángulos de 1 cm / ½ pulgada de grueso, más extra para engrasar", "2 yemas de huevo de gallinas camperas, ligeramente batidas", "300g / 10½oz de queso crema con toda su grasa", "1 vaina de vainilla, solo semillas", "1 cucharadita de mezcla de especias especiadas (ver arriba)", "200g / 7oz de azúcar glas, tamizado", "100ml / 3½fl oz de jarabe de arce", "Brandy 25ml / 1fl oz"], "method": ["Para la mezcla de especias, muela los ingredientes hasta obtener un polvo fino en una maja y mortero o molinillo de especias. Dejar de lado.", "Para el rollo, coloca la levadura y un poco de agua en una cacerola pequeña y tibia suavemente. Coloque la mezcla de harina, azúcar, sal y levadura en una batidora de pie equipada con un gancho de masa. Ponga el motor a funcionar a baja velocidad, luego vierta gradualmente 450 ml / ¾ de agua fría hasta que la mezcla se una como una masa elástica y comience a pegarse a los bordes del recipiente de mezcla (Puede que no necesite usar toda el agua .).", "Cubra el recipiente con una toalla de té limpia y déjelo a un lado en una habitación tibia durante aproximadamente 20 minutos, o hasta que la masa se haya duplicado.", "Cuando la masa haya subido, colócala en una superficie de trabajo ligeramente enharinada y retírala. Ruede la masa a un rectángulo que mida 60cmx30cm / 24inx12in.", "Coloque las rebanadas de mantequilla fría en dos líneas por un lado del rectángulo de masa. Doble la otra mitad de la masa sobre la mitad untada con mantequilla, presionando suavemente los bordes para sellar. Bash la masa rellena con un rodillo, luego estirar de nuevo en otro rectángulo de 60cmx30cm / 24inx12in.", "Doble cada uno de los bordes cortos del rectángulo de masa en el centro para que se encuentren en el medio, luego doble el rectángulo nuevamente como un libro. Repite dos veces más el proceso de golpear, rodar y doblar, luego envuelve la masa en una película adhesiva y déjala enfriar en la nevera durante una hora.", "Enrolle la masa fría en un rectángulo que mida 30cmx45cm / 12inx18in y aproximadamente 1cm / ½ in de espesor. Dejar de lado.", "Para el relleno, mezcle todos los ingredientes en un bol hasta que estén bien combinados.", "Extienda el relleno uniformemente sobre la masa, luego enrolle la masa con fuerza, empezando por el lado más largo más cercano a usted. Corta el rollo en 9 rebanadas, cada una de 5 cm / 2 pulgadas de grosor.", "Engrase una lata circular con forma de springform de 23cm / 9in con mantequilla. Coloque una de las rodajas de rollos en el centro, de pie, luego coloque las 8 rodajas restantes a su alrededor. Asegúrate de que no estén demasiado apretados. Reserve para probar nuevamente durante 35-40 minutos o hasta que duplique su tamaño.", "Precalentar el horno a 200C / 180C Fan / Gas 6.", "Cuando los rollos hayan probado, cepíllalos con el huevo batido. Hornee en el horno durante 40-45 minutos o hasta que los panecillos estén dorados y se hayan expandido y unido. Retirar del horno y reservar para enfriar en una rejilla de alambre. Separe una vez lo suficientemente frío como para manejarlo.", "Mientras tanto, para la guinda, mezcle el azúcar glas, el jarabe de arce y el brandy en un tazón hasta que quede suave.", "Para servir, acomode los rollos en un plato de servir. Rocíe el glaseado de brandy sobre los panecillos especiados con especias de vino en un patrón entrecruzado."], "url": "www_bbc_co_uk_food_recipes_mulled_wine-spiced_roll_67007", "title": "Rollo de especias con vino y glaseado de brandy", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Rinde 9", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 naranja grande", "3 limones", "12 dientes", "2 satsumas o clementinas", "2 botellas de 750 ml de vino tinto", "2 palitos de canela", "150 g / 5½ oz de azúcar en polvo (opcional)", "brandy, al gusto (opcional)"], "method": ["Con cuidado pele la cáscara muy delgada de la naranja y los limones con un pelador de verduras. Exprime el jugo y reserva.", "Pon los dientes en las satsumas.", "Vierta el vino, 1,2 litros / 2 pintas de agua fría, y la cáscara de cítricos y los jugos en una olla grande de base pesada. Agregue las satsumas con tachuelas de clavo y los palitos de canela. Ponga la mezcla a punto de ebullición, luego reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento, cubra la sartén con la tapa y continúe cocinando a fuego lento durante aproximadamente 1 hora. Agregue el azúcar gradualmente durante la cocción, hasta que el vino caliente se endulce a su gusto (es posible que no necesite todo el azúcar).", "Cuele el vino caliente y sirva caliente en tazas."], "url": "www_bbc_co_uk_food_recipes_mulled_wine_46955", "title": "Vino caliente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mulled_wine_46955_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["175g / 6oz de mantequilla, a temperatura ambiente", "175g / 6oz de azúcar en polvo", "3 huevos de gallinas camperas", "Harina de auto aumento 250g / 9 oz", "2-3 cucharadas de leche", "2 ralladura de lima, solo", "2 pizca de nuez moscada molida finamente molida", "240ml / 8¾fl oz de vino tinto", "2 x 5cm / 2in canela", "pulgar tamaño de una uña jengibre, golpeado", "8 vainas de cardamomo verde, golpeadas", "1 diente", "2 cucharadas de azúcar en polvo", "1 naranja, jugo y ralladura", "1 paquete de gelatina de fresa", "2 x 400 g / 14 oz de cóctel de frutas en almíbar ligero, escurrido", "250ml / 9fl oz de crema batida", "Almendras en copos de 25 g / 1oz, tostadas", "cerezas pequeñas glaseadas puñado", "3 huevos grandes de gallinas camperas, solo yemas", "50 g / 1 oz de azúcar en polvo", "50g / 1¾oz de harina de maíz", "1 cucharadita de extracto de vainilla", "600 ml / 1 pinta de leche entera", "300ml / 10½ fl oz de crema individual"], "method": ["Para la torta, precaliente el horno a 180C / 350F / Gas 4.", "Engrase una lata para pastel de 18cm / 7 pulgadas y forre la base con papel para hornear.", "Bata la mantequilla y el azúcar juntos en un tazón.", "Batir los huevos, uno a la vez, batiendo todo el tiempo y agregando una cucharada de harina con el último huevo para evitar que se parta.", "Tamiza la harina y dóblala suavemente, con suficiente leche para obtener una mezcla que cae lentamente de la cuchara. Doble la ralladura y la nuez moscada.", "Coloque la mezcla en la lata preparada y nivele ligeramente la parte superior. Hornee en el estante del medio del horno durante 30-40 minutos o hasta que estén doradas.", "Retire la torta del horno y déjela enfriar. Lo mejor es dejar que el pastel quede rancio durante un día o dos para que absorba más gelatina.", "Para la gelatina espesada, coloque el vino tinto con las especias, el azúcar, la ralladura de naranja y el jugo de naranja en una cacerola a fuego alto.", "Llevar a ebullición y luego reducir el fuego a fuego lento durante diez minutos.", "Cuela y descarta las especias; luego mide el líquido Rellene con agua hirviendo hasta la cantidad de líquido necesaria para las instrucciones en el paquete de mermelada de fresa.", "Haga la gelatina como se indica en el paquete y reserve.", "Para armarlo, corte el pastel en cubos y póngalo en un bol grande. Esparza más de la mitad del cóctel de frutas y vierta la mitad de la gelatina en la parte superior de la esponja. Coloque en la nevera para establecer.", "Una vez que esté listo, vierta el resto de la gelatina y el resto de la fruta y vuelva a la nevera para volver a establecer.", "Para la crema pastelera, ponga las yemas de huevo, el azúcar impalpable, la harina de maíz y el extracto de vainilla en un tazón grande y mezcle hasta que se mezcle.", "Caliente la leche y la crema juntas en una sartén hasta que estén calientes, pero no hirviendo.", "Poco a poco mezcle esto en la mezcla de yema de huevo poco a poco, luego regrese la mezcla a la sartén. Revuelva a fuego alto hasta que la mezcla hierva y la crema se espese. Quítese el calor y cubra con una película adhesiva en contacto con la superficie para evitar que se forme una piel mientras se enfría.", "Vierta sobre la crema enfriada, cubra y deje hasta que esté completamente fría antes de transferirla al refrigerador para enfriarla y ponerla.", "Para finalmente armar, bate la crema batida en un bol hasta que una cinta de crema caiga del batidor cuando se quite el batidor.", "Suavemente extienda la crema sobre la superficie de la crema y espolvoree con las almendras y cubra con las cerezas glaseadas."], "url": "www_bbc_co_uk_food_recipes_mulled_wine_trifle_96060", "title": "Bocadillo de vino caliente", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3½pts / 2L de sidra seca o jugo de manzana fresca", "2 manzanas tachonadas con clavos", "4-6 palitos de canela", "5-6 bayas de pimienta de Jamaica", "ralladura de 1 naranja", "Ron oscuro (opcional)", "rebanadas de manzana para decorar"], "method": ["Combine todos los ingredientes en una olla grande y cocine a fuego lento durante 30 minutos, no hierva.", "Transfiera a un recipiente a prueba de calor y un cucharón en tazas de cristal. Adorne con rebanadas de manzana para servir."], "url": "www_bbc_co_uk_food_recipes_mulledcider_8851", "title": "La sidra caliente con especias", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 8-10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 botella de vino tinto", "60g / 2oz demerara azúcar", "1 ramita de canela", "nuez moscada", "1 naranja, reducido a la mitad", "1 hoja de laurel seca", "60ml / 2fl oz de endrina o ginebra damson (opcional)"], "method": ["Ponga el vino en una cacerola con la naranja, el azúcar, la hoja de laurel y las especias.", "Calienta suavemente hasta que el azúcar se haya disuelto. Pruebe si desea que el vino sea más dulce y agregue más azúcar al gusto.", "Fuera del fuego, mezcle la endrina o la ginebra damson si la está usando.", "Colar en copas a prueba de calor y servir a la vez."], "url": "www_bbc_co_uk_food_recipes_mulledwine_8156", "title": "Vino caliente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mulledwine_8156_16x9.jpg", "isVegetarian": true, "recommendations": 0}]