[{"isVegetarian": false, "title": "Pesto and sun-dried tomato palmiers", "url": "www_bbc_co_uk_food_recipes_pesto_and_sun-dried_13834", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pesto_and_sun-dried_13834_16x9.jpg", "ingredients": ["125g/4½oz plain flour, plus extra for dusting", "125g/4½oz strong white flour", "½ tsp salt", "225g/8oz salted butter, chilled ", "50g/1¾oz Parmesan, grated", "50g/1¾oz basil", "1 garlic clove, crushed ", "50g/1¾oz pine nuts ", "1 tsp caster sugar ", "1 tsp salt", "50g/1¾oz Parmesan, grated", "2 tbsp olive oil, plus extra to taste ", "150g/5½oz sun-dried tomatoes in oil", "2 tbsp sun-dried tomato paste", "½ tsp chipotle paste", "½ tsp anchovy paste", "25g/1oz Parmesan, grated", "50g/1¾oz Parmesan, grated "], "serves": "Makes 16 palmiers", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the pastry, put the flours and salt in a mixing bowl. Make a well in the middle and pour in 150ml/5fl oz water.  Stir to combine, then knead for a minute. Wrap in cling film and refrigerate for 30 minutes.", "Cut the butter in half horizontally. Place a piece between two sheets of baking paper and roll out so it is 14cm/5½in wide and 13cm/5in deep. Return to the fridge while you roll out the pastry.", "Put the dough on a lightly floured work surface and roll into a rectangle approximately 15x45cm/6x18in. With a short edge nearest you, place one piece of butter on the bottom third of the pastry and fold over, then put second on top of the folded over section and bring the top piece of pastry over to cover the butter. Pinch the edges together to seal the butter in the pastry. Turn so that a short edge is nearest you and roll out to a 15x40cm/6x16in rectangle. Fold into three (like a letter), wrap in cling film and refrigerate for 30 minutes.", "On a lightly floured work surface, place the pastry with a short edge nearest to you. Roll out to 15x40cm/6x16in then fold the bottom third up and top third down. Give the dough a quarter turn and roll out and fold as before. Wrap in cling film and refrigerate for 30 minutes.", "With a short edge facing you, roll out and fold as before. Turn the pastry by 90 degrees and roll out as before. Cover the dough with the grated Parmesan before folding.  Wrap in cling film and refrigerate for 30 minutes. Repeat the rolling and folding once more, but without the Parmesan. ", "For the pesto, place all the ingredients in a food processor and process until smooth, scraping down the sides at intervals and adding more olive oil if necessary. Transfer to a bowl and cover.", "For the sun-dried tomatoes, put all the ingredients in a bowl and blend using a stick blender until fairly smooth and with no large lumps.", "To finish, roll out the pastry into a rectangle until it’s the thickness of a £1 coin (the rectangle should be approximately 35x25cm/14x10in). Trim to a neat rectangle and place a short end nearest you. Spread pesto on the top half of the rectangle, leaving a 1cm/½in border around the edge and a vertical strip down the middle clear. Sprinkle with the Parmesan and spread the sun-dried tomato mixture on the bottom half of the pastry, again leaving a 1cm/½in border and a middle strip clear. ", "Run a wetted finger along edges and centre lines to help the pastry stick. Fold each long edge into the middle and press down the join to stop it springing open when cooking. You should now have a long, thin rectangle. ", "Wet along the join and fold in half to bring the short edges together. Press down to help seal the wetted join. Next bring the two long edges together, wetting the fold line as before. You should now have pesto on the two outside loops and tomato on the two inside ones. Cut into 1cm/½in thick slices and place on greased baking trays giving them plenty of room to expand as they bake. Chill for 20 minutes.", "Preheat the oven to 200C/180C Fan/Gas 6.", "Bake for 15–20 minutes or until the pastry is crisp and golden-brown. If the centres are uncooked, carefully turn them over and bake for another 2–3 minutes. Leave to cool on the tray. "]}, {"isVegetarian": false, "title": "Pesto lemon chicken", "url": "www_bbc_co_uk_food_recipes_pesto_lemon_chicken_88391", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pesto_lemon_chicken_88391_16x9.jpg", "ingredients": ["3 cooked chicken breasts, skinned, boned, halved horizontally and sliced into thin strips ", "2 large ripe avocados, peeled and sliced ", "½ lemon, juice only", "½ cucumber", "18 baby plum tomatoes, halved lengthways", "4 tbsp fresh green basil pesto", "6 tbsp light mayonnaise", "½ lemon, juice only", "salt and freshly ground black pepper", "25g/1oz pine nuts, toasted ", "micro salad", "basil leaves"], "serves": "Serves 6", "time": {"preparation": "overnight", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 0, "preparationMins": 0}, "recommendations": 0, "method": ["To make the dressing, put the pesto, mayonnaise and lemon juice in a large bowl, season with salt and pepper and mix to combine. Add the chicken and stir again. If possible, leave it to marinate for several hours or overnight.", "Place the avocado slices in a separate bowl, pour over the lemon juice and toss so the avocado is completely coated.", "Cut the cucumber in half lengthways, use a teaspoon to remove and discard the seeds and then peel using a potato peeler. Cut into crescent-shaped slices and arrange these in layers with the avocado slices, tomato halves and pesto chicken. Season with salt and pepper. (If assembling ahead, do not add salt until just before serving.)", "Scatter over the toasted pine nuts, micro salad and basil leaves to finish."]}, {"isVegetarian": true, "title": "Pesto pinwheel", "url": "www_bbc_co_uk_food_recipes_pesto_pinwheel_94572", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz strong white flour, plus extra for dusting", "10g/⅓oz table salt ", "25g/1oz caster sugar", "10g/⅓oz fast-action yeast ", "30g/1oz unsalted butter", "2 large free-range eggs, beaten ", "50ml/2fl oz semi-skimmed milk ", "olive oil, for greasing ", "1 red onion, sliced", "1 red pepper, sliced into strips", "⅓ medium butternut squash, cut into strips about 5cm/2in long and 5mm wide", "olive oil, for drizzling", "100g/3½oz feta", "50g/1¾oz shelled walnuts, broken into small pieces", "50g/1¾oz pine nuts", "50g/1¾oz parmesan (or a similar vegetarian hard cheese)", "150ml/5½fl oz olive oil", "2 garlic cloves, peeled", "large bunch basil", "1 large free-range egg ", "10g/⅓oz pine nuts", "flaked sea salt, to taste", "cracked black pepper, to taste "], "serves": "Makes 1 large loaf", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["To make the dough, put the bread flour in a large mixing bowl.  Add the salt, sugar, yeast, butter, beaten eggs, milk and approximately 25ml/1fl oz warm water.  Mix until combined. Add up to another 100ml/3½fl oz warm water, mixing between additions until you have a soft dough.   ", "Lightly flour a work surface and knead the dough for about 10 minutes, or until it is smooth and elastic. ", "Lightly oil a large bowl and add the dough. Cover with cling film and set aside to prove for about an hour.", "For the filling, preheat the oven to 170C/325F/Gas 3.", "Put the onion, pepper and butternut squash onto separate baking trays, drizzle with olive oil and roast in the oven for about 15 minutes, or until tender.  ", "Meanwhile, make the pesto. Heat a small, dry frying pan over a low heat.  Add the pine nuts and toast until lightly browned.  Add the pine nuts and all the remaining pesto ingredients to a food processor and blend until smooth.", "To finish the bread, knock back the proved dough by kneading it for 20 seconds, then cut it into two.  Wrap half in oiled cling film and set aside.  ", "On a lightly floured work surface, roll the remaining half of dough into a circle with diameter of approximately 30cm/12in.  Let the dough rest for about five minutes – it will shrink back. Roll it out again to a diameter of approximately 32cm/13in and place on a large baking tray.  ", "Spread three tablespoons of pesto over the dough and pile the roasted vegetables, feta and walnuts over the top in layers, making the layers slightly deeper in the centre. This will form the base of the bread.", "Roll out the remaining dough as in step 8. This will make the top layer.", "Brush the edges of the base with a little water and carefully lift the top layer onto the base.  ", "Use a sharp knife to trim the dough into a neat circle (approximately 30cm/12in diameter). Place a small bowl over the filling.  Using a sharp knife, cut the dough into 16 equally-sized strips radiating from the bowl.  Carefully twist each strip twice and cut the ends into points. Press the end of each strip onto the baking sheet to stop them unravelling while they prove. Set aside to prove for about 30 minutes.", "Preheat the oven to 190C/375F/Gas 5.  ", "For the topping, brush the top of the dough with the beaten egg and sprinkle the pine nuts, salt and pepper in the centre.  Bake for 20-25 minutes, or until golden-brown. Check after 15 minutes and cover the twists with aluminium foil if they are browning too quickly. Allow to cool before serving.  "]}, {"isVegetarian": true, "title": "Pesto mash", "url": "www_bbc_co_uk_food_recipes_pestomash_67178", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pestomash_67178_16x9.jpg", "ingredients": ["450g/1lb potatoes (Désirée or King Edward)", "50g/2oz butter", "1x120g tub fresh pesto sauce", "salt and freshly milled black pepper"], "serves": "Serves 2-3", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Use a potato peeler to pare off the skins as thinly as possible and then cut the potatoes into even-sized chunks, not too small. If they are large, quarter them and if they are small, halve them. ", "Put the potato chunks in a large saucepan, then pour boiling water over them, add 1 dessertspoon of salt, put on a lid and simmer gently until they are absolutely tender - they should take approximately 25 minutes. The way to tell whether they are ready is to pierce them with a skewer in the thickest part; the potato should not be hard in the centre. And you need to be careful here, because if they are slightly underdone you do get lumps.", "When the potatoes are cooked, drain them. Cover them with a clean tea cloth to absorb some of the steam for about 5 minutes, then add the pesto and a seasoning of salt and pepper. Using an electric hand whisk, start whisking at a slow speed to break up the potatoes, then increase the speed to fast and whip them up to a smooth purée. ", "Now return the saucepan to a low heat and use a wooden spoon to turn the potatoes round until they become hot - about 1 minute - season, and now they're ready to serve."]}, {"isVegetarian": true, "title": "Pesto pasta with feta and pine nuts", "url": "www_bbc_co_uk_food_recipes_pestopastawithfetaan_75698", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz flour", "1 free-range egg", "1 tsp olive oil", "handful fresh basil", "1 tsp pine nuts", "1 clove garlic, crushed", "100ml/3½fl oz olive oil", "50g/1 ¾oz feta cheese, crumbled, to serve", "1 tbsp pine nuts, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the pasta, mix the flour, egg and oil in a food processor to make a firm dough. ", "Roll out in a pasta machine, gradually reducing the roller thickness until it reaches the thinnest setting.", "Then roll through the spaghetti attachment to make a handful of fresh spaghetti. ", "Poach in a pan full of boiling salted water for two minutes or until tender.", "To make the pesto, using a small food processor, blend the basil, pine nuts, garlic and olive oil. ", "Stir through the cooked pasta and serve with the crumbled feta cheese and pine nuts."]}, {"isVegetarian": false, "title": "Pesto pasta with roasted sea bass and sauce vierge", "url": "www_bbc_co_uk_food_recipes_pestopastawithroaste_88655", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 large handfuls fresh basil leaves", "25g/1oz pine nuts", "3 tbsp olive oil", "2 garlic cloves, finely chopped", "25g/1oz parmesan, grated", "½ sea bass fillet, skin scored", "1 tbsp olive oil", "salt and freshly ground black pepper", "2 tbsp olive oil", "1 vine tomato, seeds removed, chopped", "1 garlic clove, finely chopped", "½ lemon, juice only", "150g/5½oz cooked fresh tagliatelle, kept warm ", "handful broccoli florets, blanched"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the pesto sauce, place all the pesto ingredients in the bowl of a small food processor and pulse until smooth.", "For the roasted sea bass, heat an ovenproof griddle pan until hot and oil the fish. Sear the bass on both sides, then transfer to the oven to roast for 4-5 minutes, or until cooked through.", "For the sauce vierge, place all the ingredients into a pan and heat through gently for 4-5 minutes.", "To serve, stir the pesto through the cooked tagliatelle and place onto a serving plate. Place the roasted bass fillet on top and arrange the broccoli florets around the side. Drizzle over the sauce vierge."]}, {"isVegetarian": true, "title": "Petalberry jam", "url": "www_bbc_co_uk_food_recipes_petalberry_jam_79158", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/petalberry_jam_79158_16x9.jpg", "ingredients": ["400g/14oz strawberries, ideally Albion strawberries, hulled and halved", "300g/10½oz jam sugar ", "1 lemon, juice only", "1 food-grade scented rose, separated into petals", "2 tsp rosewater", "knob butter (optional)"], "serves": "Makes 2 x 250ml/9fl oz jars", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Squish the strawberries in a large preserving pan and cook over a medium heat for about 20 minutes.", "Add the sugar and lemon juice and keep the pan on a medium heat to dissolve the sugar. Do not boil until the sugar has dissolved.", "Bring the mixture to a rolling boil (the mixture should be bubbling vigorously so that if it rises to the top of the pan it cannot be stirred down), stirring occasionally to avoid burning on the bottom of the pan. Cook for about 20 minutes.", "Add the rose petals and rosewater and cook for a further two minutes.", "Take off the heat, use a spoon to remove any scum that rises to the top, and add a knob of butter if liked. Stir gently to remove bubbles. Allow the mixture to stand for a couple of minutes and then pour into sterilised jars. "]}, {"isVegetarian": false, "title": "Petit pois à la Francais", "url": "www_bbc_co_uk_food_recipes_petitpoisalafrancais_84115", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 slices bacon, finely chopped", "1 garlic clove", "½ onion, finely chopped", "100ml/4fl oz double cream", "110g/3½oz frozen peas", "1 little gem lettuce, leaves separated", "salt and freshly ground black pepper", "2 tbsp chopped fresh parsley", "3 slices bacon, cooked until golden brown"], "serves": "Serves 1-2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Fry the chopped bacon in a large deep pan until it begins to brown. Add the garlic and onion and cook gently for two minutes, then add the cream and peas and bring to the boil.", "Add the lettuce and boil for one minute, seasoning, to taste, with salt and freshly ground black pepper.", "To serve, pour into a bowl, sprinkle with the parsley and top with the cooked bacon slices"]}, {"isVegetarian": true, "title": "Petits Monts Blancs", "url": "www_bbc_co_uk_food_recipes_petitsmontsblancs_68027", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 large egg whites ", "4oz/110g white caster sugar ", "2x250g tins crème de marrons de l'Ardèche (sweetened chestnut purée), chilled ", "9oz/250g mascarpone ", "7fl oz/200ml 8 per cent fat fromage frais ", "1 rounded dessertspoon caster sugar ", "1 tsp vanilla extract ", "a little icing sugar "], "serves": "Serves 8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Pre-heat the oven to 150C/300F/Gas 2. ", "To make the meringues, place the egg whites in a large bowl and, using an electric hand whisk on a low speed, begin whisking. Continue for about 2 minutes, until the whites are foamy, then switch the speed to medium and carry on whisking for 1 more minute. Now turn the speed to high and continue whisking until the egg whites reach the stiff-peak stage. Next, whisk the sugar in on fast speed, a little at a time (about a dessertspoon), until you have a stiff and glossy mixture.", "Now all you do is spoon 8 heaped dessertspoons of the mixture on to the prepared baking sheet, spacing them evenly. Then, using the back of the spoon or a small palette knife, hollow out the centres. Don't worry if they are not all the same shape - random and rocky is how I would describe them. Next, pop them on the centre shelf of the oven, immediately reduce the heat to gas mark 1, 2750F (1400C) and leave them for 30 minutes. (For important information about cooking at gas mark 1, click here.) After that, turn the oven off and leave the meringues to dry out in the warmth of the oven until it is completely cold (usually about 4 hours) or overnight. The meringues will store well in a tin or polythene box, and will even freeze extremely well.", "To assemble the Monts Blancs, spoon equal quantities of the créme de marrons into each meringue, whisk the topping ingredients together and spoon equal amounts on top of the chestnut purie. A light dusting of icing sugar is good for a snowcapped-mountain image."]}, {"isVegetarian": false, "title": "Pheasant breast with pearl barley, glazed carrots and spiced dates", "url": "www_bbc_co_uk_food_recipes_pheasant_breast_with_48020", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 crowns of pheasant, cleaned and washed", "500ml/18fl oz chicken stock", "1 celery", "1 leek", "1 onion", "2 garlic cloves, left whole", "400g/14oz pearl barley", "500ml/18fl oz chicken stock", "2 sprigs fresh thyme", "5g fresh yeast mixed with 2 tbsp water", "2 tbsp lemon vinaigrette", "2 tbsp olive oil", "2 shallots, diced", "1 tsp cumin", "1 tsp caraway seeds", "100g/3½oz lardo, finely diced", "8 fresh dates", "8 baby purple carrots, washed, tops removed and reserved", "8 baby orange carrots, washed, tops removed and reserved", "8 baby yellow carrots, washed, tops removed and reserved", "100g/3½oz unsalted butter", "2 tbsp olive oil", "8 pieces of lion’s mane mushrooms", "salt and freshly ground black pepper", "1 tbsp chopped chives", "100ml/3½fl oz olive oil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the pheasant, bring the stock to the boil in a large pan, add the crowns and poach for 20 minutes. To test that the meat is cooked, pierce with a skewer and check that the juices are clear.", "For the pearl barley, tie the celery, leek, onion and garlic in cheese cloth. Put in a pan with the pearl barley, chicken stock, thyme and yeast. Simmer on a low heat for about 45 minutes, until barley is soft but retains its shape. Remove the cheesecloth and drain the barley. Season with salt and lemon vinaigrette.", "For the spiced dates, in a frying pan, cook the shallot in the oil without colouring it. Add the cumin and caraway seeds. Fry the spices gently with the shallot until soft, leave to cool and then mix in the lardo.", "Remove the skin and stones from the dates,  keeping the dates whole. Stuff each dates with the lardo mix and roll it back to its original shape. Just before serving reheat the dates in a warm oven.", "Cook the carrots in boiling salted water until al dente. Heat the butter in a clean pan until it is foaming. Add the carrots and coat in the butter, remove from the heat.", "Fry the mushroom pieces in olive oil until crisp. Season with salt and pepper.", "For the chive oil, heat the oil to 80C and add the chives. Infuse for a few minutes, leave to cool and then blend in a food processor until smooth. Pass the mixture through a fine sieve. ", "Just before serving, heat a little oil in a pan until hot and sear the cooked crowns to crisp the skin. Carve the breast from the crown.", "To serve, spoon the pearl barley on two plates and top with the pheasant breasts. Garnish with the dates, carrots, mushrooms and chive oil."]}, {"isVegetarian": false, "title": "Pheasant salad with fresh chestnuts, pomegranate, dandelion and pancetta", "url": "www_bbc_co_uk_food_recipes_pheasant_salad_with_16420", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 1kg/2lb 4oz hen pheasant", "salt and freshly ground black pepper", "1 sprig rosemary", "100g/3½oz sliced pancetta", "3 tbsp olive oil", "75ml/2½fl oz dry Marsala wine", "100g/3½oz fresh chestnuts", "1 head trevisse tardivo red chicory, leaves separated", "½ head castelfranco chicory, leaves separated", "½ tsp balsamic vinegar", "1 bunch dandelion leaves", "1 tsp chopped mint", "½ pomegranate, seeds only"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Season the inside of the pheasant with salt and pepper and stuff it with rosemary. Wrap the pancetta over the pheasant and secure with cook's string. ", "In a heavy-based, ovenproof frying pan, heat a tablespoon of olive oil and cook the pheasant on all sides to seal and colour a light golden-brown. Add the Marsala to the pan and place in the oven for 25-30 minutes depending on the size of the pheasant. Remove from the oven and leave to cool down. ", "Score the chestnuts on their flat side and boil in water for 10-15 minutes. Remove from pan and leave to cool.  ", "Wash the salad leaves thoroughly and dry them. Mix the salad leaves with two tablespoons of olive oil and the balsamic vinegar. Season with salt and pepper, then mix in the dandelion, mint and pomegranate.", "Take off the pancetta from around the bird and chop into small strips.  ", "Carve the pheasant so you have a nice mixture of breast and leg meat. ", "Cut the chestnuts in half and scoop out the insides with a teaspoon. ", "To serve, put a pile of pheasant on each serving plate and pour over a little of the juice from the pan the pheasant was cooked in. Add a scoop of chestnuts, some pancetta pieces and serve with the salad."]}, {"isVegetarian": false, "title": "Pheasant Kiev with broad beans, peas, tarragon and cobnut salad", "url": "www_bbc_co_uk_food_recipes_pheasant_kiev_with_a_34098", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 garlic bulb, left whole", "500ml/17fl oz double cream", "½ bunch fresh chives, chopped", "4 pheasant breasts, skin removed", "120g/4½oz plain flour, seasoned with salt and freshly ground black pepper", "200g/7oz dried sourdough breadcrumbs", "2 free-range eggs", "vegetable oil, for shallow frying", "30g/1¼oz ready-made French dressing", "30g/1¼oz clear honey", "30ml/1¼fl oz white balsamic vinegar", "500ml/17fl oz vegetable oil", "1 tsp diced shallot", "½ garlic clove, sliced", "1 tsp chopped fresh parsley leaves", "1 tsp chopped fresh chives", "1 tsp chopped fresh basil leaves", "1 tsp chopped fresh thyme leaves", "500g/1lb 2oz broad beans, double podded", "200g/7oz fresh peas, pods removed", "2 tbsp rapeseed oil", "100g/3½oz fresh cobnuts, toasted", "1 tsp salt", "15g/½oz chopped baby red chard", "½ head frisee lettuce (or similar bitter, frilly-edged lettuce), outer leaves only", "15g/½oz lamb’s lettuce leaves ", "pinch tarragon leaves"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 170C/150C Fan/Gas 3½.", "Wrap the garlic bulb in aluminium foil and place on a baking tray. Bake for 40-45 minutes, or until the cloves are soft and the garlic can be squeezed out. Set aside until the garlic is cool enough to handle. Slice the top off the garlic, then squeeze all of the garlic in a bowl. Chop if necessary, or mash with a fork until smooth.", "Pour the double cream in the bowl of a free-standing food mixer and churn for 3-5 minutes using the beater attachment, or until lumps of butter have risen to the surface of the cream and the remaining mixture is liquid. Line a fine sieve with muslin cloth and suspend it over a large bowl. Strain the churned cream through the sieve, wrapping the muslin tightly around the lumps of butter and squeezing out as much liquid as possible. Discard the strained liquid.", "Mix the butter with the mashed garlic until well combined. Season with a generous pinch of salt, then stir in the chives until well combined. ", "Using a sharp knife, cut a wide, deep pocket in the thickest part of each pheasant breast, just under the inner fillet, without breaking through the other side of the pheasant breast. Fill each pocket with the garlic butter and chill in the fridge for 30 minutes.", "Increase the oven temperature to 180C/160C Fan/Gas 4. ", "Sprinkle the flour on a plate and the breadcrumbs on a separate plate. Beat the eggs in a bowl. Dust each pheasant breast in the flour, then dip in the beaten egg, then roll it in the breadcrumbs until completely coated. Return to the fridge to chill for a further 10 minutes. ", "Heat the oil in a frying pan over a medium to high heat until a breadcrumb sizzles and turns golden-brown when dropped into it. (CAUTION: Hot oil can be dangerous. Do not leave unattended.) Fry the pheasant Kievs, in batches if necessary, for 1-2 minutes on each side, or until golden-brown all over. Transfer to the oven and cook for a further 6-8 minutes, or until the pheasant has completely cooked through. ", "For the dressing, blend all of the ingredients in a food processor until smooth and well combined. Set aside.", "For the salad, bring a large saucepan of salted water to the boil and blanch the broad beans and peas for 1-2 minutes, or until just tender. Then refresh in ice cold water. Drain well. ", "Mix the beans and peas with the remaining salad ingredients in a large serving bowl. Drizzle with the dressing and mix again.", "To serve, place one pheasant Kiev in the centre of each plate and pile the salad alongside."]}, {"isVegetarian": false, "title": "Pheasant, fried egg and chips", "url": "www_bbc_co_uk_food_recipes_pheasant_fried_egg_and_65194", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 pheasant breast fillets", "75g/2½oz plain flour", "3 free-range eggs, lightly beaten", "125g/4½oz fresh breadcrumbs ", "2 tbsp rapeseed oil ", "75g/2½oz unsalted butter  ", "vegetable oil, for deep frying", "2 large floury potatoes, peeled and cut into 1cm/½in thick chips", "4 pheasant or duck eggs ", "8 anchovy fillets", "1 tsp capers ", "sea salt and freshly ground black pepper "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place each pheasant breast between two sheets of cling film and, using a meat mallet or a rolling pin, flatten them to about 1cm/½in thick. Discard the cling film.", "Tip the flour, beaten eggs and breadcrumbs into separate shallow dishes. Dredge the pheasant breasts in flour, then egg and finally the breadcrumbs, tossing to coat thoroughly.", "Heat a non-stick frying pan over a medium heat. Add a little oil and butter and fry the pheasant breasts on each side until golden-brown and just cooked through (you may need to do this in batches). ", "Meanwhile, fill a deep-fat fryer with vegetable oil and heat to 180C. (CAUTION: hot oil can be dangerous. Do not leave unattended.) ", "Add the chips to the fryer and cook for 6-8 minutes, or until golden-brown. Transfer to kitchen paper to drain. Season with salt, to taste, and keep warm until ready to serve.", "In a separate frying pan, heat a little oil and butter and fry the eggs until cooked to your liking. Season the eggs with salt and pepper. ", "To serve, put the pheasant breasts on serving plates and top each one with a fried egg. Place the anchovies and capers on top of the egg and serve the chips alongside."]}, {"isVegetarian": false, "title": "Pheasant simmered in milk, cream and celeriac", "url": "www_bbc_co_uk_food_recipes_pheasant_simmered_in_48387", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 ready-to-roast pheasant (about 1kg/2lb 4oz) ", "1 sprig rosemary", "4 slices pancetta", "1 small celeriac, peeled and cut into 1cm/½in cubes", "2 tbsp extra virgin olive oil", "2 tbsp dry Marsala wine", "300ml/10fl oz milk", "50ml/2fl oz double cream", "1 garlic clove, sliced ", "sea salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4.", "Stuff the pheasant with the rosemary and season all over with salt and pepper (inside and out). Wrap the pancetta slices over the pheasant to protect the breasts and tie string around the bird so that the pancetta is secure and will not fall off. Set aside.", "Cook the celeriac in a saucepan of boiling water for about 10 minutes, or until a knife will go through the pieces easily. Drain and put to one side.", "Heat a heavy-based ovenproof pan, add the oil and sear the pheasant to give it a light golden colour all over. Remove the pheasant from the pan and discard the fat. Add the Marsala and boil for 1 minute to reduce the volume of liquid. Add the cooked celeriac, milk, cream and garlic and bring to the boil. Remove from the heat. ", "Return the pheasant to the pan and cover with baking paper. Roast for 12–15 minutes, or until the juices run clear when the pheasant thigh is pricked with a skewer. Remove the baking paper and return the pan to the oven to cook for a further 5 minutes so that the juices can reduce and the pheasant can get a little more colour. ", "Transfer the pheasant to a chopping board and leave to rest for 10 minutes (keep the celeriac warm). Remove the string and, using a sharp knife, cut along the breastbone to take off the breasts. Then cut off the legs.", "Divide the breasts and legs between two warmed plates and spoon over the celeriac and creamy cooking juices. Serve with some simple steamed spring greens tossed with good olive oil."]}, {"isVegetarian": false, "title": "Pheasant breasts braised in cider", "url": "www_bbc_co_uk_food_recipes_pheasantbreastsbrais_1003", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pheasantbreastsbrais_1003_16x9.jpg", "ingredients": ["4 pheasant breasts (young hen breasts if possible as they won't be so tough)", "4 large rashers, lightly smoked bacon", "500ml/17fl oz dry cider", "5 shallots", "knob of butter", "1 tsp caster sugar", "30g/1oz plain flour", "100ml/7tbsp full fat crème fraîche"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Butter the pheasant breasts and then wrap in the bacon. Place in an ovenproof dish (so that they aren't too cramped together) and then pop in the oven for 25 minutes.", "After 25 minutes reduce the oven temperature to 170C/325F/Gas 3, pour 250ml/8 fl oz of the cider over the pheasant breasts, cover with a lid or tin foil, and return to the oven for another 60 minutes.", "Towards the ending of the cooking time for the pheasants, pour the remaining cider into a saucepan and cook until the volume of liquid has reduced by about half. ", "Thinly slice the shallots and cook very slowly in a little butter until soft. Then add the caster sugar and continue to cook until lightly caramelised. Remove from the heat until ready to finish the sauce.", "Check the pheasant breasts during the cooking time to ensure that they do not dry out and add more cider if necessary.", "To finish the sauce, add the flour to the shallots, place the pan back on a gentle heat and mix together. You may need to add a little more butter at this stage if the shallots are very dry, but they shouldn't be. Now add the cider reduction and the crème fraîche and cook together over a low heat until the sauce starts to thicken.", "Once ready to serve, slice each breast into about five slices and place on the plate still in the shape of the whole breast. Pour the sauce over the meat and serve."]}, {"isVegetarian": false, "title": "Pheasant, wild mushroom and bacon 'pie'", "url": "www_bbc_co_uk_food_recipes_pheasant_wild_mushroom_82171", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ chicken stock cube ", "15g/½oz dried mixed wild mushrooms", "2 tbsp sunflower oil", "100g/3½oz mixed fresh wild mushrooms, such as chanterelles, wiped or brushed, and sliced if large (or 150g/5½oz sliced portabellini mushrooms)", "6 rindless smoked streaky bacon rashers, cut into 1.5cm/¾in slices", "1 onion, finely chopped", "6 skinless pheasant breasts, each cut into 6 pieces", "2 garlic cloves, crushed", "100ml/3½fl oz tawny or ruby port", "3 tbsp plain flour", "2 heaped tbsp finely chopped fresh parsley leaves", "1kg/2lb 4oz floury potatoes, preferably Maris Piper or King Edwards", "50g/1¾oz butter, cubed", "4 tbsp milk", "salt and pepper, to taste", "2 tsp truffle oil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Pour 300ml/10fl oz just-boiled water into a jug and stir in the half a stock cube until dissolved. Add the dried mushrooms and stir well. Leave to soak for 30 minutes.", "To make the mash, peel the potatoes and cut into roughly 4cm/1½in chunks. Put in a large non-stick saucepan and cover with cold water. Bring to the boil, then reduce the heat slightly and simmer for 15-18 minutes, or until very tender. ", "Drain the potatoes in a colander and then return to the saucepan and mash with the butter, milk and plenty of salt and pepper until smooth. Put back on the hob over a very low heat until the pheasant filling is ready, stirring occasionally. ", "Tip the soaked mushrooms and their stock into a sieve over a bowl to drain and reserve the liquid. Transfer the mushrooms to a chopping board and very roughly chop. Have a look at the liquor and if it is very gritty, pass through muslin or a fine sieve and into a clean bowl. ", "Heat one tablespoon of the oil in a large non-stick frying pan or sauté pan and fry the fresh mushrooms and soaked mushrooms over a medium heat for two minutes, stirring occasionally. Tip onto a plate and return the pan to the heat.", "Add one more tablespoon of oil to the pan and fry the bacon and onion for 2-3 minutes or until beginning to brown, stirring regularly. Season the pheasant well with salt and pepper and add to the pan with the onion and bacon. Fry for two minutes, turning the pheasant in the pan every now and then until lightly browned.", "Working quickly, add the garlic and port to the pan and allow the liquid to bubble furiously for a few seconds. Sprinkle the flour over and stir through the pheasant and vegetables until lightly coated. ", "Gradually stir in the reserved mushroom and chicken stock liquid, scraping the bottom of the pan to lift the sediment and sticky juices. Add the mushrooms to the pan and stir in the parsley. Bring to a gentle simmer and cook for five minutes, or until the pheasant is just cooked through and the sauce has thickened, stirring regularly. Remove from the heat.", "Preheat the grill to its hottest setting. Boil a kettle of water and half fill a 1.6 litre/3lb 8oz shallow ovenproof dish. The hot water will warm the dish. Leave for two minutes and then carefully tip the water down the sink. Spoon the pheasant mixture into the dish.", "Spoon the mashed potato on top of the pheasant, working your way around the sides before heading into the middle. Put the pie on a baking tray and grill for 6-8 minutes, or until the potato is lightly browned. Drizzle the pie with the truffle oil, if using, and serve."]}, {"isVegetarian": false, "title": "Pheasant breast with cauliflower purée and roast garlic", "url": "www_bbc_co_uk_food_recipes_pheasantbreastwithca_79505", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["55ml/2fl oz olive oil ", "1kg/2lb chicken wings ", "2 shallots, peeled and finely sliced ", "2 bay leaves ", "75ml/2½fl oz Madeira", "75ml/2½fl oz white wine ", "1.5 litres/2 pints chicken stock ", "1 cauliflower, broken into florets ", "55g/2oz butter ", "2 shallots, peeled and finely sliced ", "4 tbsp double cream", "1 garlic bulb, cut in half", "olive oil, for drizzling", "4 pheasant breasts ", "fresh thyme sprigs"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "To make the sauce, heat the oil in a large saucepan. Add the chicken wings and cook over a high heat until coloured all over. ", "Pour off the excess oil and add the shallots and bay leaves and cook for two minutes.", "Add the Madeira and white wine, bring to the boil then reduce the heat and simmer until the liquid is reduced by half.", "Add the stock and bring back to the simmer for 1 hour, regularly skimming off any surface scum.", "Strain the sauce into a clean pan, return to the heat, bring back to the boil and skim again. ", "To make the cauliflower purée, chop the cauliflower florets into small pieces.", "Melt a little butter in a large pan over a medium heat. Add the shallots and cauliflower and sweat until soft but not coloured.", "Transfer the mixture to a food processor. Blend the mixture while adding the cream slowly, until a smooth purée is formed.", "Place the purée in a small pan and keep warm.", "Meanwhile, place the garlic bulb halves cut-side down in an ovenproof non-stick frying pan.  Drizzle over a little olive oil and place over a medium heat until the garlic begins to colour.", "Transfer to a hot oven and roast for 8-10 minutes.", "Meanwhile, heat an ovenproof frying pan. Add the pheasant breasts, flesh-side down and cook for one minute, or golden brown. Turn the pheasant breasts over and transfer the pan to the oven and roast for 5-6 minutes, or until cooked through. Remove the pheasant from the oven and leave to rest for 3-4 minutes.", "To serve, slice each pheasant breast and place on four individual serving plates. Garnish with the thyme sprigs and serve with the sauce, cauliflower purée and roast garlic."]}, {"isVegetarian": false, "title": "Pheasant casserole with celeriac and apple mash", "url": "www_bbc_co_uk_food_recipes_pheasantcasserolewit_2261", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["30g/1oz butter", "2 tbsp vegetable oil", "4 pheasant breasts", "1 red onion, peeled and sliced", "1 clove garlic, peeled and crushed", "125g/4oz smoked streaky bacon, derinded and chopped", "1-2 tbsp plain flour", "150ml/5fl oz dry cider", "450 mls /15fl oz chicken stock", "1 tbsp cider vinegar", "1 sprig thyme", "1 bay leaf", "500g floury potatoes, peeled and cubed", "2 Bramley apples, peeled, cored and chopped", "500g celeriac, peeled and cubes", "1 tbsp chopped fresh parsley", "2 tbsp sour cream", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the butter and the oil in a large saucepan and brown the pheasant breasts. Put on a plate.", "Add the onion, garlic and bacon and cook for 3-4 minutes until the onion starts to soften.", "Stir in the flour and cook for a minute. Add the cider, stock , vinegar, thyme and bay leaf. Season well. Bring to the boil and replace the pheasant pieces. Turn the heat down so the liquid bubbles gently and cover. Cook for 20-30 minutes until the pheasant is cooked and the sauce has thickened. Don't overcook or the meat will dry out.", "Meanwhile bring a large pan of salted water to the boil and add the potato, apple and celeriac cubes. Boil until tender, drain, add the parsley and sour cream and some ground black pepper. Mash until smooth. Serve with the pheasant casserole and a green salad."]}, {"isVegetarian": false, "title": "Pheasant pithiviers", "url": "www_bbc_co_uk_food_recipes_pheasantpithiviers_93490", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 whole pheasant, breasts and legs removed, carcass chopped and reserved", "10g/½oz sea salt preferably fleur de sel, plus extra for seasoning", "½ tbsp black peppercorns, crushed", "½ garlic clove, finely sliced", "½ fresh bay leaf, torn", "2 sprigs fresh thyme, leaves only", "1 juniper berry, crushed", "600g/1lb 5oz duck fat, plus 1 tbsp", "freshly ground black pepper", "150g/5oz onion, chopped into 2cm/1in pieces", "1 sprig fresh thyme, leaves only", "2 fresh sage leaves", "1 fresh bay leaf", "2 juniper berries, chopped", "120g/4oz flat mushrooms, sliced", "100g/3½oz cooked chestnuts, crumbled", "30g/1½oz dried cranberries", "30g/1½pz dried blueberries", "sea salt and freshly ground black pepper", "50-75ml/1¾fl oz-2½fl oz water", "800g/1lb 12oz ready-made all-butter puff pastry", "vegetable oil, for greasing", "2 free-range eggs, beaten ", "40g/1½oz duck fat", "pheasant carcass (see above)", "4 juniper berries, crushed", "110g/4oz white onion, sliced", "60g/2oz celery, sliced", "80g/3oz flat mushroom, sliced", "200ml/7fl oz Madeira wine", "200ml/7fl oz ruby port", "400ml/14fl oz water", "salt and freshly ground black pepper", "2g/¼oz arrowroot, mixed with a little cold water", "3 tbsp prunes, stones removed, finely sliced", "3 tbsp golden raisins", "3 tbsp walnuts, finely chopped"], "serves": "Serves 8", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the pithiviers, place the legs, skin side down into a large bowl. Sprinkle over the sea salt, crushed black peppercorns, sliced garlic, thyme leaves, bay leaf and crushed juniper berry. Lightly mix together, then cover the bowl and marinate in the fridge for 6 hours. This is a light curing to slightly season and flavour.", "After 6 hours, rinse the marinade off the leg meat and pat dry with a clean kitchen towel. ", "Place 600g/1lb 5oz of the duck fat into a small saucepan and heat to 80-90C/174-194F (check the temperature using a food thermometer) over a low heat. Add the pheasant legs and bring back to the same temperature. Gently cook for 1 hour and 30 minutes, checking often to make sure the temperature does not go above 90C/194F (the fat should be kept just under simmering point). This gentle cooking will slowly break down the firm collagen within the tissue of the muscle, changing the texture of the meat so it is melting. When the legs are cooked through, set aside and allow to cool in the fat. ", "Season the pheasant breasts with a little sea salt and freshly ground black pepper.", "Heat a frying pan until medium-hot, add the tablespoon of duck fat and fry the pheasant breasts, flesh side down, for 3-4 minutes, until golden-brown. Turn the breasts over, increase the heat and fry for 4-6 more minutes, or until the skin is golden-brown and crisp and the breasts are medium-rare. Remove from the heat and set the breasts aside to rest for a few minutes before finely chopping into small cubes. 6. Return the pan used to cook the pheasant breasts to the heat, add the onions and fry for about one minute, then add the thyme, sage, bay leaf, and juniper berries and cook for 3-4 minutes, or until the onions are softened and light golden-brown.", "Increase the heat to high, then add the mushrooms and fry for 2-3 minutes, or until golden-brown and any excess moisture in the pan has evaporated.", "Add the crumbled cooked chestnuts and mix well. Transfer the mixture to a large mixing bowl and stir in the dried cranberries and blueberries. Season, to taste, with sea salt and freshly ground black pepper and stir in the chopped pheasant breasts.", "De-glaze the pan with the water and stir into the pheasant mixture.. ", "Remove the cooled confit duck leg from the duck fat and place into a hot, dry frying pan. Turn the heat up and cook for 3-4 minutes on all sides, or until golden-brown and crisp all over. Remove from the pan and cool slightly before flaking the meat off the bone. Roughly chop the leg meat, then stir into the pheasant breast mixture. Cover the bowl with cling film and chill in the fridge until needed. ", "Meanwhile, roll out the puff pastry dough until it is 2mm thick. Cut out eight 10cm/4in discs and eight 14cm/5½in discs and place onto trays lined with parchment paper. Chill the pastry in the fridge for about five minutes.", "Grease a small bowl or cup that is no more than 8cm/3in in diameter and pack about 60g/2½oz of the filling into the base, pressing down firmly.", "Turn the filling out from the bowl or cup onto the centre of the smaller pastry disc. Brush the edges of the pastry disc with some of the beaten egg, then drape the larger pastry disc over the filling. Press around the filling with your fingers to seal, making sure there are no air pockets. Repeat the process with the remaining pastry and filling, placing each finished pithivier onto a tray lined with parchment paper. Chill in the fridge for 10-15 minutes. ", "Remove the pithiviers from the fridge and trim off any excess pastry using a 10cm/4in pastry cutter. Brush the pithiviers with the remaining beaten egg, then score the top with the back of a knife, creating half-moon patterns across the pastry. Chill in the fridge until ready to cook. ", "Preheat the oven to 200C/400F/Gas 6. Place a baking sheet in the oven to heat up.", "For the sauce, take the reserved pheasant carcass and chop into 3cm/1¼in pieces.", "Heat a large frying pan until hot, add the duck fat, pheasant carcass and juniper berries and fry for 4-5 minutes, or until the carcass is golden-brown all over. Transfer the pieces to a bowl. ", "Return the pan to the heat and fry the onion and celery for 3-4 minutes, or until light golden-brown. Add the mushrooms and cook for 1-2 minutes, then return the carcass pieces to the pan. ", "Pour in the Madeira , bring to the boil, add the port and reduce in volume by half.", "Add the cold water to the pan and bring to the boil, then reduce the heat and simmer for 20 minutes.The cold water will trap any impurities and force them to the surface as it comes to the boil.  Season, to taste, with salt and freshly ground black pepper. 20 minutes is just long enough to extract all the flavours from the carcass - any longer than this and it will start to stew and taste old.", "Pass the mixture through a fine sieve into a clean pan, pressing down well to extract as much sauce as possible. Bring the sieved sauce to a simmer, then add the diluted arrowroot to the pan and stir. Cook for 1-2 minutes, until the sauce thickens enough to coat the back of a spoon. ", "Slide the pithiviers onto the hot baking sheet and bake for 15-20 minutes, until the pastry is golden-brown and crisp. ", "For the garnish, heat a frying pan over a medium heat and lightly dry fry the prunes, raisins and walnuts for 2-3 minutes, shaking the pan frequently to prevent burning, until heated through.", "To serve, place a pithivier onto the centre of each serving plate. Using a small teaspoon, make a small hole in the centre of the pithivier. Spoon some of the sauce into the hole of each pithivier, and around the plate. Scatter the warm prunes, golden raisins and walnuts around."]}, {"isVegetarian": false, "title": "Pheasant suprême with wild mushroom compote", "url": "www_bbc_co_uk_food_recipes_pheasantsupremewithw_92589", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pheasantsupremewithw_92589_16x9.jpg", "ingredients": ["drizzle olive oil", "2 x 125g/4½oz pheasant breasts (or breasts of guinea fowl, duck, partridge, pigeon of the same weight)", "salt and freshly ground black pepper", "2 tbsp redcurrant jelly", "handful fresh flatleaf parsley or coriander, finely chopped", "20g/¾oz dried porcini (ceps) or dried mixed wild mushrooms, soaked for 30 minutes in warm water", "100g/3½oz fresh mushrooms (use wild mushrooms such as Chanterelles, Pied de Mouton and Girolles, or less expensive brown caps, oysters, shiitake, button, or a mixture of the above)", "2 tbsp olive oil", "1 small red onion, finely chopped", "2 cloves garlic, finely chopped", "salt and freshly ground black pepper", "3 ready-to-bake panini, baguettes, ciabatta or 1 large focaccia (approximately 18cm/7in x 30cm/12in or 30cm/12in diameter round, sliced through the middle)", "Fresh parsley, chopped", "cranberries or redcurrants, to garnish (optional)"], "serves": "Makes 20", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. ", "Heat an ovenproof griddle pan until very hot. Rub a little olive oil onto the pheasant (or other chosen bird) breasts and season with salt and freshly ground black pepper. ", "Place the breasts onto the griddle pan, at an angle to the ridges, and cook for one minute on each side. Transfer to the oven and roast for six minutes (three minutes if using small game birds such as partridge), or until cooked to your liking. Remove and leave to rest for five minutes. ", "Place the redcurrant jelly in a small pan and heat gently until melted. Brush over the pheasant or other bird and sprinkle over the chopped parsley or coriander. Leave to cool completely.", "Meanwhile, drain the soaked dried mushrooms and squeeze out any excess moisture (save the liquid and use it in this recipe to add flavour to stocks or sauces). Rinse the soaked mushrooms in fresh water, drain again and dry with paper towels, then finely chop.", "Wipe clean the fresh mushrooms and finely chop.", "Heat the olive oil in a non-stick, lidded pan over a low heat. Add the red onion and garlic and a pinch of salt. Cover with a lid and cook gently for 15 minutes. ", "Add the dried and fresh mushrooms to the pan and cook, covered, for a further ten minutes. Season, to taste, with salt and freshly ground black pepper. If there is too much liquid in the pan, remove the lid and boil down until all the liquid has evaporated. Remove from the heat and leave to cool.", "If using panini or baguettes, cut on the diagonal; for ciabatta or focaccia, split horizontally and use a 5cm/2in pastry cutter to cut out rounds of bread for the canapé bases. ", "Toast the bread on a very hot griddle pan. Alternatively place under a grill until toasted on both sides. Leave to cool.", "To serve, cut the breasts very thinly on the diagonal. Spread a little mushroom compote on the toasted bread slices and place 2-3 slices of breast meat on top. Garnish with chopped fresh herbs, cranberries or redcurrants, as you prefer."]}, {"isVegetarian": false, "title": "Pheasant kiev, crushed swede, hazelnut butter and smoky bacon cabbage", "url": "www_bbc_co_uk_food_recipes_pheaseant_kiev_crushed_76083", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 large pheasant, plucked and cleaned", "50g/1¾oz peeled and toasted hazelnuts, plus extra for garnish", "115g/4oz salted butter", "1 clove garlic, peeled", "25g/1oz plain flour", "2 eggs, beaten", "50g/1¾oz panko breadcrumbs", "2 tbsp rapeseed oil", "115g/4oz smoked pancetta or pancetta, in one piece with skin on", "1 large swede, peeled and cut into 2cm/¾in dice", "1 litre/1¾ pint white chicken stock", "1 small Savoy cabbage, outer leaves removed and retained, inner quartered", "1 Toulouse sausage", "1 head garlic ", "½ bunch fresh thyme", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Take the legs and breasts off the pheasant carcass and skin them, discarding the skin.", "Cut the drumstick flesh and sinews away from the drumstick bone and discard. Clean the bone down then turn the leg over and cut out the thigh bone. You will be left with a boneless thigh attached to a drumstick bone.", "To make the garlic butter, place the hazelnuts, 50g/1¾oz of the butter and the clove of garlic in a food processor and blend.", "Make a small incision into the underside of the breast and fill with the garlic butter, season well with salt and freshly ground black pepper then place the mini fillet over the top of the incision to seal.", "Place the leg on top with the bone toward the thinner end of the breast.", "Carefully pass the pheasant Kievs through the flour, then the eggs and then the breadcrumbs. Heat the rapeseed oil in an ovenproof frying pan, gently fry the Kievs until lightly coloured on one side then transfer to the oven for 12-15 minutes.", "Remove the skin from the pancetta and set aside, then thickly slice the pancetta.", "Meanwhile, place the swede, pancetta skin, 500ml/18fl oz of the chicken stock and the remaining butter into a pan, season lightly and bring to the boil. Simmer for 25-30 minutes and leave to cool slightly. ", "Strain, discarding the stock and pancetta skin, then return the swede to the pan and mash well.", "Place the quartered cabbage into an ovenproof dish, layer the Toulouse sausage and pancetta inside, add the garlic head, fresh thyme and season well with salt and freshly ground black pepper.", "Pour 500ml/18fl oz of the chicken stock over the top and cover with the outer cabbage leaves. Cover with a tightly fitting lid or tin foil and bring to the boil, then place into the oven for 45 minutes. ", "To serve, carve the sausage into thick slices and place onto the plate with a piece of pancetta. Set a piece of cabbage alongside then spoon some swede next to it. Place the cooked Kiev on top and a few crushed hazelnuts around. "]}, {"isVegetarian": false, "title": "Pheasant with mushroom, kale and figs", "url": "www_bbc_co_uk_food_recipes_phesant_with_mushroom_41689", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz caster sugar", "3 figs, halved", "100g/3½oz all-butter puff pastry", "300g/10½oz ripe black or green figs, whole", "25g/1oz butter, plus extra to finish", "2 tbsp port", "salt and freshly ground black pepper", "2 pheasant crowns", "500ml/18fl oz chicken stock", "2 thyme sprigs", "2 garlic cloves, crushed", "2 tbsp olive oil", "2 tbsp unsalted butter", "½ head kale", "2 tbsp unsalted butter", "200g/7oz mixed wild mushrooms, such as girolles, chanterelles and trompets", "gravy"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6.", "For the fig tart, put the caster sugar in a pan and bring to the boil. Cook until the sugar is melted and a deep caramel colour. (CAUTION: boiling sugar is extremely hot. Handle very carefully. Use a deep pan to avoid bubbling over.)", "Carefully pour the caramel into two holes of a silicone muffin mould and place the figs cut side down in the holes. Roll out the pastry to 1cm/½in thickness. Cut out circles that are slightly bigger than the muffin holes. Place the pastry over the top of the figs and tuck in the sides. Bake for 10-15 minutes until golden-brown. ", "For the fig purée, cut the figs in half and scoop out the flesh. Heat the butter in a pan until foaming and add the fig flesh. Add the port and cook for 10-15 minutes. Transfer to a blender and blend until smooth, then pass through a sieve. Finish with a little more butter and season with salt and pepper. Set aside and keep warm. ", "Remove the fig tarts from the oven and leave to rest before serving. Keep the oven on for the pheasant. ", "Place the pheasant crowns in a saucepan and add the stock, thyme and garlic. Poach for 6-8 minutes, then drain. Heat a frying pan and add the oil and butter. Add the crowns to the pan and fry until brown all over, then transfer to the oven for 2-3 minutes, or until cooked through.", "For the mushrooms and kale, bring a large saucepan of water to the boil and blanch the kale for 1-2 minutes. Drain and set aside. Heat a large frying pan and add the butter. When foaming, add the mushrooms and fry for 1-2 minutes before adding the kale. Stir well and season with salt and pepper.", "Place some fig purée on serving plates and top with the pheasant crowns. Put the fig tarts alongside and garnish with the mushrooms and kale. Pour over some gravy and serve. "]}, {"isVegetarian": false, "title": "Pheasant dumplings with squash broth and pumpkin oil", "url": "www_bbc_co_uk_food_recipes_phesant_dumplings_with_85842", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb minced pheasant meat", "50g/1¾oz oats", "8g salt", "8g white pepper", "6 sprigs thyme, leaves picked and chopped", "4 sage leaves, chopped", "1 free-range egg", "1 dash white wine", "1 pack wonton pastry squares", "1 tbsp cornflour mixed with cold water to make a thin paste", "250g/9oz butter", "2 kabocha or acorn squash, peeled and chopped into small cubes", "1 large banana shallot, chopped", "1 garlic clove, chopped", "pinch cayenne pepper", "500ml/18fl oz water or vegetable stock", "1 orange, finely grated zest and juice", "100g/3½oz pumpkin seeds", "100ml/3½fl oz virgin pumpkin seed oil", "1 orange"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the dumplings, mix all the ingredients, except the pastry and cornflour, together. Roll the mixture into balls weighing approximately 35g/1¼oz each.", "Lay one sheet of wonton pastry on a board and brush with the cornflour mixture. Place a pheasant ball on top and lay another pastry sheet over the top. Press down to seal and stick. Cut around the pheasant mixture using a pastry cutter to neaten the dumpling. Continue this process until you have used all the pheasant balls. Rest the dumplings in the fridge for at least an hour.", "For the broth, heat half the butter in a large saucepan. Very gently fry the squash, shallots and garlic until softened, but not coloured (this will take around 20-30 minutes).", "Add the cayenne pepper, stock or water, remaining butter and a little salt and cook for around 10 minutes over a medium heat until tender. Add the orange zest and juice. Pour into a blender, blitz and pass through a fine sieve. Season with salt and pepper. ", "Steam the dumplings in a steamer or in a colander over a pan of boiling water for around 7–8 minutes, or until the filling is cooked through and reads 65C on a cooking thermometer.", "Meanwhile, toast the pumpkin seeds in a dry pan until fragrant. ", "Divide the dumplings between deep, wide bowls and spoon over the squash broth. Garnish with the toasted seeds and pumpkin seed oil. Grate some fresh orange zest over and serve immediately."]}, {"isVegetarian": true, "title": "Piña colada Madeira cake", "url": "www_bbc_co_uk_food_recipes_pia_colada_madeira_cake_39645", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb self-raising flour", "60g/2¼oz desiccated coconut", "400g/14oz caster sugar ", "400g/14oz margarine, plus extra for greasing", "7 free-range eggs", "50ml/2fl oz milk", "200g/7oz butter, softened", "400g/14oz icing sugar, sifted", "2-3 tbsp coconut-flavoured rum, such as Malibu"], "serves": "Makes 1", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 150C/300F/Gas 2.", "For the Madeira cake, grease and line a 20cm/8in square or 23cm/9in round cake tin with margarine and greaseproof paper.", "Place the all the cake ingredients into large bowl. Using an electric hand-mixer, bring all the ingredients together on the slowest setting.", "Once the ingredients are combined, increase the speed and mix for one minute.", "Spoon the mixture into the prepared tin and smooth the top to make it level.", "Bake in the middle of the oven for one hour 45 minutes to two hours. The cake should be springy to touch and golden-brown in colour.", "Leave to cool in the tin for five minutes, remove and transfer to a wire rack.", "For the buttercream, beat the butter in a bowl until soft. Gradually add the icing sugar and mix until incorporated. Stir in the coconut-flavoured rum.", "Slice the cooled cake horizontally to create three layers. Sandwich these together with the buttercream. Serve in slices."]}, {"isVegetarian": true, "title": "Piccalilli", "url": "www_bbc_co_uk_food_recipes_piccalilli_13702", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/piccalilli_13702_16x9.jpg", "ingredients": ["450g/1lb each pickling onions, peeled, cauliflower florets and de-seeded cucumber and topped and tailed French beans", "340g/12oz coarse rock salt", "750ml/1¼ pint white malt vinegar", "1 tbsp each English mustard powder, ground ginger and ground turmeric", "1 tbsp whole yellow mustard seeds", "2 cloves garlic, chopped", "175g/6oz light muscovado sugar", "2-3 tbsp cornflour", "warm large sterilised jam jars with screw tops - prepare jars by washing in hot soapy water and leaving to dry and warm in a cool oven - 130C/250F/Gas ½ for 10-15 minutes."], "serves": "Makes 3-4 x 450g/1 lb jars", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Put the vegetables into a non-metallic bowl. Sprinkle the salt over the top, toss together, cover and leave in a cool place for 12 hours.", "The next day put the vinegar into a large saucepan or preserving pan, add the spices and bring to the boil.", "Drain the vegetables and rinse well under running water for 3-5 minutes. Add to the simmering vinegar, cook over a low heat for 20-25 minutes or until the vegetables are tender. Add the sugar and continue to simmer for a further 1-2 minutes.", "Mix 2 tbsp of cornflour with a little water and blend into the hot vegetables. Bring back to the boil and cook for a further minute, the mixture should be glossy and thick. Add the remaining cornflour in the same way if necessary.", "Remove the piccalilli from the heat and leave to cool for 15 minutes. Spoon into the hot jars and cover with a disc of wax paper and a screw top lid, wipe the jars and label. Store in a cool dark place for 3-4 weeks before eating."]}, {"isVegetarian": true, "title": "Piccalilli with curry spices", "url": "www_bbc_co_uk_food_recipes_piccalilli_7718", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb small pickling onions, peeled", "450g/1lb cauliflower florets", "450g/1lb runner beans, trimmed and finely sliced", "450g/1lb cucumber, seeded and cut into 1cm/½in dice", "450g/1lb pumpkin, peeled, seeded and cut into 1cm/½in dice", "450g/1lb courgette or marrow, cut into 1cm/½in dice", "450g/1lb salt", "30g/1oz mustard", "30g/1oz ground ginger", "30g/1oz curry powder - mild or hot according to taste", "15g/½oz ground turmeric", "30g/1oz black peppercorns", "1l/1¾pt malt vinegar", "30g/1oz cornflour"], "serves": "6-8 jars", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Put all the vegetables into a large bowl and mix together with the salt. Cover and leave overnight.", "Drain and rinse the vegetables under running cold water. Dry.", "Put ¾ of the vinegar in a large preserving pan and add the spices and vegetables. Bring to the boil and simmer until just tender.", "Mix the cornflour with the rest of the vinegar and add to the pan. Mix together and simmer for 5 minutes.", "Turn into hot sterilised jars, seal and cool.", "Store for three months in a cool, dark cupboard before eating."]}, {"isVegetarian": true, "title": "Pici cacio e pepe", "url": "www_bbc_co_uk_food_recipes_pici_cacio_e_pepe_16342", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["375g/13oz white bread flour ", "1 tbsp olive oil ", "pinch fine salt ", "325g/11½oz butter\u2028", "4 tbsp freshly ground black pepper ", "200g/7oz Parmesan (or other vegetarian hard cheese), finely grated\u2028", "1 tsp lemon juice ", "½ pink grapefruit, segmented, each segment halved", "3 handfuls lamb’s lettuce", "splash red wine vinegar", "splash olive oil", "4 tsp salted ricotta cheese, coarsley grated", "salt"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["To make the pasta dough, add the flour to a mixing bowl and make a well in the middle. Mix the olive oil, salt and 185ml/6fl oz cold water together and pour into the middle of the flour.  Start incorporating the flour into the liquid until a dough starts to form. Turn the dough out onto a clean surface and knead until smooth. Shape the dough into a rectangle, wrap in cling film and leave to rest somewhere cool for at least 30 minutes. ", "To make the pici, cut the dough into 15g/½oz strips (weigh one to check and use as a guide) and keep covered with a damp tea towel. ", "On a clean, dry work surface start rolling each strip outwards, with both palms of your hands, applying pressure evenly and pushing out, until you have a noodle the same thickness as a biro. Repeat until all the dough is used up. ", "To make the pici cacio e pepe, bring a large saucepan of heavily salted water to the boil. Cook the pici for 5–6 minutes. ", "Meanwhile, place a saucepan over a medium heat.  Add the butter, black pepper and a splash of pici cooking water. Turn down to a low heat and cook until emulsified. ", "When the pasta is cooked, use tongs to transfer it from the water to the emulsifed butter, reserving the pasta water. ", "Add the Parmesan and, without stirring, leave to sit and melt from the residual heat of the pan (this prevents it from becoming chewy little cheesy balls). ", "Put the grapefruit, lamb’s lettuce, red wine vinegar and olive oil in a mixing bowl and toss together. Season with a pinch of salt. Distribute evenly between four plates and sprinkle the salted ricotta on top.", "Once the Parmesan has melted into the pici, stir the sauce and pasta together to incorporate. Season with salt if needed and serve immediately alongside the pink grapefruit, and ricotta salad. "]}, {"isVegetarian": false, "title": "Pici verde with roast tomatoes and paprika meatballs", "url": "www_bbc_co_uk_food_recipes_pici_verde_with_roast_30260", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz spinach, washed well ", "300–350g/10½–12oz Italian '00' flour (strong white flour)", "1 tbsp olive oil, plus extra", "1 onion, finely chopped", "2 garlic cloves, finely chopped ", "300g/10½oz minced beef", "300g/10½oz minced pork", "100g/3½oz soft white breadcrumbs", "50ml/2fl oz soured cream or crème fraîche", "2 tsp sweet smoked paprika", "1 tsp hot smoked paprika (or to taste)", "1 tsp dried oregano", "2 tbsp finely chopped parsley", "1 free-range egg ", "salt and freshly ground black pepper", "400g/14oz cherry tomatoes, halved", "salt, to taste", "sprig thyme, leaves only", "2 garlic cloves, finely sliced", "2-3 tbsp olive oil", "fresh basil leaves", "grated parmesan"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["To make the pasta, shake off any excess water from the spinach and put into a food processor with 300g/10½oz of the flour. Blend together until the spinach has completely broken down and formed a dough. You may need to push everything down the sides once or twice. Check the dough – if it is very sticky (this will depend on how wet your spinach is), add more flour. The best texture is soft and very slightly tacky.", "Roll out the pasta. Do this by pulling off small balls (around the size of a large marble). Start off by rolling between your hands then laying out on a work surface and rolling lightly with both hands, moving from the centre outwards. If it is very sticky, dust your hands with a little flour, but try not to use too much as it makes the pasta much harder to roll – it will slide away from you. ", "The pasta can be cooked right away, in a large pan of boiling, salted water, or it can be dried out. If you are cooking from fresh, it will take five minutes; if it is dry, it will take 8-10 minutes.", "For the meatballs, heat the olive oil in a frying pan and add the onion. Cook on a medium to low heat until very soft and translucent, then add the garlic and continue to cook for another minute or two. Remove from the heat and cool.", "Put the beef and pork in a large bowl with the breadcrumbs, soured cream (or crème fraîche), two types of paprika, herbs and egg. Add the onion and garlic and season very generously. Mix thoroughly. ", "Take a small amount of the mixture and fry it. When it is cooked, taste for seasoning and adjust accordingly – meatball mixture often needs more salt than you think. Form the mixture into 20 balls. ", "To cook, either preheat the oven to 200C/180C Fan/Gas 6 and bake for 18-20 minutes, turning them over halfway through, until well browned and piping hot in the centre. Or heat some oil in a large frying pan and cook them in two batches, turning regularly.", "For the roast tomatoes, lay the tomatoes in a roasting tin or ceramic ovenproof dish, cut-side up. Sprinkle with salt, thyme leaves, garlic and the olive oil, then roast for around 10 minutes, or until well softened and very slightly browned round the edges. ", "Serve the meatballs and tomatoes with all the pan juices over the pasta, garnished with plenty of basil and grated parmesan."]}, {"isVegetarian": true, "title": "Pici", "url": "www_bbc_co_uk_food_recipes_piciallebriciole_82363", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz strong flour, plus extra for dusting", "pinch of salt", "1 large free-range egg", "125ml/4½floz water", "6 tbsp extra virgin olive oil, plus extra to drizzle", "2 large cloves garlic, finely chopped ", "200g/7oz stale, dried white breadcrumbs", "1 tsp salt, plus extra to taste ", "pinch freshly ground black pepper", "1 bunch flatleaf parsley, trimmed and coarsely chopped ", "100g/3½oz grated parmesan (or a vegetarian alternative), plus extra to serve"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["First make the fresh pici. Mix the flour and salt in a large bowl, then pour onto a pastry board or other work surface. Make a well with your fingers in the centre. Crack the egg into this well. Gradually mix the flour and egg, adding water a little at a time until the dough is firm but flexible. You may not need to use all of the water.", "Knead the dough until well blended and it springs back to the touch. ", "Lightly dust a rolling pin with flour, and roll out the dough until it is about ½-1cm/¼-½in thick. Leave for 20 minutes to rest. ", "Cut the dough into 1cm/½in wide strips with a sharp knife. Hand-roll the strips into thick, spaghetti-like strands. These should be about 3mm/eighth inch wide.", "To cook the pici, bring a large saucepan of salted water to the boil. Add the pici and cook for about 10-12 minutes. The exact cooking time will depend on the width of the strands.", "Meanwhile, make the sauce. Heat the olive oil in a large saucepan. Add the garlic and allow it to flavour the oil. Add the breadcrumbs and the salt and freshly ground black pepper. Sauté for 2-5 minutes, stirring frequently, until the breadcrumbs are golden brown", "Drain the pici and add to the breadcrumb mixture. Add the parsley and parmesan and toss to mix.", "Divide the mixture between individual pasta bowls. If you like, add extra grated parmesan or olive oil to serve."]}, {"isVegetarian": true, "title": "Pickled eggs", "url": "www_bbc_co_uk_food_recipes_pickled_eggs_79282", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 large free-range eggs", "350ml/12fl oz cider vinegar", "1 tbsp salt", "1 tbsp sugar", "1 tsp chilli flakes or a few dried chillies (optional)"], "serves": "Makes 6 pickled eggs", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["First sterilise a jar large enough to hold all six eggs. Either run it through the hottest setting in your dishwasher, or wash in plenty of hot, soapy water, rinse thoroughly, then put in a low oven to dry out completely.", "Bring a saucepan of water to the boil, then gently lower in the eggs. Boil for 7 minutes exactly, then remove from the heat, strain, and run under cold water to stop them cooking. When they are cool enough to handle, peel carefully.", "Put the cider vinegar in a saucepan with 150ml/5fl oz water, salt and sugar. Slowly bring to the boil, stirring to dissolve the sugar, then simmer for 5 minutes. If using the chilli, add this at the last minute.", "Pack the eggs into the jar, then pour over the vinegar mixture. Seal and leave to cool completely. Leave for at least 2 weeks before eating, preferably a month, then store in the fridge once opened."]}, {"isVegetarian": false, "title": "Pickled mackerel with warm potato and radish salad", "url": "www_bbc_co_uk_food_recipes_pickled_mackerel_with_47640", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 large pinches coriander seeds", "120ml/4fl oz white balsamic vinegar", "120ml/4fl oz white wine vinegar", "4 tbsp light soft brown sugar", "4 whole mackerel (about 250g/9oz each), filleted and lightly scored", "1 tbsp sea salt flakes, plus extra for seasoning", "1 small red onion, thinly sliced", "2 fresh coriander sprigs, plus 2 tbsp chopped fresh coriander leaves", "1 garlic clove", "300g/10½oz small new potatoes, such as Charlotte or Pink Fir Apple, scrubbed", "1 tbsp natural Greek-style yoghurt", "1 lime, finely grated zest and juice ", "8 large radishes, thinly sliced", "1 spring onion, thinly sliced diagonally", "freshly ground black pepper", "2 tbsp Dijon mustard", "2 tbsp white balsamic vinegar", "4 tbsp olive oil or sunflower oil", "4 tbsp extra virgin olive oil or sunflower oil", "2 egg yolks", "1 tbsp French mustard", "few drops of lemon juice", "150ml/5fl oz sunflower oil or grapeseed oil"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the salad, heat a frying pan over a medium heat. Add the coriander seeds and toast for 1 minute, shaking them occasionally, until aromatic. Tip them on to a plate and lightly crush using a knife blade. ", "Pour both vinegars into a small saucepan, add the sugar and cook over a medium heat for 2-3 minutes, or until the sugar is dissolved, stirring occasionally. Remove from the heat and stir in the coriander seeds, then leave until cold.", "Put the mackerel fillets in a shallow, non-metallic dish, skin-side-down, and sprinkle with the salt. Pour over the vinegar mixture and top with three-quarters of the red onion. Cover with cling film and marinate in the refrigerator for 6 hours, or until pickled, turning the fish over halfway through.", "Just before the mackerel is ready, fill a saucepan one-third full with water, place a steamer on top and bring to a simmer. Put the remaining red onion, the coriander sprigs and garlic in the water. Put the potatoes in the steamer, cover and cook for 12-18 minutes, or until just tender. Turn the heat off and steam them in the residual heat for a further 5 minutes, then leave to cool.", "For the French dressing, whisk the Dijon mustard, vinegar and 2 tablespoons of water together in a small bowl. Whisk in both olive oils until thick and glossy. Season with salt and pepper.", "For the mayonnaise, beat the egg yolks and French mustard together in a large bowl. Add a few drops of lemon juice and season with salt and pepper. Drizzle in the oil a little at a time, whisking continuously with a hand-held electric whisk, until thickened.", "Whisk together 3 tablespoons of the French dressing, 2 tablespoons of the mayonnaise and the yoghurt in a bowl. Stir in the lime zest and juice and season with salt and pepper. ", "Cut the potatoes into 5mm/¼in slices and put them in a large salad bowl. Add the radishes and chopped coriander leaves, then drizzle with the dressing and toss gently. Scatter over the spring onion. Lift the mackerel out of the pickling liquor and put it on serving plates. Scatter over some pickled red onion and serve with the potato salad."]}, {"isVegetarian": false, "title": "Pickled mackerel with tomatoes and sourdough", "url": "www_bbc_co_uk_food_recipes_pickled_mackerel_with_50047", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 fillets line-caught mackerel, bone in", "25g/1oz sea salt, plus extra for sprinkling", "200ml/7fl oz rice wine vinegar", "300ml/10fl oz extra virgin rapeseed oil, plus extra for drizzling", "50g/1¾oz chardonnay vinegar", "1 loaf sourdough", "16 cherry tomatoes, on the vine", "100g/3½oz salted butter", "2 thyme sprigs", "4 mixed heritage tomatoes, cut into wedges", "wild samphire, preferably English, tips only, to serve", "1 yellow chicory, to serve"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Lightly salt the flesh side of the mackerel fillets and leave to marinade for about 2 hours before using. ", "Put the mackerel fillets into a shallow tray, skin-side down. Pour over the rice vinegar until it’s about halfway up the mackerel. Allow to sit for 2 minutes then carefully remove the membrane around the skin. Place the fillets back into the vinegar, flesh side down for another 1–2 minutes. Remove from the vinegar and carefully cut out the bones.", "Mix together 200ml/7fl oil with the chardonnay vinegar in a small jar. Put the mackerel on a serving plate and drizzle with the rapeseed and vinegar dressing.", "Preheat oven to 150C/170C Fan/Gas 2.", "Put the sourdough slices onto baking sheets, drizzle with some oil and sprinkle with a little sea salt. Bake for 3–4 minutes until golden brown. Set aside.", "Blanch the cherry tomatoes in boiling water for 10 seconds and carefully remove the skins.", "Place half the tomatoes in a saucepan with the butter, thyme and some of the vines and warm very gently for a couple of minutes. ", "Place the other half of the tomatoes into a bowl and dress with the rapeseed dressing. Refrigerate any remaining dressing to use on other dishes.", "Blow torch the tomato wedges until caramelised and sprinkle with with sea salt.", "Place the mackerel between 4 plates, arrange the tomatoes around the fish and finish with the samphire, chicory and crispy sourdough."]}, {"isVegetarian": true, "title": "Pickled mushrooms", "url": "www_bbc_co_uk_food_recipes_pickled_mushrooms_45080", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 litre/1¾ pints white wine vinegar", "1 tsp salt", "1 tsp sugar", "2 garlic cloves", "olive oil", "½ tsp black peppercorns", "1 bay leaf", "1 kg/2lb 4oz wild mushrooms, cleaned and roughly chopped"], "serves": "Makes 1 x 1litre/1¾ pints jar", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Place all of the ingredients except the mushrooms into a saucepan and add 500ml/18fl oz water. ", "Bring to the boil and add the mushrooms. Cook for 12-15 minutes, or until cooked through.", "Remove the mushrooms from the pan with a slotted spoon and set aside to dry on a clean tea towel for 3-4 hours, or until completely dry.", "Pour some olive oil into a 1 litre/1¾ pints sterilised jar, add the mushrooms, then cover with more olive oil. Stir together gently until all of the mushrooms are coated in the olive oil. Cover tightly with a sterilised lid.", "The mushrooms will keep for two months unopened. Use within 3-4 days once opened. "]}, {"isVegetarian": true, "title": "Pickled courgette and blue cheese salad", "url": "www_bbc_co_uk_food_recipes_pickledcourgetteandb_81263", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tsp olive oil", "1 tsp white wine vinegar", "½ courgette, cut into thin strips with a vegetable peeler", "½ red onion, finely sliced", "salt and freshly ground black pepper", "1 tsp finely chopped fresh flatleaf parsley", "25g/1oz blue cheese, crumbled"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the olive oil and white wine vinegar into a large bowl and whisk together.", "Add the courgette ribbons and red onion. Toss to coat in the dressing and season, to taste, with salt and freshly ground black pepper.", "To serve, place the salad in the centre of a plate and sprinkle over the parsley and blue cheese."]}, {"isVegetarian": true, "title": "Pickled cucumber", "url": "www_bbc_co_uk_food_recipes_pickledcucumber_11033", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pickledcucumber_11033_16x9.jpg", "ingredients": ["1 whole cucumber, peeled", "1 tsp salt", "60ml/2fl oz white vinegar ", "50g/2oz sugar ", "7.5cm/3in fresh root ginger", "4 stem ginger in sugar syrup"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 120, "preparationMins": 120}, "recommendations": 0, "method": ["Use a fork to run through the surface of the cucumber, vertically downwards, to obtain a fluted pattern when sliced.", "Cut cucumber into thin slices and put into a large bowl, sprinkle with salt and mix well. Leave the cucumber for 10 minutes to absorb the salt then rinse with cold water. Drain off excess liquid in a colander. Return cucumber to the large bowl.", "Grate the fresh root ginger. Cut the stem ginger into thin slices.", "Combine sugar, vinegar and the two types of ginger together. Add to cucumber slices and mix well. ", "Decant into a plastic container. Refrigerate overnight or for a few hours before serving. "]}, {"isVegetarian": false, "title": "Pickled French beans with mackerel, bacon and Taleggio jacket potato", "url": "www_bbc_co_uk_food_recipes_pickledfrenchbeanswi_85427", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "5 shallots, finely sliced ", "2 sprigs fresh thyme, leaves only", "1 bay leaf ", "2 garlic cloves, peeled and crushed", "2.5cm/1in piece ginger, peeled, finely chopped ", "2 tsp pink peppercorns, crushed", "450ml/16fl oz white wine vinegar", "500g/1lb 2oz French beans, tops trimmed", "75g/3oz sugar", "4 baking potatoes", "8 rashers smoked streaky bacon, cut into strips or lardons", "4 small smoked mackerel fillets, skinned, boned and broken up into flakes", "4 tbsp crème fraîche", "salt and freshly ground black pepper ", "300g Taleggio cheese, cut into four equal slices"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the beans, place a heavy-bottomed saucepan onto a medium heat and add the olive oil, shallots, thyme leaves, bay leaf, garlic, ginger and peppercorns. Gently fry for 2-3 minutes, until the shallots are soft but not coloured.", "Add the vinegar to the pan and swirl to combine. Remove from the heat and allow to cool.", "Meanwhile, bring a pan of lightly salted water to the boil and blanch the beans for two minutes. Drain and refresh the beans in cold water.", "Place the beans into a large bowl and sprinkle with the sugar, tossing gently to coat. Pour the cooled vinegar mixture over the beans and set aside.", "For the jacket potatoes, preheat the oven to 200C/400F/Gas 6.", "Pierce the baking potatoes several times all over with a sharp knife, then place into the oven to bake for one hour, or until crisp on the outside, but tender when pierced with a knife. Remove from the oven and allow to cool slightly.", "Preheat the grill to its highest setting.", "Meanwhile, heat a frying pan until hot. Add the bacon strips and fry, stirring occasionally for 3-4 minutes until golden and crisp. Remove the bacon from the fat with a slotted spoon and set aside to drain on kitchen paper.", "When the potatoes are cool, place them onto a board and slice the tops off. Using a spoon, scoop out all of the potato flesh from the skins and place the flesh into a clean bowl.", "Mash the potato flesh until smooth, then add the cooked bacon, flaked mackerel and crème fraîche. Season, to taste, with salt and freshly ground black pepper.", "Carefully spoon the potato mixture back into the potato skins and place onto a baking sheet. Top each potato with a piece of Taleggio and place under the grill to cook until the cheese is golden and bubbling.", "To serve, place the jacket potatoes onto four plates and place a spoonful of the pickled beans alongside."]}, {"isVegetarian": true, "title": "Pickled tomatoes", "url": "www_bbc_co_uk_food_recipes_pickled_tomatoes_56805", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250ml/9fl oz malt vinegar", "250ml/9fl oz red wine vinegar", "5 tbsp golden caster sugar", "3 tbsp sea salt", "20 assorted cherry or small tomatoes", "4 garlic cloves", "2 large sprigs rosemary", "1 bay leaf", "1 tbsp coriander seeds", "1 tbsp black peppercorns"], "serves": "Makes 1 litre/1¾ pint", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the pickling liquid, in a pan bring all of the pickling liquid ingredients to the boil and leave to simmer on a low heat.", "Sterilise both a 1 litre/1¾ pint pickling jar with a screw top lid and the lid in a large pot of boiling water that boils for at least 10 minutes. (Or use several smaller jars with lids.) Lift the jars out of their water bath with a pair of jar tongs. Empty the water. ", "Alternatively they can be sterilised in a dishwasher. ", "For the pickle, quickly fill the jars with the tomatoes, herbs and spices.", "Using a jug or a funnel pour the hot pickling liquid into the jar, pour it all the way to the top and seal, ensuring as little air as possible remains in the jar.", "The pickle will keep for up to a year. ", "Keep refrigerated once opened and finish within two weeks."]}, {"isVegetarian": false, "title": "Pickled scotch eggs", "url": "www_bbc_co_uk_food_recipes_pickled_scotch_eggs_68143", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 pickled eggs", "2 tbsp celery salt", "60g/2oz plain flour, seasoned with salt and pepper", "600g/1lb 5oz Cumberland sausages, sausagemeat removed from the skins", "100g/3½oz Japanese panko breadcrumbs", "1 x 30g packet cheese and onion crisps, crushed", "2 free-range eggs, beaten", "vegetable oil, for deep-frying"], "serves": "Makes 6 scotch eggs", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Take a pickled egg and roll it in celery salt, then seasoned flour. ", "Divide the sausagemeat into six portions. Roll each portion into a patty big enough to wrap around an egg. Wrap the sausagemeat around the eggs and roll into a ball shape. ", "Mix the breadcrumbs with the crisps. Dust the sausage-coated egg in flour, dip in beaten egg and then roll in the breadcrumb mixture. ", "Heat the oil in a deep-fat fryer or a deep-sided, heavy-bottomed pan to 160C, or until a breadcrumb sizzles and turns golden-brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not over-fill the pan or leave unattended).", "Fry the eggs for about 8-10 minutes until golden-brown. Alternatively, shallow fry, turning occasionally, until cooked through. "]}, {"isVegetarian": true, "title": "Pickled onions", "url": "www_bbc_co_uk_food_recipes_pickledonions_7719", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2¼lb small pickling onions or shallots, peeled", "30g/1oz salt", "1 tsp dried chilli flakes", "1l/1¾pt malt vinegar", "180g/6oz granulated sugar"], "serves": "Makes 1 large jar", "time": {"preparation": "overnight", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 10, "preparationMins": 0}, "recommendations": 0, "method": ["Put the onions in a large bowl with the salt and mix together. Cover and leave overnight.", "Rinse well in cold water and allow to dry as much as possible.", "Pack the onions into sterilised jars.", "Put the vinegar, chilli flakes and sugar into a pan and slowly bring to the boil to dissolve the sugar.", "Pour the vinegar over the onions and seal the jars.", "Store in a cool, dark cupboard for two weeks before eating."]}, {"isVegetarian": true, "title": "Pickled pears", "url": "www_bbc_co_uk_food_recipes_pickledpears_93088", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 litre/1¾ pints white wine vinegar", "0.5 litres/17½fl oz water", "500g/1lb 2oz caster sugar", "3 star anise ", "1 large cinnamon stick, broken into three pieces", "1 tbsp allspice berries", "1 lemon, zest peeled off in large strips using a potato peeler", "½ tsp cloves", "2 tsp juniper berries", "20 Conference pears, peeled, stalks intact", "2 sprigs fresh rosemary"], "serves": "Makes 2 x 1.5 litre jars", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Bring the water, vinegar, sugar, star anise, cinnamon sticks, allspice berries, lemon zest, cloves and juniper berries to the boil in a large, lidded, non-reactive pan. ", "Add the pears, then cover the pan with a lid and reduce the heat until the mixture is gently simmering. Simmer for 10-15 minutes, or until the pears are tender. Remove the pears from the poaching liquid using a slotted spoon and set aside.", "Return the poaching liquid to the boil and boil for 4-5 minutes, or until the volume of liquid has reduced and thickened.", "Divide the poached pears between two 1.5 litre/2 pints 13fl oz sterilised airtight jars. Pour half of the reduced cooking liquid into each jar, making sure the spices are evenly distributed between each jar. Add one sprig of rosemary to each jar. Seal the jars tightly. The pickled pears can be stored for up two months, but can be eaten after one week. Once opened, store in the fridge and eat within two weeks."]}, {"isVegetarian": false, "title": "Pickled salmon with greens", "url": "www_bbc_co_uk_food_recipes_pickledsalmonwithgre_91478", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250ml/9fl oz white wine vinegar", "75g/2¾oz caster sugar (optional)", "3 garlic cloves, finely sliced", "2 tsp ground coriander", "2 tsp ground cumin", "1 tsp ground turmeric", "12 whole white peppercorns", "1 bay leaf", "2 red onions, very finely sliced", "6 x 100g/3½oz salmon fillets, skin removed", "1 courgette, cut into batons", "100g/3½oz fresh broad beans, out of their pods ", "100g/3½oz fresh butter beans, out of their pods", "100g/3½oz cherry tomatoes, halved", "small handful mustard cress, to serve"], "serves": "Serves 6", "time": {"preparation": "over 2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["Bring the white wine vinegar, sugar, garlic, spices, peppercorns, bay leaf and onion to the boil in a large non-reactive pan. Reduce the heat to a simmer and simmer the mixture for 4-5 minutes. ", "Remove the pan from the heat, then add the salmon fillets and courgette batons and stir to coat them in the marinade mixture. Set aside until completely cooled. Cover the pan and chill in the fridge for 1½-2 hours.", "When the pickled salmon has chilled and marinated, mix together the broad beans, butter beans and cherry tomato halves in a bowl. Pour over a little of the chilled marinade liquid, to taste, and stir well to combine. ", "To serve, divide the dressed beans and tomato mixture equally among six serving plates. Place one pickled salmon fillet on top of each. Spoon over some of the marinated onion, garlic and courgette pieces. Drizzle some of the remaining marinade liquid around the edge of each plate. Sprinkle over the mustard cress."]}, {"isVegetarian": true, "title": "Pickled shallots", "url": "www_bbc_co_uk_food_recipes_pickledshallots_13699", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz rock salt", "2 litre/3½ pint water", "1.35kg/3lb shallots, peeled and trimmed", "2 litre /3½ pint white wine vinegar", "1 tbsp each allspice berries, juniper berries, black peppercorns and mustard seeds", "2 bay leaves", "170g/6oz light muscovado sugar", "large sterilised jars with screw top lids - prepare jars by washing in hot soapy water and leaving to dry and warm in a cool oven - 130C/250F/Gas ½ for 10-15 minutes."], "serves": "Makes 2x450g/1 lb jars", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Put the salt and water into a large saucepan, dissolve over a low heat and then leave the brine to cool.", "Put the prepared shallots into the brine, weight down with a plate and leave in a cool place for 24 hours.", "The next day put the vinegar and all the spices and sugar into a saucepan, bring to the boil and leave to infuse and cool.", "Drain the shallots and carefully pack into the jars. Pour over the infused vinegar and the spices. Cover the jars with a screw top lid and leave in a cool dark place for 3-4 weeks before eating."]}, {"isVegetarian": true, "title": "Picnic basket pie", "url": "www_bbc_co_uk_food_recipes_picnic_basket_pie_50454", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["600g/1lb 5oz plain flour", "300g/10½oz unsalted butter, at room temperature but not soft", "salt", "½ tsp baking powder", "50ml/2fl oz milk, to brush", "1 free-range egg, beaten, to glaze", "2 tbsp sunflower oil", "2 medium red onions, chopped", "2 garlic cloves, in whole cloves, skin on, lightly crushed under fork", "3 Romano red peppers, chopped", "1 large courgette, chopped", "1 aubergine, chopped into 1cm/½in cubes", "salt and freshly ground black pepper", "100g/3½oz couscous", "90g/3¼oz sun-dried tomato paste", "250g/9oz halloumi", "100g/3½oz mozzarella, grated", "small bunch fresh oregano", "small bunch fresh basil", "100g/3½oz caster sugar"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the pastry, rub the butter into the flour using your hands until it resembles fine breadcrumbs. Add 150ml/5fl oz water and bring the mixture together to form a dough (be careful not to overwork it).  Wrap the dough in cling film and leave to rest in the fridge while you prepare the filling.", "For the roasted vegetables, lightly oil a roasting tray with sunflower oil, and arrange the onions, garlic, peppers, courgette and aubergine on the tray. Toss to coat the vegetables in oil.", "Roast for 30-40 minutes, or until the vegetables are tender. Season with salt and freshly ground black pepper. Set aside to cool.", "For the filling, put the couscous in a bowl and add enough boiling water to just cover it. Cover the bowl and let it stand for 5-10 minutes. ", "When the water has been absorbed, use a hand-held blender to blend half of the couscous with the sun-dried tomato paste. Combine with the unblended couscous. Season with salt and pepper and set aside in the fridge.", "Slice the halloumi, pat dry with kitchen paper and dry-fry until brown spots appear.  Flip it over and fry the other side in the same way. Leave to cool. ", "To make the pastry basket, divide the pastry dough into four portions: 350g/12oz for the case, 300g/10½oz for the lattice 'basket', 150g/5½oz for the lattice lid, and 100g/3½oz for the handle and other extras.", "Roll out the pastry dough for the lattice to about 3mm thick, keeping the pastry cold (return it to the fridge for five minutes to chill if required).", "Cut five strips 2cm/1in wide. The strips need to be long enough to go down one side of the tin, across the width of the base and up other side of tin, leaving a slight overhang each side.  The strips will be about 25-30cm/10-12in long (depending on the size of the tin). ", "Lay the strips inside the tin - spacing the strips evenly along the length of the tin.", "Cut four strips also 2cm/1in wide and the same length as the tin (two strips for each long side of the tin). Place one strip flush with the tin's base and the other about two-thirds of the way up.  Weave the strips in an out of the vertical strips to make a lattice.  Where the strips overlap, brush with a little water or milk and press into place.", "Freeze the tin with the lattice inside.", "Meanwhile, roll out the pastry for the case into a rectangle big enough to line the base and sides of the tin. Transfer the pastry rolled pastry to the fridge to rest.", "Make a rectangular lattice for the hamper lid, cutting long strips of pastry, and interweaving them (it's best to do this on a baking tray lined with greaseproof paper). Leave small gaps between rows so there are holes in the lid where any steam can escape during cooking.  Rest the pastry in the fridge.", "Make a basket handle and two buckles out of the remaining pastry (you can mould the handle over a piece of scrunched up tin foil).  Transfer to the fridge to rest.", "Brush the inside of the frozen lattice with milk and line it with the rolled pastry case, pressing lightly to stick the case to the lattice. Rest it in the fridge for 15 minutes.", "Preheat the oven to 200C/400F/Gas 6.", "Remove the garlic cloves from the cooled roasted vegetables and discard.", "To fill the pie, lay half of the couscous on the bottom (this will soak up any liquid) and pack it firmly by pressing it down. Layer the vegetables, halloumi and grated mozzarella on top. Sprinkle over the oregano and basil. Top with the remaining couscous, again pressing down.  Make sure all layers are tightly packed.", "Brush the edges of the pastry with milk, then slide the lattice lid into place from the greaseproof paper.  Press the edges to seal. Brush the top of the pie with beaten egg.", "Bake for 50 minutes.", "Bake the pastry buckles, hinges and handles separately for 10-15 minutes towards the end of the pie's cooking time.", "Remove the pie from the tin and brush the sides with beaten egg. Return it to the oven and bake for another three minutes. Remove from the oven and leave to cool.", "For the caramel, melt the sugar in a pan with a couple of tablespoons of water. Do not stir. Let it reach a light golden-brown colour.  ", "Dip the handle ends and buckles into the caramel and stick them to the pie (caution: melted sugar is very hot. Take care not to burn yourself). Hold in place while the caramel sets."]}, {"isVegetarian": false, "title": "Picnic loaf", "url": "www_bbc_co_uk_food_recipes_picnic_loaf_86630", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["large round loaf of bread (rustic cob)", "2 tbsp olive oil", "2 handful salad leaves", "4 slices mature cheddar ", "4 slices salami", "4 slices ham", "small handful fresh basil, shredded", "400g/14oz cherry tomatoes, quartered"], "serves": "Makes 1 loaf", "time": {"preparation": "1-2 hours", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 120, "preparationMins": 120}, "recommendations": 0, "method": ["Slice the loaf into three horizontal slices of the same width.", "Put the top slice to one side. Brush the other two pieces of bread with a little of the oil.", "Top each slice of oiled bread with a handful of salad leaves, the cheddar, salami and ham. Sprinkle over the basil and tomatoes and season with freshly ground black pepper.", "Put the loaf back together by placing the two covered slices of bread on top of each other. Put the top piece back on like a lid. Wrap the loaf tightly in cling film. ", "Put the loaf in the fridge, top with a large dinner plate and place a couple of tins on top to weigh it down. Chill for 1-2 hours.", "To serve, cut the loaf into wedges."]}, {"isVegetarian": true, "title": "Picnic parkin", "url": "www_bbc_co_uk_food_recipes_picnic_parkin_46362", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 dessertspoons vegetable oil, plus some for greasing", "50g/2oz plain flour ", "1 tsp baking powder ", "1 tbsp dark soft brown sugar ", "½ tsp ground ginger ", "40g/1½oz rolled oats ", "4 dessertspoons milk ", "5 dessertspoons golden syrup"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Before cooking, wash your hands and put an apron on. Weigh or measure all the ingredients. Brush some oil inside a 500g loaf tin and place it onto a baking tray. Preheat the oven to 180C/350F/Gas 4. ", "Place the flour into a clean bowl with the baking powder, sugar and ginger. ", "Put the oats and milk together in another bowl and set aside for 5-10 minutes so the oats soak up the milk and soften.  ", "Stir the oil and golden syrup into the oats and milk. If you measure the oil first, the golden syrup will slide off the spoon more easily.", "Stir the flour mixture into the oaty milk mixture until all the ingredients are well mixed. ", "Pour the mixture into the greased loaf tin. Place the tin on a baking tray and bake for 25-30 minutes. Leave to cool and serve it in slices with a glass of milk."]}, {"isVegetarian": true, "title": "Picnic pasta salad", "url": "www_bbc_co_uk_food_recipes_picnic_pasta_salad_47257", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/picnic_pasta_salad_47257_16x9.jpg", "ingredients": ["300g/10½oz pasta shapes such as penne or macaroni", "250g/9oz cherry tomatoes, halved", "sea salt", "100g/3½oz black olives, stoned, halved ", "200g/7oz feta cheese, crumbled", "225g/7oz baby spinach", "3 tbsp lemon-infused olive oil", "2 tbsp pine nuts, toasted", "large handful torn basil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the pasta in a large pan of salted boiling water until al dente. Drain the pasta, rinse in cold water and tip into a large bowl.", "Add the halved tomatoes to the pasta and sprinkle with sea salt. Add the olives, feta and spinach and drizzle with the lemon olive oil.  Add the pine nuts and basil and toss gently before serving."]}, {"isVegetarian": true, "title": "Picnic crudite loaf", "url": "www_bbc_co_uk_food_recipes_picniccruditeloaf_91686", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/picniccruditeloaf_91686_16x9.jpg", "ingredients": ["1 stale crusty white farmhouse loaf", "2 large free-range egg yolks", "1 heaped tsp Dijon mustard", "¼ tsp caster sugar", "1½ tbsp white wine vinegar or lemon juice", "200ml/7fl oz sunflower oil", "salt and freshly ground black pepper", "4 free-range eggs, hard-boiled ", "assorted vegetables (such as radishes, baby carrots, cherry tomatoes, celery sticks and ", "cucumber), washed, trimmed and cut into batons"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Slice off the top of the loaf and set aside. Place the loaf upright onto a work surface and make deep incisions in the crumb, leaving a 2.5cm/1in border of bread around the edges. Hollow out the loaf using your hands (the crumb can be used in another recipe).", "For the mayonnaise, blend the egg yolks, mustard, sugar and white wine vinegar or lemon juice in a food processor until smooth. Gradually add the sunflower oil in a thin stream, whisking continuously until the mixture is smooth and well combined and has thickened. Season, to taste, with salt and freshly ground black pepper.", "To serve, spoon the mayonnaise into a small sterilised jam jar and fasten tightly. Place the jar inside the hollowed-out loaf of bread. Add the hard-boiled eggs and vegetable batons. Wrap pinches of salt and freshly ground black pepper in individual sachets of aluminium foil and add them to the hollowed-out loaf. Cover the loaf with the reserved top slice of bread, or 'lid'. Wrap in aluminium foil or secure with string and carry with you on your picnic."]}, {"isVegetarian": false, "title": "Picnic of piccalilli, ham, anchovy dip and pork pies", "url": "www_bbc_co_uk_food_recipes_picnicofpiccalilliha_86566", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125g/4½oz table salt", "2 litres/3½ pints water", "300g/11oz cauliflower florets", "225g/8oz baby onions, peeled", "225g/8oz cucumber, seeds removed, cut into large chunks", "2 tsp capers, rinsed and drained", "60g/2½oz butter", "4 tbsp flour", "200ml/7fl oz malt vinegar", "200ml/7fl oz white wine vinegar", "50g/2oz caster sugar", "2 tsp ground turmeric", "1¼ tsp mustard powder", "freshly ground black pepper", "1kg/2.2lb raw gammon", "1 onion, cut into quarters", "4 cloves", "2 bay leaves", "2 sprigs fresh thyme", "2 sprigs fresh flatleaf parsley", "4 canned anchovies, drained", "1 lemon, zest only", "1 garlic clove, peeled", "4 tbsp double cream", "75ml/3fl oz extra virgin olive oil", "salt and freshly ground black pepper ", "250g/8¾oz mature cheddar", "4 ready-made pork pies", "1 cauliflower, cut into florets", "1 bunch baby carrots, washed and trimmed", "200g/7oz ripe cherry tomatoes"], "serves": "Serves 4-6", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the piccalilli, dissolve the salt in the water in a large bowl. Add the cauliflower and onions and stir well to mix, ensuring they are completely submerged in the water. Cover and place into the fridge for 24 hours.", "When you're ready to cook the piccalilli, remove the bowl from the fridge and drain the salted water off. Rinse the vegetables well.", "Place the cauliflower, onions, cucumber and capers into a pan and cover with fresh water. Bring to the boil, then reduce the heat and simmer for ten minutes. Drain once more and set the vegetables aside.", "Meanwhile, heat a pan and cook the butter and flour for 2-3 minutes, stirring frequently.", "Slowly add the two vinegars, stirring constantly, and cook gently for 2-3 minutes, or until just thickened. Add the sugar, turmeric and mustard powder and season with freshly ground black pepper.", "Pour the mustard mixture over the vegetables and stir to combine, making sure all the vegetables are covered in the sauce.", "Pour into sterilised jars and seal. Leave in the fridge for at least five days before eating so that the vegetables can absorb all the flavours. The pickle can be kept in the fridge for up to two weeks.", "For the ham, place the gammon into a large lidded pan and cover with cold water. Stud the onion with the cloves and add to the water with the bay leaves, thyme and parsley. Bring the water to a rapid boil, then turn down the heat, cover the pan and simmer gently for two hours.", "When the ham is cooked, take the pan off the heat and leave the ham to cool in the cooking liquid. When cold, remove from the cooking liquid, trim off any excess fat and slice.", "For the anchovy dip, place the anchovies, lemon zest, garlic and cream into a blender and blend until smooth. Gradually add the olive oil until the sauce is thickened and emulsified. Season, to taste, with salt and freshly ground black pepper.", "Serve the piccalilli with the sliced ham, cheddar cheese and pork pie, the raw vegetables and the anchovy dip."]}, {"isVegetarian": false, "title": "Pie-shaped hidden design cake", "url": "www_bbc_co_uk_food_recipes_pie-shaped_hidden_design_24020", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["175g/6oz salted butter, softened", "175g/6oz unsalted butter, softened", "350g/12oz caster sugar", "6 free-range eggs, lightly beaten", "350g/12oz self-raising flour, sifted", "2 unwaxed lemons, zest only ", "2 tsp baking powder   ", "175g/6oz salted butter, softened", "175g/6oz caster sugar", "3 medium free-range eggs, lightly beaten", "175g/6oz self-raising flour", "½ tsp baking powder", "food colouring in egg yellow, pink/flesh and black ", "125g/4½oz unsalted butter, softened ", "125g/4½oz salted butter, softened ", "350g/12oz icing sugar", "1 lemon, zest and juice", "few drops black food colouring", "1 x 500g pack ready-to-roll fondant icing", "150g/5oz icing sugar", "few drops blue food colouring", "1 or 2 packs modelling paste, cream coloured", "1 x 250g pack sugarpaste, cream coloured", "coloured sugarpaste, black and yellow "], "serves": "Makes 1", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the lemon sponge cakes, preheat the oven to 180C/350F/Gas 4. Grease and line the bases of four 23cm/9in cake tins. In a large bowl, beat the butters with the sugar until pale and fluffy. Gradually add the eggs, beating well after each addition. Mix in a little flour and the lemon zest. Sieve the remaining flour and the baking powder and fold into the butter mix using a metal spoon. Divide the mix between the four tins and gently smooth the surface. Bake for 20–25 minutes, or until a skewer comes out clean, then set aside to cool on wire racks.", "For the small, coloured sponges, grease three mini cake tins (8cm/3in round tins are ideal). In a large bowl, beat the butter with the sugar. Gradually add the eggs, beating well after each addition and then mix in a little flour. Sieve the remaining flour and the baking powder and fold into the butter mix using a metal spoon. Divide the mix into three bowls and add the black food colouring to one, the yellow to another and the pink/flesh colour to the third. Pour the mixes into the prepared tins and bake for 15–20 minutes, or until a skewer comes out clean. Cool in the tins on a wire rack. ", "For the buttercream, beat the butter until soft, then add the icing sugar in batches until it is completely incorporated. Mix in the lemon zest and juice. Transfer one tablespoon of buttercream to a separate bowl and mix in the black food colouring a few drops at a time until the buttercream has turned an even black colour. ", "When the small coloured sponges are completely cool, take the yellow sponge and cut it into an open beak shape that is approximately 5cm/2in long. Use the pink cake to make a nose shape that can sit inside the open ‘beak’.", "To assemble the cake, sandwich three lemon sponge cakes together with butter cream. To create a cavity for the ‘beak’ and ‘nose’ to sit in, mark the centre of the cake and cut out a tapered cylinder shape. Insert the pink ‘nose’ and the yellow ‘beak’ (use a small amount of buttercream to fix in place and fill any gaps). ", "Spread buttercream over the top of the cake and add the final layer of cake. To form the cavity for the blackbird’s head, mark the centre of the cake and draw a 10cm circle round it. Scrape out a dome that is deep enough to reach the next layer of cake (so the blackbird’s head will sit immediately on top of the beak). Cut out the same sized dome from the black cake and insert into the dome-shaped cavity.", "To decorate, cut the edge of the bottom cake layer away slightly to create a ‘pie dish’ effect. Cut and shape the top of the cake so it that it resembles a pie top (it doesn't need to be perfect at this stage as it will be covered in fondant icing later).  Cover the entire cake with a layer of buttercream.", "To ice the cake, first roll out the white fondant into a strip large enough to wrap around the side of the cake and form the pie dish base. Trim to fit and apply in one strip. Secure the ends by brushing them with water so they’ll stick together. Mix the icing sugar with water to make a paste and add drops of blue food colouring until the icing is a deep-blue colour.  Pipe clusters of three dots all around the pie dish to create a blue and white ceramic effect. ", "Roll out the cream coloured fondant icing large enough to make a ‘pastry top’. Take one of the cake tins used for the lemon sponge and use it as guide to cut out a circle in the cream fondant icing. Apply to top of cake and crimp the edge so it resembles a pastry top. Cut a cross in the top of the pie and roll back the corners", "For the decorations, use the black and yellow coloured fondant to make a few small blackbird heads and sit them inside the cross of the ‘pastry top’. "]}, {"isVegetarian": false, "title": "Piedmontese peppers", "url": "www_bbc_co_uk_food_recipes_piedmontese_peppers_40938", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/piedmontese_peppers_40938_16x9.jpg", "ingredients": ["8-12 ripe plum tomatoes", "4 red peppers, stalks left on (for decoration), cut lengthways in half, seeds removed", "4 garlic cloves, sliced", "5-6 tbsp extra virgin olive oil", "salt and freshly ground black pepper ", "8 large canned anchovies, cut in half lengthways", "small handful fresh basil"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5.", "Pour boiling water over the plum tomatoes, leave for 10 seconds, carefully remove from the water and refresh in a bowl of cold water. Peel off the tomato skins. ", "Place the halved peppers into an ovenproof dish (preferably one that will be nice enough to present later), cut-side up.", "Place the garlic inside the peppers and then fit the tomatoes inside too, pushing them gently into the space. Add a small pinch of salt and a grinding of freshly ground black pepper. Spoon over the olive oil and then place into the oven. Bake for about 45 minutes to one hour, turning the heat down a little if you notice any excessive scorching of the peppers. ", "Once they are nicely softened and have slightly collapsed, remove the peppers from the oven. Criss-cross each pepper half with an anchovy, baste with the oily juices and allow to cool to room temperature. ", "Top with basil leaves and serve."]}]