[{"isVegetarian": true, "title": "Lazybones buns (Luilakbollen)", "url": "www_bbc_co_uk_food_recipes_lazybones_buns_47431", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾ oz caster sugar", "50g/1¾ oz butter, cut into cubes", "150ml/¼ pt milk", "1 x 7g sachet of fast-action dried yeast", "375g/13oz strong white flour, plus extra for dusting", "½ tsp fine sea salt", "1 tsp ground cinnamon", "1 lemon, zest finely grated", "1 large egg, beaten", "125g/5oz raisins or 100g/4oz raisins and 25g/1oz currants", "sunflower oil, for greasing", "butter and syrup or honey, to serve"], "serves": "Makes 8", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Put the sugar, butter and milk in a small saucepan and heat very gently for a few seconds until just warm. Take care that the milk doesn’t get too hot or the yeast won’t work. ", "Pour the milk mixture into a heatproof bowl and stir in the yeast. Leave for 10 minutes or until a light foam forms on the surface.", "Mix the flour, salt, cinnamon and lemon zest in a large bowl and make a well in the centre.", "Whisk the egg into the warm milk mixture, then pour it all on to the flour. Stir with a wooden spoon until the mixture forms a ball. ", "Turn the mixture out on to a very lightly floured surface and knead for 5 minutes to make a smooth, pliable dough. ", "Knead the fruit into the dough for a couple of minutes until it is evenly distributed. ", "Place the dough in a lightly oiled bowl and cover with oiled clingfilm. Leave to rise in a warm place for 1½ hours, or until it has doubled in size and is spongy to touch.", "Return the dough to the work surface and knock it back with your knuckles. Knead lightly, then divide the dough into 8 portions. Roll each of these into a ball, then pull the dough from around the sides and tuck it underneath the bun to give it a neat shape.", "Place the buns on a large baking tray lined with baking parchment and flatten them slightly.  If your tray isn’t large enough to take all of the buns at once, bake them in a couple of batches.", "Cover with oiled clingfilm and leave to prove for a further 45 minutes.", "Preheat the oven to 190°C/375F/Gas 5. Remove the clingfilm and bake the buns in the centre of the oven for about 20 minutes until risen and golden brown. ", "Serve warm the day they’re made – great spread with butter and drizzled with syrup or honey."]}, {"isVegetarian": true, "title": "Leafy salad with feta and pomegranate", "url": "www_bbc_co_uk_food_recipes_leafysaladwithfetaan_83561", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/leafysaladwithfetaan_83561_16x9.jpg", "ingredients": ["200g/7oz feta", "splash lemon juice", "1-2 garlic cloves, crushed", "100g/3½oz flaked almonds, toasted", "120g bag mixed rocket, spinach and watercress", "3 tbsp olive oil", "salt and freshly ground black pepper", "2 pomegranates, seeds only"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Put the feta in a shallow dish, squeeze over the lemon juice and scatter over the garlic. Leave to marinate while you prepare the rest of the salad.", "Toast the almonds under a medium grill until lightly browned, then leave to cool. Cut the pomegranate in half and pop the seeds out into a bowl by bashing the skin with a spoon.", "Toss together the rocket, spinach and watercress in a large salad bowl with the olive oil, and salt and freshly ground pepper. Crumble in the marinated feta, and scatter the pomegranate seeds and toasted almonds over. Serve immediately."]}, {"isVegetarian": false, "title": "Lean pork stir fry", "url": "www_bbc_co_uk_food_recipes_leanporkstirfry_83698", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["110g/4oz medium ready-made egg noodles", "250g/10½oz lean pork, cut into cubes", "1 tbsp olive oil ", "1 red onion, peeled and sliced ", "½ green pepper, core and seeds removed, sliced ", "2 garlic cloves, peeled and crushed ", "½ mango, peeled, stone removed and chopped ", "1 tsp freshly grated ginger ", "squeeze lime juice ", "splash water ", "1 tsp soy sauce", "1 vegetable stock cube ", "1 tsp sesame oil ", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to its highest setting.", "Cook the egg noodles according to packet instructions and drain. ", "Place the pork pieces onto a baking sheet and place under a heated grill. Grill for about 10 minutes, turning occasionally to brown all over, until cooked through.", "Heat the olive oil in a wok over a high heat. Add the onion and stir-fry for a few minutes to soften.", "Add the green pepper, garlic, mango and ginger to the wok and stir-fry for a few minutes.  ", "Add the lime juice, splash of water and soy sauce. Stir well and crumble in the stock cube. 7. Add the sesame oil and salt and freshly ground black pepper and continue to heat for a few minutes. ", "Add the cooked noodles to the pan and cook for 1-2 minutes, or until heated through. ", "Add the cooked pork pieces to the pan, stir again, then transfer the noodles to a large bowl and serve hot."]}, {"isVegetarian": false, "title": "Lebanese-spiced lamb flatbread", "url": "www_bbc_co_uk_food_recipes_lebanese-spiced_lamb_56436", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lebanese-spiced_lamb_56436_16x9.jpg", "ingredients": ["400g/14oz type ‘00’ flour, plus extra for dusting", "100g/3½oz semolina flour", "½ tsp salt", "1½ tsp caster sugar", "7g sachet fast-action yeast", "325ml/11fl oz warm water", "1 tbsp vegetable oil", "1 shallot, finely chopped", "1 garlic clove, finely chopped", "1 tsp ground coriander", "1 tsp ground cumin", "1 tbsp ground baharat spice mix", "500g/1lb 2oz lamb mince", "75g/2½oz sultanas", "300ml/10½fl oz chicken stock", "250ml/9fl oz plain yoghurt", "2 green chillies, finely chopped", "salt and freshly ground black pepper", "4 fresh mint sprigs, leaves only", "16 coriander sprigs, leaves only"], "serves": "Serves 8", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["For the dough, the day before you want to eat the flatbreads, mix the flours, salt and sugar in a large bowl. ", "In a jug, mix the yeast to a paste with a little of the water, then stir in the remaining water until the yeast has completely dissolved.", "Make a well in the centre of the flour mixture and pour in the yeasted water, gradually bringing more and more of the flour into the wet mixture, until all of the flour has been incorporated and the mixture has come together as a soft dough.", "Turn out the dough onto a lightly floured work surface and knead well until smooth and elastic.", "Divide the dough into four equally sized pieces and roll each into a ball. Place the dough balls onto a lightly greased baking tray, cover with a loose sheet of cling film or a clean tea towel, and leave to prove in the fridge for 24 hours.", "When the dough has proved (doubled in size), make the topping. ", "For the topping, heat the oil in a frying pan over a medium heat. Add the shallot, garlic and spices and fry for 1-2 minutes, or until softened.", "Add the lamb mince and increase the heat to high. Fry for 4-5 minutes, breaking up the mince with a spoon and stirring frequently, until browned all over.", "Add the sultanas and chicken stock to the pan and bring the mixture to the boil, then reduce the heat until the mixture is simmering and simmer for 18-20 minutes, or until the lamb is tender and the liquid has almost all evaporated. Season, to taste, with salt and freshly ground black pepper, then remove the pan from the heat and set aside to cool completely.", "Preheat the oven to its highest setting. Place a heavy baking tray or pizza stone in the oven and allow to heat up.", "Roll each piece of dough out onto a lightly floured work surface into an oval roughly 20x15cm/8x6in, and about 0.5cm/¼in thick.", "Spread the lamb mixture onto the dough bases, then top with dollops of the yoghurt. Sprinkle over the chopped chillies and season, to taste, with salt and freshly ground black pepper.", "Transfer the flatbreads, in batches if necessary, to the baking tray or pizza stone and cook for 5-10 minutes, or until the bases are golden-brown and crisp. Remove from the ove and sprinkle over the herbs. Serve immediately."]}, {"isVegetarian": true, "title": "Leek and brioche bake", "url": "www_bbc_co_uk_food_recipes_leek_and_brioche_bake_21766", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75g/2¾oz butter", "500g/1lb 2oz leeks, sliced and washed", "3 sprigs fresh thyme, leaves picked", "150ml/5fl oz white wine", "200ml/7fl oz double cream", "75g/2¾oz brioche loaf, cut into 1cm/½in cubes", "50g/1¾oz Gruyère, finely grated", "salt and freshly ground black pepper"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6.", "Heat 50g/1¾oz of the butter in a frying pan and fry the leeks and thyme for 2-3 minutes, or until softened.", "Add the wine and cook until the volume of the liquid has reduced by two-thirds. Add the cream and reduce again by half. Season with salt and pepper and pour into an ovenproof dish.", "Heat a separate frying pan until hot. Add the remaining butter and the brioche. Cook until golden-brown on all sides. Season with salt and pepper and scatter over the top of the leeks.", "Sprinkle the cheese on top of the dish and cook in the oven for 20-30 minutes, or until golden-brown and bubbling."]}, {"isVegetarian": true, "title": "Leek and egg salad, mushrooms and crusty bread", "url": "www_bbc_co_uk_food_recipes_leek_and_egg_salad_14872", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 eggs  ", "500g/1lb 2oz leeks, washed ", "5 tbsp olive oil ", "250g/9oz mushrooms (such as white closed cap), wiped clean and sliced ", "salt and pepper ", "1 garlic clove, finely chopped ", "1 tbsp white wine vinegar", "1 tsp mustard ", "1 small baguette (labelled ‘baton’ in shops), cut into slices "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the eggs into a pan of boiling water. Boil for eight minutes exactly, then drain and cool under cold running water. Peel the eggs and set them aside.", "Trim the very tops off the leeks and then cut two-thirds of the way down. Discard any of the coarse outer leaves of the upper two-thirds, cut in half lengthways and horizontally and separate the inner green stems into strips.", "Cut the lower white part of the leek into rounds. Steam the white round and green strips in a steamer placed over salted boiling water for four minutes, or until tender.", "Run the leeks under cold water to cool. Squeeze them out if they are at all watery.", "Meanwhile, heat a small frying pan and add a tablespoon of the oil. Once hot, add the sliced mushrooms to the pan with a pinch of salt. Cook over a medium heat for 4-5 minutes, or until tender and lightly golden-brown. Add the garlic and fry for another minute.", "Whisk the remaining olive oil together with the vinegar and mustard in a small bowl to make a dressing. Taste and season as necessary. Cut the peeled eggs into wedges. Put the cooled leeks in a bowl and top them with the eggs. Season with salt and pepper", "Dress the egg and leek with the dressing. Taste and adjust the seasoning if needed. Serve with the mushrooms and baguette."]}, {"isVegetarian": true, "title": "Leek and Stilton quiche", "url": "www_bbc_co_uk_food_recipes_leek_and_stilton_quiche_08524", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/leek_and_stilton_quiche_08524_16x9.jpg", "ingredients": ["225g/8oz plain flour", "125g/4½oz butter", "1 free-range egg", "1 tbsp water", "1 tbsp olive oil", "2 leeks, thinly sliced", "2 sticks celery, thinly sliced", "4 free-range eggs", "450ml/16fl oz double cream", "150g/5½oz Stilton cheese, coarsely grated", "2 tbsp chopped parsley", "salt and freshly ground black pepper"], "serves": "Serves 6-8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/180 Fan/Gas 6.  ", "To make the pastry, measure the flour and butter into a food processor and blend until the mixture resembles breadcrumbs. Add the egg and water and blend again until it forms a smooth dough ball. Roll on a lightly floured work surface and use the pastry to line a 28cm/11in loose-bottomed, deep quiche tin. Form a little lip around the top and prick the base with a fork. Place in the fridge for 15 minutes.", "Line with baking paper and baking beans and bake for 15 minutes. Remove the beans and paper and return to the oven for a further 5–10 minutes, or until just cooked and pale golden-brown. Reduce the oven temperature to 180C/160 Fan/Gas 4.", "To make the filling, heat the oil in a wide-based frying pan, add leeks and celery and fry over a high heat for few minutes.  ", "Lower the heat, cover and simmer for about 25 minutes, or until the vegetables are completely tender. Remove the lid, increase the heat and fry for a minute to cook off any excess water.    ", "Beat the eggs and cream together in a jug and season with salt and pepper.", "Spoon the soft leeks and celery into the pastry case, scatter with cheese and parsley and season with salt and pepper. Pour over the cream.  ", "Bake for about 35–40 minutes, or until golden-brown and just set on top. Leave to sit for about 5–10 minutes before turning out."]}, {"isVegetarian": true, "title": "Leek soup", "url": "www_bbc_co_uk_food_recipes_leek_soup_66968", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/leek_soup_66968_16x9.jpg", "ingredients": ["1 carrot, grated", "1 onion, grated", "2 sticks celery, grated", "2 garlic cloves, roughly chopped", "salt and pepper", "stalks from a small bunch of parsley", "olive oil", "1 onion, finely chopped", "200g/7oz floury potatoes, peeled and chopped into cubes", "350g/12oz celeriac, peeled and chopped", "1 sprig thyme, leaves only", "4 leeks, finely sliced", "sea salt and freshly ground black pepper", "1 small bunch chives, finely chopped"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the stock, put the grated carrot, onion, celery and garlic into a large heatproof bowl. Add a pinch of salt and pepper and pour over 1 litre/1¾ pints of boiling water. Set aside to steep for 10-15 minutes while you prepare the soup.", "Heat a large heavy-based saucepan or casserole dish over a medium heat. Add a dash of oil and, once hot, add the onion, potatoes, celeriac and thyme leaves. Cook over a medium heat for 10 minutes, or until the vegetables have softened.", "Strain the stock through a sieve into the pan of celeriac. Simmer gently for 10-15 minutes until the celeriac is nearly tender. ", "Add the leeks, cover the pan and cook for a further 5-7 minutes, or until the leeks are wilted and tender but still bright green.", "Remove from the heat and blend in batches until really smooth. (Blend for a minute or longer for a really velvety texture.) The soup can be stored in the fridge or frozen at this stage.", "Transfer the blended soup to a clean pan. Reheat the soup if necessary, taste and season with salt and pepper to taste.To serve, spoon into bowls and garnish with chopped chives. "]}, {"isVegetarian": true, "title": "Leek and caper soup", "url": "www_bbc_co_uk_food_recipes_leekandcapersoup_85786", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 leek, finely sliced", "1 garlic clove, finely chopped", "100ml/3½fl oz white wine", "150ml/¼ pint hot chicken stock (vegetarians can substitute vegetable stock)", "75ml/2½fl oz double cream", "1 tbsp capers, rinsed and drained", "salt and freshly ground black pepper ", "1 tbsp chopped fresh chives, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a pan over a medium heat, add the leek and sauté until softened. Add the garlic and fry for one minute.", "Add the white wine, turn up the heat and simmer for 2-3 minutes.", "Add the stock, double cream and capers and simmer for 3-4 minutes. Season, to taste, with salt and freshly ground black pepper.", "To serve, pour the soup into a serving bowl and garnish with chopped chives."]}, {"isVegetarian": true, "title": "Leek and potato strudel", "url": "www_bbc_co_uk_food_recipes_leek_and_potato_strudel_70345", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tsp vegetable oil, plus extra for greasing ", "285g/10¼oz plain flour, plus extra for dusting", "pinch salt", "½ tsp hot, smoked paprika", "1 medium free-range egg", "100g/3½oz butter", "450g/1lb potatoes, peeled and diced", "olive oil for frying", "1 medium onion, finely chopped", "3 leeks, washed and finely chopped", "¾ tsp ground turmeric", "1 large chilli, finely chopped ", "1 tsp harissa ", "50g/1¾oz whole pistachios", "75ml/5 tbsp whipping or double cream ", "100g/3½oz Gruyère, grated", "50g/1¾oz breadcrumbs (approximately two slices of bread) ", "1½ tsp sea salt", "freshly ground black pepper", "1 tsp hot, smoked paprika", "1 tbsp nigella seeds (available from large supermarkets)", "large handful fresh coriander ", "75ml/2½fl oz olive oil ", "100g/3½oz cherry tomatoes on the vine", "large handful fresh rocket ", "1 radicchio head, trimmed"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the filo pastry, lightly oil a large bowl.  Sift the flour, paprika and salt into a clean bowl and make a well in the centre. Add the egg and oil then gradually stir in 150ml/5fl oz water, or enough to make a soft dough.", "Lightly flour the work surface, turn out the dough and knead for 15 minutes (this dough is best kneaded by pulling it up from the counter and throwing it down - don’t leave it in contact with the counter for too long or it will stick). The dough is ready when it loses its stickiness and is elastic enough to be stretched by approximately 50cm. Place the dough in the oiled bowl, cover with cling film and leave to relax for an hour.", "For the leek and potato filling, steam the diced potatoes for approximately five minutes, or until they are cooked through but still hold their shape. Remove from the heat and set aside to cool. ", "In a frying pan, cook the onions and leeks in a little olive oil until they are soft and the onions are translucent. Add the turmeric, chilli, harissa, potatoes, pistachios and cream to the pan. Remove from the heat, stir in the cheese and breadcrumbs, then season to taste with salt and freshly ground black pepper.", "Preheat the oven to 200C/400F/Gas 6, line a baking tray with parchment paper and cover the work surface with a table cloth generously dusted with flour. ", "Melt the butter and use a rolling pin to roll out the dough to a thickness of 1cm/½in. Stretch the dough by hand taking care not to tear it, pull the dough gently by running your hands under the dough from the centre outwards. The finished dough should be very thin, transparent enough to read through and at least 50cm wide.", "Trim the dough edges with scissors to make a neat rectangle then scatter the dough liberally with melted butter from a flicked pastry brush.", "Place the cooled filling at one of the narrow ends of the pastry and, using the table cloth to help, gently roll up the strudel. Fold the pastry edges under the strudel and place on the lined baking tray. Curve into a horseshoe shape if it is too big for the tray.", "Sprinkle with melted butter and scatter over the paprika and nigella seeds. Bake on the top shelf of the oven for 30-40 minutes or until golden brown.", "To serve, blend the coriander with 50ml warmed olive oil in a food processor. Transfer the strudel to a serving plate. Place the cherry tomatoes on a baking tray and brush with oil. Use a blowtorch to char the tomato skin then arrange around the strudel with the rocket, radicchio and coriander oil blend. "]}, {"isVegetarian": true, "title": "Lebanese rice pudding", "url": "www_bbc_co_uk_food_recipes_lebanese_rice_pudding_16994", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lebanese_rice_pudding_16994_16x9.jpg", "ingredients": ["150g/5½oz pudding rice", "250ml/9fl oz double cream", "250ml/9fl oz full-fat milk ", "2 tbsp golden caster sugar", "1 vanilla pod, split", "16 dried apricots", "1 cinnamon stick", "½ unwaxed lemon", "2 tsp rosewater", "2 tsp orange blossom water", "50g/1¾oz shelled pistachios, roughly chopped", "2 tbsp food-grade rose petals"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put the rice in a medium-sized, heavy-based pan, then pour in the cream, milk and sugar and add the vanilla pod.", "Bring to the boil over a medium heat, then reduce the heat until the milk is bubbling gently. Allow to simmer for 25 minutes, or until tender, giving it the occasional stir.", "Fill another pan with 300ml/10fl oz water, add the dried apricots, cinnamon stick and the lemon half. Bring to the boil and simmer for 10 minutes.", "When the rice is soft, remove the vanilla pod and stir in the rosewater and orange blossom water. ", "Divide the rice pudding between four bowls. Spoon four apricots into each bowl with a little of the juice from the pan. Scatter over the pistachios and a few rose petals and serve. "]}, {"isVegetarian": true, "title": "Leek and asparagus soup", "url": "www_bbc_co_uk_food_recipes_leekandasparagussoup_80982", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "½ leek, cleaned and finely chopped", "4 asparagus spears, chopped", "150ml/5fl oz vegetable stock ", "100ml/3½fl oz double cream", "salt and freshly ground black pepper", "crusty bread, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a medium saucepan over a medium heat. Add the leek and asparagus and sauté for 2-3 minutes, to soften.", "Add the vegetable stock, bring to the boil, then reduce the heat to simmer gently for 8-10 minutes, until the asparagus is cooked through.", "Transfer to a food processor, add the cream and blend until smooth.", "Return the soup to the pan, season, to taste, with salt and freshly ground black pepper and warm through gently.", "To serve, pour into a soup bowl with the crusty bread placed on a plate alongside."]}, {"isVegetarian": false, "title": "Leek and lamb koftas", "url": "www_bbc_co_uk_food_recipes_leekandlambkoftas_77205", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/8¾oz lamb mince", "½ leek, chopped", "handful breadcrumbs", "½ tsp paprika", "½ tsp chilli flakes", "½ tsp ginger", "1 free-range egg yolk", "1 tbsp oil", "herb salad, to serve"], "serves": "Makes 3", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Mix together all of the ingredients thoroughly and mould around three skewers.", "Heat the oil in a frying pan and cook the lamb skewers for 1-2 minutes to seal on all sides.", "Place into the oven for ten minutes, until golden and cooked through.", "Serve with a herb salad."]}, {"isVegetarian": false, "title": "Leek and lamb pie with buttered new potatoes and carrots", "url": "www_bbc_co_uk_food_recipes_leekandlambpiewithbu_85341", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb plain flour, plus extra for dusting", "½ tsp salt ", "1 tbsp icing sugar ", "1 free-range egg, beaten ", "200ml/7fl oz water ", "75g/3oz butter, chopped", "75g/3oz lard, chopped", "25g/1oz butter", "1kg/2lb 2oz leeks, thinly sliced", "2 fresh thyme sprigs, leaves only", "450g/1lb boneless leg of lamb, cut into chunks", "2 tbsp chopped fresh flatleaf parsley", "2 tbsp chopped fresh mint", "salt and freshly ground black pepper", "1 free-range egg, beaten ", "new potatoes, cooked ", "chantenay carrots, cooked"], "serves": "8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 225C/440F/Gas 8.", "Place a heavy baking tray into the oven to preheat.", "Mix the flour, salt and icing sugar in a large bowl. Make a well in the middle of the dry ingredients and pour the egg into it. Scoop a liberal amount of flour over to cover the egg. ", "Place the water, butter and lard into a saucepan over a low heat and bring slowly to the boil.", "Gradually pour the boiling liquid into the flour mixture, stirring with a knife constantly to combine, then knead on a clean, floured surface until the egg is completely combined and the pastry is smooth. (NB: use the pastry immediately to make your pie because when the pastry cools it will harden and become unmanageable.)", "Cut off one third of the pastry and set this aside for the lid. Roll out the remaining pastry into a flat round shape large enough to line the base and sides of a 25cm/10in loose-bottomed cake tin, allowing an overhang of pastry of about 2cm/1in.", "Roll out the pastry set aside for the lid to fit the top of the pie and set aside.", "For the filling, heat a frying pan until hot, then add the butter, leeks and thyme and gently fry for 5-8 minutes, or until the leeks are tender. Set aside and allow to cool slightly.", "Place the lamb into a food processor along with the parsley and mint leaves and pulse to chop finely. Season well with salt and freshly ground black pepper.", "Spread the lamb mixture into the pastry case in a thick layer and then spread the leeks over the top.", "Brush the edges of the pastry with a little beaten egg. Place the pastry lid on top of the filling and pinch and crimp the edges of the case and lid together to seal.", "Trim away any excess pastry from the pie with a sharp knife and use the pastry trimmings to make decorative leaves for the top of the pie.", "Brush the top of the pie with beaten egg and make a hole in the centre to allow the steam to escape. Arrange the pastry leaves on top and brush these with the beaten egg.", "Place in the oven to cook for 15 minutes, then reduce the oven temperature to 180C/355F/Gas 4 and continue to bake for one hour. Remove from the oven and allow to cool for five minutes before serving.", "To serve, cut out a wedge of pie and place onto a plate accompanied by buttered new potatoes and chantenay carrots."]}, {"isVegetarian": true, "title": "Leek and mushroom risotto", "url": "www_bbc_co_uk_food_recipes_leekandmushroomrisot_84317", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz unsalted butter", "1 tbsp olive oil", "½ onion, finely chopped", "1 clove garlic, finely chopped", "1 leek ,(white only) ,chopped", "50g/1¾oz chestnut mushrooms, chopped", "100g/3½oz risotto rice", "50ml/2fl oz white wine", "300ml/10fl oz hot chicken stock (vegetarians may substitute vegetable stock)", "50g/1¾oz Dolcelatte", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the butter and oil in a saucepan over a medium heat.", "Add the onion, garlic, leek and mushroom and fry for two minutes, or until soft.", "Add the rice and wine and bring to the boil. Turn down the heat slightly and simmer until the wine is completely absorbed.", "Add the stock and simmer for 12 minutes, or until the stock is absorbed and the rice is completely cooked through.", "Add the Dolcelatte and stir with a spoon until melted. Season, to taste, with salt and freshly ground black pepper.", "To serve, spoon onto a serving plate."]}, {"isVegetarian": true, "title": "Leek and potato soup", "url": "www_bbc_co_uk_food_recipes_leekandpotatosoup_14556", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 leeks ", "340g/¾lb potatoes ", "1 onion, chopped ", "1 garlic clove, thinly sliced ", "30g/1oz butter ", "570ml/1 pint water ", "1 bay leaf ", "1 sprig of thyme ", "salt and freshly ground black pepper ", "100ml/3½fl oz milk", "100ml/3½fl oz double cream ", "2 tbsp fresh chives, chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Trim and slice the leeks in thin rounds. Rinse in a colander under cold water. ", "Peel the potatoes and cut into chunks. ", "Melt the butter in a pan and gently sauté the onion and garlic. ", "Add the leek, potatoes, bay leaf and thyme. Season. ", "Cover with the water and bring to the boil. ", "Simmer for 12 minutes until the potatoes and leeks are tender. ", "Remove the bay leaf. ", "Just before serving add the milk and cream and stir over a low heat, check the seasoning. ", "Serve in bowls and sprinkle with the chives."]}, {"isVegetarian": true, "title": "Leek and potato soup", "url": "www_bbc_co_uk_food_recipes_leekandpotatosoup_1920", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/leekandpotatosoup_1920_16x9.jpg", "ingredients": ["1 tbsp vegetable oil", "1 onion, sliced", "225g/8oz potatoes, cubed", "2 medium leeks,sliced", "1.2 litres/2 pints vegetable stock", "150ml/5fl oz double cream or crème fraîche", "salt and freshly ground black pepper"], "serves": "4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a large pan and add the onions, potatoes and leeks. Cook for 3-4 minutes until starting to soften.", "Add the vegetable stock and bring to the boil. Season well and simmer until the vegetables are tender.", "Whizz with a hand blender or in a blender until smooth. Reheat in a clean pan, stir in the cream or crème fraîche, heat through and serve."]}, {"isVegetarian": true, "title": "Leek and potato soup", "url": "www_bbc_co_uk_food_recipes_leekandpotatosoup_75793", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["¼ potato, diced", "¼ leek, sliced", "1 tbsp butter", "150ml/5fl oz milk", "150ml/5fl oz double cream", "handful of fresh chives, chopped"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place all the ingredients, except the chives into a saucepan and cook for 15 minutes or until cooked through. ", "Add the chives and serve."]}, {"isVegetarian": true, "title": "Leek and potato soup", "url": "www_bbc_co_uk_food_recipes_leekandpotatosoup_79045", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "½ potato, peeled and diced", "1 garlic clove, peeled and diced", "1 leek, diced", "55ml/2fl oz white wine", "150ml/5fl oz vegetable stock", "55ml/2fl oz double cream ", "salt and freshly ground black pepper", "1 slice of bread", "35g/1½oz blue cheese"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a saucepan and fry the potato and garlic for 3-4 minutes, to soften. ", "Add the leeks and cook for a further few minutes.", "Stir in the wine with the stock and cream then reduce the heat and simmer gently for 10-12 minutes, or until the potatoes are tender.", "Using a hand blender, blend the soup until smooth and season to taste. ", "To serve, toast the bread on one side, under a hot grill, until golden. Turn over and lay the blue cheese on top. Return to the grill and cook until melted and golden.", "Serve the cheese toast on top of the soup."]}, {"isVegetarian": true, "title": "Leek and potato soup", "url": "www_bbc_co_uk_food_recipes_leekandpotatosoup_85731", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "½ leek, finely chopped", "1 garlic clove, finely chopped", "sprig fresh thyme, leaves only", "½ vegetable stock cube, crumbled", "150ml/¼ pint milk", "1 small potato, peeled and chopped", "1 tbsp double cream", "salt and freshly ground black pepper", "1 tbsp chopped fresh chives, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a small pan, add the leek and sauté for 3-4 minutes, until softened. Add the garlic and thyme and fry for a further minute.", "Add the half stock cube, the milk and potato. Bring to the boil, reduce the heat and simmer for 6-8 minutes, or until the potato is tender.", "Stir in the cream, season, to taste, with salt and freshly ground black pepper and allow to cool slightly.", "Pour the soup into a food processor and blend until smooth. If necessary, gently reheat the soup before serving.", "To serve, pour the soup into a bowl or cappuccino cup and sprinkle with chives."]}, {"isVegetarian": false, "title": "Leek and potato soup", "url": "www_bbc_co_uk_food_recipes_leekandpotatosoup_85929", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/2oz unsalted butter", "½ onion, finely sliced", "1 garlic clove, chopped ", "1 leek, trimmed and chopped ", "1 potato, peeled and chopped", "150ml/4½fl oz hot vegetable stock", "50g/2oz bacon lardons, or chopped smoked bacon ", "1 garlic clove, chopped", "1 tsp smoked paprika", "salt and freshly ground black pepper", "sprig fresh chervil, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the leek and potato soup, heat the butter in a pan and sauté the onion, garlic and leek until softened.", "Add the potato and stock and bring to the boil. Reduce the heat and simmer for ten minutes, or until the potato is tender. Remove from the heat and allow to cool slightly.", "Pour the soup into a blender and blend until smooth.", "For the spicy pork fat, heat the pork fat in a pan with the garlic and paprika. Season with salt and freshly ground black pepper and fry gently until the fat has rendered and the texture is crisp. Remove the fat pieces with a slotted spoon and drain on kitchen paper.", "To serve, pour the soup into a bowl, top with the spicy pork fat and garnish with chervil."]}, {"isVegetarian": false, "title": "Leek and potato soup with poached oysters", "url": "www_bbc_co_uk_food_recipes_leekandpotatosoupwit_81984", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 chickens, cut into portions ", "1 leek, roughly chopped", "1 celery stick, roughly chopped", "1 onion, roughly chopped", "1 head of garlic, cut in half crossways", "sprig of thyme", "1 bay leaf", "25g/1oz butter", "1 tbsp olive oil", "1 small onion, finely chopped", "4 large leeks, finely sliced", "2 large potatoes, peeled and cut into cubes", "1 bouquet garni", "8 small rock oysters ", "250ml/9fl oz fish stock", "snipped chives, to garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["First make the chicken stock. Place the chickens, chopped vegetables, garlic and herbs in a large pan. Cover with cold water and bring to the boil. Skim off any fat that rises to the surface, then leave to simmer for 1½-2 hours. ", "Strain the stock through a colander set in a bowl, then pass through a sieve. You need 700ml/1¼ pints of stock for the soup; keep the remainder for another use. ", "Remove the 'oysters' (the small oyster-shaped piece of meat above the thigh) from the chicken back portions and leave to one side for use later as a garnish. Discard all the remaining contents of the colander.", "For the soup, melt the butter with the olive oil in a saucepan. Add the onion and slowly cook without colouring. After a couple of minutes add the leeks, then cover and sweat for about five minutes over a low heat. Do not allow the vegetables to colour.", "Add the potatoes and bouquet garni and cook uncovered for two minutes, then pour in the hot stock. Bring to the boil and cook until the potatoes are soft.", "Remove the bouquet garni, then carefully blitz the soup in a food processor or blender. Pour into a bowl and set over ice to cool. Chill in the fridge until ready to serve.", "Remove the rock oysters from their shells and lightly poach in the fish stock. Drain and allow to cool. ", "To serve, place the sea oysters and chicken 'oysters' in large soup bowls and ladle the soup on top. Finish with a sprinkling of chives."]}, {"isVegetarian": false, "title": "Leek and potato soup with crisp ox tongue and poached egg", "url": "www_bbc_co_uk_food_recipes_leekandpotatosoupwit_93783", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 onion, peeled, diced", "1 carrot, peeled, diced", "4 stalks celery, diced", "2 leeks, diced", "1 bunch fresh parsley, stalks only", "1 head garlic, broken into cloves", "1 bouquet garni", "2kg/4lb 6½oz ox tongue", "1 tsp vegetable oil", "150g/5¼oz unsalted butter", "2 onions, peeled, finely sliced", "4 leeks, finely sliced", "3 medium potatoes, peeled, finely sliced", "4 free-range eggs, poached", "100g/3½oz leeks, white part only, finely sliced", "knob of butter", "100g/3½oz potato, peeled, cut into 2cm/1in cubes, boiled until tender, drained"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the ox tongue, place the vegetables, parsley stalks, garlic and bouquet garni into a large saucepan. Cover with water and bring to the boil. ", "Add the ox tongue, reduce the heat and simmer for 4 hours, or until the meat is very tender.", "Carefully remove the tongue from the pan. Remove the skin and any glands or excess fat and gristle. Set aside to rest in the fridge for at least 30 minutes, then, cut the tongue into cubes.", "Heat a frying pan until hot, add the tongue cubes and fry until golden-brown and crisp on all sides.", "Meanwhile, for the leek and potato soup, melt the butter in a saucepan over a gentle heat, until foaming. Fry the onions for 4-5 minutes, or until softened. ", "Add the leeks and fry for a further 2-3 minutes. Stir in the potatoes and cover with 1 litre/1pint 15¼fl oz water. Bring the mixture to the boil and cook for 10-15 minutes, or until the potatoes are tender.", "Remove the pan from the heat and blend the mixture in a blender until smooth. Season, to taste, with salt and freshly ground black pepper.", "To serve,  heat the butter in a frying pan and fry the leeks  for 4-5 minutes, or until softened. Season, to taste with salt and freshly ground black pepper.", "Spoon some fried leeks and cooked potato into each of 4 serving bowls and top with a poached egg. Ladle the soup around the egg and top with the crisp ox tongue."]}, {"isVegetarian": true, "title": "Leek and smoked cheese pancakes", "url": "www_bbc_co_uk_food_recipes_leekandsmokedcheesep_91738", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz plain flour, sifted, plus extra for dredging", "pinch salt", "4 free-range eggs", "400ml/14fl oz milk", "150ml/5½fl oz water", "100g/3½oz butter, melted", "vegetable oil, for frying", "2 free-range eggs, beaten ", "125g/4½oz polenta (cornmeal)", "50g/2oz butter", "250g/9oz leeks, sliced into rounds ", "150g/5½oz smoked cheese, grated", "1 tbsp chopped fresh thyme", "1 tbsp chopped fresh sage", "100g/3½oz frozen peas", "100g/3½oz ricotta ", "1 red onion, peeled, chopped ", "1 cucumber, chopped", "12 cherry tomatoes, chopped", "200ml/7fl oz tomato passata ", "1 red chilli, finely chopped ", "50ml/2fl oz sherry vinegar"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the pancakes, sift the flour and salt into a large bowl and make a well in the centre. Break the eggs into the well, then gradually mix the eggs into the flour with a fork. Gradually add the milk and water to the mixture, whisking continuously, until the mixture is smooth and has the texture of double cream. Finally, whisk in the butter. ", "Heat a drizzle of the oil in a 18cm/7in non-stick frying pan over a high heat until smoking, then turn the heat down to medium. Spoon in about two tablespoons of the pancake batter into the pan, swirling it around to evenly coat the bottom of the pan.", "Cook for about 30 seconds, then flip the pancake over and cook for a further 15-20 seconds, or until cooked through. Place the pancake onto a plate lined with greaseproof paper, then place another layer of greaseproof paper on top. Repeat the cooking process with the remaining pancake batter, adding more oil to the pan if necessary, and making sure each pancake sits between two layers of greaseproof paper to prevent them from sticking to each other. Set aside. ", "Preheat the oven to 180C/350F/Gas 4.", "For the filling, melt the butter in a pan until foaming, then gently fry the leeks for 4-5 minutes, or until softened. Drain well, then place into a bowl. ", "Add the smoked cheese, thyme, sage, peas and ricotta to the bowl of leeks and mix together until well combined. ", "Spread about three tablespoons of the filling over one pancake. Roll up the bottom, then the two sides; roll the pancake upwards to form a cylindrical shape like a spring roll. Repeat with the remaining filling and pancakes.", "Dredge each pancake roll in flour, then dip into the beaten egg and roll in the polenta to coat. ", "Heat a drizzle of oil in a frying pan and fry the pancake rolls for 3-4 minutes on each side, or until golden-brown all over. Place the pancakes into the oven to cook for 10-12 minutes, or until heated through. Set aside.", "For the salsa, mix together all of the salsa ingredients in a bowl. ", "To serve, arrange the pancake rolls on serving plates with the salsa in small bowls alongside for dipping."]}, {"isVegetarian": false, "title": "Leek and smoked salmon tart with salad", "url": "www_bbc_co_uk_food_recipes_leekandsmokedsalmont_89896", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz ready-made shortcrust pastry", "50g/2oz butter", "750g/1lb 10½oz trimmed leeks, finely sliced", "5 sprigs fresh thyme, leaves only", "200ml/7fl oz double cream", "1 free-range egg", "1 free-range egg yolk", "salt and freshly ground black pepper", "200g/7oz smoked salmon", "75g/3oz gruyère cheese, grated", "1 tbsp wholegrain mustard", "1 tbsp white wine vinegar", "3 tbsp extra virgin olive oil", "2 Little Gem lettuces, leaves trimmedseparated", "50g/2oz watercress"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the tart, preheat the oven to 200C/400F/Gas 6.", "On a lightly floured surface, roll out the pastry to line a 20cm/8in diameter, 2.5cm/1in deep loose-bottomed tart tin. Line the inside of the tin with the pastry, then cover and chill in the fridge for 30 minutes.", "Remove the tart case from the fridge. Line the pastry tart case with greaseproof paper and fill with baking beans or uncooked rice. Bake blind in the oven for 15 minutes.", "Remove the baking beans or rice and greaseproof paper and return the tart case to the oven to bake for a further 5-6 minutes, or until it is just cooked and becoming golden-brown.", "Reduce the oven temperature to 180C/360F/Gas 4.", "Meanwhile, melt the butter in a large frying pan over a low heat. Add the leeks and fry until just softened. Remove from the heat and leave to cool.", "Place the cream, egg and egg yolk into a bowl and whisk to combine.", "Add the egg and cream mixture to the cold leeks and mix together well. Season well with salt and freshly ground black pepper.", "Pour the leek mixture into the cooked pastry case.", "Place the smoked salmon over the top of the leek mixture filling, to cover the filling completely.", "Sprinkle the grated gruyère over the top of the smoked salmon layer. Bake in the oven for 20 minutes, or until the filling is just set and the top is golden-brown.", "For the salad, whisk the mustard, vinegar and olive oil together in a bowl. Add the Little Gems and watercress and mix well.", "To serve, place a slice of tart onto each plate and place a portion of salad alongside."]}, {"isVegetarian": true, "title": "Leek and sweet potato gratin", "url": "www_bbc_co_uk_food_recipes_leekandsweetpotatogr_89400", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "25g/1oz butter", "½ onion, chopped", "½ leek, white part only, sliced", "½ sweet potato, peeled and sliced", "2 tbsp white wine", "200ml/7fl oz double cream", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Heat the oil and butter in an ovenproof frying pan over a medium heat. Fry the onion and leek for 3-4 minutes, or until softened. Add the sweet potato and fry for a further two minutes.", "Add the wine and simmer for 1-2 minutes until the liquid has reduced. Add the cream, season to taste with salt and freshly ground black pepper, and stir well.", "Transfer the pan to the oven and cook for 10-12 minutes, or until the potatoes are cooked through and the cream is bubbling.", "To serve, spoon onto a serving plate and serve immediately as a side dish."]}, {"isVegetarian": false, "title": "Leek and spring onion terrine with roasted ham and mustard dressing", "url": "www_bbc_co_uk_food_recipes_leekandspringonionte_86658", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 medium leeks, trimmed", "12 spring onions, trimmed", "750ml/1 pint 6fl oz vegetable stock", "1 bay leaf", "3 leaves gelatine", "salt and freshly ground black pepper", "2 tbsp roughly chopped fresh chervil", "1 tsp English mustard", "2 tsp white wine vinegar", "½ lemon, juice only", "250ml/9fl oz rapeseed oil", "salt and freshly ground black pepper ", "750g/1lb 10oz cooked ham, sliced, to serve"], "serves": "Serves 4-6", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the terrine, place the leeks and spring onions into a wide shallow pan with the vegetable stock and bay leaf. Bring to the boil, then reduce the heat and simmer for 8-10 minutes, or until the vegetables are tender. Remove the vegetables from the pan and set aside.", "Return the pan to the heat and boil to reduce the volume of the stock by two thirds.", "Meanwhile, soak the gelatine leaves in cold water until softened. Strain, then add to the reduced stock. Whisk to combine, then strain into a bowl. Allow to cool, then season with salt and freshly ground black pepper and stir in the chervil.", "Place into the fridge and chill for 30 minutes, or until just setting, but still with a good wobble.", "On a work surface, place three large sheets of cling film one on top of the other. Lay the leeks in a row on the cling film, then top with the spring onions.", "Spoon over the jelly, then roll the cling film up into a large cigar shape, twisting firmly to enclose at both ends. Place in the fridge for at least an hour until fully set.", "For the dressing, whisk the mustard, vinegar and lemon juice together in a bowl. Slowly whisk in the rapeseed oil and season, to taste, with salt and freshly ground black pepper.", "To serve, slice the terrine into wedges and place onto serving plates with some slices of ham and a drizzle of dressing."]}, {"isVegetarian": true, "title": "Leek and Stilton tart", "url": "www_bbc_co_uk_food_recipes_leekandstiltontart_85730", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 sheet ready-made filo pastry", "25g/1oz butter, melted", "1 tbsp olive oil", "¼ leek, finely sliced", "2 free-range egg yolks", "2 tbsp double cream", "1 tbsp chopped fresh chives, plus extra to serve ", "salt and freshly ground black pepper", "30g/1oz Stilton, crumbled"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Brush the filo pastry with butter, fold in half and press into a chefs' ring on a baking sheet. Brush with more butter, then transfer to the oven and bake for eight minutes, or until golden-brown.", "Meanwhile, heat the olive oil in a small pan, add the leek and sauté for 3-4 minutes, until softened. Leave to cool slightly.", "Place the eggs, cream and chives into a bowl, season with salt and freshly ground black pepper and mix well. Add the leeks to the bowl and stir to combine.", "Remove the filo pastry case from the oven, pour in the egg mixture and top with the Stilton. Return to the oven and bake for 8-10 minutes, or until the filling has set.", "To serve, place the tart onto a plate, remove the chefs' ring and sprinkle with chopped chives."]}, {"isVegetarian": true, "title": "Leek, blue cheese and potato soup", "url": "www_bbc_co_uk_food_recipes_leekbluecheeseandpot_88555", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "25g/1oz butter", "½ onion, chopped", "1 garlic clove, finely chopped", "200g/7oz new potatoes, chopped", "85g/3oz baby leeks, sliced", "300ml/10fl oz hot chicken or vegetable stock", "85g/3oz Lanark Blue cheese, or other blue cheese, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil and butter in a pan and gently fry the onion and garlic for a couple of minutes, until softened.", "Add the potatoes and leeks and continue to fry for another 3-4 minutes.", "Add the stock and bring to a simmer. Simmer for 10-12 minutes, or until the potatoes are tender.", "Serve in a bowl, with the blue cheese crumbled over the top."]}, {"isVegetarian": true, "title": "Leek, onion and garlic soup", "url": "www_bbc_co_uk_food_recipes_leekonionandgarlicso_86202", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "½ leek, finely sliced", "1 garlic clove, finely chopped", "¼ onion, finely chopped", "150ml/¼ pint hot vegetable stock", "1 tbsp double cream", "salt and freshly ground black pepper", "1 slice ciabatta, griddled", "olive oil, to drizzle"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a small saucepan, add the leek, garlic and onion and sauté gently for 3-4 minutes. Add the stock and simmer for five minutes. Remove from the heat and allow to cool slightly.", "Pour into a blender, add the cream and season well with salt and freshly ground black pepper. Blend until smooth. ", "To serve, pour into a bowl and top with the griddled ciabatta and a drizzle of olive oil."]}, {"isVegetarian": false, "title": "Leek risotto with parmesan crisps", "url": "www_bbc_co_uk_food_recipes_leekrisottowithparme_92285", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/leekrisottowithparme_92285_16x9.jpg", "ingredients": ["2 medium leeks, sliced", "thick slice of butter", "3-4 tarragon stalks, leaves only ", "2 good spilling handfuls of arborio rice (about 200g/7oz)", "175ml/6fl oz wineglass dry white wine", "1 litre/1 pint 15fl oz hot homemade chicken stock (the stock can be made from leftover roast chicken)", "salt and freshly ground black pepper", "2 heaped tablespoons finely grated parmesan cheese"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Scatter the chopped leeks into a large shallow pan, add the butter and some tarragon leaves and cook over a gentle heat, stirring from time to time, until the leeks soften and become translucent but not coloured, about 12-15 minutes.", "Stir in the rice to coat in the butter, then add the wine and let it bubble until the liquid has pretty much disappeared. Little by little add the hot stock, a couple of ladlefuls at a time at the most. When the rice absorbs the liquid and starts to diminish in the pan, you can add another ladle or so, stirring the rice often. Continue cooking until the rice has become plump and creamy but still has a little bite left in it, about 20 minutes. Season, to taste, with salt and freshly ground black pepper. ", "The parmesan crisps can be made about ten minutes before the serving the risotto. Place each spoonful of finely grated parmesan into a non-stick pan over a low heat and flatten slightly with the back of a spoon so it looks like a biscuit. Leave it to cook gently, so that the parmesan melts and forms a little crust. Once it is crisp on the bottom, very carefully flip it over using a palette knife. Cook for a minute or two on the other side and then remove from the pan. Serve the risotto in two bowls, both topped with a parmesan crisp."]}, {"isVegetarian": true, "title": "Leek soup", "url": "www_bbc_co_uk_food_recipes_leeksoup_87413", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["dash olive oil", "½ onion, chopped", "1 garlic clove, peeled and finely chopped", "½ large leek, chopped", "150ml/5¼fl oz hot vegetable stock", "150ml/5¼fl oz whole milk", "salt and freshly ground black pepper", "1 tbsp double cream, to serve", "1 tsp chopped fresh chives, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a small saucepan, add the onion, garlic and leek and sauté for 4-5 minutes, or until softened but not coloured. ", "Add the vegetable stock, milk and seasoning and bring to the boil. Simmer for six minutes, then remove from the heat and allow to cool slightly. Pour into a food processor and blend until smooth. ", "To serve, pour into a bowl and garnish with a swirl of double cream and chopped chives."]}, {"isVegetarian": true, "title": "Leek soup with chilli and cheese croutes", "url": "www_bbc_co_uk_food_recipes_leeksoupwithchillian_90087", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "½ onion, chopped", "1 garlic clove, finely chopped", "½ leek, green part only, chopped", "400ml/14fl oz vegetable stock", "3 tbsp double cream", "salt and freshly ground black pepper", "3 slices French stick", "85g/3oz mature cheddar, grated", "1 red chilli, de-seeded and finely chopped"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the soup, heat the oil in a pan and gently fry the onion, garlic and leek for about 3-4 minutes, or until softened. Add the stock and simmer for 4-5 minutes, then stir in the cream. Season, to taste, with salt and freshly ground black pepper then blend until smooth with a stick blender. ", "For the croûtes, arrange the slices of bread on a tray and bake in the oven for 2-3 minutes, or until crisp. Remove from the oven, sprinkle over the cheese and chilli and return to the oven for a further 3-4 minutes, or until the cheese is melted.", "Serve the soup in a bowl with the croûtes on the side."]}, {"isVegetarian": true, "title": "Leeks with three mustard and cheese sauce", "url": "www_bbc_co_uk_food_recipes_leekswiththreemustar_8917", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3lb (1kg 350g) small leeks, trimmed and washed and cut in half", "salt and pepper", "2oz (50g) butter", "3oz (50g) plain flour", "¾ pint (425ml) milk", "6oz (175g) cheddar cheese, grated ", "1oz (25g) parmesan, or similar vegetarian hard cheese, grated", "1 tbsp (15g) wholegrain mustard", "1 tbsp (15g) Dijon mustard", "1 tsp (5g)  English mustard", "2 tbsp  fresh white breadcurmbs", "1oz (25g) grated cheddar cheese"], "serves": "8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat oven to 200C/400F/Gas 6/180C fan oven.", "Place the leeks in a pan of cold salted water, bring to the boil and simmer for 3 minutes until just tender. Drain and put under cold water immediately to refresh and stop the cooking process.", "Place the butter, flour and milk in a saucepan and slowly bring up to the boil and whisk all the time. Once it is up to the boil, reduce the heat and let it just simmer for 2 minutes.", "Add the grated cheddar and parmesan and then the mustards. Season with salt and pepper.", "Put your leeks into a shallow serving dish and pour over the sauce.", "Mix the breadcrumbs and the cheese together and scatter over the top of the leeks.", "Bake in the oven for 20 minutes until the top is golden brown."]}, {"isVegetarian": false, "title": "Thai green prawn curry", "url": "www_bbc_co_uk_food_recipes_leelikolminicurrygre_12734", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/leelikolminicurrygre_12734_16x9.jpg", "ingredients": ["2 tbsp oil", "1 onion, finely sliced", "6 garlic cloves, crushed", "4cm/1½in piece of fresh ginger, crushed", "2 hot green chillies, seeds removed, finely chopped", "½ tsp ground turmeric", "450ml/14fl oz can coconut milk", "4 green cardamom pods, lightly crushed", "4 cloves", "5-6 curry leaves (available from Asian grocers)", "2cm/¾in piece cinnamon stick", "2 tbsp chopped fresh coriander", "500g/1lb 2oz tiger prawns, cleaned and de-veined, shells removed but tail intact"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a large heavy-based pan with a lid. Add the onion and cook until translucent.", "Add the garlic, ginger and green chillies and cook for two minutes, taking care not to let them brown. ", "Add the turmeric and cook for a few seconds, then pour in the coconut milk. Bring slowly to the boil, stirring right from the bottom of the mixture. ", "Season with salt, then add the cardamom, cloves, curry leaves and cinnamon. Simmer for a couple of minutes, until the mixture has thickened slightly, then add the coriander and cook for another minute or two. ", "Add the prawns and cook for 2-4 minutes, depending on their size. Cover the pan, remove from the heat and set aside for about five minutes. The prawns will continue to cook in the residual heat of the curry (more cooking on the stove will spoil the prawns by overcooking).", "Serve with steamed jasmine rice and a fresh onion salad."]}, {"isVegetarian": false, "title": "Lee's brown-bag fried chicken", "url": "www_bbc_co_uk_food_recipes_leesbrownbagfriedchi_91744", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/leesbrownbagfriedchi_91744_16x9.jpg", "ingredients": ["2 chicken breasts (wing bone attached), skin on, cut in two diagonally", "2 chicken legs, skin on", "2 chicken thighs, skin on", "1 litre/1¾ pints sunflower oil, for deep frying", "7 tbsp plain white flour", "1 tbsp dried oregano, crumbled", "1 tbsp dried thyme leaves", "1 tbsp dried rosemary leaves, crumbled", "2 tsp cayenne pepper", "2 tsp ground white pepper", "1 tbsp sea salt flakes", "100ml/3½fl oz evaporated milk", "2 free-range eggs, beaten ", "French fries", "ready-made tomato ketchup, mayonnaise or barbecue sauce (optional)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Rinse the chicken pieces in cold water, then pat dry with kitchen paper. ", "For the coating, tip the flour, dried herbs, cayenne pepper, white pepper and a pinch of salt into a large, strong polythene bag. Shake until well combined. ", "In a bowl, beat together the evaporated milk and eggs until well combined. Set aside. ", "Half-fill a large, heavy-based pan with the oil and heat to 180C/350F (use a kitchen thermometer to check the temperature). ", "Dip a chicken piece into the milk and egg mixture until completely coated, then place it into the polythene bag containing the flour and herb mixture. Twist the bag closed, trapping in air so that it resembles a balloon, and shake vigorously until the chicken piece is completely coated. Remove the chicken piece from the bag and set aside on a plate. Repeat the process with the remaining chicken pieces.", "Carefully lower the coated chicken pieces into the hot oil, one at a time, using tongs. When all of the chicken pieces have been added, the oil should be just bubbling. Cook the chicken in the oil for 18-20 minutes, turning regularly, until crisp and deep golden-brown and completely cooked through. Remove the cooked chicken from the pan using a slotted spoon and set aside to drain on kitchen paper. ", "To serve, divide the chicken pieces equally among four serving plates. Serve with French fries and dollops of tomato ketchup, mayonnaise or barbecue sauce, if using."]}, {"isVegetarian": false, "title": "Leftover turkey and ham pie", "url": "www_bbc_co_uk_food_recipes_leftover_turkey_and_ham_95969", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/leftover_turkey_and_ham_95969_16x9.jpg", "ingredients": ["400g/14oz plain flour, plus extra for dusting ", "pinch of salt", "65g/2¼oz chilled butter\t", "160g/5¾oz frozen butter\t", "45g/1½oz butter", "2 large leeks, washed and roughly sliced", "1 orange, juice and finely grated zest only", "50ml/2fl oz medium sherry", "3 tbsp plain flour", "500ml/18fl oz chicken stock (or 250ml/9fl oz leftover gravy and 250ml/9fl oz stock)", "1 heaped tsp wholegrain mustard", "600g/1lb 5oz leftover turkey meat, cut into bite-sized pieces", "250g/9oz cooked ham, cut into bite-sized pieces", "2 tbsp roughly chopped tarragon", "200ml/7fl oz single cream", "1 free-range egg, beaten for egg wash", "salt and white pepper "], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["For the pastry, mix the flour and salt together in a bowl. Rub in the chilled butter using your fingertips. Gradually add enough cold water to form a dough (about 150-180ml/5-6fl oz).", "Lightly dust the work surface with flour and roll the dough into a rectangle. Grate 60g/2¼oz of the frozen butter over the bottom two thirds of the dough. Fold down the top third and fold up the top third as if folding a letter. Turn by 90 degrees and roll out again. Repeat, adding the remaining frozen butter and fold as before. Rest in the fridge for 30 minutes before using. ", "For the filling, melt the butter in a large frying pan over a medium heat and add the leeks to the pan with the orange juice, zest and sherry. Cover and cook gently for 6 minutes, stirring occasionally until the leeks are just tender. Remove the lid and increase the heat, reduce the volume of liquid until you are left with a few spoonfuls of buttery liquid. Sprinkle the flour over the leeks and stir to mix evenly. Gradually stir in the stock and simmer for 5 minutes until the sauce has thickened slightly.  Add the mustard, turkey and ham and stir. Finally add the tarragon and cream. Season to taste with a little white pepper and salt.", "Preheat the oven to 200C/180C Fan/Gas 6.  ", "Pour the pie filling and sauce into a 1.2-1.5 litre/2-2½ pint pie dish dish and allow to cool. If you have a pie funnel, put it in the middle of the filling.", "Roll out the pastry on a lightly floured work surface to about 5mm thick. Cut a 2cm/¾in strip of pastry. Brush the rim of the pie dish with egg wash, then place the pastry strip onto the rim and brush it with more egg wash. ", "To make the pie lid, cut the remaining pastry a little larger than the dish and lift it into place (use the rolling pin to help you). Make a steam hole to expose the funnel (if using). Press the edges to seal then trim away any excess. Re-roll any trimmings and use them to make decorations. Brush the pastry with egg wash, arrange any decorations on top of the pie and brush these with egg too.", "Bake for 35-40 minutes until the pastry is risen and golden-brown. Allow to cool slightly before serving. "]}, {"isVegetarian": false, "title": "Leftover waffles with pancetta, maple syrup and ice cream", "url": "www_bbc_co_uk_food_recipes_leftover_waffles_with_59419", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["260g/9½oz plain flour", "1 tbsp baking powder ", "1 tsp sea salt flakes", "1 tbsp granulated sugar", "3 large free-range eggs, lightly beaten", "425ml/15fl oz full-fat milk", "110g/3¾oz unsalted butter, melted", "150g/5½oz leftover smoked salmon, torn into small pieces", "2 tbsp finely chopped chives", "12 thin slices pancetta", "maple syrup, to taste", "vanilla ice cream, to taste"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the waffle maker and preheat the oven to 140C/120C Fan/Gas 1. Put a large wire rack on a baking tray and keep it warm in the oven. ", "In a large mixing bowl, combine the flour, baking powder, salt and sugar. Whisk in the eggs, milk and butter and combine thoroughly. Mix in the smoked salmon and chives.", "Ladle the batter into each well of the waffle maker and close the lid. Cook the waffles for 5 minutes, then lift the lid and check the waffle – it should be golden-brown and crisp. Transfer to the wire rack in the oven and repeat the process with the remaining batter.", "For the pancetta, preheat the grill to high. Place the pancetta on a lined tray and grill for 6-7 minutes until crisp, turning once. ", "Serve the waffles with the pancetta, maple syrup and ice cream. "]}, {"isVegetarian": false, "title": "Leftover roast chicken stock", "url": "www_bbc_co_uk_food_recipes_leftoverroastchicken_92286", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["leftover roast chicken", "vegetables, such as onions, carrots and celery"], "serves": "Makes 1-2 litres", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Place the bones of the leftover roast chicken in a large pan or stockpot with any vegetables you have, such as onions, carrots and celery, and cover with cold water. Bring to a simmer and cook gently for 2-6 hours depending what time allows, but as a general rule the longer it can simmer, the better the flavour will be. Strain and either store for 3-4 days in the fridge or freeze and use from frozen when needed."]}, {"isVegetarian": false, "title": "Leg of lamb in hay with lavender", "url": "www_bbc_co_uk_food_recipes_leg_of_lamb_in_hay_with_43057", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 2.7kg/5lb10oz leg of lamb", "1 small handful lavender, preferably freshly picked", "½ bag hay", "50g/2oz butter, softened, plus an extra knob for the broccoli ", "10 King Edward potatoes, peeled and cut into 2 or 3 pieces", "75g/2¾oz beef dripping or vegetable oil", "75ml/2¾fl oz malt vinegar", "25g/1oz caster sugar", "1 large bunch fresh mint leaves, finely chopped", "400g/14oz purple sprouting broccoli", "sea salt and freshly ground black pepper"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. ", "Pierce the leg of lamb 10-12 times all over using the point of a sharp knife, then insert the lavender sprigs into the holes.", "Use the hay to stuff a large, deep-sided roasting tray, one that’s large enough for the whole leg of lamb. Sprinkle over the remaining lavender leaves.", "Place the leg of lamb onto the hay, then rub it all over with the softened butter, and season, to taste, with salt and freshly ground black pepper. Cover the roasting tray with aluminium foil.", "Roast the lamb in the oven for 2-3 hours (for tender meat with a trace of pink), or until cooked to your liking, then remove it from the oven and set aside to rest for at least 30 minutes.", "Meanwhile, bring the potatoes to the boil in a large pan of salted water and continue to boil for 2 minutes. Drain into a colander and shake them around to fluff up the edges.", "When the lamb has about an hour left to cook, scrape the beef dripping into a large roasting tray, add the potatoes and season with salt flakes. Add them to the oven and roast for 25-30 minutes, or until golden-brown and crisp on their undersides, then turn them to coat them in the fat and continue to roast for a further 20-30 minutes, or until golden-brown and crisp all over.", "Bring the vinegar and sugar to a simmer in a non-reactive saucepan, then remove the pan from the heat and stir in the chopped mint. Season with a pinch of salt. ", "Just before serving, cook the broccoli until just tender in a pan of salted, boiling water (about 2-3 minutes). Drain and season, to taste, with salt and freshly ground black pepper and a knob of butter.", "To serve, transfer the lamb to a serving platter and carve into slices. Serve with the roast potatoes and purple sprouting broccoli alongside, and drizzle over the mint sauce."]}, {"isVegetarian": false, "title": "Legume canapés", "url": "www_bbc_co_uk_food_recipes_legume_canaps_26578", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["35g/1¼oz plain flour", "25g/1oz butter, cut into small pieces", "1 large free-range egg, beaten", "pinch sugar", "pinch salt", "5 sheets gelatine", "150g/5½oz tomato ketchup", "120g/4½oz smoked trout", "100g/3½oz unsalted butter, softened", "½ tbsp creamed horseradish", "40g/1½oz soured cream ", "handful fresh parsley, chopped", "handful fresh dill, chopped", "fresh lemon juice, to taste", "salt and freshly ground black pepper", "bunch fresh basil, to decorate ", "250g/9oz plain flour", "2 tsp smoked paprika", "¼ tsp sugar", "1 tsp salt", "125g/4½oz unsalted butter, cut into small pieces", "1 free-range egg", "1 free-range egg yolk", "pinch smoked paprika", "pinch ground turmeric", "drop orange food colouring", "1 x 400g/14oz can chickpeas", "50ml/2fl oz light tahini", "1 lemon, juice only", "2 garlic cloves, crushed", "1 tsp ground cumin", "handful fresh coriander, chopped", "salt and freshly ground black pepper", "pinch smoked paprika", "fresh dill, to garnish", "freshly ground black pepper", "few pinches grated nutmeg", "handful chives", "handful dill", "400g/14oz cauliflower", "100g/3½oz garlic and herb cream cheese", "1½ tsp salt", "½ tsp Dijon mustard", "300g/10½oz self-raising flour, plus extra for flouring", "½ tsp salt ", "½ tsp pepper", "100g/3½oz unsalted butter, cut into small pieces", "handful chives, finely chopped", "100g/3½oz Comté, grated (alternatively use Gruyère)", "150ml/5fl oz full-fat milk", "4 Little Gem lettuces ", "pinch grated nutmeg"], "serves": "Serves 36 canapés", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the choux pastry 'tomatoes', preheat the oven to 190C/375F/Gas 5 and line a baking tray with non-stick baking parchment. Use a pastry cutter to mark 12 circles that are 3.5cm/1½in in diameter, with space between them of the same width. ", "Take a sheet of baking parchment and crease it in the middle then open out flat. Sift the flour into the centre of the crease and set aside. (This is to make it easy to add to the pan in the next step.)", "Put 60ml/2fl oz of cold water and the butter into a small saucepan and heat gently, stirring until the butter has melted. Slowly bring to the boil and then immediately remove the pan from the heat. Tip the sifted flour into the pan all in one go and beat vigorously with a wooden spoon until the mixture forms a ball of paste. Allow to cool slightly, then beat in the beaten egg to form a smooth glossy paste. ", "Place a piping bag fitted with a round nozzle into the neck of a tall glass and spoon the paste into it. Lightly spray the prepared baking tray with water and pipe evenly sized balls (3.5cm/1½in) onto the marked circles on the prepared baking parchment.", "Bake in the oven for approximately 10 minutes, or until the choux pastry is golden-brown, crisp and risen. Remove from the oven. Reduce the temperature to 160C/325F/Gas 3 and pierce the base of each bun with a cocktail stick. Return to the oven to dry out for a few minutes and then transfer to a wire rack to cool completely. ", "For the tomato glaze, soften the sheets of gelatine in a bowl of cold water for about five minutes. Measure the tomato ketchup into a small saucepan and, once the gelatine sheets have softened, squeeze off the excess water and add to the pan. ", "Stir over a low heat until a smooth mixture forms, then strain into a bowl through a fine sieve and set aside. ", "For the smoked trout pâté, place the smoked trout and butter in a food processor and blend until smooth. Add the creamed horseradish, soured cream and chopped herbs and blend again. Add the lemon juice and season to taste with salt and pepper. Spoon the pâté into a piping bag fitted with a small plain nozzle and fill each choux bun with the pâté by inserting the nozzle into the holes in the bases.  ", "Coat each choux bun with tomato glaze by carefully spooning it over the top. Place a small sprig of basil on top of each (to resemble a tomato leaf) and leave to set. ", "For the 'Chantenay carrots', place the flour, paprika, sugar and salt in a bowl. Using your fingertips, rub in the butter until the mixture resembles fine breadcrumbs. Make a well in the centre of the mixture, add the egg and bring the pastry together. Gradually add a tablespoon of cold water while working the pastry with your hands. ", "Transfer to a lightly floured work surface and gently knead to form a ball. Wrap in cling film and place in the fridge to rest for at least 45 minutes, or ideally 1-2 hours.", "For the glaze, beat together all the ingredients in a bowl.", "Preheat the oven to 190C/375F/Gas 5 and line a baking tray with non-stick baking parchment.", "Take the chilled pastry from the fridge, remove the cling film and divide the pastry into three. On to a lightly floured work surface, roll each piece into a circle, then divide each circle into four quarters. Carefully wrap each quarter around a pastry horn mould and brush with the prepared glaze. Use a fork to create a carrot texture over the pastry and place each 'carrot' on the lined baking tray. Bake for approximately eight minutes, or until lightly golden-brown and crisp. When cool enough to handle, remove the pastry horn moulds, brush with the glaze and set aside to cool completely.", "For the cumin and coriander hummus, drain and rinse the chickpeas. Place the tahini and lemon juice in a food processor and blend for one minute. Scrape down the sides and blend again for half a minute. Add the garlic and cumin and blend again. Add the drained chickpeas and blend again. Add the chopped coriander and blend once again. Season to taste with salt and pepper and transfer the mixture to a bowl. Chill in the fridge for 10-15 minutes. ", "To make the cauliflower purée, preheat the oven to 110C/225F/Gas ¼.", "Place some water in a large saucepan with a little black pepper, a pinch of grated nutmeg and the chives and dill. Steam the cauliflower over the flavoured water until cooked. Place the cooked cauliflower in a roasting tray and bake in the preheated oven until dry. Transfer to a bowl and set aside to cool. ", "For the cheese scones, preheat the oven to 190C/375F/Gas 5 and line a baking tray with non-stick baking parchment.", "Sift the flour, salt and pepper into a large bowl. Use your fingertips to rub in the butter until the mixture resembles fine breadcrumbs. Mix in the chopped chives and grated cheese. Gradually add the milk until the mixture comes together to form a dough. Turn out onto a lightly floured work surface and very gently knead to create a smooth, soft dough. Gently roll out the dough and cut into rounds with a 3.5cm/1½in round pastry cutter. ", "Place the scones on the prepared baking tray and bake for approximately 10 minutes, or until risen, lightly golden-brown and crisp. Remove from the oven and leave to cool. Once cool, cut the top off each scone.", "For the cauliflower purée, blend the cooked cauliflower using a stick blender or food processor. Add the garlic and herb cream cheese, salt, Dijon mustard and a pinch of grated nutmeg and black pepper. Spoon the purée into another piping bag fitted with a star nozzle and pipe a little of the mixture on the top of each scone.", "Remove some leaves from the Little Gem lettuces and, using a fluted pastry cutter, cut through the leaves to create circles which will represent the leaves of a cauliflower. Place a lettuce circle on top of each scone and press gently to help it stick to the purée. Pipe more purée on top of the lettuce (to resemble the florets of a cauliflower) and finish with a fine grating of nutmeg.", "Just before serving, spoon the hummus into a piping bag and pipe into the cooled pastry carrots. Sprinkle with the smoked paprika and arrange some fresh dill on top to look like carrot tops."]}, {"isVegetarian": false, "title": "Lemon-and-herb stuffed shoulder of lamb", "url": "www_bbc_co_uk_food_recipes_lemon-and-herb_stuffed_91538", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon-and-herb_stuffed_91538_16x9.jpg", "ingredients": ["500g/1lb 2oz reserved lamb bones (see below)", "splash olive oil", "½ medium onion, peeled, cut into quarters", "2 celery sticks, trimmed, cut into short lengths", "1 medium carrot, peeled, cut into short lengths", "4 sprigs fresh thyme", "1 fresh bay leaf", "1 litre/1¾ pints cold water", "1 tsp fine sea salt", "1 heaped tbsp plain flour", "1 tbsp redcurrant jelly", "few sprigs fresh mint", "3 tbsp extra virgin olive oil", "75-100g/2½-3½oz slightly stale white bread, crusts removed, bread cut into 1cm cubes", "1 medium leek, washed, trimmed, finely sliced", "½ medium onion, peeled, finely sliced", "4 garlic cloves, peeled, crushed to a paste", "2 tbsp baby capers, drained", "1 small lemon (preferably unwaxed), finely grated zest only", "5 heaped tbsp chopped fresh mint", "3 heaped tbsp chopped fresh parsley", "1 tsp sea salt flakes", "freshly ground black pepper", "3 tbsp finely chopped fresh mint leaves, plus extra small whole mint leaves, to serve", "2 tsp caster sugar", "2 tbsp white wine vinegar", "splash extra virgin olive oil", "2kg/4lb 8oz bone-out lamb shoulder (ask your butcher for the bone), fat and sinew trimmed", "sea salt flakes", "freshly ground black pepper", "2 tsp extra virgin olive oil", "2 tbsp olive oil, plus extra for greasing", "1 large onion, peeled, finely sliced", "3-4 sprigs fresh thyme, plus extra to garnish", "3 garlic cloves, peeled, finely sliced", "1.2 kg/2lb 4oz floury potatoes, such as Maris Piper, peeled, thinly sliced to the thickness of a £1 coin", "400ml/14fl oz chicken or vegetable stock", "sea salt flakes", "freshly ground black pepper"], "serves": "Serves 6", "time": {"preparation": "1-2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the lamb jus, first make some lamb stock. Put the lamb bones into a large saucepan with a little oil and fry over a medium to high heat for 8-10 minutes, until lightly browned all over. Add the onion, celery, carrot, thyme and bay leaf to the pan.", "Pour over the water and bring the mixture to the boil. Reduce the heat until the stock is simmering, then continue to simmer for 45 minutes, skimming the foam from the surface of the liquid at regular intervals.", "Remove the stock from the heat and strain through a fine sieve into a clean jug or bowl; set aside to cool. Once cooled, spoon off any fat that has risen to the surface of the liquid.", "While the stock is simmering, make the stuffing. Heat two tbsp of the oil in a large non-stick frying pan over a low to medium heat. Add the bread cubes, in batches if necessary, and fry for 3-4 minutes, or until golden-brown. Transfer the fried bread cubes to a large mixing bowl.", "Add the remaining oil to the frying pan and add the leek, onion and garlic. Fry for 2-3 minutes, stirring regularly, until softened but not browned. Transfer the vegetables to the bowl containing the bread.", "Stir the capers, lemon zest, mint and parsley into the bread and vegetables until well combined, then season, to taste, with salt and freshly ground black pepper. Set aside to cool.", "For the mint sauce, mix the chopped mint leaves and sugar in a small bowl, then crush using the back of a spoon for 1-2 minutes to extract the flavour from the mint. Stir in the white wine vinegar and a dash of olive oil until well combined. Set aside.", "For the lamb, place the lamb onto a chopping bard, skin-side down. Cover the lamb with a large sheet of cling film, then flatten the meat into a large, neat rectangle shape, about 3cm/1½in in thickness, using a rolling pin or meat mallet. Season all over with salt and freshly ground black pepper.", "With the longest sides of the lamb rectangle facing you, spoon the stuffing mixture horizontally across the middle of the lamb rectangle (from one short side to the other). Wrap the two long sides of the lamb rectangle around the stuffing to fully enclose it. Truss the lamb securely at 3cm/1½in intervals in several places using cooking string. (Tie the two ends first, then the middle, then fill in the gaps. That way the stuffing doesn't get squeezed out.)", "Weigh the trussed lamb joint and make a note of the weight, then place the lamb into a roasting tin. (At this stage, the lamb can be chilled for several hours; remove from the fridge and bring back to room temperature before roasting.)", "For the boulangère potatoes, heat the oil in a large, non-stick frying pan over a medium heat. Add the onion and thyme sprigs and fry, stirring occasionally, for 8-10 minutes, until the onion has softened and browned slightly. Add the garlic and continue to fry for 2-3 minutes, then season, to taste, with salt and freshly ground black pepper.", "Grease a 20cm x 30cm/8in x 12in roasting tin or ovenproof dish with a little oil.", "Arrange a layer of potato slices to cover the base of the dish. Sprinkle over one-third of the fried onions. Continue layering the potato slices and onion mixture, ending with a layer of potatoes. ", "Pour over the stock until it just reaches the top layer of potatoes. Season again with freshly ground black pepper and garnish with a few sprigs of thyme.", "To cook the lamb and potatoes, preheat the oven to 200C/400F/Gas 6. Rub the trussed lamb joint all over with the oil and season well with salt and freshly ground black pepper. Roast the lamb in the centre of the oven, and the potatoes at the bottom of the oven. For the lamb, allow 20 minutes of cooking time per 500g/1lb 2oz of weight. (The full cooking time should be approximately 1hour 20minutes).", "When the lamb has cooked to your liking, remove from the oven and set aside on a chopping board. Cover with a piece of aluminium foil and a couple of clean tea towels to keep warm, then set aside to rest. Reserve the roasting tray.", "Meanwhile, continue cooking the potatoes at the top of the oven for a further 10-15 minutes, or until browned on top.", "To make the lamb jus, spoon as much fat as possible from the top of the juices left in the roasting tray, then place the tray over a medium heat and whisk the flour into the juices. Cook for 10-15 seconds.", "Gradually add 300ml/10½fl oz of the reserved lamb stock to the flour mixture, whisking after each addition until the mixture is smooth and well combined.", "Stir in the redcurrant jelly and the mint sprig and bring the mixture to a gentle simmer. Continue to simmer for 10 minutes, stirring occasionally, then season, to taste. Stir in any juices released from the resting meat, then strain the jus into a warmed jug.", "To serve, trim the ends off the roast lamb parcel, then remove the string. Carve the stuffed lamb shoulder into thick slices. Spoon a portion of boulangère potatoes into the centre of each of six warmed plates. Place a few slices of stuffed lamb alongside each and drizzle over the lamb jus and a little mint sauce. Garnish with a few small whole mint leaves."]}, {"isVegetarian": true, "title": "Lemon and raspberry éclairs", "url": "www_bbc_co_uk_food_recipes_lemon__raspberry_clairs_98706", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon__raspberry_clairs_98706_16x9.jpg", "ingredients": ["50g/1¾oz butter, cut into cubes, plus extra for greasing", "65g/2¼oz plain flour", "2 large free-range eggs, beaten", "600ml/1 pint double cream", "6 tbsp lemon curd", "2 tbsp freeze-dried raspberry powder", "400g/14oz icing sugar", "½ lemon, juice only", "pink food colouring paste", "yellow food colouring paste", "100g/3½oz white chocolate drops, melted ", "100g/3½oz dark chocolate drops, melted"], "serves": "Makes 12 éclairs", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/200C(fan)/Gas 7. Grease two large baking trays with butter. ", "For the choux pastry, put the butter and 150ml/5½fl oz water in a small pan over a low heat. Bring slowly to the boil, tip in the flour, then remove from the heat. Stir vigorously.", "When the mixture becomes a smooth paste, return the pan to the heat, stirring constantly. The mixture will dry out a little and form a soft ball that comes away from the sides of the pan.", "Remove the pan from the heat again, leave the mixture to cool slightly, then gradually add the eggs, beating really well between each addition until the mixture is smooth and glossy. (You may not need all the eggs, the mixture should be a piping consistency.)", "Sprinkle the baking tray with water (a water spray with a fine nozzle is good for this). ", "Spoon the éclair mixture into a large piping bag fitted with a 1cm/½in plain nozzle. Pipe the mixture onto the baking sheets into 7.5cm/3in lengths, leaving room between each éclair for them to spread a bit.", "Bake for 10 minutes, then reduce the heat to 190C/170C(fan)/Gas 5 and bake for a further 20 minutes. Split each éclair in half lengthways and transfer to a wire rack to cool completely.", "For the filling, whip the cream to soft peaks.  Divide the cream into separate bowls and fold the lemon curd into one bowl of cream and the raspberry powder into the other.", "Once the éclairs have cooled, spoon the lemon cream into a piping bag fitted with a 1cm/½in plain nozzle and pipe the lemon cream into the bottom half of six éclairs, then spoon the raspberry cream into the piping bag and pipe into the bottom half of the remaining éclairs. ", "For the icing, place half the icing sugar in a bowl and mix with enough lemon juice to form a very stiff icing. Colour with the yellow food colouring and spoon into a disposable piping bag.", "Tip the remaining icing sugar into a bowl and add enough water to make a very stiff icing. ", "Colour with the pink food colouring and spoon into a disposable piping bag.   Snip the ends off the piping bags and pipe on top of the raspberry éclairs.  Spread the icing out using a palette knife dipped in boiling water, so the top is smooth. ", "Repeat with the yellow icing on the remaining six eclairs.  Place on top of the lemon cream filled eclairs.", "Drizzle the melted white chocolate over the raspberry éclairs in a zig zag pattern. Drizzle swirls of melted dark chocolate over the lemon éclairs. Serve."]}, {"isVegetarian": true, "title": "Lemon and blueberry muffins", "url": "www_bbc_co_uk_food_recipes_lemon_and_blueberry_11428", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_and_blueberry_11428_16x9.jpg", "ingredients": ["100g/4oz butter", "250g/9oz self-raising flour", "1 tsp bicarbonate of soda", "100g/3½oz golden caster sugar, plus 2 tsp for sprinkling", "100g/3½oz blueberries", "1 lemon, zest only", "2 free-range eggs", "150ml/5fl oz low-fat natural yogurt", "2 tbsp milk", "12 tsp lemon curd"], "serves": "Makes 12", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. Line a 12-hole deep muffin tin with paper cases.", "Melt the butter in a small pan over a low heat then set aside to cool for a few minutes.", "Sift the flour and bicarbonate of soda into a large bowl and stir in the sugar, blueberries and lemon zest. Make a well in the centre.", "Beat the eggs with a large whisk until smooth then beat in the yogurt, milk and melted butter until well combined.  Stir into the flour mixture with a large metal spoon until very lightly mixed.", "Divide the batter between the muffin cases. Place a teaspoon of the lemon curd on top of each one and sprinkle with the remaining sugar. Bake for 20 minutes or until well risen and golden-brown. Serve warm or allow to cool on a wire rack. (The lemon curd will be very hot, so don’t eat as soon as they come out of the oven.)"]}, {"isVegetarian": true, "title": "Lemon and blueberry bursts", "url": "www_bbc_co_uk_food_recipes_lemon_and_blueberry_74594", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["85g/3oz ground almonds ", "120g/4oz icing sugar ", "2 free-range egg whites", "pinch salt", "50g/1¾oz caster sugar", "purple food colouring gel", "50g/1¾oz melted butter, plus extra for greasing ", "50g/1¾oz plain flour, plus extra for dusting", "1 free-range egg ", "50g/1¾oz caster sugar", "½ lemon, zest and juice ", "⅓ tsp baking powder", "100ml/3½fl oz limoncello liquor", "75ml/2½fl oz lemon juice", "75g/2½oz caster sugar", "250g/9oz blueberries ", "1 heaped tsp agar-agar flakes", "few drops lemon juice", "5-7 tsp granulated sugar", "1 tsp citric acid", "few drops purple food colouring", "100ml/3½fl oz double cream, whipped to soft peaks"], "serves": "Makes 12", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["To make the macaroon shells, preheat the oven to 150C/300F/Gas 2 and line a baking tray with a sheet of silicone paper.  Mark out rounds of 4cm/1.5in diameter on the reverse side of the paper with a pencil and set to one side.  ", "Pulse the almonds with the icing sugar in a food processor and then pass through a sieve to get rid of any larger bits of almond.  Put the egg whites with a pinch of salt in a free-standing food mixer with a whisk attachment and whisk until frothy, then gradually add the caster sugar a little a time, whisking in between each addition, until the whites are glossy and have firm peaks when the whisk is removed.  ", "Towards the end of the whisking, add a few drops of food colour and then add the egg whites to the icing sugar and almonds.  Mix until combined and so that the mixture falls off a spatula in ribbons.  Put the mixture into a piping bag which has a small round nozzle attached, no bigger than 1cm/½in in diameter.  Pipe the mixture onto the tray in the circles and leave to set for around 15 minutes. ", "Bake the macaroon shells for 12-15 minutes, until the shells peel off the paper easily. Leave them to cool on a wire rack.", "For the lemon sponges, increase the oven temperature to 200C/180C (fan)/Gas 6.  Grease the silicone moulds with melted butter, then dust with flour and set to one side.", "Whisk together the egg with the sugar in a bowl until pale and frothy. Add the butter, flour, lemon zest and juice and baking powder and mix well until combined.  Rest the batter for 20-30 minutes before pouring into the moulds and baking for 12-15 minutes.  ", "Remove from the moulds and cool on a wire rack for 10 minutes.  Dip each sponge into the limoncello and set to one side.", "For the lemon sugar syrup, place the lemon juice and sugar in a small saucepan and bring to a boil for 4-5 minutes, or until thickened and syrupy.  Remove from the heat and set to one side until cool.", "To make the blueberry gel, place the blueberries into a food processor and blend to a purée.  Sieve the purée into a saucepan to remove the skins and pips.  Sprinkle the agar-agar flakes over the purée and place on the heat without stirring.  ", "Once the mixture has heated through, stir and keep on the heat for 3-5 minutes. Pour into a cling film-lined cake tin and put into the fridge until set - around 30 minutes.  Once set, break the jelly into pieces and put into the food processor with a few drops of lemon juice and blend until smooth and is a gel consistency.  Transfer into a piping bag and keep cool until needed. ", "For the sherbet, mix together five teaspoons of the sugar, the citric acid and food colouring until the colour is even throughout.  Taste to ensure that the sherbet is not too sour and add more sugar, to taste.", "To assemble, brush a little of the lemon sugar syrup on the edges only of the sponges and then roll the edges in the sherbet.  Scoop out a little hole in the top of the sponge, making sure not to go too deep and cut through the bottom of the sponge.  Pipe a small blob of the blueberry gel in the hole.  Place the whipped cream in another piping bag and pipe a small blob of cream on each sponge making sure to hide the hole and its contents.  ", "Sandwich together the macaroons with the remaining gel and place a macaroon, on its side, on top of each sponge cake over the blob of whipped cream."]}, {"isVegetarian": true, "title": "Lemon and blueberry nougat", "url": "www_bbc_co_uk_food_recipes_lemon_and_blueberry_82699", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_and_blueberry_82699_16x9.jpg", "ingredients": ["400g/14oz granulated sugar", "100ml/3½fl oz clear honey ", "50ml/2fl oz liquid glucose  ", "2 large egg whites, at room temperature", "pinch of salt", "50g/1¾oz candied lemon peel, chopped", "75g/2½oz flaked almonds, toasted", "75g/2½oz dried blueberries ", "40g/1½oz white chocolate chips ", "handful of fresh blueberries, to scatter over the top"], "serves": "Makes 25 pieces of nougat", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Line a 17cm/7in square tin with baking parchment and line the base with rice paper.", "Put the sugar, honey and liquid glucose in a large, deep heavy-bottomed pan with 125ml/4½fl oz of cold water. Heat gently to dissolve the sugar (about 15 minutes). Put a sugar thermometer in the pan and bring the mixture to the boil. Allow it to bubble until the temperature reaches 125C/257F. (CAUTION: boiling sugar is extremely hot. Handle very carefully and do not leave unattended.)", "At this point, put the egg whites in the bowl of a freestanding mixer and whisk until stiff peaks form, taking care not to overbeat. Fill your sink with 10cm/4in of cold water.", "Continue to cook the syrup until the thermometer reaches 149C/300F – it should be a dark caramel colour. Dip the base of the pan in the cold water to stop the caramel cooking. ", "Slowly pour the caramel mixture into the food mixer taking care not to let it touch the beaters as it might splash you. It will froth up to the top of the mixing bowl. Add a pinch of salt and mix on a moderate speed for 5-8 minutes to incorporate all the syrup. The nougat is ready when it is light, fluffy and an off-white colour. ", "Working quickly, fold in the candied peel, most of the almonds and the dried blueberries, then pour the mixture into the prepared tin and spread it evenly in the tin using a wet knife. Sprinkle over the white chocolate chips with the remaining almonds and the fresh blueberries and leave to cool. Leave to set for a few hours before cutting into squares."]}, {"isVegetarian": true, "title": "Lemon and ginger millefeuilles", "url": "www_bbc_co_uk_food_recipes_lemon_and_ginger_mille_19111", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["750g/1lb 10oz strong white flour", "pinch salt", "250g/9oz unsalted butter, diced", "250g/9oz lard, diced", "1 tbsp lemon juice", "about 450ml/16fl oz iced water", "3 free-range eggs, plus 4 free-range egg yolks", "6 lemons, juice and zest of 3 lemons", "115g/4oz unsalted butter, diced", "115g/4oz caster sugar", "1 x 250g/9oz jar preserved ginger in syrup", "300ml/10fl oz double cream", "300ml/10fl oz crème fraîche", "300g/10oz cream cheese", "1 lemon, zest only   ", "2 tsp ground ginger", "250ml/9fl oz sugar", "125ml/4¼fl oz water", "500g/1lb 2oz fondant icing", "yellow food colouring"], "serves": "Makes 12", "time": {"preparation": "1-2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7. Line two large baking trays with greaseproof paper. You'll also need two more large baking trays.", "For the pastry, sift the flour and salt into a large bowl. Stir in the butter and lard then add the lemon juice and just enough iced water to bring the pastry together. Shape the dough into a block and chill in the freezer for 10 minutes. ", "Roll the pastry out to a rectangle of 5mm/¼in thickness and fold into thirds. Seal the edges by pressing them together, turn the pastry through 90 degrees and roll out again. Wrap in cling film and chill in the freezer for five minutes.", "Repeat step 3 twice then chill in the fridge for at least 20 minutes, or until ready to use. ", "Roll out one quarter of the pastry on a floured work surface to a 3mm/⅛i thickness and carefully place on one of the lined baking trays. Repeat with another quarter of the pastry. Return the remaining pastry to the fridge.", "Prick each sheet of pastry with a fork, dust with icing sugar and return to the fridge for five minutes. Lay a piece of greaseproof paper over each sheet of pastry, cover each with a empty baking tray and bake in the oven for 10 minutes. Remove the top baking tray and parchment, dust the pastry with icing sugar and return to the oven for 10 minutes.", "Repeat steps 5 and 6 with the remaining pastry.", "When the pastry sheets are cool, cut them with a pizza slicer or a sharp knife into 10cm x 5cm/4in x 2in rectangles. You will need 36 rectangles for the finished millefeuilles (this recipe makes plenty of pastry so don’t worry if there are a few breakages when you cut it).", "Meanwhile, make the lemon curd. Whisk together the egg yolks and eggs in a large bowl. Place the lemon juice, zest, butter and sugar in large metal bowl, set it over a saucepan of simmering water and whisk until the butter melts and the sugar dissolves. ", "Gradually whisk the hot butter mixture into the eggs then pour the mixture back into the metal bowl over simmering water. Whisk constantly for 4-5 minutes, or until the curd thickens. Pour the lemon curd into a clean bowl and place clingfilm directly on the surface to prevent a skin forming. Chill until required.", "For the ginger filling, blend half the ginger and all of the syrup in a blender to a smooth purée. Finely chop the remaining ginger and set it aside.", "Using an electric mixer, beat the cream, crème fraîche and cream cheese until smooth then fold in the lemon zest, ground ginger and about four tablespoons of the ginger purée. ", "Gently fold 125ml/4fl oz of the lemon curd into the cream mixture and spoon into a piping bag fitted with a 1cm/½in plain nozzle. Chill until required.", "For the icing, place the sugar and water in a small pan, and heat until the sugar dissolves. Add the fondant icing and heat until the mixture is of a thick pouring consistency. Remove about 125ml/4fl oz of the mixture and stir in a few drops of yellow food colouring; spoon the it into a piping bag fitted with a small nozzle. Set aside to cool completely.", "To assemble the millefeuilles, take 12 rectangles of the pastry and lie them next to each other in two rows of six. Pour the white icing over them, spreading it carefully with a palette knife. Pipe across lines of yellow icing and drag a toothpick in the opposite direction to make the traditional feathered pattern. Let the icing set for five minutes then carefully separate the pieces of pastry.", "Scatter a little chopped ginger onto 12 plain pastry bases and pipe over some ginger cream filling. Top with the remaining plain pastry bases and add another layer of chopped ginger and cream. Top with an iced pastry rectangle."]}, {"isVegetarian": false, "title": "Lemon and ginger prawns", "url": "www_bbc_co_uk_food_recipes_lemon_and_ginger_prawns_60081", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 small preserved lemons", "7½cm/3in piece fresh root ginger, peeled and grated", "1 tbsp grated fresh turmeric", "2 tbps olive oil", "1 fat garlic clove, peeled ", "5 tbsp clear honey", "black pepper", "2 tbsp olive oil", "4 extra-large prawns (about 100g/3½oz each, if possible)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["In a blender, combine all the ingredients except the prawns and blend to a purée. ", "Peel the prawns, but leave the tail on. Pour the marinade into a shallow bowl or a large food bag, add the prawns and make sure they are well-coated. Refrigerate for at least 20 minutes, but longer if you like.  ", "Heat a large griddle pan. When hot, add the prawns and cook on each side for 1-2 minutes, or until cooked through. While they are cooking keep basting all the time. Serve immediately."]}, {"isVegetarian": true, "title": "Lemon and lavender posset with lavender biscuits", "url": "www_bbc_co_uk_food_recipes_lemon_and_lavender_79937", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_and_lavender_79937_16x9.jpg", "ingredients": ["600ml/20fl oz double cream", "150g/5½oz caster sugar", "1 tbsp edible lavender", "2 lemons, juice only, strained", "100g/3½oz soft, unsalted butter", "2 tsp lavender (fresh buds and leaves or edible dried lavender)", "50g/1¾oz caster sugar", "175g/6oz plain flour"], "serves": "Serves 4-6", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["To make the posset, put the cream, sugar and lavender in a pan. Gradually bring to the boil, stirring all the time to dissolve the sugar. Reduce the heat a little and simmer for 2-3 minutes, stirring often so that the cream doesn’t stick and burn.", "Remove the pan from the heat and stir in the lemon juice. Leave to cool for five minutes, then pour into four glass tumblers or small dishes, or six espresso cups. Leave to cool completely then cover with cling film and chill in the fridge for at least three hours, or until set. ", "Remove from the fridge 20 minutes before serving.", "To make the biscuits, place the butter and lavender in a bowl and beat together. This helps release the flavour of the lavender. Add the caster sugar and beat until pale and fluffy. Work in the flour with a fork or wooden spoon. Don’t worry if it seems like there is too much flour at this point - it is supposed to be a fairly dry mix. Use your hands to bring the mixture together into a smooth dough.", "Form the mixture into a cylinder shape, about 4cm/1½in in diameter and 18cm/7in long, and wrap in greaseproof paper or cling film. Put in the fridge for at least a couple of hours, until firm.", "When you are ready to bake the biscuits, preheat the oven to 160C/325F/Gas 3 and line a large baking tray with parchment.", "Unwrap the dough and use a sharp, serrated knife to cut 5mm thick discs from the cylinder. Place these onto the lined tray, allowing room for the biscuits to spread a little when they bake. (You’ll need to bake them in batches.) Bake for about 15 minutes, or until the edges of the biscuits are just starting to turn golden-brown. Transfer to a wire rack to cool.", "Serve the lemon posset with the lavender biscuits. Any leftover biscuits will keep in an airtight container for a few days."]}, {"isVegetarian": true, "title": "Lemon and lavender loaf cake", "url": "www_bbc_co_uk_food_recipes_lemon_and_lavender_loaf_90853", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_and_lavender_loaf_90853_16x9.jpg", "ingredients": ["250g/9oz plain flour", "½ tsp baking powder", "½ tsp bicarbonate of soda", "125g/4½oz caster sugar", "1½ tbsp edible lavender", "2 unwaxed lemons, finely grated zest only", "2 large free-range eggs", "200g/7oz plain, full-fat yoghurt", "100g/3½oz unsalted butter, melted", "juice of 2 lemons, strained", "2 tbsp icing sugar", "1 tbsp granulated sugar", "2 tsp edible lavender"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat your oven to 180C/350F/Gas 4. Line a 1kg/2lb 4oz loaf tin (around 10x20cm/4x8in base measurement) with baking parchment.", "In a bowl, combine the flour, raising agents, sugar, lavender and lemon zest.", "In a jug, beat the eggs with the yoghurt and melted butter. Pour this onto the dry ingredients and, using a spatula, stir until just combined.", "Pour into the prepared tin and bake for 40 minutes, or until a skewer inserted into the centre of the cake comes out clean.", "Remove the cake from the oven and prick it deeply all over with a cocktail stick.", "Mix the ingredients for the drizzle together and pour over the hot cake. Sprinkle over the granulated sugar and then the lavender. Leave to cool completely in the tin before slicing."]}]