[{"ingredients": ["1 x 3 libras / 1,2 kg de pollo entero", "1 limón", "2 cucharadas de sal de roca, o al gusto", "1 bulbo de ajo, cortado por la mitad en el centro", "1 cebolla, partida en dos, piel dejada en", "pimienta negra recién molida", "aceite de oliva, para lloviznar", "50g / 2oz de mantequilla", "1 cucharada de semillas de alcaravea", "1 cucharada de tomillo fresco picado", "Zanahorias baby 250 g / 9 oz, recortadas y blanqueadas", "Puerros de bebé 250g / 9oz, cortados y blanqueados", "Remolacha bebé 250g / 9 oz, recortada y blanqueada", "sal y pimienta negra recién molida", "100 ml / 3½ fl oz miel", "1 cucharadita de vinagre balsámico"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para el pollo asado con ajo, coloque el pollo en una lata de asar. Corte el limón por la mitad y exprima el jugo sobre el pollo, luego frote el pollo con la sal de roca.", "Coloque el ajo, exprimido mitades de limón y cebolla en la cavidad del pollo. Sazonar todo el pollo con pimienta negra recién molida y rociar un poco de aceite de oliva.", "Transfiera al horno y tueste durante 1 ¼ horas, o hasta que los jugos salgan limpios cuando el pollo esté perforado con un pincho y esté completamente cocido. Retirar del horno y dejar reposar en un lugar cálido durante unos minutos antes de servir.", "Para las verduras de bebé glaseadas con miel, caliente la mantequilla en una sartén hasta que haga espuma, luego agregue las semillas de alcaravea, el tomillo y las verduras. Revuelva bien y sazone con sal y pimienta negra recién molida.", "Agregue la miel y llévela a ebullición. Reduzca el fuego y cocine a fuego lento, revolviendo de vez en cuando, hasta que todas las verduras estén cubiertas y la miel se haya espesado.", "Justo antes de servir, tome un poco de ajo asado del interior de la cavidad del pollo y exprímalo de la piel sobre las verduras. Rocíe el vinagre balsámico y revuelva bien.", "Para servir, esculpe el pollo en porciones y colóquelo en platos para servir con las verduras para bebés glaseadas con miel."], "url": "www_bbc_co_uk_food_recipes_garlicroastchickenwi_86779", "title": "Pollo asado con verduras de bebé glaseadas con miel", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 rebanadas gruesas de pan blanco crujiente", "2 cucharadas de aceite de oliva", "1 bulbo de ajo ahumado, un diente retirado y pelado", "½ pimiento rojo, semillas retiradas", "3 cucharadas de aceite de oliva", "gran cantidad de hierbas frescas, como perejil, albahaca, eneldo y cebollín", "exprimir jugo de limón", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Para la tostada de ajo, calienta una sartén de plancha y plancha el pan en ambos lados hasta que esté tostado. Rocíe más de la mitad del aceite de oliva y frote el diente de ajo pelado sobre el pan.", "Coloque el resto del bulbo de ajo en una bandeja para hornear, rocíe con el aceite de oliva restante y transfiéralo al horno para asar durante 15 minutos o hasta que se ablande.", "Para la ensalada de hierbas y pimientos asados, coloque el pimiento en una bandeja para hornear, rocíe con una cucharada de aceite de oliva y tueste en el horno durante 15 minutos, o hasta que se ablanden.", "Retire la pimienta del horno y coloque en un recipiente. Cúbralo con una película adhesiva y déjelo enfriar un poco, luego retire la piel del pimiento y pásela aproximadamente.", "Coloque todas las hierbas en un recipiente con el resto del aceite de oliva y el jugo de limón. Sazone con sal y pimienta negra recién molida y mezcle bien para cubrir las hierbas.", "Para servir, coloque la tostada de ajo en un plato junto con la ensalada y el bulbo de ajo asado para apretar sobre la tostada."], "url": "www_bbc_co_uk_food_recipes_garlictoastwithroast_85529", "title": "Tostadas de ajo con ensalada de hierbas y pimienta asada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["250g / 9 oz de harina lisa fuerte, preferiblemente orgánica", "3 pizcas de sal marina", "2 cucharadas de azúcar en polvo", "1 paquete de 7 g de levadura seca", "3 huevos de gallinas camperas, preferiblemente orgánicos", "175g / 6 oz de mantequilla sin sal, cortada en cubos pequeños", "3 yemas de huevo de gallinas camperas, preferiblemente orgánicas", "3 cucharadas de azúcar en polvo", "1 limón, jugo y ralladura", "125ml / 4fl oz crema fresca", "1 yema de huevo de gallinas camperas, preferiblemente orgánica", "2 cucharaditas de azúcar en polvo", "10 g de mantequilla, cortada en cubos (opcional)", "1 cucharada de azúcar nibbed, para decorar"], "method": ["Para la masa de brioche, coloque la harina, la sal, el azúcar y la levadura (manteniendo la levadura lejos de la sal, ya que la atacará y dañará su capacidad de fermentación), en un recipiente mezclador eléctrico. Agregue los huevos y mezcle con un accesorio de gancho de masa durante 5 minutos a baja potencia hasta que los huevos estén completamente incorporados (alternativamente, coloque los ingredientes en un tazón grande y mezcle durante 5 minutos).", "Aumente la velocidad de la máquina o su agitación y mezcle durante otros 5 minutos hasta que la masa se desprenda del borde de la taza. A continuación, agregue los cubitos de mantequilla y continúe mezclando durante 2-3 minutos hasta que esté completamente incorporado.", "Retire el tazón de la máquina, si está usando, luego cúbralo con film transparente y déjelo a temperatura ambiente durante 1 hora para comprobarlo, luego enfríelo durante una hora más (será más fácil trabajar con él).", "Precalentar el horno a 190 ° C / 170 ° C (Ventilador) / Gas 5.", "Enharina ligeramente una superficie de trabajo y sus manos. Junta la masa con las palmas de las manos para formar una bola, colócala en una bandeja para hornear y aplástala ligeramente. Comenzando desde el medio de la masa, presione suavemente la masa y extiéndala para formar un círculo de aproximadamente 23 cm de diámetro, pero deje un espacio de 2 cm en el borde, ya que creará el borde de la tarta. Tenga cuidado de no estirar la masa y trate de mantener la base incluso en grosor.", "Cubra con una toalla de té limpia y coloque la masa en el área tibia durante 25 minutos.", "Para el relleno de crema, mezcle las yemas de huevo, el azúcar, la ralladura de limón y el jugo en un tazón grande y mezcle gradualmente la crema fresca. Dejar de lado.", "Para el glaseado, cepille el borde del pastel con la yema de huevo y pise uniformemente la base de la masa con un tenedor para ayudar a cocinar y levantar la masa. Verter la mezcla de crema sobre la masa, espolvorear con el azúcar impalpable y salpicar con la mantequilla, espolvorear con el azúcar picado y hornear en el horno precalentado durante 25 minutos, o hasta que el brioche se haya levantado y se haya establecido el relleno. Retire del horno y deje a un lado para enfriar, luego sirva."], "url": "www_bbc_co_uk_food_recipes_gateaualacrme_93878", "title": "Pastel de crema", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Hace 1 tarta de 23cm / 9in", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 litro / 1.7 pintas de passata", "4 cebollas de primavera, cortadas, en rodajas", "2 dientes de ajo, pelados, aplastados", "½ pepino, pelado, picado", "1 cebolla roja pequeña, pelada, picada", "½ pimienta roja y ½ verde, tallo y semillas retirados, picados", "2 cucharadas de vinagre de jerez", "sal y pimienta blanca", "4 cucharadas de aceite de oliva virgen extra, más extra para servir", "8-10 huevos de codorniz (opcional)", "puñado de hojas pequeñas de albahaca, finamente trituradas", "croûtons ligeramente tostados con bolsa pequeña (opcional)"], "method": ["Para el gazpacho, mezcle todos los ingredientes del gazpacho con un puré suave en una licuadora o procesador de alimentos y deje enfriar en la nevera durante la noche.", "Justo antes de servir, ponga a hervir un recipiente con agua y hierva los huevos de codorniz durante tres minutos (si los está usando). Pasa los huevos de las codornices en agua fría. Cuando esté frío, retire las cáscaras y pique los huevos (o simplemente córtelos por la mitad).", "Revuelva la albahaca en el gazpacho.", "Para servir, vierte el gazpacho en tazones y espolvorea sobre los croûtons, si se usa. Adorne con el huevo de codorniz y un chorrito de aceite de oliva."], "url": "www_bbc_co_uk_food_recipes_gazpacho_hispaniola_04615", "title": "Gazpacho Hispaniola", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 10}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gazpacho_hispaniola_04615_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Trocitos de chocolate 125g / 4oz o chocolate para cocinar (cobertura)", "100 g / 3½ oz tamizado azúcar glas", "3 cucharadas de crema doble", "2 huevos separados", "55g / 2oz de uva pelada", "3 cucharadas de cocinar kirsch", "2 cucharadas de agua", "100 g / 3½ oz de la mejor mantequilla sin sal", "100g / 3½oz de galletas de mantequilla pequeñas desmenuzadas"], "method": ["Coloque los bizcochos en un tazón pequeño, agregue el kirsch y déjelos para infundir.", "Coloque el agua y el chocolate en una sartén pequeña y gruesa y disuelva a fuego lento. Revuelva bien hasta que quede completamente suave, luego retírelo del fuego.", "Corte la mantequilla en pequeños copos y agregue el chocolate hasta que se disuelva por completo.", "Agregue las yemas de huevo y bata hasta que la mezcla esté suave de nuevo.", "Agregue el azúcar, mezcle bien, agregue las claras de huevo batidas y bátalas hasta que se mezclen bien.", "Agregue los panecillos y las uvas empapados.", "Finalmente agregue la crema.", "Convierta en una lata de torta deslizante engrasada y aceitada de 13 cm / 5 pulg. De diámetro, teniendo cuidado de revestir la base con un círculo apropiado de papel engrasado con aceite.", "Refrigere hasta que esté listo, sáquelo, retire el papel y adorne."], "url": "www_bbc_co_uk_food_recipes_gateaulambassadeuram_13036", "title": "Pastel del embajador (pastel del embajador)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de salsa de frijol amarillo", "2 cucharadas de salsa de soja ligera baja en sodio", "1 cucharada de puré de tomate", "1 cucharada de vinagre de arroz", "1 cucharada de salsa de chile picante", "1 cucharadita de azúcar moreno claro o miel", "1 cucharadita de salsa de soja oscura", "1 cucharada de harina de patata o harina de maíz", "Muslos de pollo de 350g / 12oz (4 pequeños), deshuesados, pelados y cortados en tiras de 1x2.5cm / ½x1in", "1 cucharada de aceite de colza", "2 dientes de ajo, aplastados", "5 chiles secos de Sichuan", "1 cebolla, cortada en cubos de 2cm / ¾in", "1 pimiento rojo grande, sin semillas, cortado en cubos de 2cm / ¾in", "1 cucharada de vino de arroz Shaoxing o jerez seco", "4 cebolletas, cortadas en piezas de 2cm / ¾in", "Cacahuetes de 75 g / 2½ onzas, tostados y picados", "sal marina y pimienta blanca molida", "semillas de sésamo tostadas, para adornar", "Fideos de huevo finos de 300g / 10½oz", "2 cucharaditas de aceite de sésamo tostado", "1 cucharada de aceite de colza", "100g / 3½oz de cebollino chino, cortado en un ángulo de 5 mm / ¼ en piezas", "100g / 3½oz de champiñones chinos secos, remojados en agua caliente durante 20 minutos, tallo descartado, cortado en tiras de 5 mm / ¼ pulgada", "1 cucharada de vino de arroz Shaoxing", "1 cucharada de salsa de champiñones o salsa de ostras", "pizca de azúcar en polvo", "2 cucharadas de salsa de soja ligera baja en sodio", "puñado de brotes de soja", "1 cebolleta, finamente cortada, para adornar (opcional)"], "method": ["Para el pollo, mezcle todos los ingredientes de la salsa en un recipiente y reserve.", "Mezcle la harina de papa con una pizca de sal marina y pimienta blanca en un tazón. Agregue el pollo y revuelva para cubrir bien.", "Caliente un wok a fuego alto hasta que empiece a humear, luego agregue el aceite de colza. Agregue el ajo y los chiles secos y saltee por unos segundos. Agregue la cebolla y el pimiento rojo y saltee por 15 segundos, o hasta que estén crujientes en los bordes.", "Empuje los ingredientes a un lado del wok. Agregue el pollo y déjelo dorar por 10 segundos, luego cocínelo, revolviéndolo por 30 segundos. Antes de que se haya vuelto completamente opaco, sazone con vino de arroz. Continúe cocinando durante 1 minuto o hasta que esté cocido.", "Vierta la salsa y cocine por 1 minuto, o hasta que se haya reducido a la mitad y esté ligeramente pegajoso. Agregue las cebollas de primavera y los cacahuetes, luego transfiera a un plato de servir mientras cocina los fideos.", "Para los fideos, cocinar los fideos de acuerdo con las instrucciones del paquete, luego escurrir y vestir en 1 cucharadita de aceite de sésamo (puede hacerlo con antelación para ahorrar tiempo). Luego caliente un wok a fuego alto y agregue el aceite de colza. Agregue el cebollín al ajo y cocine por 30 segundos, luego agregue los hongos chinos y cocine por 10 segundos.", "Agregue el vino de arroz y cocine hasta que se evapore. Agregue los fideos preparados y mezcle bien durante 30 segundos. Sazone con la salsa de champiñones, el azúcar y la salsa de soja ligera. Agite suavemente y doble los brotes de soja. Sazonar con la cucharadita restante de aceite de sésamo, adornar con la cebolla tierna y servir inmediatamente al lado del pollo."], "url": "www_bbc_co_uk_food_recipes_general_tsos_chicken_94858", "title": "Pollo del general Tso con cebolleta al ajo y fideos con champiñones", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 2 o 4 para compartir", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/general_tsos_chicken_94858_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["¼ melocotón blanco fresco, cortado en 2 rodajas, más extra para decorar", "10 hojas de menta fresca, además de ramita extra para adornar", "2 cucharaditas de jarabe de azúcar", "50ml / 2fl oz de whisky bourbon", "cubos de hielo", "salpicar champán"], "method": ["Coloque las rodajas de melocotón blanco y las hojas de menta en una coctelera y aplastar ligeramente (confusión) con una cuchara de mango largo.", "Agregue el jarabe de azúcar, bourbon y hielo y agite bien.", "Para servir, cuela la mezcla en un vaso y rellena con el champán. Enganche una rodaja de melocotón y una ramita de menta sobre el borde del vaso."], "url": "www_bbc_co_uk_food_recipes_gentlemansjulep_92495", "title": "Julepe de caballero", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 manzanas de postre, peladas, sin corazón y cortadas en rodajas finas", "1 cucharada de jugo de limón", "125g / 4½oz de mantequilla, ablandada, más extra para engrasar", "Azúcar en polvo de oro de 140g / 5oz", "3 huevos de gallinas camperas, a temperatura ambiente, golpeados", "Harina normal 225g / 8oz", "Polvo de hornear 2 cucharaditas de nivel", "½ cucharadita de sal", "5 cucharadas de leche entera", "1½ cucharada de azúcar demerara", "½ cucharadita de canela molida"], "method": ["Precaliente el horno a 170 ° C / 150 ° Ventilador / Gas 3. Unte con mantequilla y cubra una lata redonda de pastel de 23 cm / 9 pulg.", "Cubra las rodajas de manzana en el jugo de limón y reserve.", "En un tazón grande, bata la mantequilla y el azúcar, usando una batidora eléctrica, hasta que esté pálida y esponjosa. Agregue los huevos y bata hasta que quede suave. Tamice la harina, el polvo de hornear y la sal y mezcle bien. Lentamente agregue la leche, mezcle bien después de cada adición, hasta que tenga una mezcla suave.", "Transfiere la masa al pastel. Coloque las rebanadas de manzana, con el lado plano hacia abajo, sobre la pasta en forma de espiral.", "Para el relleno, mezcle el azúcar demerara y la canela. Espolvorea sobre la masa.", "Hornee en el medio del horno durante 40-45 minutos, o hasta que un pincho insertado en el centro del pastel salga limpio y la parte superior esté dorada. Dejar enfriar durante 15 minutos en la lata. Pase un cuchillo por los bordes del pastel y gírelo de la lata sobre una rejilla.", "Sirva caliente o a temperatura ambiente con crema batida."], "url": "www_bbc_co_uk_food_recipes_german_apple_cake_59663", "title": "Pastel alemán de manzana", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 1 x 23 cm / 9 en pastel", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/german_apple_cake_59663_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Paquete de 1 x 500 g / 17½ oz paquete de hojaldre confeccionado", "harina común, para quitar el polvo", "aceite de oliva, para cepillar", "pimentón (pimentón ahumado), para rociar", "semillas de alcaravea, para rociar", "sal marina, para rociar", "2 pepinos, cortados y picados", "2 tallos de apio, cortados y picados", "3 dientes de ajo, pelados, finamente picados", "1 cebolleta cortada en racimo pequeña, cortada y picada", "2 pimientos rojos, sin semillas, picados", "2 pimientos amarillos, sin semillas, picados", "8 tomates de ciruela, picados", "4 cucharadas pasadas", "75ml / 2½fl oz de aceite de oliva virgen extra", "3 cucharadas de vinagre balsámico blanco, más extra para el gusto", "salpique salsa Tabasco, al gusto", "sal y pimienta negra recién molida", "1 pequeño manojo de cebollín fresco, finamente picado", "1 manojo pequeño de albahaca fresca"], "method": ["Precaliente el horno a 200C / 390F / gas 6. Engrase ligeramente 2 bandejas para hornear.", "Estirar la masa de hojaldre en una superficie ligeramente enharinada hasta 0,5 cm de espesor. Corta la hoja en 10 tiras, cada una de 1 cm / ½ pulgadas de ancho. Cepille cada tira con aceite de oliva y espolvoree ligeramente con pimentón, semillas de alcaravea y sal. Gire cada extremo de la tira y coloque sobre las bandejas para hornear, separadas. Enfriar durante 10 minutos en la nevera.", "Hornee los giros durante 10-15 minutos o hasta que estén crujientes y dorados. Con cuidado, transfiéralo a una rejilla para que se enfríe.", "Para el gazpacho, coloque el pepino, el apio, el ajo, las cebolletas, los pimientos y los tomates en un procesador de alimentos y mezcle hasta que quede suave. Con el motor en marcha, agregue la passata, el aceite de oliva, el vinagre y Tabasco. Sazonar, al gusto, con sal, pimienta negra recién molida y vinagre.", "Ponga el gazpacho en vasos de chupito helados y adorne con una cucharada de cebollino y albahaca. Sirva el pimentón y semillas de alcaravea al lado."], "url": "www_bbc_co_uk_food_recipes_gazpachoshotswithpim_93819", "title": "Disparos de gazpacho con giros de semillas de pimentón y alcaravea", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "20", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gazpachoshotswithpim_93819_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50g / 2oz de mantequilla sin sal", "Leche 250ml / 9fl oz", "4 cucharadas colmadas de azúcar granulada", "1 cucharada de levadura seca de acción rápida", "1 cucharadita de sal", "1 huevo grande de gallinas camperas, más 1 yema, batido ligeramente", "Harina simple de 450g / 1lb", "aceite, para engrasar", "175g / 6oz de mantequilla sin sal", "175g / 6oz de azúcar morena suave", "100g / 3½ oz de jarabe dorado", "100g / 3½oz de nueces picadas", "55 g / 2 oz de cerezas secas endulzadas", "85 g / 3oz de pasas", "1 cucharadita de canela molida", "225 g / 8 oz de azúcar en polvo", "55g / 2oz de mantequilla sin sal, derretida"], "method": ["Para la masa, derrita la mantequilla en una cacerola pequeña a fuego lento, luego agregue la leche y el azúcar y caliente hasta que esté tibia.", "Vierta la mezcla en una jarra y agregue la levadura. Deje reposar durante 8-10 minutos.", "Revuelva la sal y los huevos en la mezcla de levadura.", "Coloque la harina en un mezclador de alimentos de pie equipado con el accesorio de gancho de masa. Agregue la mezcla de levadura y mezcle a baja velocidad trabajando en la etapa húmeda inicial hasta que la masa comience a separarse limpiamente de los lados del recipiente y quede lisa.", "Coloque en un tazón engrasado grande, cúbralo con una película adhesiva engrasada y demuéstrelo durante dos horas o más, o hasta que se haya triplicado su volumen.", "Engrase una bandeja para hornear de 23 x 33 x 3 cm / 9 x 13 x 1½ pulgadas con aceite; si la lata es demasiado poco profunda, rezumará por el costado.", "Para el relleno pegajoso, derrita la mantequilla, el azúcar morena y el sirope dorado en una sartén.", "Extienda sobre la base de la bandeja de horno engrasada y espolvoree sobre las pacanas. Dejar de lado.", "Para el relleno de fruta, mezcle las cerezas, las pasas, la canela y el azúcar en un tazón. Dejar de lado.", "Cuando la masa ha subido, retroceda y ruede sobre una superficie ligeramente enharinada hasta un rectángulo de 30 x 38 cm / 12 x 15 pulgadas.", "Cepille la masa con la mantequilla derretida y luego distribuya uniformemente sobre la fruta. Enrolle, comenzando con el lado largo, en forma de salchicha.", "Coloque la salchicha, con la costura hacia abajo, y córtela en 12 pedazos iguales con un cuchillo muy afilado. Coloque el lado cortado hacia arriba en la bandeja de nueces preparada.", "Cubra con película adhesiva engrasada y deje crecer durante aproximadamente 40 minutos.", "Precaliente el horno a 200C / ventilador del horno 180C / 400F / Gas 6.", "Hornee los bollos durante aproximadamente 35-40 minutos. Si se dora demasiado rápido, cúbralo con un poco de papel de aluminio.", "Salga de la bandeja mientras todavía está caliente en un plato o bandeja de horno."], "url": "www_bbc_co_uk_food_recipes_german_sticky_buns_96670", "title": "Bollos pegajosos alemanes (caracoles)", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Hace 12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 chalotes, finamente picados", "4 cucharadas de aceite de maíz", "1 cucharada de vinagre de vino blanco", "1 cucharadita de mostaza Dijon", "sal", "pimienta negra recién molida", "4 papas grandes, cocidas y enfriadas", "1 cucharadita de semillas de mostaza", "50g / 1¾ oz pepinillos, picados", "½ manojo de eneldo fresco, picado"], "method": ["Prepare un aderezo para las papas. Combine los chalotes, el aceite, el vinagre y la mostaza. Sazonar bien, luego probar, ajustando la cantidad de aceite y vinagre, si es necesario.", "Triture ligeramente las papas y dóblese a través del aderezo, las semillas de mostaza, el pepinillo y el eneldo fresco.", "Servir."], "url": "www_bbc_co_uk_food_recipes_germanstylepotatosal_74850", "title": "Ensalada de papa al estilo alemán", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 3-4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Pasta de gemelos 175g / 6oz", "1 cucharada de aceite de oliva", "6 filetes de anchoa, finamente picados", "1 diente de ajo, aplastado", "¼ cucharadita de hojuelas de chile seco", "150g / 5½oz de tomates cherry, partidos a la mitad por el ecuador", "4 cucharadas de vermut blanco seco", "2 cucharadas de mascarpone", "1 cucharada de parmesano finamente rallado más extra para servir", "2 cucharadas de perejil de flatillo finamente picado, más extra para servir", "sal"], "method": ["Llevar a ebullición una cacerola grande de agua salada. Cocine la pasta de acuerdo con las instrucciones del paquete, pero comience a verificar unos buenos 2 minutos antes de que le digan que debería estar lista.", "Mientras tanto, coloque el aceite y las anchoas en un wok de base pesada, y cocine, revolviendo a fuego medio durante aproximadamente 1 minuto, o hasta que las anchoas casi se hayan disuelto en el aceite. Agregue el ajo y las hojuelas de chile, luego caliente un poco el fuego y agregue los tomates, revolviendo suavemente durante 2 minutos, o hasta que empiecen a ablandarse.", "Vierta el vermut, deje que burbujee, luego revuelva y empuje los tomates en la sartén durante 2 minutos hasta que se hayan desmenuzado un poco en la salsa espesa y reducida. Retire la sartén del fuego, mezcle el mascarpone y, cuando todo esté derretido, agregue el parmesano y el perejil.", "Antes de drenar la pasta, baje en una taza para eliminar parte del agua de cocción. Agregue una cucharada más o menos del agua de cocción a la salsa de pasta; esto ayudará a que la salsa cubra la pasta. Escurra la pasta, agréguela a la salsa y mezcle bien para mezclar, agregando más agua de cocción de pasta si es necesario. Espolvorear con un poco de perejil y llevar el queso parmesano a la mesa para servir."], "url": "www_bbc_co_uk_food_recipes_gemelli_with_anchovies_80715", "title": "Gemelli con anchoas, tomates y mascarpone", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gemelli_with_anchovies_80715_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 lechuga butterhead, más o menos picada", "50 g / 2 oz de pepinillo, aproximadamente picado", "80g / 2¾oz de glucosa", "1 pepino, cortado por la mitad y cortado longitudinalmente", "50 g / 2 oz de azúcar en polvo", "Vinagre de vino de arroz 150ml / 5fl oz", "1 chile rojo, finamente cortado en cubos", "16 vainas de guisantes", "3 pepinillos medianos, finamente cortados longitudinalmente", "12 rábanos de desayuno, cortados longitudinalmente", "2 cucharadas de alcaparras", "4 filetes brillantes, pelados y completamente cortados", "sal y pimienta negra recién molida", "50g / 2oz de mantequilla", "1 cucharada de aceite de oliva", "2 cucharadas de berro de coriandro", "2 cucharadas de brotes de guisantes"], "method": ["Para el aderezo, coloque la lechuga butterhead, los pepinillos y la glucosa en un procesador de alimentos y mezcle hasta lograr un puré muy fino.", "Vierta en un paño o en un tamiz forrado de papel sobre un recipiente, luego póngalo a un lado para drenar, dejando el aderezo en el tamiz.", "Para la ensalada, coloque el pepino en un recipiente.", "Caliente el azúcar impalpable y el vinagre de vino de arroz en una cacerola pequeña hasta que esté hirviendo a fuego lento, luego agregue el chile y revuelva.", "Vierta inmediatamente en el pepino y revuelva para asegurarse de que todo el pepino esté cubierto. Dejar enfriar a temperatura ambiente.", "Saca los guisantes de sus vainas y cocina durante un minuto en una olla con agua hirviendo. De inmediato drene los guisantes y colóquelos en un recipiente con agua fría, para detener el proceso de cocción.", "Coloque los pepinillos, los rábanos, las alcaparras, los guisantes juntos en un tazón y mezcle.", "Escurra el pepino, reservando el licor de decapado. Agregue el pepino a la mezcla de pepinillo y mezcle.", "Agregue un poco del licor de decapado a la ensalada, solo lo suficiente para cubrir las verduras.", "Sazonar el brill con sal y pimienta negra.", "Caliente una sartén hasta que esté caliente, agregue la mantequilla y el aceite, luego agregue el brillo y fría en cada lado durante dos minutos.", "Para servir, usando una brocha de pastelería, cepille una cucharada del aderezo en cada plato de servir, luego cubra con un puñado de la ensalada, terminando con una dispersión de berro de cilantro y brotes de guisantes. Coloque el filete brillante al lado."], "url": "www_bbc_co_uk_food_recipes_gherkin_salad_with_pan_71661", "title": "Ensalada de pepinillo con pan frito brillante", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["225 g / 8oz de sémola fina", "7 cucharadas de mantequilla sin sal derretida", "200ml / 7¼fl oz de agua", "120 g / 4 oz de azúcar en polvo", "30 g / 1¼ oz de almendras molidas", "30 g / 1¼ oz de semillas de amapola blanca", "30g / 1¼oz de coco desecado", "¼ cucharadita de cardamomo molido", "¼ cucharadita de nuez moscada", "Harina normal de 600 g / 1 lb y 5 oz", "aceite vegetal, para freír"], "method": ["Tamiza la harina en un tazón y frota en cuatro cucharadas de la mantequilla derretida, agrega un poco de agua a la vez para formar una masa suave, puede que no necesites toda el agua. Amasar la masa durante aproximadamente un minuto hasta que esté suave, cubrir con un paño húmedo y reservar.", "Calienta suavemente la mantequilla restante, luego agrega la sémola y aumenta el fuego a medio. Cocine, revolviendo continuamente durante aproximadamente 5-10 minutos o hasta que la sémola sea de color marrón claro. Agregue los ingredientes restantes, excepto el azúcar, mezcle bien y cocine por un minuto. Retire la sartén del fuego, agregue el azúcar y déjela enfriar.", "Divida la masa en 25 bolas pequeñas.", "Haga rodar una bola en un círculo de 8cm / 3 pulgadas y coloque dos cucharaditas de la mezcla de sémola en un extremo. Doble la masa por la mitad, presione los extremos firmemente juntos y engarce para formar un sello seguro. Repita esto con la masa restante y el relleno.", "Llene una freidora con grasa o una sartén grande, profunda y de fondo grueso, dos tercios llena con aceite vegetal. Caliente el aceite a 180 ° C / 350 ° F o hasta que se rompa el pan rallado. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido). Freír los ghoogras durante 2-3 minutos o hasta que estén dorados. Retire de la sartén con una cuchara ranurada y déjela a un lado para escurrir sobre papel de cocina."], "url": "www_bbc_co_uk_food_recipes_ghoogra_70656", "title": "Ghogra", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 25", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/ghoogra_70656_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["450 g / 1 libra de mantequilla o margarina, ablandada a temperatura ambiente", "450 g / 1lb de azúcar en polvo", "8 huevos medianos de granja", "4 cucharaditas de extracto de vainilla", "Harina de auto aumento de 450g / 1lb", "leche, para aflojar", "Mantequilla 280g / 10oz, ablandada", "560g / 1lb 4oz de azúcar glas", "2-4 cucharadas de leche", "1.2kg / 2lb 12oz glaseado de fondant blanco", "mermelada de albaricoque, tamizada", "glaseado de fondant negro"], "method": ["Precalienta el horno a 180 ° C / 160 ° C Ventilador / Gas 4. Engrasa y enharina la lata o tazón de torta del hemisferio. Engrase 3 x 18cm / 7en latas de pastel y forre con papel para hornear.", "Bata la mantequilla y el azúcar juntos en un tazón grande hasta que estén pálidos y esponjosos. Poco a poco golpee los huevos y agregue el extracto de vainilla.", "Doble la harina y agregue un poco de leche extra si es necesario para crear una mezcla con una consistencia suave. Divida la mezcla entre las latas de la torta y extiéndala suavemente con una espátula.", "Hornee durante 20-25 minutos, o hasta que estén doradas en la parte superior y un pincho insertado en el centro salga limpio. Retire del horno y déjelo a un lado durante 5 minutos, luego retírelo de las latas y quítelo. Coloque sobre una rejilla y déjelo enfriar.", "Mientras tanto, para la crema de mantequilla, bata la mantequilla en un tazón grande hasta que esté suave. Agregue la mitad del azúcar glas y bata hasta que quede suave. Agregue el azúcar glas restante y 2 cucharadas de leche y bata la mezcla hasta que quede cremosa y suave. Agregue más leche, si es necesario, para aflojar la mezcla.", "Cuando las esponjas se hayan enfriado, ensamble el pastel. Coloque una de las esponjas regulares en un tablero redondo de tarta y una cuchara de crema de mantequilla en la parte superior, la parte superior con otra esponja y continuar con capas de crema de mantequilla y las esponjas restantes, terminando con la esponja del hemisferio. Luego, con cuidado, alise la crema de mantequilla restante sobre el pastel entero (el fondant blanco se colocará sobre el pastel para que el buttercream no tenga que verse perfecto).", "Ruede el fondant blanco en un círculo grande que sea lo suficientemente ancho como para cubrir todo el pastel. Coloque el fondant blanco sobre el pastel, asegurándose de que cubra el pastel de manera uniforme. Luego presione hacia abajo el fondant para mantenerlo en su lugar.", "Usa el fondant negro para hacer ojos y boca y pégalos sobre la torta con un poco de mermelada de albaricoque."], "url": "www_bbc_co_uk_food_recipes_ghost_cake_56500", "title": "Torta fantasma", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Sirve de 20 a 24", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/ghost_cake_56500_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["6-8 cucharadas de aceite de oliva", "½ cebolla roja grande, finamente picada", "2 dientes de ajo", "sal y pimienta negra recién molida", "2 x 400 g de tomates picados", "200ml / 7fl oz de caldo de verduras"], "method": ["Calentar el aceite de oliva en una sartén y freír la cebolla durante 5-7 minutos.", "Agregue los dientes de ajo enteros y cocine durante aproximadamente un minuto. Sazonar con sal y pimienta negra recién molida.", "Agregue los tomates picados y el caldo. Deje que la mezcla hierva a fuego lento y reduzca durante aproximadamente 40 minutos. Es posible que desee agregar más caldo y dejar que hierva durante más tiempo, o agregar más aderezo, según el gusto. Servir."], "url": "www_bbc_co_uk_food_recipes_giancarlostomatosauc_82370", "title": "Salsa de tomate lento cocido", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["8 claras de huevo de gallinas camperas", "475 g / 1 libra de azúcar en polvo 1 oz", "3 cucharaditas de harina de maíz", "2 cucharaditas de vinagre de vino blanco", "800 g / 11lb 12 oz de bayas mixtas de temporada, como frambuesas, fresas, grosellas, moras o grosellas rojas", "2 naranjas, jugo y ralladura", "600ml / 1 pinta 1fl oz crema doble", "Azúcar glasé para espolvorear"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Línea dos bandejas para hornear con pergamino para hornear.", "Batir las claras de huevo en un tazón grande hasta que se formen picos duros y brillantes cuando se quite el batidor.", "Agregue el azúcar unas cucharadas a la vez, batiendo bien después de cada adición. Cuando todo el azúcar haya sido removido en las claras de huevo, continúe batiendo durante 6-7 minutos o hasta que la mezcla de merengue esté tieso y brillante y se levante en los picos. Finalmente, mezcle la harina de maíz y el vinagre de vino blanco.", "Divida la mezcla de merengue de manera equitativa entre las dos bandejas forradas, colocando la mezcla en el centro y extendiéndola en círculos de aproximadamente 25 cm de diámetro, usando una espátula.", "Reduzca la temperatura del horno a 120C / 250F / Gas ½, luego hornee los merengues durante 1½ horas. Después de 1 hora y media, apague el horno y deje los merengues adentro hasta que se hayan enfriado por completo.", "Mientras tanto, coloca las bayas, el jugo de naranja y la ralladura de naranja en una olla. Ponga la mezcla a ebullición, luego reduzca el fuego hasta que la fruta esté hirviendo a fuego lento y continúe cocinando a fuego lento durante 10-15 minutos, o hasta que la fruta comience a descomponerse. Retire la sartén del fuego y déjela a un lado, tapada, hasta que la fruta estofada se haya enfriado por completo.", "Batir la crema en un tazón grande hasta que se formen picos suaves cuando se quite la batidora. Dobla la fruta estofada enfriada para crear un efecto marmoleado.", "Cuando los merengues se hayan cocinado, retire suavemente el pergamino para hornear.", "Para servir, coloque uno de los merengues en un plato para servir o en un soporte para pasteles. Coloca la mitad de la mezcla de crema y fruta encima. Cubra con el segundo merengue y cuchara sobre la mezcla de crema y fruta restante. Polvo con azúcar glas y servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_giant_pavlova_91173", "title": "Gigante Pavlova", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 10-12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/giant_pavlova_91173_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de chocolate negro, roto en pedazos", "2 cucharadas de crema doble", "50 g / 1¾oz de mantequilla sin sal, picada en trozos pequeños", "2 cucharadas de ginebra", "½ lima, cáscara y jugo solamente", "cacao en polvo, al polvo"], "method": ["Coloque un recipiente resistente al calor encima de una olla con agua hirviendo a fuego lento, asegurándose de que el fondo del recipiente no toque el agua. Coloque el chocolate en el recipiente con la crema y caliente suavemente para permitir que el chocolate se derrita.", "Agregue la mantequilla (corte la mantequilla en pedazos bastante pequeños porque quiere que se derrita con bastante rapidez). Revuelva para asegurarse de que toda la mantequilla se derrita en la mezcla de chocolate. Siga revolviendo hasta que toda la mantequilla se haya derretido y la mezcla esté suave y brillante.", "Agregue la ginebra, la ralladura de lima y el jugo. Batir los ingredientes hasta que estén suaves y ligeramente espesados. Coloque la cuchara en un recipiente sellable, colóquela en la tapa y déjela enfriar durante la noche en la nevera.", "Tome cucharaditas de la mezcla y gírelas en bolas. Poner en un plato forrado con papel de hornear y enfriar durante una hora más o menos.", "Tamiza el cacao en un tazón y enrolla las trufas para cubrirlo. Estos hacen un presente brillante."], "url": "www_bbc_co_uk_food_recipes_gin_and_lime_truffles_65812", "title": "Trufas de ginebra y lima", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Hace 20 trufas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gin_and_lime_truffles_65812_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["220 g / 8 oz de azúcar en polvo", "Ginebra de buena calidad 170ml / 6fl oz", "500ml / 18fl oz tónico", "1 limón, solo jugo", "2 manzanas Bramley, peladas y ralladas", "500ml / 18fl oz de jugo de manzana", "50g / 1¾oz de mantequilla", "2 manzanas Braeburn, cortadas en cubitos"], "method": ["Traiga 120ml / 4fl oz de agua y el azúcar impalpable hasta que hierva. Una vez que el azúcar se haya disuelto, retíralo del fuego. Agregue la ginebra, el tónico, el jugo de limón y la manzana Bramley rallada. Déjelo enfriar por completo, luego vierta la mezcla en un recipiente plástico a prueba de congelación y colóquelo en el congelador.", "Cada 30 minutos, retírelo del congelador y bate. Repita esto hasta que se congele (esto tomará alrededor de 3-4 horas).", "Para hacer un caramelo de manzana, caliente el jugo de manzana hasta que se reduzca su volumen a un caramelo espeso (esto tomará aproximadamente 45 minutos). Retire del fuego y mezcle con la mantequilla. Deja enfriar.", "Para servir, retire el granizado del congelador y divídalo con un tenedor para crear una textura de \"cachorro aguanieve\". Espolvoree la manzana en cubos Braeburn encima y sirva con el caramelo de manzana."], "url": "www_bbc_co_uk_food_recipes_gin_and_tonic_granita_18303", "title": "Gin-tonic granita", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Sirve 8-10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gin_and_tonic_granita_18303_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["¼ clementina", "2 cucharaditas de gelatina de arándano", "1 tiro de ginebra endrinas", "champán", "ramillete de grosellas rojas, bañadas en jarabe de azúcar (vendido como jarabe Gomme), luego sumergidas en azúcar"], "method": ["Exprime el jugo del cuarto de clementina en una coctelera, luego agrega el cuarto.", "Agregue la gelatina de arándano y la ginebra endrinas, reponga con cubitos de hielo y agite bien.", "Vierta el champán en un vaso de flauta hasta aproximadamente dos tercios lleno.", "Cuele la mezcla de clementina, arándano y endrina en el vaso de flauta.", "Adornar con la ramita de grosellas azucaradas."], "url": "www_bbc_co_uk_food_recipes_ginandcranberrysauce_87674", "title": "Salsa de ginebra y arándano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]