[{"ingredients": ["1 gran canal de pollo asado con aproximadamente un tercio de la carne en el hueso", "2 litros / 3½ litros de agua", "2 zanahorias, peladas", "2 puerros", "1 cebolla, pelada y partida por la mitad", "1 hoja de laurel", "6 granos de pimienta negra", "1 cubo de caldo de pollo", "150g / 5½oz de huevo o fideos de arroz", "100g / 3½oz de bok choi, más o menos picados", "3-4 cebollas de primavera, en rodajas finas", "50g / 1¾oz de maíz dulce enlatado", "3 cucharadas de salsa de soja", "cilantro de racimo pequeño, picado"], "method": ["Retire la carne restante de la carcasa del pollo y colóquelo en la nevera.", "Caliente 2 litros / 3½ litros de agua hasta hervir a fuego lento en una cacerola grande y profunda.", "Coloque la carcasa de pollo asado, junto con los jugos de cocción restantes, en el agua caliente y agregue las zanahorias, puerros enteros, cebolla, laurel, granos de pimienta y cubos de caldo.", "Llevar el caldo a ebullición, reducir a fuego lento y cocinar durante una hora. Elimine el stock de vez en cuando para eliminar cualquier residuo que se forme en la parte superior.", "Después de cocinar el caldo durante una hora, coloque un colador sobre una sartén grande. Elija la carcasa de pollo del caldo y colóquelo en el colador. Con cuidado, vierta el resto del caldo a través del colador en la sartén.", "Regrese el caldo colado al calor y vuelva a hervir a fuego lento.", "Mientras tanto, rasgue el pollo asado reservado en trozos pequeños.", "Agregue los fideos al caldo de pollo y cocine por un minuto antes de agregar el pollo, el bok choi, la cebolla tierna, el maíz dulce y la salsa de soja a la sartén. Cocine por 2-3 minutos, luego revuelva a través del cilantro picado.", "Divida entre cuatro tazones y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_how_to_make_chicken_19119", "title": "Cómo hacer sopa de fideos de pollo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_chicken_19119_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 muslos de pollo", "30 ml / 2 cucharadas de miel", "60 ml / 4 cucharadas de salsa de soja", "60 ml / 4 cucharadas de mirin", "30 ml / 2 cucharadas de sake", "2 cucharaditas de jengibre fresco rallado", "1 diente de ajo, picado", "30ml / 2 cucharadas de aceite vegetal", "Fideos de huevo medianos 250 g / 9 oz"], "method": ["Retire los huesos de los muslos de pollo con un cuchillo pequeño y afilado.", "En un tazón grande, mezcle la miel, la salsa de soja, el mirin, el sake, el jengibre y el ajo.", "Coloque los muslos de pollo en el adobo y cubra bien la carne con la salsa. Transfiera el pollo a la nevera por 15 minutos.", "Cuando esté listo para cocinar el pollo, caliente el aceite vegetal en una sartén. Seque el lado de la piel de los muslos de pollo en papel de cocina, para que la piel se fríe cuando se fríe. Coloque los muslos de pollo en la sartén, con la piel hacia abajo, a fuego medio. Freír hasta que la piel esté dorada. Dependiendo del tamaño de su sartén, es posible que deba freír el pollo en tandas, no amontone la sartén.", "Baje el fuego a bajo, luego voltee el pollo para freír el otro lado. Vierta la salsa utilizada para marinar el pollo en la sartén. Cocine a fuego lento durante cinco minutos, luego aumente la temperatura y cocine hasta que la salsa se espese.", "Mientras tanto, cocina los fideos de acuerdo con las instrucciones del paquete.", "Para servir, corta el pollo y colócalo en un plato con los fideos. Vierta la salsa teriyaki espesada sobre el pollo."], "url": "www_bbc_co_uk_food_recipes_how_to_make_chicken_71312", "title": "Cómo hacer pollo teriyaki", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_chicken_71312_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cubo de caldo de pollo o verdura o similar", "2 nidos de fideos de huevo", "100g / 3½oz Tentedtem brócoli, cortado en dedos", "2 pechugas de pollo sin piel (o puedes usar lomo de cerdo)", "Setas, shiitake o castaña 200g / 7oz, divididos a la mitad o en cuartos", "1 cebolla roja, espesamente cortada", "1 pimiento rojo, sin semillas y en rodajas gruesas", "1 diente de ajo, en rodajas finas", "pieza del tamaño del pulgar jengibre fresco de la raíz, finamente cortado", "1 cucharada de aceite vegetal o de girasol", "½ cucharadita de hojuelas de chile seco", "3 cucharadas de salsa hoisin, mezclada con 2 cucharadas de agua", "1-2 cucharaditas de aceite de sésamo", "puñado de anacardos o cacahuetes"], "method": ["Ponga a hervir una olla de agua, agregue el cubo de reserva y deje que se disuelva. Agregue los fideos y vuelva a hervir.", "Agregue el brócoli y hierva durante dos minutos hasta que el brócoli y los fideos estén tiernos, luego escurra, enjuague con agua fría y déjelos a un lado en el colador.", "Corta el pollo en tiras y prepara los champiñones, la cebolla, la pimienta, el ajo y el jengibre.", "Caliente una cucharadita de aceite vegetal en una sartén antiadherente grande o wok, luego agregue el pollo. Sofreír el pollo durante dos minutos a fuego alto hasta que se dore.", "Saca el pollo de la sartén y ponlo a un lado en un plato mientras las verduras están cocidas.", "Regrese la sartén al fuego y agregue el aceite restante. Agregue los pimientos, cebollas y champiñones. Revuelva y cocine por unos minutos hasta que esté tierno, pero aún con colores brillantes, y los champiñones solo se doren.", "Agregue el ajo, el jengibre y las hojuelas de chile y chisporrotee durante unos segundos hasta que estén fragantes.", "Incline los fideos escurridos, el brócoli y el pollo y sofríalos hasta que los fideos estén calientes. Agregue la salsa hoisin y la mezcla de agua, luego mezcle para que todo esté cubierto con la salsa. Si los fideos parecen un poco secos, agrega un poco más de agua. Para finalizar, rocíe con aceite de sésamo, esparza las nueces tostadas y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_how_to_make_chicken_stir_01397", "title": "El mejor pollo salteado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_chicken_stir_01397_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["5 pimientos rojos", "8 chiles rojos", "1.25kg / 2lb 12 oz azúcar granulada", "360ml / 12fl oz de vinagre de vino blanco o vinagre de sidra", "225g / 8oz de tomates picados enlatados", "125g / 4½oz de pectina líquida"], "method": ["Para limpiar los frascos, precaliente el horno a 140C / 275F / Gas 1. Lave bien los frascos con agua tibia y jabón y luego enjuague bien con agua corriente. Deje los frascos y tapas para secar, al revés, en el horno. (O puede limpiar los frascos poniéndolos a través del ciclo caliente del lavavajillas).", "Coloque un plato limpio en el congelador para enfriar. Esto se usará para probar si el atasco cocido ha alcanzado el punto de ajuste.", "Para la mermelada, corte los pimientos y los chiles por la mitad, luego quite las semillas y las membranas blancas (mantenga las membranas blancas de los chiles si desea más calor picante). Cortar los pimientos y los ajíes finamente a mano o, alternativamente, cortarlos aproximadamente, colocarlos en un procesador de alimentos y pulsar para picar finamente.", "Coloque los chiles picados y los pimientos en una cacerola amplia y profunda con el azúcar, el vinagre y los tomates. Llevar lentamente a ebullición, revolviendo, hasta que el azúcar se haya disuelto.", "Llevar la mezcla a ebullición durante 7-10 minutos para reducir el líquido a la mitad. Retire del fuego y agregue la pectina. Regrese la sartén al fuego y hierva por otros minutos.", "Para comprobar si el atasco ha alcanzado el punto de ajuste, coloque la cuchara un poco sobre la placa refrigerada. Déjelo por un momento, luego presione el borde del atasco con el dedo: si el atasco está listo, la superficie se arrugará al empujar.", "Una vez que el atasco ha alcanzado el punto de ajuste, déjelo enfriar durante cinco minutos antes de colocarlo en los recipientes esterilizados. El atasco se mantendrá en el frasco sellado por hasta seis meses."], "url": "www_bbc_co_uk_food_recipes_how_to_make_chilli_11991", "title": "Cómo hacer mermelada de ají", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 3 jarras", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_chilli_11991_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1kg / 2lb 4oz Bramley manzanas", "500 g / 1 libra de cebollas de 2 oz", "2 dientes de ajo", "Jengibre fresco de la raíz de los 5cm / 2in", "100g / 3½ oz de pasas (u otras frutas secas como dátiles y pasas)", "pizca de copos de chile seco", "Vinagre de malta destilado de 500ml / 18fl oz", "250g / 9oz de azúcar mascabado ligero", "1½ cucharadita de sal"], "method": ["Pele, núcleo, luego corte aproximadamente las manzanas. Cortar las cebollas, picar finamente el ajo y la cáscara y picar finamente el jengibre.", "Coloque la manzana, la cebolla, el ajo, el jengibre, los copos de chile y la fruta en una cacerola grande y ancha. Agregue el vinagre, el azúcar y la sal. Revuelva la mezcla a fuego medio hasta que todo el azúcar se haya disuelto.", "Una vez que el azúcar se haya disuelto, lleve a ebullición, luego reduzca ligeramente el fuego y cocine a fuego lento la salsa picante por alrededor de una hora, revolviendo cada cierto tiempo. A medida que se espesa, revuelva con más frecuencia y observe que el azúcar no comienza a pegarse al fondo de la sartén. La salsa picante se hace cuando puedes raspar una cuchara de madera en el fondo de la sartén y la salsa picante no fluye hacia atrás en el espacio.", "Mientras tanto, para limpiar los frascos de mermelada, precaliente el horno a 140C / 275F / Gas 1. Lave bien los frascos con agua tibia y jabón y luego enjuague bien con agua corriente. Deje los frascos y tapas para secar, al revés, en el horno. (O puede limpiar los frascos poniéndolos a través del ciclo caliente del lavavajillas).", "Cuidadosamente cuchara la salsa picante en los frascos esterilizados y selle mientras está caliente. Almacene en un lugar fresco y oscuro durante aproximadamente un mes antes de comer, para que los sabores se suavicen."], "url": "www_bbc_co_uk_food_recipes_how_to_make_chutney_57366", "title": "Cómo hacer chutney", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Rinde 7-8 jarras de chutney", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_chutney_57366_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500g / 1lb 2oz de harina blanca fuerte", "1 cucharadita de sal", "50g / 1¾oz de azúcar moreno claro", "15 g / 1 oz de levadura fresca o 1½ cucharadita de levadura seca", "75g / 3oz de mantequilla, ablandada", "200ml / 7fl de leche en oz", "2 huevos de gallinas camperas, más una yema de huevo, para glasear", "aceite sin sabor, para engrasar", "Ciruelas pasas 200g / 7oz, aproximadamente picadas", "1 naranja, ralladura y jugo", "100g / 3½oz de azúcar moreno claro", "1½ cucharadita de canela molida", "100 g / 3½ onzas de mantequilla, ablandadas, más extra para engrasar", "50 g / 2 oz de azúcar en polvo"], "method": ["Mezcle la harina, la sal y el azúcar en un tazón. Mezcle en la levadura fresca (o mezcle la levadura seca). Frote la mantequilla ablandada en la mezcla de harina con las puntas de los dedos hasta que no haya grandes trozos de mantequilla. (No tiene que ser tan fino como pan rallado, como lo harías con un crumble).", "Haz un pozo en la mezcla de harina. Vierta la leche en el pozo y agregue un huevo. Traiga la masa con sus manos o con una espátula. Esta es una masa bastante suave y flexible; si se siente un poco húmeda y pegajosa, no entre en pánico. Sigue mezclando y la harina absorberá el líquido.", "Voltee la masa sobre una superficie limpia y amasar durante 10 minutos o hasta que la masa esté suave y elástica. Corte una pieza pequeña y estire la masa lo más fina que pueda: si puede ver la luz que brilla a través de la masa y puede ver la sombra de sus dedos detrás de la parte más delgada, está lista.", "Coloque la masa en un bol engrasado, cubra con una toalla de té húmeda y deje probar durante aproximadamente 80-90 minutos.", "Mientras tanto, para el relleno, combine las ciruelas picadas con la ralladura de naranja y el jugo, y reserve. La fruta debe empaparse por un mínimo de media hora, pero se puede preparar con hasta un día de anticipación.", "En un tazón pequeño, bata el azúcar y la canela en la mantequilla ablandada con un tenedor hasta que estén bien combinados. Dejar de lado.", "Engrase ligeramente la base y los lados de una lata para asar profunda de aproximadamente 34x24cm / 13x9 pulgadas con mantequilla y colóquelos en un pergamino para hornear.", "Cuando la masa casi ha duplicado su tamaño, tírela fuera del bol y elimine el aire. Ruede la masa en un rectángulo, el grosor de una moneda de una libra. El lado largo del rectángulo debe tener unos 30 cm de largo.", "Extienda la pasta de canela sobre la superficie de la masa, asegurándose de que la pasta llegue a todos los bordes. Escurrir las ciruelas pasas, reservar el jugo y luego espolvorear las ciruelas pasas sobre la masa.", "Comenzando con un lado largo del rectángulo, enrolle la masa en forma de salchicha. Hierva la superficie de trabajo y coloque la masa enrollada sobre la harina antes de cortarla en 12 rebanadas iguales.", "Coloque las rebanadas una al lado de la otra, con la espiral hacia arriba, en la lata de tueste revestida. Cubra con un paño de cocina húmedo y déjelo para probar nuevamente durante aproximadamente 45 minutos.", "Precalentar el horno a 200C / 400F / Gas 6.", "Cuando los panecillos se han levantado y se sienten elásticos al tacto, están listos para hornear. Batir el huevo restante y la yema de huevo juntos en un tazón pequeño, y cepillar la parte superior de los bollos con glaseado de huevo. Esto dará a los bollos un brillo y un color encantador.", "Hornee los panecillos a 200C / 400F / Gas 6 por 10 minutos y luego baje la temperatura del horno a 180C / 350F / Gas 4. Cocine por otros 20 minutos.", "Mientras los bollos se hornean, prepara el jarabe. Vierta el jugo de naranja reservado de sumergir las ciruelas en una olla pequeña con el azúcar. Suavemente caliente la mezcla, revolviendo hasta que el azúcar se disuelva. Ponga a hervir el almíbar y cocínelo durante cinco minutos. Dejar de lado.", "Cuando los panecillos hayan terminado de hornear, retírelos del horno y cepíllelos con el almíbar para que el sabor a naranja se empape con los bollos. Transfiera los bollos en el papel a una rejilla para que se enfríen."], "url": "www_bbc_co_uk_food_recipes_how_to_make_cinnamon_86187", "title": "Cómo hacer bollos de canela", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Hace 12 bollos", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_cinnamon_86187_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 cucharadas de semillas de cilantro", "2 cucharadas de semillas de comino", "1 cucharada de semillas de mostaza", "1 cucharadita de semillas de hinojo", "1 cucharadita de pimienta negra", "1 cucharadita de cúrcuma molida", "1 cucharadita de canela molida", "1 cucharadita de pimentón", "1 o 2 chiles secos, según las preferencias personales", "1 cucharadita de sal", "pieza del tamaño del pulgar jengibre fresco de raíz, pelado y finamente rallado", "4 dientes de ajo, finamente rallados", "1 cucharada de puré de tomate", "4 cucharadas de vinagre de vino blanco o vinagre de sidra", "aceite vegetal o de girasol, para cubrir la pasta para almacenar"], "method": ["Pon las semillas y los granos de pimienta en una sartén seca a fuego medio. Cocine durante unos tres minutos, revolviendo con frecuencia, hasta que las semillas de mostaza comiencen a reventar y las semillas se vuelvan doradas y aromáticas. Incline en un recipiente y permita que se enfríe durante unos minutos.", "Agregue la cúrcuma, la canela, el pimentón y los chiles secos a una mano de mortero. Agregue las especias tostadas enfriadas y moler todo junto en un polvo fino. Agrega la sal", "Agregue el jengibre rallado, el ajo, el puré de tomate y el vinagre de vino blanco y mezcle bien para hacer una pasta.", "Úselo de inmediato o coloque la pasta en un recipiente, cúbralo con una capa de aceite, cierre con una tapa y guárdelo en la nevera hasta por una semana."], "url": "www_bbc_co_uk_food_recipes_how_to_make_curry_paste_37065", "title": "Cómo hacer pasta de curry", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Hace suficiente pasta para 8 porciones", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_curry_paste_37065_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500g / 1lb 2oz de pescado blanco sostenible, como el abadejo o el coley", "pizca de sal", "Harina normal de 50g / 2oz", "2 huevos de gallinas camperas, golpeados", "Pan rallado de 200 g / 7 oz (hecho de pan duro)", "1 cucharada de perejil finamente picado", "1 limón, cáscara y jugo solamente", "sal y pimienta negra recién molida", "2 cucharadas de aceite de oliva, más extra para engrasar", "Mayonesa 100 g / 3½ oz", "3 pepinillos, finamente picados", "Alcaparras 50 g / 2 oz", "1 cucharada de perejil finamente picado"], "method": ["Cortar el pescado en tiras por el filete, siguiendo las líneas naturales de los peces. Las tiras deben medir aproximadamente 2 cm / 1 pulgada de ancho y 6-8 cm / 3-4 pulgadas de largo. Espolvorea un poco de sal en el pescado.", "Coloque la harina en un plato. Coloque los huevos batidos en un recipiente grande. Coloque las migas de pan en otro plato y mezcle el perejil picado y la ralladura de limón en las migas de pan.", "Ahora tiene preparada su línea de producción, tome un trozo de pescado y espolvoréelo en la harina, luego sumérjalo en el huevo (permitiendo que el exceso gotee) y finalmente en las migas de pan.", "Transfiera los dedos de pescado a la bandeja de horneado preparada y refrigere durante una hora; esto reafirmará los pescados y los hará más fáciles de manipular, y el huevo y la harina se solidificarán un poco también.", "Precaliente el horno a 220C / 425F / Gas 7 y engrase ligeramente una bandeja para hornear.", "Rocíe los dedos de pescado con aceite de oliva.", "Hornee los dedos de pescado durante 12-15 minutos, o hasta que estén ligeramente dorados y cocidos. O freír el pescado en una sartén, a fuego medio, con unas cucharadas de aceite de oliva durante 2-3 minutos por cada lado hasta que estén doradas y cocidas. Retire los dedos de pescado de la sartén y colóquelos en papel de cocina para absorber el exceso de aceite.", "Mientras tanto, prepare la salsa tártara mezclando todos los ingredientes en un tazón pequeño y déjelos a un lado hasta que los necesite.", "Una vez cocinado, exprime un poco de jugo de limón sobre los dedos de pescado. Sirva con una generosa ración de salsa tártara."], "url": "www_bbc_co_uk_food_recipes_how_to_make_fish_fingers_64484", "title": "Cómo hacer dedos de pez", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_fish_fingers_64484_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100g / 3½oz de mantequilla sin sal, ablandada", "100 g / 3½ oz de azúcar en polvo", "2 huevos de gallinas camperas, a temperatura ambiente, ligeramente golpeados", "100g / 3½ oz de harina de auto crianza", "1 cucharadita de extracto de vainilla", "¼ cucharadita de sal fina", "1 cucharada de leche", "125g / 4½oz de mantequilla sin sal, ablandada", "200g / 7oz de azúcar glas, tamizado", "1 cucharada de leche", "1 cucharadita de extracto de vainilla", "cuajada de limón o mermelada para el relleno (opcional)"], "method": ["Precalentar el horno a 180 ° C / 350 ° F / Gas 4 y alinear un molde de 12 hoyos con 12 cajas de pastel de hadas de papel. (O para cupcakes profundos de estilo americano, forre un molde para muffins de 6 hoyos con cajas de muffins más grandes).", "Coloque la mantequilla ablandada en un tazón grande y luego bata con un batidor de mano eléctrico hasta que esté pálida y esponjosa. Poco a poco agregue el azúcar y continúe batiendo hasta que esté completamente combinado.", "Agregue un poco del huevo batido a la mezcla de mantequilla, luego bata de nuevo. Poco a poco agregue el huevo, poco a poco, batiendo después de cada adición. Es importante ir despacio, ya que agregar demasiado huevo a la vez puede hacer que la mezcla se separe. Si se divide, simplemente agregue una cucharada de la harina y bata hasta que la masa esté suave de nuevo.", "Tamiza la harina en el tazón. Usando una cuchara grande de metal o una espátula, dobla la harina en la mezcla para pastel.", "Agregue la vainilla y la sal y revuelva para combinar. Agregue la leche para hacer que la mezcla para pastel tenga una consistencia suave, donde una cucharada colmada de mezcla se desprende de la cuchara después de volcarla durante unos segundos.", "Usando dos cucharas de postre (una para recoger y otra para meter la mezcla en la lata), llene las cajas de papel hasta la mitad con la pasta, llenándolas por igual.", "Hornee los pasteles de hadas por 15 minutos en el medio del horno, hasta que estén dorados y las tortas vuelvan hacia atrás cuando se presionen ligeramente. (Hornee pastelitos por 18-20 minutos).", "Cuando esté lo suficientemente frío para manipularlo, levante los pasteles sobre una rejilla para enfriar y deje que se enfríen por completo. Los pasteles se pueden congelar por hasta un mes o se mantendrán frescos en una lata hermética durante unos días.", "Para hacer la crema de mantequilla, coloca la mantequilla en un tazón grande y bate con batidores eléctricos hasta que quede suave y cremosa. Tamice el azúcar glas, luego trabaje en la mantequilla, comenzando lentamente al principio y luego batiendo con más fuerza una vez que todo el azúcar se haya combinado. Agregue la leche y la vainilla, luego bata hasta que quede cremoso y suave. Si la mezcla es demasiado dura, agregue un poco más de leche. Puedes colorear la crema de mantequilla en esta etapa.", "Para hacer pasteles de mariposas, corte la parte superior de cada pastel con un pequeño cuchillo de sierra, inclinando ligeramente el cuchillo para hacer un corte cóncavo. Corta las partes superiores por la mitad, para hacer dos 'alas'. Unte o vierta una cucharada colmada de crema de mantequilla en la salsa que ha preparado en la parte superior de cada pastel y espolvoree un poco de cuajada de limón o mermelada. Coloque las alas en la crema de mantequilla, y el polvo con un poco de azúcar glas."], "url": "www_bbc_co_uk_food_recipes_how_to_make_fairy_cakes_45428", "title": "Cómo hacer pasteles de hadas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 12 pequeños pasteles de hadas, o 6 pastelitos profundos", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_fairy_cakes_45428_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["150 g / 5½ oz de mantequilla sin sal, a temperatura ambiente", "45 g / 3 cucharadas de azúcar en polvo", "300g / 10½oz de queso crema con alto contenido de grasa"], "method": ["Coloque la mantequilla en un tazón grande con el azúcar en polvo.", "Batir la mantequilla y el azúcar juntos durante 2-3 minutos hasta que estén suaves y cremosos.", "Luego bata en el queso crema hasta que quede suave."], "url": "www_bbc_co_uk_food_recipes_how_to_make_cream_cheese_66895", "title": "Cómo hacer glaseado de queso crema", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Hace suficiente para un pastel", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_cream_cheese_66895_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1kg / 2lb 4oz de patatas, peladas", "50g / 2oz de mantequilla", "100g / 3½ oz de crema", "3 cucharadas de leche tibia", "pizca de sal y pimienta blanca", "500 ml / 1 litro de leche", "Abadejo ahumado de 250 g / 9 oz", "200 g / 7oz cod lejos", "1 cebolla", "1 hoja de laurel", "3 dientes", "2 puerros, lavados y picados", "50 g / 2 oz de mantequilla, más 25 g / 1 oz para puntear en la parte superior de la tarta", "1 cucharada de aceite de oliva", "3 cucharadas de harina", "sal y pimienta blanca", "100g / 3½ oz de gambas crudas", "50g / 2oz de guisantes congelados", "1 cucharada de perejil finamente picado", "1 limón, ralladura solamente"], "method": ["Precalentar el horno a 190C / 375F / Gas 5.", "Corte las papas en trozos de 5cm / 2in y hierva hasta que estén suaves. Escurrir y macerar con la mantequilla, crema fresca y leche tibia. Sazonar con sal y pimienta blanca. Apartar y mantener caliente.", "Caliente la leche en una sartén grande, agregue el abadejo ahumado y el bacalao. Corta la cebolla por la mitad, haz una incisión en una de las mitades e inserta la hoja de laurel. Empuja los dientes en la misma mitad de cebolla y colócala en la sartén con la leche y el pescado. Llevar la leche a ebullición. Reduzca el fuego y cocine a fuego lento durante 6-7 minutos.", "Mientras tanto, pique finamente la mitad de la cebolla restante y los puerros. Caliente la mantequilla con el aceite de oliva en una sartén pequeña y fría la cebolla y los puerros durante 4-5 minutos para que se ablanden, pero no se doren.", "Retire el pescado de la sartén y póngalo a un lado para que se enfríe un poco. Mantenga la leche en la sartén.", "Agregue la harina a los puerros y mezcle bien para combinar. Freír por un minuto, revolviendo con frecuencia. Poco a poco, saque la leche de la caza furtiva del pescado y revuélvala bien cada vez. Agregue toda la leche de esta manera y caliente suavemente hasta que la salsa se espese.", "Pruebe la salsa para condimentar y agregue más sal o pimienta si es necesario.", "Rompe el pescado en trozos, teniendo cuidado de sentir por los huesos y quita la piel, luego dobla los trozos de pescado en la salsa.", "Agregue los langostinos crudos y los guisantes congelados a la mezcla.", "Coloque un plato para pastel a prueba de horno en una bandeja de hornear (esto captará cualquier mezcla que burbujee durante la cocción).", "Coloque la mezcla de pescado en el fondo del plato resistente al horno. Espolvoree perejil fresco picado y ralladura de limón rallado en la parte superior.", "Cuidadosamente cubra con el puré de papa enfriado. Usa un tenedor para extender el puré sobre el pastel y crea una textura áspera en la parte superior. Coloque el pastel con la mitad restante de la mantequilla y colóquelo en el horno durante 25-30 minutos, o hasta que se dore y burbujee."], "url": "www_bbc_co_uk_food_recipes_how_to_make_fish_pie_56143", "title": "Cómo hacer pastel de pescado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_fish_pie_56143_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 x pescado blanco entero (como la dorada, John Dory o pargo), eviscerado", "grandes langostinos en el caparazón", "grandes mejillones en el caparazón", "Papas cerosas de 400g / 14oz, como Desirée, peladas y cortadas en trozos de 2cm", "1 cucharada de perejil de flatillo picado", "llovizna de aceite de oliva", "30ml / 2 cucharadas de aceite de oliva", "recortes de pescado, incluida la cabeza y los huesos, de los peces mencionados anteriormente", "1 chalote, picado", "1 hinojo pequeño con bulbo, picado", "3 tomates maduros", "3 dientes de ajo, aplastados con el lado plano de un cuchillo", "1 tomillo de ramita grande", "2 hojas de laurel", "2 pellizcos hilos de azafrán", "Anís de 1 a 2 estrellas", "2 litros / 3½ pintas de agua hirviendo", "sal y pimienta negra recién molida"], "method": ["Filete el pescado, aparte las guarniciones y quite cualquier hueso pequeño de los filetes con unas pinzas. Coloque los filetes a un lado para agregarlos a la sopa más tarde.", "Para hacer el caldo, corte los recortes de pescado aproximadamente en tres partes. Caliente una cacerola grande de base pesada a fuego medio y agregue el aceite de oliva.", "Agregue las guarniciones de pescado y freír durante 5-10 minutos hasta que comiencen a dorarse. Retire los restos de pescado de la sartén y déjelos a un lado en un plato.", "Agregue la chalota, el hinojo, los tomates, el ajo, el tomillo, las hojas de laurel, el azafrán y el anís estrellado. Freír suavemente a fuego medio durante unos minutos, revolviendo regularmente, hasta que los vegetales se hayan suavizado.", "Agregue los restos de pescado cocido nuevamente a la sartén y vierta el agua hirviendo. Vuelva a cocinar a fuego lento y elimine cualquier espuma que se forme en la superficie con un cucharón o cuchara. Reduzca el fuego y cocine a fuego lento durante 35 minutos.", "Coloque un colador en un colador colocado sobre una olla grande. Coloque el caldo en el colador y luego vierta suavemente el resto de líquido de la sartén, con cuidado de no incrustar el pescado o las verduras en el colador. Sazone al gusto con sal y pimienta negra recién molida.", "Para la sopa, coloque las papas en el caldo de pescado. Llevar a ebullición y cocinar durante 6-8 minutos, o hasta que las papas estén casi cocidas.", "Cortar los filetes de pescado en trozos de 5cm / 2in. Deseche los mejillones que estén abiertos o que no se cierren cuando se golpeen, o que se rompan las cáscaras.", "Agregue las gambas, los mejillones y el pescado blanco a la cacerola y cocine a fuego lento durante 2-3 minutos, o hasta que el pescado esté cocido y los mejillones se hayan abierto. Deseche los mejillones que no se hayan abierto durante la cocción. Sazone al gusto con sal y pimienta negra recién molida.", "Para servir, vierta la sopa de pescado en los cuencos de sopa, espolvoréese con perejil, rocíe con aceite de oliva y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_how_to_make_fish_soup_13895", "title": "Cómo hacer sopa de pescado", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_fish_soup_13895_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina de pan fuerte de 250g / 9oz, más extra para quitar el polvo", "½ cucharadita de sal", "½ cucharadita de semillas de cilantro, tostadas y molidas", "½ cucharadita de pimentón ahumado", "4 cucharadas de aceite de oliva", "100ml / 3½fl oz de agua tibia"], "method": ["Mezcle la harina, la sal, las semillas de cilantro y el pimentón en un tazón grande, haga un pozo en el centro y agregue el aceite de oliva y el agua tibia. Con un tenedor, comience a incorporar la harina con el agua y el aceite de oliva, si es necesario agregue más agua. Una vez que la masa comienza a juntarse, use sus manos para formar una bola suave de masa.", "Espolvorea tus manos y limpia la superficie de trabajo con harina y amasa la masa durante cinco minutos, o hasta que esté suave y elástica. Vuelva a colocar la masa en el recipiente, cúbrala y déjela a un lado durante 15 minutos. (Esta masa es mucho más firme de manejar que la masa de pan y se sentirá más pesada).", "Divida la masa en cinco bolas iguales. Estirarlos al grosor de una moneda de £ 2. Caliente una sartén a la plancha y cocine los panes planos durante dos minutos por cada lado.", "Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_how_to_make_flatbread_44059", "title": "Cómo hacer pan plano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Hace 5 panes planos", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_flatbread_44059_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50g / 2oz de mantequilla", "1kg / 2lb 4 oz cebollas, en rodajas finas", "2 dientes de ajo picados", "100ml / 3½fl oz de vino blanco", "2 cucharadas de Madeira, más extra una vez cocinado, al gusto", "1 litro / 1¾ de pinta de carne de res fresca", "sal y pimienta negra recién molida", "perejil picado para decorar", "8 rebanadas gruesas de pan francés", "2 dientes de ajo, cortados por la mitad", "Queso Gruyère 100g / 3½oz, rallado"], "method": ["Derrita la mantequilla en una sartén mediana a prueba de horno, agregue las cebollas y el ajo y fría a fuego lento durante 30-35 minutos, revolviendo ocasionalmente, hasta que las cebollas sean realmente suaves y tengan un color marrón oscuro intenso. Esta etapa de la receta es realmente importante, la cocción lenta y prolongada de las cebollas le da a esta sopa su delicioso sabor y color.", "Agregue el vino blanco, revolviendo el fondo de la sartén para aflojar toda la cebolla dorada. Vuelva a hervir y luego agregue el caldo de Madeira y la carne de res.", "Llevar a ebullición y luego cocinar a fuego lento durante unos 10-12 minutos.", "Mientras tanto, prepara los crotones. Tueste el pan en ambos lados y frote la tostada con el lado cortado de un diente de ajo. Cubra con el queso rallado y coloque debajo de la parrilla hasta que el queso se haya derretido.", "Pruebe la sopa para verificar el condimento y agregue sal y pimienta negra recién molida al gusto. Agregue otras cucharadas de Madeira a la sopa, para aumentar el sabor y revuelva bien.", "Coloque los croûtons encima de la sopa y espolvoree con perejil fresco picado.", "Para servir, ponga la sopa en cuencos, asegurándose de que cada porción tenga un croûton cursi. Servir inmediatamente, antes de que el croûton se empape."], "url": "www_bbc_co_uk_food_recipes_how_to_make_french_onion_87434", "title": "Cómo hacer sopa de cebolla francesa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_french_onion_87434_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 huevos de gallinas camperas, solo yemas", "100 g / 3½ oz de azúcar en polvo de oro", "1 cucharada de harina de maíz, opcional", "Crema doble de 300 ml / ½ pinta", "300ml / ½ pinta de leche entera", "1 vaina de vainilla"], "method": ["Asegúrese de tener suficiente espacio libre en el congelador. Primero, separa los huevos, colocando las yemas en un tazón grande. (No necesitarás los blancos para esta receta. Puedes usarlos para hacer merengues).", "Agregue el azúcar a las yemas de huevo y bata hasta que esté pálido y espeso.", "Agregue la harina de maíz (si se usa) y mezcle bien para incorporar en las yemas de huevo.", "Pon la crema y la leche en una cacerola mediana.", "Corta la vaina de vainilla abierta a lo largo y raspa las semillas con el dorso de un cuchillo, luego agrega a la crema y la leche.", "Caliente la crema y la leche hasta que estén justo por debajo de la ebullición. Lentamente vierta la crema y la leche caliente sobre los huevos y el azúcar, batiendo sobre la marcha.", "Tamiza la natilla en una sartén limpia y ponla a fuego muy bajo. Mezcle la crema constantemente con una cuchara de madera, prestando especial atención a las esquinas de la sartén, hasta que esté humeante y se haya espesado ligeramente. La crema está lista cuando puedes dibujar una línea clara a través de ella en la parte posterior de la cuchara de madera. Esto puede tomar hasta 10 minutos.", "Incline la crema pastelera en un recipiente grande, poco profundo, a prueba de congelación, y permita que se enfríe a temperatura ambiente (puede acelerar esto colocando la tarrina de crema en un recipiente grande con agua helada).", "Una vez que esté a temperatura ambiente, coloque una tapa sobre la crema pastelera y deje enfriar en la nevera durante la noche.", "Una vez frío, transfiera la crema pastelera al congelador y sáquela cada hora, durante tres horas, para batirla con un batidor de mano eléctrico. Esto dispersará los cristales de hielo y lo mantendrá liso.", "A continuación, deje el helado en el congelador para una congelación final, hasta que esté sólido.", "Retire el helado del congelador 10 minutos antes de servirlo, para que sea fácil de extraer."], "url": "www_bbc_co_uk_food_recipes_how_to_make_ice_cream_97157", "title": "Cómo hacer helado", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_ice_cream_97157_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["125g / 4½oz de mantequilla sin sal, ablandada", "200g / 7oz de azúcar glas, tamizado", "1 cucharada de leche", "1 cucharadita de extracto de vainilla"], "method": ["Coloque la mantequilla en un tazón grande y bata con un batidor de mano eléctrico hasta que esté suave y esponjosa.", "Tamice el azúcar glas, luego trabaje en la mantequilla, comenzando lentamente al principio y luego batiendo con más fuerza una vez que todo el azúcar se haya combinado.", "Agregue la leche y la vainilla, luego bata hasta que quede cremoso y suave.", "Si la mezcla es demasiado dura, agregue un poco más de leche.", "Raspe los lados del tazón para asegurarse de que todo el azúcar glas esté incorporado. Continúe batiendo hasta que quede ligero y cremoso.", "Puede colorear la crema de mantequilla en esta etapa o agregar aromatizantes como cacao o chocolate derretido o cáscara de limón o naranja."], "url": "www_bbc_co_uk_food_recipes_how_to_make_icing_04669", "title": "Cómo hacer glaseado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Hace suficiente para 6 pastelitos", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_icing_04669_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 huevos de gallinas camperas", "100 g / 3½ oz de azúcar en polvo de oro", "1 cucharada de harina de maíz, opcional", "300ml / 1 pinta de crema doble", "300ml / ½ pinta de leche entera", "1 vaina de vainilla"], "method": ["Separe los huevos, colocando las yemas en un tazón grande. (No necesitarás los blancos para esta receta. Puedes usarlos para hacer merengues).", "Agregue el azúcar a las yemas de huevo y bata hasta que esté pálido y espeso.", "Agregue la harina de maíz y bata bien para incorporar en las yemas de huevo.", "Pon la crema y la leche en una cacerola mediana.", "Corta la vaina de vainilla abierta a lo largo y raspa las semillas con el dorso de un cuchillo, luego agrega a la leche y la crema.", "Caliente la mezcla de crema justo por debajo del punto de ebullición. Saque la vaina de vainilla y déjela a un lado (puede secarse y colocarse en azúcar para hacer azúcar de vainilla).", "Lentamente vierta la crema y la leche caliente sobre los huevos y el azúcar, batiendo sobre la marcha.", "Transfiera la natilla a un recipiente limpio y ajústelo a fuego muy bajo.", "Mezcle la crema constantemente con una cuchara de madera, prestando especial atención a las esquinas de la sartén, hasta que esté humeante y se haya espesado ligeramente. La crema está lista cuando puedes dibujar una línea clara a través de ella en la parte posterior de la cuchara de madera. Esto puede tomar hasta 10 minutos."], "url": "www_bbc_co_uk_food_recipes_how_to_make_custard_82327", "title": "Cómo hacer natillas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_custard_82327_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Frambuesas de 450g / 1lb, tan frescas como sea posible", "450g / 1lb de azúcar granulada"], "method": ["Para limpiar los frascos, precaliente el horno a 140C / 275F / Gas 1. Lave bien los frascos con agua tibia y jabón y luego enjuague bien con agua corriente. Deje los frascos y tapas para secar, al revés, en el horno. (O puede limpiar los frascos poniéndolos a través del ciclo caliente del lavavajillas).", "Coloque algunos platillos en el congelador para enfriar. Estos se usarán para probar si el atasco cocido ha alcanzado el punto de ajuste.", "Coloque las frambuesas y el azúcar en una cacerola para preservar la boca ancha a fuego muy lento, revolviendo de vez en cuando hasta que todo el azúcar se haya disuelto por completo. Es importante tener el calor bajo para que el azúcar se disuelva en lugar de derretirse y se adhiera a la sartén.", "Llevar la mezcla de frutas a un punto de ebullición rápido (cuando las burbujas no se puedan calmar removiendo con una cuchara). Cocine por 3-5 minutos hasta que el atasco llegue al punto de ajuste. A medida que su mermelada se acerca al punto de ajuste, se espesará y comenzará a hervir más lentamente, con burbujas más gruesas y pesadas.", "Para probar si el atasco ha alcanzado el punto de ajuste, primero retire la sartén del fuego mientras prueba el atasco; esto es muy importante. Ponga un poco de mermelada en un platillo frío, déjelo enfriar durante unos minutos y luego introduzca el dedo en el atasco. Si se arruga, está listo. De lo contrario, devuelva la sartén al fuego y cocine el atasco durante uno o dos minutos más y vuelva a probar.", "Cuando el atasco haya alcanzado el punto de ajuste, colóquelo cuidadosamente en los frascos esterilizados (un embudo de atasco esterilizado es muy útil) y gire las tapas mientras el atasco todavía está caliente. El atasco se espesará a medida que se enfríe y el sello de los frascos debería sumergirse. Si un frasco no se sella, guárdelo en el refrigerador y use el atasco dentro de un par de semanas.", "Los frascos sellados se pueden guardar en el armario durante meses, aunque después de seis meses el sabor comienza a deteriorarse."], "url": "www_bbc_co_uk_food_recipes_how_to_make_jam_75331", "title": "Cómo hacer mermelada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 3 jarras de mermelada", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_jam_75331_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1.5kg / 3lb 5oz hombro de cordero, deshuesado, cortado en cubos", "4 cucharadas de pasta de curry india media", "2 cucharadas de aceite vegetal o de girasol", "generosa perilla de mantequilla", "2 cebollas, partidas a la mitad y luego cortadas en rodajas finas", "1 ramita de canela", "6 cápsulas de cardamomo", "400 g / 14 oz pueden cortar los tomates de ciruela", "1 cucharada de puré de tomate", "300ml / ½ pinta de pollo caliente o caldo de cordero", "400 g / 14 oz pueden garbanzos, drenados", "Espinaca de la hoja del bebé 125g / 4½oz, bien lavada"], "method": ["Coloque el hombro cortado en cordero en un bol o bolsa de comida. Mezcle tres cucharadas de pasta de curry y deje macerar durante 30 minutos a temperatura ambiente, o hasta 24 horas en la nevera.", "Caliente el aceite y la mantequilla en una sartén grande y pesada, luego agregue las cebollas, la ramita de canela, las vainas de cardamomo y la cucharada restante de pasta de curry. Freír a fuego medio durante 10 minutos, hasta que las cebollas se suavicen y comiencen a dorarse.", "Agregue el cordero marinado y fría por un par de minutos hasta que la carne cambie de color, no tiene que dorarse.", "Agregue los tomates picados, el puré de tomate y suficiente caldo para cubrir la mayor parte del cordero, con las piezas superiores simplemente quitando el líquido.", "Agregue los garbanzos y lleve la mezcla a ebullición, luego baje la temperatura a fuego lento y cocine suavemente durante 1 - 1½ horas, hasta que el cordero esté muy tierno y la salsa rica y espesa.", "Elimine el exceso de grasa que se habrá acumulado en la parte superior del curry, luego sazone con sal y pimienta negra recién molida al gusto.", "Agregue la espinaca, revolviendo las hojas de espinaca en el curry hasta que se marchiten.", "Sirve el curry con tu arroz, panes y chutneys favoritos."], "url": "www_bbc_co_uk_food_recipes_how_to_make_lamb_curry_32719", "title": "Cómo hacer cordero al curry", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_lamb_curry_32719_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1.25kg / 2lb 12oz Naranjas de Sevilla", "1.5kg / 3lb 5oz de azúcar granulada"], "method": ["Friegue las naranjas y coloque las frutas enteras en una sartén grande de acero inoxidable, o en una sartén preservadora.", "Cubra con 2,25 litros / 4 pintas de agua, luego lleve a ebullición. Reduzca el fuego y cocine a fuego lento, tapado, durante aproximadamente una hora hasta que la fruta esté suave.", "Precaliente el horno a 140 ° C / 275 ° F / Gas 1. Lave bien los frascos con agua tibia y jabón y luego enjuague bien con agua corriente. Deje los frascos y tapas para secar, al revés, en el horno. Coloque algunos platillos en el congelador para enfriar (estos se usarán para probar si la mermelada cocinada ha alcanzado el punto de ajuste).", "Retire las naranjas de la sartén con una espumadera y déjelas enfriar. Mida con cuidado 1,7 litros / 3 pintas del líquido de cocción, descartando cualquier cantidad adicional o reponiéndola con agua según sea necesario. Devuelve el líquido a la sartén.", "Cuando las naranjas estén lo suficientemente frías para manipularlas, córtelas por la mitad y saque la carne, la médula y las pepitas en un bol. Vierta la pulpa de naranja en una bolsa de muselina y asegúrela con hilo de cocina. Agregar a la sartén.", "Corta la cáscara en trozos tan finos como quieras y agrega a la sartén. Coloque la sartén a fuego lento y agregue el azúcar. Revuelva hasta que el azúcar se disuelva.", "Llevar la mermelada a ebullición durante 10-15 minutos. Elimina cualquier espuma anaranjada que salga a la superficie.", "Pruebe el punto de configuración colocando un poco de la mezcla en un platillo frío, déjelo por un momento y luego inserte el dedo en la mermelada. Si arrugas, está listo. Alternativamente, sumerja una cuchara en la mermelada, deje que la mezcla se enfríe un poco, luego vuelva a verterla lentamente en la sartén. Si está en el punto de ajuste, las gotas se ejecutarán juntas para formar un copo colgante (esto se conoce como prueba de escamas). Puede llevar hasta 30 minutos alcanzar el punto de ajuste, por lo tanto, siga probando.", "Cuando la mermelada esté lista, retire la sartén del fuego. Con cuidado, haga una cucharada dentro de los frascos esterilizados calientes (un embudo de mermelada esterilizado lo hace mucho más fácil) dejando aproximadamente 1 cm / ½ en el espacio en la parte superior del frasco. Gire las tapas de los tarros calientes para sellar. La mermelada seguirá espesándose a medida que se enfríe."], "url": "www_bbc_co_uk_food_recipes_how_to_make_marmalade_20072", "title": "Cómo hacer mermelada", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Rinde 8 jarras de mermelada", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_marmalade_20072_16x9.jpg", "isVegetarian": true, "recommendations": 0}]