[{"ingredients": ["25 g / 1 oz de azúcar en polvo", "25g / 1oz de sal fina", "1 vaina de vainilla, semillas raspadas", "2 cucharadas de whisky", "1 x 500 g / 1 lb 2 onzas de salmón, con la piel puesta y los huesos de alfiler retirados", "½ manojo de remolachas heredadas del bebé, limpio, pequeño tallo dejado en", "200ml / 7fl oz de vinagre de vino blanco", "75 g / 2½ oz de azúcar en polvo", "1 cucharadita de sal", "½ cucharadita de pimienta negra", "2 chalotes de plátano, en rodajas finas", "½ pepino, en rodajas finas", "Jengibre de raíz de 2 cm / 1 en pieza, pelado y en rodajas", "100ml / 3½fl oz de vinagre de vino blanco", "2 cucharaditas de azúcar en polvo", "2 pepinos, toscamente picados", "1 cucharadita de goma de xantano", "2 cucharadas de berros de mostaza", "2 cucharadas de berro de coriandro"], "method": ["Para el salmón curado con whisky, coloque el azúcar, la sal, las semillas de vainilla y el whisky en un tazón grande y mezcle. Espolvoree parte de la mezcla en el fondo de una bandeja de horno no reactiva y coloque el salmón encima, con la piel hacia abajo.", "Cubra el salmón con el resto de la mezcla de curado y cubra con una película adhesiva. Coloque en el refrigerador durante 4-6 horas o durante la noche.", "Para la remolacha en escabeche, pepino y chalotes, coloque la remolacha en una olla grande de agua hirviendo y cocine durante 15-20 minutos. Escurrir y dejar hasta que esté lo suficientemente frío como para manejarlo. Pelar con cuidado y cortar por la mitad.", "Para los chalotes encurtidos, caliente el vinagre de vino blanco, el azúcar, la sal y los granos de pimienta en una sartén a fuego medio hasta que el azúcar se haya disuelto. Coloque los chalotes, el pepino, la remolacha y el jengibre en un recipiente y vierta sobre la mezcla de vinagre caliente. Mézclelos para cubrirlos y luego déjelos reposar durante al menos una hora, preferiblemente durante 24 horas.", "Para el ketchup de pepino, coloque el vinagre y el azúcar en una cacerola y caliente hasta que el azúcar se haya disuelto. Retire del fuego y deje enfriar un poco antes de verterlo en un procesador de alimentos grande con el pepino. Mezclar hasta que esté suave. Con el procesador todavía funcionando, agregue la goma xantham hasta que esté bien combinada y espesada. Sazonar con sal y dejar de lado.", "Para servir, corte el salmón en tiras finas. Extienda el ketchup de pepino en un plato para servir y agregue el salmón. Adorne con las verduras y berros encurtidos."], "url": "www_bbc_co_uk_food_recipes_whisky-cured_salmon_with_58695", "title": "Salmón curado con whisky con salsa de tomate en escabeche, pepino, chalotes y pepino", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["25 g / 1 oz de azúcar en polvo", "25g / 1oz de sal fina", "1 vaina de vainilla, semillas raspadas", "2 cucharadas de whisky", "1 x 500 g / 1 lb 2 onzas de salmón, con la piel puesta y los huesos de alfiler retirados", "Perlas de tapioca 100 g / 3½ oz", "200ml / 7fl oz de caldo de verduras", "2 cucharaditas de jugo de remolacha", "aceite vegetal, para freír", "sal", "100ml / 3½fl oz de vinagre de vino blanco", "2 cucharaditas de azúcar en polvo", "2 pepinos, toscamente picados", "1 cucharadita de goma de xantano", "1 pepino, pelado, con los extremos y bordes redondeados recortados", "aceite de colza, para lloviznar", "gran puñado de berros o 2 cucharadas de berros"], "method": ["Para el salmón curado con whisky, coloque el azúcar, la sal, las semillas de vainilla y el whisky en un tazón grande y mezcle. Espolvoree parte de la mezcla en el fondo de una bandeja de horno no reactiva y coloque el salmón encima, con la piel hacia abajo.", "Cubra el resto del salmón con la mezcla de curado y cúbralo con una película adhesiva. Coloque en el refrigerador durante 4-6 horas o durante la noche.", "Para las patatas fritas de tapioca, coloque la tapioca en una olla con el caldo y cocine, revolviendo constantemente. Agregue el jugo de remolacha y revuelva. Incline sobre una bandeja de horno forrada. Deje que se seque durante 2-3 horas.", "Caliente una freidora de grasa (o una olla grande de media base con aceite) a 190 ° C / 380 ° F. (PRECAUCIÓN: El aceite caliente puede ser peligroso. No lo deje desatendido.) Rompa los trozos de la tapioca seca y colóquelos en la freidora por un segundo, luego retírelos con una espumadera y déjelos a un costado para escurrirlos sobre papel de cocina. Espolvorea con sal.", "Para el ketchup de pepino, coloca el vinagre y el azúcar en una cacerola mediana y calienta hasta que el azúcar se haya disuelto. Retire del fuego y deje enfriar un poco antes de verterlo en un procesador de alimentos grande con el pepino. Mezclar hasta que esté suave.", "Con el procesador todavía funcionando, agregue la goma xantana hasta que esté bien combinada y espesada. Sazonar con sal y dejar de lado.", "Para el pepino a la brasa, caliente una sartén grande hasta que esté caliente. Rocíe el pepino con el aceite de colza y cocine hasta que esté uniformemente carbonizado en cada lado. Retirar del fuego y cortar en cuatro pedazos.", "Para servir, corte el salmón en rodajas finas formando un ángulo y coloque unas rodajas en el centro de cada una de las cuatro placas. Ponga un poco de la salsa de tomate de pepino al lado, con un trozo de pepino a la brasa. Esparcir sobre unas hojas de berro y patatas fritas de tapioca y servir."], "url": "www_bbc_co_uk_food_recipes_whisky-cured_salmon_with_72948", "title": "Salmón curado con whisky con salsa de tomate de pepino y pepino a la brasa", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["150ml / 5fl oz de vinagre de sidra", "5 cucharadas de azúcar en polvo", "60 g / 2¼ oz de semillas de mostaza amarillas", "25 g / 1 oz de semillas de mostaza marrón", "2 cucharadas de mostaza inglesa en polvo", "50ml / 1¾fl oz de whisky de malta", "50ml / 1¾fl oz de jugo de naranja", "2 cucharaditas de miel", "50g / 1¾oz de mantequilla, más extra para engrasar", "1 diente de ajo, cortado por la mitad", "500g / 1lb 2oz de papas King Edward, peladas y en rodajas finas", "Nabos de 500g / 1lb 2 oz, pelados y en rodajas finas", "sal y pimienta negra recién molida", "300 ml / 10 fl oz doble crema", "300ml / 10fl oz de leche entera", "pizca de nuez moscada recién rallada", "4kg / 8lb 8oz 3-bone forerib of 28-day aged beef", "200ml / 7fl oz de vino blanco", "300ml / 10fl oz de caldo de carne"], "method": ["Para la mostaza, coloque el vinagre y el azúcar en una cacerola y cocine a fuego lento. Agregue las semillas de mostaza y el polvo y mezcle bien.", "Cocine a fuego lento durante tres minutos hasta que el volumen del líquido se haya reducido a la mitad y las semillas estén ligeramente blandas.", "Vierta en una licuadora de alimentos y mezcle con un puré: demora unos minutos para que las semillas se descompongan y la mostaza se vuelva cremosa.", "Agregue el whisky, el jugo de naranja y la miel, luego mezcle una vez más. Sazonar con un poco de sal y pimienta negra recién molida y dejar de lado.", "Para dauphinoise, precalentar el horno a 170C / 325F / Gas 3.", "Unte con mantequilla un plato resistente al horno con un poco de mantequilla y luego frote el diente de ajo alrededor del plato.", "Mezcle las papas y los nabos en un bol, sazone con sal y pimienta negra recién molida. Incline en el plato a prueba de horno, presionando las rebanadas hacia abajo para formar una capa uniforme.", "Coloque la crema y la leche en un tazón y bata para combinar. Sazonar con sal, pimienta negra y nuez moscada y verter la crema y la leche sobre las patatas y los nabos.", "Apunte con la mantequilla restante y luego cubra bien con papel de aluminio. Coloque en el horno y cocine durante una hora hasta que las verduras estén tiernas. Después de una hora, retírelo del horno y déjelo a un lado.", "Para la carne de res, aumente la temperatura del horno a 200C / 400F / Gas 6. Extienda un poco de mostaza por toda la carne (cualquier mostaza restante puede guardarse en un recipiente en la nevera durante unas semanas).", "Caliente una sartén grande hasta que esté muy caliente. Agregue un poco de aceite a la sartén y fría la carne por todos lados hasta que esté dorado. Transfiera a un plato de asar y colóquelo en el horno durante 1 hora y 30 minutos.", "Retire del horno, cubra con papel de aluminio y descanse durante 15-30 minutos.", "Para el dauphinoise, retire la lámina y vuelva al horno por otros 30 minutos hasta que se dore en la parte superior.", "Para la carne, coloque la carne en una tabla lista para tallar y luego devuelva la bandeja de asar al fuego. Haga una salsa calentando los jugos de carne a fuego medio hasta que burbujee, luego agregue el vino y cocine hasta que el líquido se haya reducido a la mitad. Agregue el caldo de carne y cocine hasta que se reduzca a la mitad nuevamente, luego sazone al gusto.", "Para servir, esculpe la carne y sirva con una cucharada de dauphinoise y una cucharada de mostaza. Rocíe la salsa para terminar."], "url": "www_bbc_co_uk_food_recipes_whisky_and_orange_31001", "title": "Whisky y naranja mostaza costilla de ternera con patata y nauphinoise nabo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 limas, 1 jugo y ralladura, 1 jugo solamente", "90ml / 3½fl oz de whisky", "180g / 6½oz de azúcar morena clara", "20 gambas de tigre crudas, peladas, desveladas", "1 chile rojo, sin semillas, finamente picado", "1 cucharada de aceite vegetal"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Caliente el jugo de lima, el whisky y el azúcar en una cacerola a fuego medio, revolviendo suavemente, hasta que el azúcar se haya disuelto. Una vez que el azúcar se haya disuelto por completo, deje de remover, suba el fuego y hierva durante 5-7 minutos, o hasta que la mezcla se vuelva espesa y espesa. Para saber si está lista, sumerja una cuchara de madera en la mezcla y golpéela; aún debe adherirse un poco de esmalte a la cuchara, pero no será tan espesa como la miel. (A veces, el whisky se prende y verá una llama azul-anaranjada saliendo de la sartén. Simplemente quítelo del fuego y el whisky se consumirá).", "Agregue la ralladura de lima finamente rallada, luego retire la sartén del fuego y reserve.", "Ponga las gambas en un plato para horno poco profundo y espolvoree sobre la guindilla. Cepille las gambas con el aceite y luego con el glaseado. Hornee en el horno durante 10-15 minutos, o hasta que las gambas se vuelvan opacas. Retire del horno y cepille con más esmalte, reservando cualquier glaseado extra para mojar, y deje enfriar un poco antes de servir."], "url": "www_bbc_co_uk_food_recipes_whisky_and_chilli_tiger_72921", "title": "Whisky y langostinos tigre", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4 como entrante o 2 como plato principal", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/whisky_and_chilli_tiger_72921_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 lado del salmón", "150g / 5½oz de sal marina", "150 g / 5½ oz de azúcar en polvo", "100 ml / 3½ fl oz de whisky", "Harina normal de 200g / 7oz", "7g bolsita instantánea de levadura", "Leche 250ml / 9fl oz", "1 cucharadita de sal", "1 cucharadita de azúcar", "2 claras de huevo de gallinas camperas", "50g / 1¾oz de mantequilla", "Gelatina de grosella roja 200 g / 7 oz", "3 dientes", "50ml / 2fl de whisky de oz", "100ml / 3½fl oz de vinagre de vino tinto", "50g / 1¾oz de mostaza Dijon", "10 remolachas, cocidas y cortadas en cubos", "250 g / 9 oz de crema fresca", "mostaza berro o micro hierbas, para adornar"], "method": ["Coloque tiras largas de película adhesiva sobre una superficie de trabajo. Coloque el salmón encima y cúbralo con sal marina, azúcar y whisky. Envuelva el pescado firmemente en una película adhesiva y colóquelo en la nevera durante 12 horas.", "Lave el salmón para eliminar el roce de sal, luego corte en rodajas finas.", "Para hacer los blinis, mezcle la harina, la levadura, la leche, la sal y el azúcar. Reserve en un lugar cálido para probar durante una hora.", "Para la remolacha, caliente la jalea de grosella, el clavo, el whisky y el vinagre en una cacerola. Cocine a fuego lento hasta que el volumen del líquido se haya reducido a la mitad. Pasar por un tamiz", "Agregue la mostaza, revuelva a través de la remolacha. Ponga a un lado hasta que esté listo para servir.", "Para los blinis, bata las claras de huevo en un recipiente aparte hasta que se formen picos rígidos cuando se quite el batidor. Cuando el bateador ha probado ser pliegue en las claras de huevo.", "Para cocinar los blinis, derrita la mantequilla en una sartén grande. Agregue una cucharada de masa al molde por blini y cocine hasta que se dore por la parte inferior. Da la vuelta y cocina el otro lado. Retire el blini y colóquelo en papel de cocina. Repite hasta que hayas usado toda la masa. Mantenga los blinis calientes hasta que estén listos para servir.", "Para servir, coloque rodajas de salmón en platos para servir, con algunos blinis, una cucharada de remolacha y una quenelle de crème fraîche. Adorne con berro de mostaza o micro hierbas."], "url": "www_bbc_co_uk_food_recipes_whisky_cured_salmon_with_14937", "title": "Salmón curado con whisky con remolacha y blinis", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Sirve 10-12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/whisky_cured_salmon_with_14937_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["175g / 6oz de mantequilla sin sal ablandada", "100 g / 3½ oz de azúcar en polvo", "185g / 6½ oz de harina común", "½ cucharadita de sal de mesa", "85g / 3oz de sémola fina", "50ml / 2fl oz de whisky de malta", "Avena de avena instantánea de 40 g / 1½ oz, rellena con un procesador de alimentos", "harina de arroz, para quitar el polvo", "6 cucharadas de agua tibia", "2½ cucharadas de polvo de merengue", "½ cucharadita de crema de tártaro", "500g / 1lb 2oz de azúcar glas", "Colorante de comida de gel verde", "colorante de comida de gel rojo"], "method": ["Para el shortbread, ponga la mantequilla y el azúcar en un tazón y mezcle hasta que estén suaves y esponjosos. Agregue la harina, la sal, la sémola, la avena y el whisky. Mezclar a la masa y enfriar en la nevera durante 15 minutos.", "Polvore una superficie de trabajo con harina de arroz y enrolle la masa hasta 4 mm de grosor. Usando un cortador de galletas o una plantilla cortada en 12-15 galletas grandes (el número exacto variará dependiendo de la forma). Enfriar en la nevera durante 15 minutos.", "Precalentar el horno a 170C / 150C Fan / Gas 3½.", "Coloque los bizcochos en bandejas para hornear forradas u hojas de hornear de malla y hornee por 15 minutos, no los deje dorar. Deje que se enfríe en las rejillas de alambre.", "Para el glaseado real, coloque el agua y el polvo de merengue en el recipiente de un mezclador de alimentos, y mezcle durante un minuto. Agregue la crema de tártaro y mezcle durante 45 segundos. Agregue lentamente el azúcar glasé y bata durante 10 minutos a baja velocidad (¡puede resultar beneficioso colocar una toalla húmeda sobre el tazón cuando se agrega azúcar glas, ya que llega a todas partes!).", "Ponga un cuarto de la formación de hielo en un tazón pequeño y agregue el color verde del alimento del gel. En un tazón separado colorea otro cuarto del rojo glaseado. Esto te deja con la mitad del glaseado aún blanco. Coloque el glaseado verde y rojo en bolsas de tubería separadas con boquillas finas y llanas. Ponga un tercio del glaseado blanco en una manga pastelera equipada con una boquilla simple.", "Pase un círculo de glaseado blanco por la superficie de cada galleta bastante cerca del borde y déjelo reposar. Con una cucharilla, llene el círculo con el resto del glaseado blanco (si el glaseado blanco es un poco demasiado espeso para extenderlo sobre los bizcochos, agregue una gota de agua, pero tenga cuidado de no dejarlo demasiado líquido). Antes de que se forme el glaseado blanco, hágalo con líneas finas y alternas de glaseado rojo y verde. Usando un palillo de cóctel, arrastre la formación de hielo en la dirección opuesta a las líneas rojas y verdes para crear un efecto de pluma. Deja para establecer.", "Si desea que las galletas cuelguen en un árbol de Navidad, use un palillo de cóctel para perforar un agujero cerca de la parte superior y empujar un poco de hilo o cinta fina a través."], "url": "www_bbc_co_uk_food_recipes_whisky_shortbread_ding_77063", "title": "Whisky shortbread ding dangs", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 12 galletas grandes", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/whisky_shortbread_ding_77063_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["75ml / 3fl oz de whisky", "25g / 1 oz de miel", "1 limón, solo jugo", "75 g / 3 oz de semillas de mostaza amarillas", "25 g / 1 oz de semillas de mostaza marrón", "50 ml / 2 fl oz de agua", "4 x chuletas de lomo de cerdo, francés recortado, grasa eliminada", "75g / 3oz de pan rallado seco", "1 cucharada de aceite de oliva", "25g / 1oz de mantequilla", "50g / 2oz de mantequilla", "3 cucharadas de aceite de oliva", "4 papas pequeñas, peladas, cortadas en rodajas gruesas", "1 diente de ajo, pelado, finamente cortado", "2 ramitas frescas de romero, solo hojas", "sal y pimienta negra recién molida", "Hojas de espinaca bebé 400 g / 14 oz", "2-3 cucharadas de agua"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Caliente el whisky, la miel, el jugo de limón y el agua en una cacerola y caliente hasta que la miel se disuelva.", "Agregue las semillas de mostaza y cocine durante 1-2 minutos, o hasta que la mayor parte del líquido haya sido absorbido.", "Mezcle la mezcla en un procesador de alimentos hasta que quede cremosa (esto tomará unos minutos).", "Espolvoree las migas de pan en un plato.", "Cepille la chuleta de cerdo en un lado con la mezcla de mostaza y drague en las migas de pan. Vierta la mostaza restante en un recipiente pequeño y déjela a un lado.", "Caliente el aceite de oliva y la mantequilla en una sartén a prueba de horno hasta que estén calientes. Freír las chuletas de cerdo durante 2-3 minutos en cada lado, o hasta que estén doradas en cada lado.", "Transfiera al horno por 6-8 minutos, o hasta que el cerdo esté cocido. Retire del horno y reserve para descansar.", "Para las papas salteadas, caliente el aceite de oliva y la mitad de la mantequilla en una sartén hasta que estén calientes. Freír las papas durante 4-5 minutos o hasta que estén doradas y tiernas. Agregue el ajo y el romero y sazone al gusto con sal y pimienta negra recién molida.", "Caliente la mantequilla restante en una sartén, agregue la espinaca y el agua y cocine por 2-3 minutos, o hasta que la espinaca se haya marchitado.", "Para servir, espolvorea unas papas en cada uno de los 4 platos para servir, completa con una chuleta de cerdo y coloca un poco de espinaca al costado. Sirve con la mostaza restante."], "url": "www_bbc_co_uk_food_recipes_whiskymustardcrusted_93746", "title": "Corteza de cerdo con costra de mostaza y whisky con patatas salteadas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharaditas de azúcar en polvo", "425ml / 15fl oz de agua tibia", "2½ cucharadita de levadura seca o 20 g / ¾ oz de levadura fresca", "750g / 1lb 9oz de harina de pan fuerte, más extra para espolvorear", "2 cucharaditas de sal", "40 g / 1½ oz de mantequilla o 4 cucharadas de aceite de oliva", "aceite vegetal, para engrasar", "1 huevo de gallinas camperas, golpeado", "semillas de amapola o sésamo, para la parte superior del pan (opcional)"], "method": ["En una jarra medidora, mezcle el azúcar con 150ml / 5fl oz del agua tibia y la levadura y deje reposar en un lugar tibio durante cinco minutos, o hasta que esté espumoso. Si usa levadura de acción rápida, no hay necesidad de dejarla en reposo.", "Tamiza la harina y la sal en un tazón grande. Frota la mantequilla y haz un pozo en el centro. (Si usa aceite de oliva en lugar de mantequilla, vierta el aceite de oliva en el agua restante). Vierta la mezcla de levadura y la mayor parte del agua restante (y el aceite de oliva, si se usa). Mezcle con una masa suelta, agregue el agua restante si es necesario, más extra si es necesario.", "Amase durante aproximadamente diez minutos o hasta que la masa esté suave y elástica al tacto. (Si amasa en una batidora eléctrica con un gancho de masa, cinco minutos suele ser suficiente). Coloque la masa en un tazón grande y aceitado. Cubra la parte superior con cinta adhesiva y colóquelo en un lugar cálido hasta que duplique su tamaño. Esto puede tomar hasta dos o incluso tres horas.", "Precalentar el horno a 220C / 425F / Gas 7.", "Cuando la masa haya aumentado más del doble, golpee y amase de nuevo durante 2-3 minutos. Deje que se relaje durante diez minutos antes de comenzar a darle forma al pan.", "Forme el pan en hogazas o rollos, transfiéralo a una bandeja para hornear y cubra con una toalla de té limpia. Deje que se levante nuevamente en un lugar cálido durante 20-30 minutos, o hasta que la masa con forma se duplique nuevamente. Cuando se haya levantado por completo, debe dejar una abolladura al presionar suavemente la masa con el dedo.", "Suavemente (como el pan está lleno de aire en este punto y, por lo tanto, muy frágil) cepillar con huevo y espolvorear con semillas de amapola o de sésamo (si se usa), o espolvorear ligeramente con harina para obtener un pan de aspecto rústico.", "Hornee en el horno durante 10-15 minutos para panecillos, o 30-45 minutos para pan, dependiendo de su tamaño. Reduzca la temperatura a 200C / 400F / Gas 6 después de 15 minutos para el tiempo de cocción restante. Cuando está cocido, el pan debe sonar hueco cuando se toca en la base. Transfiera a una rejilla para enfriar."], "url": "www_bbc_co_uk_food_recipes_white_bread_38648", "title": "pan blanco", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Rinde 2 panes", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["8 hojas grandes de repollo blanco", "4 zanahorias, peladas y en rodajas finas", "4 chalotes, partidos en 'pétalos'", "100ml / 3½fl oz de vinagre de vino blanco", "100ml / 3½fl oz de aceite de oliva", "3 dientes de ajo", "2 cucharadas de azúcar", "1 cucharada de semillas de cilantro", "100g / 3½oz de mantequilla sin sal", "50ml / 2fl oz de aceite vegetal", "4 grandes codornices de corral", "sal marina", "20 rebozuelos escoceses", "pimienta negra recién molida", "tapas de zanahoria, para adornar"], "method": ["Poner a hervir una olla grande de agua con sal y agregar las hojas de col, las zanahorias y los chalotes. Deje que el agua vuelva a hervir y cocine por dos minutos, luego escurra y vuelva a llenar las verduras rápidamente en un tazón grande con agua helada. Drene nuevamente, seque las verduras y luego colóquelas en un plato resistente al calor.", "Coloque el vinagre, el aceite, el ajo, el azúcar y las semillas de cilantro en una olla pequeña, deje hervir y luego vierta sobre las verduras y deje enfriar.", "Precalienta el horno a 180 ° C / 350 ° F / Gas 4. Calienta la mantequilla y el aceite en una sartén grande. Sazonar las codornices con la sal y sellarlas en la sartén hasta que se doren por todos lados, rociando con la mantequilla mientras se doran. Transfiera la codorniz a una lata de asar y tueste en el horno por dos minutos. Freír los níscalos en la sartén por un minuto y luego sazonar con sal y pimienta negra recién molida.", "Para servir, coloca la codorniz en un plato con los níscalos. Coloque las verduras alrededor de la codorniz y rocíe un poco de la salsa escabeche. Adornar con las tapas de zanahoria."], "url": "www_bbc_co_uk_food_recipes_white_cabbage_escabeche_33284", "title": "Escabeche de repollo blanco con codorniz de corral y níscalos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200g / 7oz de chocolate blanco para cocinar, aproximadamente picado", "300 g / 10½ onzas de queso crema con toda su grasa, a temperatura ambiente, con líquido drenado", "300 ml / 10 fl oz doble crema", "1 cucharadita de jugo de limón", "1 cucharadita de extracto de vainilla", "Galletas de jengibre de 175g / 6oz", "50 g / 1¾oz de mantequilla sin sal, ablandada"], "method": ["Para hacer el relleno, derrita suavemente el chocolate blanco en un recipiente resistente al calor, sobre una cacerola llena de 4cm / 2 en agua hervida a fuego lento. Asegúrese de que la base del recipiente no toque el agua. Una vez que quedan unos pocos trozos de chocolate sin fundir, revuélvalo, retire el recipiente y siéntelo en algún lugar durante aproximadamente 10 minutos, hasta que el chocolate permanezca líquido pero se enfríe a temperatura ambiente.", "Para hacer la base, rompe los bizcochos en un procesador de alimentos y licúa hasta que tengas casi todas las migas. Agregue la mantequilla y procese de nuevo hasta que la mezcla comience a agruparse y se una a la cuchilla. Si lo hace a mano, coloque los bizcochos en una bolsa, aplaste las migajas, luego derrita la mantequilla y agregue las migas de galletas hasta que estén bien mezcladas.", "Presione la mezcla de galletas en la lata de la torta, dejando que algunas suban un poco por los lados. La parte posterior de una cuchara es la herramienta más fácil para el trabajo aquí. Stash la lata en la nevera mientras te vas con el relleno de tarta de queso.", "Batir el queso crema con una cuchara de madera en un tazón grande, hasta que esté suave. Doble suavemente el chocolate blanco ligeramente enfriado y derretido.", "Suavemente batir la crema para que se espese, pero los picos no mantienen su forma, luego dóblela en la mezcla de chocolate blanco en dos lotes. Agregue el jugo de limón y el extracto de vainilla y dóblelos, luego vierta y raspe la mezcla pálida y casi húmeda en la lata revestida de galletas. Alise la parte superior, cubra la lata con film transparente y refrigere durante la noche antes de servir.", "Cuando esté listo para servir, retírelo de la nevera durante 10 minutos antes de soltar la lata y cortarla en rodajas."], "url": "www_bbc_co_uk_food_recipes_white_chocolate_22234", "title": "Tarta de queso de chocolate blanco", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 10}, "serves": "Hace 8 rebanadas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/white_chocolate_22234_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Galletas digestivas 150 g / 5½ oz", "75g / 2¾oz de mantequilla, más extra para engrasar", "250 g / 9 oz de queso mascarpone", "300 ml / 10 fl oz doble crema", "1 cucharadita de extracto de vainilla", "200g / 7oz de chocolate blanco, roto en trozos", "400g / 14oz de frambuesas frescas"], "method": ["Engrase la base de una lata con forma de manto springform de 20 cm / 8 pulg con mantequilla, luego alinee con un círculo de pergamino para hornear.", "Para hacer la base de la tarta de queso, coloque los bizcochos en una bolsa de plástico y aplaste con un rodillo hasta que se asemeje a migajas finas, pero todavía tiene textura. Derrita la mantequilla en una olla pequeña a fuego lento. Agregue los bizcochos y revuelva. Cuchara en la base de la lata y presione con la parte posterior de una cuchara hasta que esté nivelada, luego cúbrala y déjela enfriar en el refrigerador.", "Para hacer el relleno, coloque el mascarpone y la crema doble en un tazón y mezcle con un batidor de mano eléctrico hasta que esté suave y tenga picos muy suaves. Agregue la vainilla.", "Coloque el chocolate en un recipiente pequeño a prueba de calor y colóquelo encima de una olla con agua hirviendo a fuego lento. Revuelva hasta que se derrita pero no caliente. Dejar de lado durante 5-10 minutos, hasta que esté frío pero aún líquido. Vierta en el mascarpone y revuelva, pero tenga cuidado de no mezclar demasiado.", "Para hacer el coulis, ponga la mitad de las frambuesas en una licuadora pequeña. Blitz hasta que se escurra, luego vierte a través de un colador en un recipiente para eliminar las semillas.", "Vierta la mitad de la mezcla de chocolate blanco sobre la base. Use el mango de una cucharilla para hacer algunos agujeros angostos en la mezcla hasta la base. Vierta o pipe el coulis en los agujeros, reserve algunos para decorar. Vierta la mezcla restante de chocolate blanco en la parte superior, luego alise y nivele. Cubra con película adhesiva y enfríe durante al menos 6 horas o durante la noche.", "Pase una espátula alrededor de los bordes de la lata. Retire los lados y la base y siéntese en un plato. Puede ser más fácil servir en la base o pasar cuidadosamente un cuchillo debajo de la base de la galleta para soltarla. Coloque las frambuesas restantes sobre la tarta de queso y rocíe sobre el coulis restante."], "url": "www_bbc_co_uk_food_recipes_white_chocolate_and_48500", "title": "Tarta de queso de chocolate blanco y frambuesa", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/white_chocolate_and_48500_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["375g / 13oz de harina blanca fuerte, más extra para espolvorear", "250g / 9oz de masa fermentada", "7g de sal", "100-130ml / 3½-4fl oz de agua tibia", "aceite de oliva, para amasar", "150g / 5½oz de chips de chocolate blanco", "100 g / 3½ oz de frambuesas frescas (no congeladas)", "harina de sémola fina, para quitar el polvo"], "method": ["Combine la harina, el entrante y la sal en un tazón grande. Agregue el agua y mezcle con las manos hasta que tenga una masa suave.", "Cubra una tabla de cortar con aceite de oliva, luego incline la masa sobre ella y amase la masa durante 5-10 minutos, o hasta que la masa forme una piel suave y lisa.", "Incline la masa en un recipiente ligeramente engrasado y cubra con una toalla de té limpia. Deje que se levante en un lugar cálido (22-24C / 71-51F) durante cinco horas, o hasta que al menos duplique su tamaño.", "Una vez que haya subido, amase la masa hasta que esté suave, eliminando el aire. Agregue las virutas de chocolate blanco y las frambuesas y continúe amasar hasta que el chocolate y las frambuesas estén bien mezclados con la masa.", "Ruede en una forma alargada para caber en una cesta de prueba larga.", "Harina la cesta de prueba y coloque la masa en la cesta. Deja crecer durante 5-9 horas.", "Precalentar el horno a 220C / 425F / Gas 7.", "Espolvoree liberalmente la sémola sobre la masa expuesta en la cesta de prueba; esto le dará agarre en la bandeja de horneado y evitará que se extienda.", "Coloque una bandeja para hornear sobre la canasta de prueba, luego voltéela rápidamente, retire la canasta y deje la forma del pan en la bandeja para hornear.", "Hornee por 20 minutos, luego reduzca la temperatura del horno a 190C / 375F / Gas 5 y hornee durante otros 20-25 minutos. Si el pan parece que está coloreando muy rápidamente, reduzca el calor antes y cúbralo con papel de aluminio."], "url": "www_bbc_co_uk_food_recipes_white_chocolate_and_89452", "title": "Pan de chocolate blanco y frambuesa", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Hace 1 pan", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["400 ml / 14 fl oz crema doble", "100ml / 3½fl oz de leche entera descremada", "1 vaina de vainilla, dividida por la mitad a lo largo y semillas raspadas", "6 yemas de huevo de gallinas camperas", "100 g / 3½ oz de azúcar en polvo", "100 ml / 3½ fl oz de whisky", "3 medialunas grandes con mantequilla, rebanadas gruesas", "Sultanas de 25g / 1oz", "40 g / 1½ oz de mantequilla, ablandada", "Crema doble 500ml / 18fl oz", "500ml / 18fl de leche en oz", "300 g / 10½ oz de chocolate blanco, toscamente picados", "3 huevos de gallinas camperas", "6 yemas de huevo de gallinas camperas", "200 g / 7 oz de azúcar en polvo", "Whisky 75ml / 3floz", "2 cucharadas de azúcar glas, al polvo", "Leche 400ml / 14fl oz", "Toffee de panal de 75 g / 2½ oz (toffee de ceniza)", "1 cucharadita de polvo de lecitina"], "method": ["Para el helado, ponga la crema y la leche en una cacerola con la vaina de vainilla (reserve las semillas para el pudin) y cocine a fuego lento.", "Batir las yemas de huevo y el azúcar en un bol.", "Agregue el whisky a la crema caliente y cocine a fuego lento, luego vierta sobre los huevos y batir para combinar. Regrese la mezcla a la sartén y caliente hasta que esté lo suficientemente espesa como para cubrir la parte posterior de una cuchara.", "Cuela y reserva la vaina de vainilla para hacer el pudin. Vierta en una máquina para hacer helados y batir siguiendo las instrucciones del fabricante. Congelar hasta que sea necesario.", "Para el pudin, precaliente el horno a 180C / 350F / Gas 4.", "Coloque los cruasanes en un plato a prueba de horno con las sultanas en capas en el medio, luego salpique con la mantequilla ablandada.", "Coloque la crema, la leche y la vaina de vainilla reservada y las semillas en una cacerola. Llevar a ebullición, agregar el chocolate y batir hasta que se derrita.", "Coloque los huevos, las yemas de huevo y el azúcar en un tazón y bata para combinar. Vierta la crema de chocolate caliente a través de un colador sobre los huevos y batir para combinar. Agregue el whisky y mezcle. Cúbralo a través de un fino colador sobre los cruasanes y déjelo a un lado durante 15-20 minutos para remojarlo.", "Cubra con papel de aluminio y colóquelo en el horno durante 25-30 minutos, o hasta que esté dorado y la crema recién preparada.", "Retirar del horno y espolvorear con azúcar glas. Use un soplete o coloque debajo de la parrilla para caramelizar.", "Para la espuma, coloque la leche, el panal y la lecitina en una cacerola pequeña y deje que hierva, luego espolvoréese con una batidora hasta que forme espuma.", "Para servir, coloque una porción del pudín en el centro de los platos con un poco de la salsa del plato, cubra con una bola de helado y una cucharada de espuma."], "url": "www_bbc_co_uk_food_recipes_white_chocolate_and_94872", "title": "Pudín de pan y mantequilla de chocolate blanco y whisky con espuma de panal y helado de whisky", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["aceite, para engrasar", "Disco de bizcocho de 25 cm / 10 in (cortado a partir de una gran caja de flan con esponja ya hecha)", "Chocolate blanco de 300g / 11oz, más o menos picado", "Crema doble 350ml / 12fl oz", "750g / 1lb 10oz de queso de crema suave con toda su grasa", "1½ cucharadita de extracto de vainilla", "2 limones, ralladura y jugo", "50 ml / 2 fl oz bourbon, más extra para rociar", "3 huevos de gallinas camperas, separados", "200 g / 7 oz de azúcar en polvo", "4 cucharadas de harina de maíz", "Frambuesas 250 g / 7 oz", "Frambuesas 250 g / 9 oz", "2 cucharadas de azúcar glas"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase ligeramente una lata de torta en forma de resorte de 25 cm / 10 pulg.", "Coloque 200 g / 7 oz del chocolate blanco y la crema doble en un recipiente suspendido sobre una olla de agua hirviendo (no permita que el fondo del recipiente toque el agua) y caliente hasta que se derrita.", "Coloque el disco de esponja en la base de la lata. Espolvorea con un poco de bourbon, si quieres.", "Coloque el queso crema en otro recipiente y agregue el extracto de vainilla. Luego, bata con la ralladura de limón y el jugo, el bourbon y las yemas de huevo.", "Agregue el azúcar, la harina de maíz y la crema de chocolate blanco y mezcle hasta que estén bien combinados.", "Con cuidado, dobla las frambuesas y el resto del chocolate blanco picado.", "Batir las claras de huevo hasta que se formen picos rígidos cuando se quite el batidor. Doble las claras de huevo batidas en la mezcla de queso crema con una cuchara de metal grande, asegurándose de que estén completamente incorporadas, luego vierta la mezcla sobre la base de la esponja en la lata de la torta.", "Coloque la tarta de queso en una lámina grande de papel de aluminio y envuelva la lámina alrededor de la base de la lata para sellar el fondo.", "Vierta 2-3 mm de agua tibia en una bandeja de asar, y coloque la lata de pastel en la bandeja. (Esto ayudará a crear vapor durante la cocción.) Hornea durante una hora hasta que la parte superior esté dorada, pero el centro del pastel todavía tiene un leve bamboleo.", "Retire del horno y deje enfriar y fragüe por completo antes de sacarlo de la lata.", "Para la salsa de frambuesa, coloque las frambuesas, el azúcar glas y 50 ml / 2 fl oz de agua en una licuadora y puré hasta que quede suave.", "Cuele la salsa a través de un tamiz fino empujándola con una espátula o cuchara.", "Cortar la tarta de queso y servir con una llovizna de salsa de frambuesa."], "url": "www_bbc_co_uk_food_recipes_white_chocolate_bourbon_02403", "title": "Pastel de chocolate blanco, bourbon y frambuesa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 8-10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 hojas de gelatina de hoja", "Chocolate blanco de buena calidad de 400g / 14oz, cortado en trozos pequeños", "568ml / 1 pinta de crema doble", "3 huevos blancos de gallinas camperas", "125g / 4½oz de harina natural", "35 g / 1¼ oz de avellanas peladas", "4 huevos de gallinas camperas", "1 yema de huevo de gallinas camperas", "185g / 6½ oz de azúcar en polvo", "60 g / 2¼ oz de mantequilla, derretida", "300g / 10½oz de avellanas picadas", "150 g / 5½ oz de azúcar en polvo", "Licor de avellana 200ml / 7fl oz", "Frambuesas de 500 g / 1 lb 2 oz"], "method": ["Para la mousse, coloque la gelatina en un recipiente pequeño con agua fría y déjela a un lado para que se ablande. Coloque el chocolate en un recipiente de vidrio y derrita en el microondas durante unos dos minutos, revolviendo de vez en cuando hasta que el chocolate se derrita por completo y se suavice. Dejar de lado para enfriar.", "Calienta suavemente 100 ml / 3½ fl oz de la crema en una olla pequeña sobre la encimera. Retire la sartén de la placa, exprima el agua de la gelatina y luego revuelva en la crema hasta que se disuelva por completo. Dejar en la nevera para enfriar.", "Batir las claras de huevo hasta que se formen picos rígidos cuando se quite el batidor.", "Batir la crema restante hasta que se formen picos rígidos cuando se quite la batidora. Dobla el chocolate derretido con una cuchara de metal. Agregue la mezcla de gelatina y crema y mezcle hasta que esté bien combinado. Doble suavemente las claras de huevo, cubra el recipiente con film transparente y enfríe en la nevera durante 1-2 horas.", "Para el bizcocho, precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase dos moldes para pasteles de 15 cm / 6 pulg. Y forre las bases y los lados con papel antigrasa, asegurándose de que el papel se extienda por encima de las latas.", "Coloque la harina y las avellanas en un procesador de alimentos y pulse hasta que esté muy finamente molido.", "Coloque los huevos, la yema de huevo y el azúcar en un recipiente colocado sobre una fuente de agua a fuego lento, asegurándose de que el fondo del recipiente no toque el agua. Batir los huevos y el azúcar sobre el fuego durante unos cinco minutos o hasta que la mezcla esté ligera, esponjosa y tibia.", "Retire el tazón del fuego y bata con un batidor eléctrico durante unos cinco minutos o hasta que la mezcla se haya triplicado en volumen y tenga la consistencia de crema batida.", "Tamizar un tercio de la harina y la mezcla de avellanas sobre los huevos batidos y doblar suavemente con una espátula de goma grande. Dobla por la mitad de la mezcla de harina restante, luego el resto. (No mezcle demasiado la mezcla).", "Mezcle una taza de la mezcla en la mantequilla derretida con una espátula pequeña. Cuando esté completamente combinado, doble la mezcla de mantequilla en la masa con una espátula. Divida la mezcla entre las latas de torta preparadas, alisando el nivel superior. (El bateador no debe alcanzar más de la mitad de la profundidad de las latas).", "Hornee las tortas en el horno durante 20-25 minutos o hasta que la mezcla se contraiga ligeramente desde los bordes de la sartén y la parte superior retroceda cuando se presione ligeramente. Enfriar sobre una rejilla de alambre, retirando las latas de torta y el papel resistente a las grasas tan pronto como estén lo suficientemente fríos como para manipularlos.", "Para hacer el praliné, coloque las avellanas picadas y el azúcar en una olla pequeña. Calienta suavemente hasta que el azúcar se haya disuelto y se haya vuelto de color caramelo pálido. Vierta la mezcla en la bandeja de horno preparada y déjela enfriar. Cuando el caramelo se haya solidificado, rómpalo rompiéndolo con un rodillo, coloca las piezas en un procesador de alimentos y pulsa hasta que tengas un polvo grueso.", "Para armar el pastel, corte cada esponja por la mitad horizontalmente con un cuchillo de sierra. Coloque una esponja cortada en un soporte para pasteles, cepille con licor de avellana y pise o extienda la mousse en la parte superior. Repita estas capas con las esponjas restantes, luego cubra todo el pastel con la espuma restante, usando una espátula. Coloque las frambuesas en la parte superior de la torta y luego presione suavemente la praliné en polvo en los lados, usando papel resistente a las grasas para obtener un acabado uniforme. Cepille cualquier exceso de praliné lejos del soporte de la torta con un cepillo de pastelería."], "url": "www_bbc_co_uk_food_recipes_white_chocolate_hazelnut_53975", "title": "Torta de mousse de genoise en capas de chocolate blanco, avellana y frambuesa", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Sirve 10-12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Pan rallado integral de 175 g / 6 oz marrones", "300 ml / 10 fl oz doble crema", "300 ml / 10 fl oz crema individual", "125g / 4½oz de azúcar glasé", "2 huevos de gallinas camperas, separados", "1 cucharada de whisky, (opcional)", "350 ml / 12 fl oz de leche", "Crema doble 350ml / 12fl oz", "1 vaina de vainilla, dividida", "2 huevos de gallinas camperas", "4 yemas de huevo de gallinas camperas", "150 g / 5½ oz de azúcar en polvo", "150 g / 5½ oz de chocolate blanco, más o menos picados", "8-10 rebanadas de pan blanco, cortado en cuartos", "110g / 3¾oz de mantequilla, ablandada, más extra para engrasar", "4 cucharadas de whisky", "2 cucharadas de azúcar glas, al polvo", "4 yemas de huevo de gallinas camperas", "40 g / 1½ oz de azúcar en polvo", "150ml / 5fl de leche en oz", "150m / 5fl ozl crema doble", "1 vaina de vainilla, semillas retiradas"], "method": ["Para el helado, precaliente el horno a 200C / 180C Fan / Gas 4.", "Extienda las migas de pan en una bandeja para hornear y tueste en el horno por un par de minutos hasta que estén crujientes y ligeramente doradas.", "Mientras tanto, bate las dos cremas con el azúcar. Mezcle las yemas de huevo y el whisky, si está usando, y agregue a la mezcla de crema batiéndola bien. Cuando las migas de pan estén frías, dóblelas suavemente en la mezcla de crema, asegurándose de que estén distribuidas uniformemente.", "Por último, batir las claras de huevo hasta que estén tieso y doblar en la mezcla. Transfiera a un recipiente sellable, colóquelo en el congelador y almacénelo hasta que lo necesite. (No hay necesidad de revolver este helado mientras se congela).", "Para el budín de pan con mantequilla, precaliente el horno a 130C / 110C Fan / Gas 2.", "Coloque la leche, la crema y la vaina de vainilla en una olla y deje que hierva lentamente.", "Coloque los huevos, las yemas de huevo y el azúcar en un tazón y bata para combinar.", "Cuando la mezcla de crema haya llegado a ebullición, retírela del fuego y retire la vaina de vainilla. Batir la mezcla de huevo en la mezcla de crema. Agregue el chocolate blanco y mezcle hasta que se derrita y suavice.", "Engrase un plato a prueba de horno y mantequilla el pan. Coloque el pan en el plato, superponiendo las rebanadas. Rocíe el whisky sobre el pan. Vierta sobre la mezcla de natillas.", "Hornee durante 20-25 minutos, o hasta que estén dorados y simplemente listos. Retirar del horno y espolvorear con azúcar glas. Coloque debajo de una parrilla precalentada o use un mini soplete para caramelizar la parte superior.", "Para la crema inglesa, coloca las yemas de huevo y el azúcar en un tazón y bate hasta que estén bien mezclados. Combine la leche, la crema y la vaina de vainilla en una olla y deje que hierva. Reduzca inmediatamente el fuego y cocine a fuego lento durante un minuto", "Vierta la leche en la mezcla de huevo y mezcle. Vuelva la mezcla a la cacerola y caliente lentamente, hasta que la natilla se haya espesado lo suficiente como para cubrir la parte posterior de la cuchara. Retire y deseche la vaina de vainilla.", "Cortar el budín en cuadrados y retirar del plato, espolvorear con azúcar glas y usar un soplete para colorear la parte superior. Sirva con el helado de pan moreno y la crema inglesa."], "url": "www_bbc_co_uk_food_recipes_white_chocolate_bread_66263", "title": "Pudín de mantequilla y pan de chocolate blanco con helado de whisky", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["600g / 1lb de mantequilla sin sal 5oz, más extra para engrasar", "600g / 1lb de azúcar en polvo de 5 oz", "12 huevos de gallinas camperas", "Harina de auto aumento de 450g / 1lb", "150 g / 5½ oz de cacao en polvo", "150 g / 5½ oz de chocolate negro, derretido", "300g / 10½oz de mantequilla sin sal ablandada a temperatura ambiente", "1 cucharadita de extracto de vainilla", "750g / 1lb 10oz de azúcar glas", "150g / 5½oz de chocolate blanco, derretido", "300g / 10½oz de mantequilla sin sal ablandada a temperatura ambiente", "1 cucharadita de extracto de vainilla", "750g / 1lb 10oz de azúcar glas", "150 g / 5½ oz de chocolate negro, derretido", "400 ml / 13 fl oz crema doble", "400g / 14oz de chocolate blanco", "flores frescas, para decorar"], "method": ["Precaliente el horno a 170 ° C / 325 ° F / Gas 3. Engrase y forre la lata para pasteles de 23 cm / 9 pulgadas y la lata para pasteles de 15 cm / 6 pulgadas.", "Bata la mantequilla y el azúcar juntos en un tazón hasta que estén suaves y esponjosos, luego bata los huevos, uno a la vez, hasta que estén bien combinados.", "Agregue la harina y el cacao en polvo, luego agregue el chocolate derretido hasta que esté bien combinado.", "Divida la mezcla entre las latas de pastel preparadas.", "Hornee el pastel de 23 cm en una hora, 1 hora y 15 minutos y la torta de 15 cm en 45 minutos o hasta que los pasteles estén dorados y una brocheta insertada en el centro de los pasteles salga limpia.", "Retire los pasteles del horno y déjelos a un lado para que se enfríen, luego retírelos cuidadosamente de las latas y deje que se enfríen completamente.", "Mientras tanto, para la crema de mantequilla de chocolate blanco, unte la mantequilla, la vainilla y el azúcar glas juntos en un bol hasta que estén suaves y esponjosos. Agregue el chocolate derretido.", "Para la crema de mantequilla de chocolate negro, repita el método para la crema de mantequilla de chocolate blanco.", "Para la ganache, caliente la crema doble en una cacerola hasta que hierva, luego retírela del fuego. Vierta la crema sobre el chocolate picado y revuelva hasta que el chocolate se haya derretido y la mezcla esté suave. Déjelo enfriar un poco o hasta que la mezcla se espese.", "Con cuidado, corte cada pastel por la mitad horizontalmente y rellene con la crema de mantequilla de chocolate oscuro. Extienda una cucharadita de crema de mantequilla sobre cada tarta de pastel y coloque los pasteles sobre ellos.", "Extienda la crema de mantequilla de chocolate blanco sobre la parte superior y los lados de cada pastel hasta que esté cubierto. Enfriar en la nevera durante 30 minutos, o hasta que se haya solidificado la formación de hielo.", "Extienda la ganache sobre cada pastel con una espátula, tratando de hacerlo lo más suave posible. Enfriar en la nevera durante 30 minutos, o hasta que se haya solidificado la formación de hielo.", "Para apilar las tortas, sostenga una varilla de sujeción al costado de la torta de 23cm / 9 pulgadas y marque con un lápiz donde se encuentra la guinda. Corta la varilla y otros tres con la misma longitud. Empuje las varillas en la torta a unos 5 cm / 2 pulgadas de distancia de los lados, para formar las cuatro esquinas de un cuadrado en el centro de la torta. Coloque los pilares en la parte superior de la torta más grande, colocando cada uno sobre una varilla de sujeción y luego cubra con la torta de 15 cm. Decorar con flores frescas."], "url": "www_bbc_co_uk_food_recipes_white_chocolate_wedding_01746", "title": "Pastel de bodas de chocolate blanco", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Sirve 60", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/white_chocolate_wedding_01746_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100m / 3½fl oz de aceite de oliva", "2 ramitas de romero fresco", "2 dientes de ajo, pelados y dejados enteros", "400g / 14oz de espagueti seco", "½ bulbo de hinojo, muy finamente cortado", "4 lanzas de espárragos, finamente cortadas usando un pelador de verduras", "1 chalote, finamente picado", "1 diente de ajo, aplastado", "1 chile, finamente picado", "50ml / 2fl oz de vino blanco seco", "200 g / 7 oz de carne de cangrejo blanca fresca", "1 limón, cáscara y jugo solamente", "puñado de perejil fresco, toscamente picado", "50ml / 2fl oz de aceite de oliva", "sal y pimienta negra recién molida", "1 cucharada de hojas frescas de perifollo, para servir", "1 cucharada de hojas frescas de estragón, para servir"], "method": ["Calentar el aceite en una sartén y agregar el romero y el ajo y cocinar durante 1-2 minutos.", "Cocine los espaguetis de acuerdo con las instrucciones del paquete, con un poco del aceite infundido agregado al agua. Escurrir bien y dejar reposar.", "Saca el romero y el ajo del aceite y vierte el hinojo y los espárragos para que se cocinen durante 1 minuto. Retire el hinojo y el ajo y reserve.", "Caliente el resto del aceite infundido en una sartén grande. Agregue la chalota y cocine a fuego medio hasta que esté suave. Agregue el ajo, el chile y un chorrito del vino a la sartén y revuelva para combinar. Agregue el cangrejo, el hinojo cocido y los espárragos y los espaguetis cocidos a la sartén y deje hervir. Sazone al gusto y agregue un poco más de vino si es necesario. Agregue la ralladura de limón y el perejil y mezcle bien. Retire la sartén del fuego.", "Para servir, agregue los espaguetis a un tazón y sazone con el jugo de limón y las hierbas restantes."], "url": "www_bbc_co_uk_food_recipes_white_crab_spaghetti_65861", "title": "Espagueti de cangrejo blanco", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["150ml / 5fl oz de whisky", "75g / 2¾oz de grosella blanca", "40g / 1½ oz de azúcar", "½ limón, solo ralladura", "½ cucharadita de jengibre rallado", "4 huevos de gallinas camperas, solo yemas", "60g / 2¼ oz de azúcar en polvo", "Crema doble 250ml / 9fl oz", "75g / 2¾oz de grosella blanca"], "method": ["Línea seis moldes de pudín de 125ml / 4fl oz con film transparente. Para hacer que el whisky sea cordial, coloque el whisky, las grosellas blancas, el azúcar, la ralladura de limón y el jengibre en una cacerola y caliéntelo suavemente. No permita que la mezcla hierva. Cuele y empuje la pulpa a través de un colador fino para extraer el jugo y déjelo enfriar.", "Para el semifrío, coloque las yemas de huevo y el azúcar en un tazón sobre una fuente de agua apenas hervida y bata hasta que la mezcla esté pálida y espesa. Retire la sartén del fuego y continúe batiendo hasta que la mezcla esté fría.", "Mezcle 125ml / 4fl oz del whisky cordial en la mezcla semifrío una cucharada a la vez. Batir la crema hasta que forme gruesas cintas y luego doblarla en el semifrío. Vierta la mezcla en los moldes alineados y congele durante la noche.", "Para la guarnición, pique las grosellas blancas con un alfiler y colóquelas en un tazón con el whisky cordial restante. Coloque en el refrigerador para macerar durante la noche.", "Para servir, convierte los semifreddos en platos y espolvorea con las grosellas blancas maceradas."], "url": "www_bbc_co_uk_food_recipes_white_currant_and_whisky_86804", "title": "Semifrío de grosella blanca y whisky", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 perejil pequeño de hojaldre, toscamente picado", "3-4 tomates secados al sol, al gusto", "15 g / ½ oz de aceitunas negras o verdes sin hueso, picadas", "1 cucharada de alcaparras, más o menos picadas", "1-2 anchoas (opcional)", "4 cucharadas de aceite de oliva virgen extra", "pimienta negra recién molida", "500g / 1lb 2oz de pescado blanco congelado (bacalao, abadejo y rape funcionan mejor), descongelado", "Medallones de tocino sin ahumar de 200g / 7oz", "1 cucharada de aceite de colza", "brócoli cocido al vapor"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Para tapenade, machaque el perejil, tomates secados al sol, aceitunas, alcaparras y anchoas en un tazón hasta que se rompa. Agregue el aceite de oliva y continúe macerando hasta que se convierta en una pasta espesa y untable. Sazonar con pimienta y dejar de lado mientras se prepara el pescado.", "Cortar el pescado en dedos gruesos de aproximadamente 2 cm de ancho y 8 cm de largo si es posible. Cortar los medallones de tocino por la mitad a lo largo y luego, utilizando la parte posterior del cuchillo, aplanar el tocino a lo largo, estirándolo sobre la marcha. Esto lo hará delgado y lo suficientemente largo como para envolver al pez.", "Si ha hecho la tapenade, cepille el pescado con la tapenade por todas partes, luego envuelva con el tocino. Si no usa tapenade, simplemente envuelva una tira de tocino alrededor del pescado para cubrir la mayor parte del medio posible", "Pon el pescado, únelo en la bandeja del horno y hornea por 10-15 minutos hasta que el tocino esté crujiente y el pescado se haya cocinado. Sirva con el brócoli al vapor."], "url": "www_bbc_co_uk_food_recipes_white_fish_and_bacon_30891", "title": "Pescado blanco y paquetes de tocino", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/white_fish_and_bacon_30891_16x9.jpg", "isVegetarian": false, "recommendations": 0}]