[{"isVegetarian": false, "title": "Crabcakes with chilli syrup", "url": "www_bbc_co_uk_food_recipes_crabcakeswithchillis_79703", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz white breadcrumbs", "100g/3½oz brown crab meat", "½ tsp ground ginger", "½ tsp dried chilli flakes", "1 spring onion, finely chopped", "salt and freshly ground black pepper, to taste", "3 tbsp white wine", "3 tbsp caster sugar", "½ tsp dried chilli flakes", "1 tsp tomato ketchup"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the crabcakes, place all the crabcake ingredients in a large bowl and mix together.", "Place a non-stick medium frying pan over a medium heat. Divide the crabcake mixture into two, form each into a crabcake and place each into the heated pan.", "Cook the crabcakes for two minutes on each side, until golden, then remove from heat and set aside.", "To make the chilli syrup, place a small saucepan over a high heat. Place all of the chilli syrup ingredients into the pan and bring to simmering point. Simmer for two minutes, until a syrup consistency is reached.", "To serve, place the crabcakes onto a plate and drizzle over the chilli syrup."]}, {"isVegetarian": false, "title": "Crabcakes with chilli sauce", "url": "www_bbc_co_uk_food_recipes_crabcakeswithchillis_83757", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz King Edward potatoes, peeled and cut into large chunks", "10g/½oz butter", "1 tbsp double cream", "½ tsp medium curry powder", "1 tbsp finely chopped fresh coriander", "½ large fresh green chilli, de-seeded and finely chopped", "1 tbsp red onion, grated", "salt and freshly ground black pepper ", "250g/9oz white crabmeat, flaked", "1 tbsp vegetable oil", "75g/2¾oz caster sugar", "2 red chillies, roughly chopped", "3 plum tomatoes, roughly chopped", "8 kaffir lime leaves", "2 lemongrass stems, finely chopped", "25g/1oz ginger, roughly chopped", "2 garlic cloves ", "2 shallots, roughly chopped", "4 tbsp fish sauce (nam pla)", "40ml/1½fl oz sesame oil", "50ml/2fl oz dark soy sauce", "2 tbsp clear honey", "3 limes, juice and zest only"], "serves": "Makes 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Boil the potatoes in a saucepan of lightly salted water for about 15 minutes, or until tender. Drain well, and then return to the pan. Mash with a fork or potato masher until smooth.", "Add the butter, cream, curry powder, coriander, chilli, onion and season with salt and freshly ground black pepper. Stir together to mix thoroughly, then leave to cool completely.", "Meanwhile, check the crabmeat carefully for any flecks of shell and discard. Add the crabmeat to the mashed potato mixture, then shape into four round patties. If the mixture sticks to your hands, simply dip your hands in cold water.", "Heat the oil in a shallow frying pan and when hot, carefully add the crabcakes. Cook for 3-4 minutes, until golden-brown on the underside, then carefully turn the crabcake and cook for another 3-4 minutes on the other side. When fully cooked through remove from the pan and place on kitchen towels.  ", "For chilli sauce, place the sugar in a pan on a medium heat and melt to a light brown caramel.", "Place the remaining chilli sauce ingredients into a food processor and blend to a smooth purée.", "Once the sugar is a rich caramel colour (but not burnt), pour in the purée and stir well. ", "Bring the mixture to the boil, reduce the heat and simmer for about five minutes, then remove from the heat and allow to cool. ", "Serve the crabcakes on a plate with the chilli sauce in a bowl for dipping to the side."]}, {"isVegetarian": false, "title": "Crabcakes with watercress salad", "url": "www_bbc_co_uk_food_recipes_crabcakeswithwatercr_72371", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["110g/4oz fresh breadcrumbs, seasoned", "1 large egg", "55ml/2fl oz crème fraîche, full fat", "1 tsp Worcestershire sauce", "1 tsp mustard powder", "450g/1lb crabmeat", "large handful of fresh tarragon", "sea salt and freshly ground black pepper", "watercress and endive salad"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["In a bowl, mix together the breadcrumbs, egg, crème fraîche, Worcestershire sauce and mustard powder.", "Now add the crab meat and tarragon. Mix thoroughly and season to taste. If the mixture is too dry, add more crème fraîche. Put in the fridge to bind.", "Remove the mixture from the fridge and shape into eight small cakes. ", "Shallow fry the cakes over a gentle heat until brown on both sides.", "Serve with a watercress and endive salad."]}, {"isVegetarian": false, "title": "Crabcakes with a tomato, crab and basil dressing", "url": "www_bbc_co_uk_food_recipes_crabfishcakeswithato_6230", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crabfishcakeswithato_6230_16x9.jpg", "ingredients": ["1 cooked brown crab, weighing about 1.25kg/2½lb", "300ml/10fl oz olive oil", "1 large carrot, chopped", "1 leek, chopped", "1 medium onion, chopped", "900g/2lb potatoes", "flour, for dusting", "2 eggs, beaten", "100g/4oz breadcrumbs", "2 tomatoes, skinned, seeded and chopped", "10 fresh basil leaves, 6 thinly sliced and 4 left whole", "juice of ¼ lemon", "salt and freshly ground black pepper"], "serves": "4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 150C/300F/Gas2.", "Extract all the meat from the crab but reserve all the shells. Place the shells with the olive oil in a shallow roasting pan with the carrot, leek and onion. Bake in the oven for 2 hours to gently extract the flavour. Leave to cool then strain the oil and discard the debris.", "Cook the potatoes in lightly salted boiling water until soft. Mash with a fork and mix in three-quarters of the white crab meat, half the brown crab meat and one third of the crab oil. Correct the seasoning with salt. Divide the mixture into balls each weighing about 50g/2oz. On a floured surface, shape into round flat patties with a palette knife. Pass the cakes first through the flour, then the egg and then the breadcrumbs.", "Put the remaining crab oil, the tomatoes, sliced basil, lemon juice and the rest of the crab meat in a pan and warm through but do not boil.", "Set the deep-fryer to 160C/320F or heat some oil to the same temperature in a large pan. Add the cakes and fry for three minutes. Remove and drain on kitchen paper.", "Divide the crabcakes between four warmed plates. Pour the dressing around the crab cakes. Garnish with a whole basil leaf placed on top of the dressing. Serve immediately."]}, {"isVegetarian": false, "title": "Crab fishcakes with garlic mayo", "url": "www_bbc_co_uk_food_recipes_crabfishcakeswithgar_71554", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp butter", "2 tbsp diced red pepper", "4 tbsp finely chopped spring onion", "2 tbsp finely chopped celery", "200g/7oz fresh hake/whiting/cod boned and skinned", "450g/16oz fresh or frozen crabmeat", "1 egg", "1 tbsp chopped parsley", "1 tbsp chopped fresh basil", "1 tbsp Dijon mustard", "200g/7oz fresh breadcrumbs", "salt", "freshly ground pepper", "1 tbsp vegetable oil", "2 egg yolks", "2 garlic cloves", "1-2 tbsp lemon juice", "grated lemon zest", "¼ tsp salt", "125ml/4fl oz olive oil", "125ml/4fl oz vegetable oil", "green salad leaves"], "serves": "Serves 2", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 70, "preparationMins": 60}, "recommendations": 0, "method": ["Melt one tablespoon of the butter in a small saucepan and sweat the pepper, spring onion and celery until soft, about five minutes. Allow to cool and then place in a bowl.", "Process the fresh fish in a food processor to make a rough purée. Add the crabmeat, egg, herbs, mustard and 100g/3½oz of the breadcrumbs. Taste for seasoning and add salt and pepper if necessary.", "Roll the crabmeat mixture into balls just a little larger than a golf ball and dip in the remaining breadcrumbs. ", "Finally form the balls into little cakes by pressing them down lightly.", "Melt one tablespoon of the butter in a large frying pan with the vegetable oil. Saute the crabcakes over a moderate heat until nicely golden and heated right through. This will take about 3-4 minutes on each side (depending on thickness) ", "Drain on kitchen paper and serve with a garlic mayonnaise.", "To make the mayonnaise, combine the egg yolks, garlic, one tablespoon of the lemon juice, the lemon zest and the salt in a food processor. ", "Blend for a few seconds and then slowly add the oils in a steady stream until emulsified. ", "Taste and adjust the amount of lemon juice and salt if necessary. Serve with the crabcakes and some green salad leaves."]}, {"isVegetarian": false, "title": "Crab noodle salad with nuoc cham", "url": "www_bbc_co_uk_food_recipes_crabnoodlesaladwithn_86637", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["10 small red chillies", "5 garlic cloves ", "5 limes, juice only", "1 lemongrass stalk, finely chopped ", "75ml/3fl oz rice vinegar", "75ml/3fl oz water", "250g/10½oz fine rice noodles", "250g/10½oz fresh crabmeat (cooked)", "1 red onion, very finely sliced ", "1 tbsp chopped fresh coriander", "3 lime leaves, finely sliced", "half red pepper, finely chopped ", "half cucumber, seeds removed, finely chopped", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the nuoc cham, place all of the nuoc cham ingredients into a food processor and blend until smooth. ", "For the crab salad, soak the rice noodles in very hot water for five minutes, or until soft (or cook according to packet instructions - do not overcook). Drain and set aside to cool.", "Place all of the remaining salad ingredients into a bowl and mix well, seasoning, to taste, with salt and freshly ground black pepper. ", "To serve, drizzle a little of the nuoc cham dressing into the noodles and mix well.", "Fold half of the crab salad mixture into the noodles, then using a large fork, wrap up a forkful of noodles and gently place into a small bowl to create a 'nest' of noodles. Repeat with three more bowls.", "Spoon some of the nuoc cham dressing over each noodle nest.", "Top with a spoonful of crab salad mixture, then spoon over a little more dressing."]}, {"isVegetarian": false, "title": "Crab patties with mizuna salad and chilli dressing", "url": "www_bbc_co_uk_food_recipes_crabpattieswithmizun_86379", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["600g/1lb 5oz fresh white crabmeat", "400g/14oz floury potatoes, cooked, mashed and allowed to cool", "1cm/½in fresh ginger, peeled, finely grated", "1 lime, juice only", "1 small bunch fresh coriander, roughly chopped", "salt and freshly ground black pepper ", "1 tbsp olive oil", "2 red chillies, finely chopped", "75g/3oz caster sugar", "75ml/3fl oz white wine vinegar", "75ml/3fl oz water", "75g/3oz mizuna leaves (substitute with rocket leaves if unavailable)", "50g/2oz sweetcorn kernels, drained", "4 spring onions, finely sliced", "50g/2oz fresh coconut, sliced and toasted in a dry frying pan until golden"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the crab patties, place the crab, potato, ginger and lime juice into a bowl and mix thoroughly.", "Add the coriander and season well with salt and freshly ground black pepper and mix well.", "Roll a golf ball-sized piece of crab mix and form it into a flat patty shape. Repeat with the rest of the mixture.", "Heat a frying pan until hot and add the olive oil. Add the patties and fry on both sides until golden brown all over and heated through. Set aside on kitchen paper and keep warm.", "For the salad, place the chillies, sugar, vinegar and water into a pan over a medium heat and bring to a boil. Reduce the heat and simmer the mixture for 5-6 minutes to make the dressing.", "Place the mizuna leaves, sweetcorn, spring onions and toasted coconut into a bowl and stir gently to combine. Add a little dressing and stir to coat.", "To serve, place equal portions of the salad onto plates and top each with two or three crab patties."]}, {"isVegetarian": false, "title": "Crab salad", "url": "www_bbc_co_uk_food_recipes_crabsalad_83897", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["piece of ginger (about the size of a walnut)", "75ml/3fl oz freshly squeezed lime juice (about 2 ripe limes)", "1 tsp sugar", "1 tbsp mild olive oil", "salt and freshly ground black pepper", "15 mint leaves", "2 small ripe green or orange-fleshed melons, well chilled", "½ small cucumber ", "100g/3½ oz watercress ", "300g/10oz fresh crabmeat, cooked"], "serves": "2", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["To make the dressing, peel the ginger and grate it over a bowl - you should get about a heaped teaspoon. ", "Using a small whisk (if you have one - otherwise stir with a spoon), combine the lime juice, sugar and olive oil with the ginger.", "Season with a little salt and a generous grinding of black pepper. Roughly chop the mint leaves and stir half of them in.", "For the salad, peel the melons, cut the flesh in half and scrape out the seeds with a teaspoon. Cut the flesh into chunks.   ", "Peel the cucumber, remove the seeds and cut the flesh into chunks, slightly smaller than those of the melon.", "In a bowl, toss the melon and cucumber together with the dressing.", "Trim only the toughest stalks fromf the watercress and add it to the melon.", "Divide the melon and watercress between two large plates or salad bowls, leaving any extra dressing behind in the bowl.", "Season the crabmeat with a little salt and black pepper. Pile the crab on top of the melon and watercress.", "Scatter over the remaining mint leaves. Serve straightaway."]}, {"isVegetarian": false, "title": "Crab and salmon fishcakes with homemade tartare sauce", "url": "www_bbc_co_uk_food_recipes_crabsalmonanddillfis_93618", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crabsalmonanddillfis_93618_16x9.jpg", "ingredients": ["250g/9oz small potatoes, preferably red-skinned potatoes such as Roosevelt", "sea salt and freshly ground black pepper", "2 tbsp olive oil ", "250g/9oz salmon, poached, flaked, bones removed", "150g/5oz white crab meat", "150g/5oz brown crab meat", "1 tbsp good quality mayonnaise", "handful fresh flatleaf parsley, chopped", "handful fresh dill, chopped", "1 red chilli, finely chopped", "1 tsp Dijon mustard", "sea salt and freshly ground black pepper", "1 tbsp olive oil", "4 tbsp good quality mayonnaise", "4 small cornichons or gherkins, finely chopped", "1 tbsp capers", "handful fresh flatleaf parsley, finely chopped", "½ lemon, juice only", "1 tsp grated fresh horseradish", "sea salt and freshly ground black pepper", "2 large handfuls fresh baby spinach ", "1 tbsp olive oil", "sea salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. ", "For the potatoes, boil the potatoes in a large pan of salted water for 15-20 minutes, or until tender. Drain, and then return to the saucepan.", "Crush the potatoes slightly with a fork, season, to taste, with salt and freshly ground black pepper, and drizzle over the oil. Tip into a roasting tin and roast in the oven for 25-30 minutes, or until golden-brown and crisp. ", "Meanwhile, for the fishcakes, combine the salmon, white and brown crab meat, mayonnaise, parsley, dill, red chilli and Dijon mustard in a bowl. Season, to taste, with salt and freshly ground black pepper.", "Shape the mixture into cakes using your hands, and chill in the fridge until the potatoes are almost ready. ", "For the tartare sauce, mix all of the ingredients together in a bowl and season, to taste, with salt and freshly ground black pepper. Set aside.", "To cook the fishcakes, heat the oil a large frying pan over a medium-high heat.  Fry the fishcakes in the oil for 3-4 minutes on each side, or until golden-brown and crisp.", "For the spinach, place the spinach into a small frying pan over a medium heat and cook for 1-2 minutes, or until wilted. Drizzle over the olive oil and season, to taste, with salt and freshly ground black pepper.", "To serve, divide the fishcakes between two serving plates, place the roasted potatoes and spinach either side, and spoon the tartare sauce around the edge of the plate."]}, {"isVegetarian": false, "title": "Crab soufflé", "url": "www_bbc_co_uk_food_recipes_crabsouffle_82130", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250ml/9fl oz ready-made béchamel sauce", "2 tbsp fresh chives, chopped", "25ml/1fl oz double cream", "1 free-range egg yolk", "salt and freshly ground black pepper", "2 free-range egg whites, whisked until stiff peaks form", "25g/1oz butter, melted", "125g/4½oz white crab meat from a can", "1 spring onion, finely chopped"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to high.", "Place the béchamel sauce, fresh chives, double cream, egg yolk, salt and freshly ground black pepper into a bowl and mix together well.", "Add the egg whites and fold into the mixture gently to maintain volume.", "Melt the butter in a small ovenproof frying pan and when foaming pour in the egg mixture.", "Sprinkle over the crab cook for 3-4 minutes, or until the base has set. ", "Transfer to the grill and cook for 2-3 minutes, or until browned and set but still slightly wobbly in the middle.", "To serve, slide the soufflé onto a plate and sprinkle over the spring onions."]}, {"isVegetarian": false, "title": "Crab tian", "url": "www_bbc_co_uk_food_recipes_crabtian_86162", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp olive oil", "1 garlic clove, thinly sliced", "4 tomatoes, skinned, seeds removed, cut into four", "400g/14oz white crabmeat", "1 tsp curry powder", "1 lemon, juice only", "salt and freshly ground black pepper", "1 large bunch fresh chives, finely chopped", "400g/14oz brown crabmeat, picked", "1 tsp sweet smoked paprika", "110ml/4fl oz double cream, lightly whipped", "2 small punnets cress"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a frying pan until just warm then add two tablespoons of the olive oil, the garlic and tomatoes and cook over a low heat for 5-8 minutes, until the tomatoes are just softened. Remove from the heat and allow to cool.", "Place four 5cm/2in x 8cm/3in chefs' rings onto a large flat plate.", "Place three pieces of tomato in the bottom of each ring.", "Place the white crabmeat, curry powder and a squeeze of lemon juice into a bowl. Mix together well and season with salt and freshly ground black pepper.", "Place a layer of crab mixture into each chefs' ring over the tomatoes and smooth over.", "Sprinkle over the chopped chives to cover the crabmeat mixture.", "Mix the brown crabmeat with the smoked paprika and a squeeze of lemon, and season with salt and freshly ground black pepper. Spoon a layer of the brown crabmeat mixture over the top of each layer of chives.", "Repeat the layering process with the remaining white crabmeat mixture, chives and brown crabmeat mixture until the ring is full.", "Whisk the remaining lemon juice into the double cream and season, to taste, with salt and freshly ground black pepper.", "Spoon the cream mixture over the top of the chefs' ring, smoothing over the top. Place into the fridge to chill for one hour.", "To serve, remove the plate with the rings from the fridge and carefully transfer each ring to a serving plate.", "Finely dice the remaining four pieces of tomato.", "Remove each chefs' ring carefully then top the stack with a few pieces of tomato.", "Place the cress into a bowl with the remaining one tablespoon of olive oil and salt and freshly ground black pepper. Mix well to coat then arrange a little cress around each stack."]}, {"isVegetarian": false, "title": "Crab with mango and avocado salad", "url": "www_bbc_co_uk_food_recipes_crabwithmangoandavoc_91733", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2¼lb cooked crab, white meat and claw meat only, chopped (the brown meat can be used in another recipe)", "1 just-ripe mango, peeled, stone removed, flesh cut into cubes", "2 avocados, stones and skin removed, flesh cut into cubes", "1 red onion, peeled, sliced", "1 garlic clove, peeled, sliced", "½ mild red chilli, seeds removed, finely sliced", "2 sprigs fresh thyme, leaves only", "1 lime, juice only", "1-2 tbsp olive oil, or to taste", "pinch salt ", "2 Little Gem lettuces, leaves separated, washed and patted dry with kitchen paper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the white crabmeat and claw meat into a bowl, add the chopped mango, avocados, red onion, garlic, red chilli, thyme leaves, lime juice and olive oil, then season, to taste, with salt. Mix until well combined.", "To serve, spoon the crab mixture into the lettuce leaves. Divide the filled lettuce leaves equally among four serving plates."]}, {"isVegetarian": true, "title": "Crackle top bread", "url": "www_bbc_co_uk_food_recipes_crackle_top_bread_97187", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crackle_top_bread_97187_16x9.jpg", "ingredients": ["400g/14oz strong white bread flour + extra for dusting", "50g/2oz strong wholemeal bread flour", "1 x 7g sachet of fast-action dried yeast", "2 tsp salt", "a little sunflower oil (or oil spray)", "25g/1oz rice flour", "1 tsp caster sugar", "¼ tsp fast-action dried yeast", "pinch salt", "1 tsp vegetable oil"], "serves": "Makes 1 loaf", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["First, prepare the bread. Put the flours, yeast and salt into a large bowl (or food mixer set with a dough hook) and give a quick mix to combine. Add 275ml/9¾fl oz of water, mixing all the time until everything comes together. Then get your hands in and squidge it into a ball. Knead it on a floured surface for 10 minutes (or for 5-7 minutes if using a food mixer). ", "To see if the dough has been kneaded enough, first make the dough into a ball with a taught top. Then, put your finger in the flour and prod the side of the dough to make an indent. If the dough springs back all the way, then the dough is ready, if it only springs back a little, then knead it for a couple more minutes and try again. ", "Now flatten the bread ball out a little (to give roughly a 5cmx12.5cm/2inx5in wide loaf). Then pull the edges into the middle giving a little parcel type thing and turn it over. This will give the dough a nice taught top. Cup the edges of the dough with your hands to shape it into a neat round shape and place on a baking sheet.", "Oil some cling film and wrap it over the bread. Use several pieces if necessary, so that the bread is completely covered, but not too tightly so there is room to rise. Place in a warm place for about 30-45 minutes or until it has increased in size by about fifty percent. ", "Preheat the oven to 200C/400F/Gask 6.", "For the topping, mix the rice flour in a small bowl with the sugar, yeast and salt. Stir in the oil and 25ml/1fl oz of warm water until it forms a thickish paste. Cover and set aside in a warm area until ready to use.", "To check that the dough is risen enough, remove the cling film, dip your finger in some flour and then dip it into the side of the bread making a small indent. If the dough springs back halfway it is ready. ", "Once the dough has sufficiently proved, use your hands to rub the topping paste all over the top and sides of the bread in a nice even layer. ", "Bake the bread in the oven for 25 minutes.  The bread should be crackled on top; if not, pop it back in the oven until it starts to darken. If it is crackled, give it a tap underneath - it should sound hollow, but if it is not quite there yet, put it back in the oven for another five minutes or so. ", "Once ready, remove it from the oven and allow to cool on a wire rack for a bit. This is best served with lashings of butter."]}, {"isVegetarian": false, "title": "Crackling pork belly", "url": "www_bbc_co_uk_food_recipes_crackling_pork_belly_21942", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crackling_pork_belly_21942_16x9.jpg", "ingredients": ["1-1.5kg/2¼lb-3lb 5oz pork belly, bones removed, skin intact and finely scored", "3 garlic cloves", "half a teaspoon dried chilli flakes", "2 tablespoons light soy sauce", "a tablespoon groundnut oil", "2 teaspoons salt", "a lightly heaped teaspoon Chinese five-spice powder ", "2 spring onions", "a small red chilli", "3 peaches ", "8 cherry tomatoes", "a small bunch coriander", "juice of 2 limes ", "3 tablespoons olive oil"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Put the pork belly in a china or glass dish. ", "For the rub, peel and crush the garlic to a paste, stirring in the soy, dried chilli flakes, groundnut oil, salt and five-spice powder. Spread this paste over the skin and underside of the pork belly. Leave it to marinate for a good 4 hours, if not overnight. ", "When the pork has marinated, preheat the oven at 220C/425F/Gas 8. Place the pork in a roasting tin then cook, skin-side up, for about 20 minutes. Lower the heat to 200C/400F/Gas 6 and continue cooking for a further 40-50 minutes, or until the skin is dark and crisp. Leave for 10 minutes to rest, then carve. ", "Meanwhile, to make the peach salsa, trim and finely chop the spring onions, finely chop the chilli, peel, stone and finely chop the peach and halve the tomatoes. Mix gently then dress with the lime juice and the olive oil. ", "Serve the ribs with the peach salsa on the side."]}, {"isVegetarian": true, "title": "Cranachan", "url": "www_bbc_co_uk_food_recipes_cranachan_17284", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2lb 4oz porridge oats", "150g/5½oz caster sugar", "3 litres/5¼ pints double cream", "3 litres/5¼ pints plain yoghurt", "1.8kg/4lb fresh strawberries, hulled, chopped"], "serves": "Serves 40", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 70, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas mark 6.", "Place the oats on two large baking trays, sprinkle the sugar over them and mix together. Bake in the oven for 7-8 minutes, or until lightly toasted.", "Whisk the double cream until it reaches soft peaks.  Stir in the yoghurt and almost all of the fresh fruit then fold in the toasted oats.", "Place in serving dishes, top with the remaining fruit and chill until ready to serve."]}, {"isVegetarian": true, "title": "Cranachan", "url": "www_bbc_co_uk_food_recipes_cranachan_20683", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cranachan_20683_16x9.jpg", "ingredients": ["75g/2½fl oz porridge oats", "35g/1oz flaked almonds", "300ml/10fl oz double cream", "150g/5½oz half-fat crème fraîche", "½ tsp vanilla extract", "3 tbsp whisky", "3 tbsp clear honey, plus extra for drizzling", "400g/14oz fresh raspberries", "2-3 tbsp caster sugar"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Put the oats and almonds in a large non-stick frying pan and dry-fry over a medium heat for 4-5 minutes, stirring occasionally until light golden-brown. Remove from the heat and leave to cool.", "Pour the double cream and crème fraîche into a large bowl and add the vanilla extract, whisky and honey. Whisk with an electric whisk until floppy peaks form. Don’t over-whisk the cream as it will stiffen further when mixed with the oats.", "Put half of the raspberries into a sieve over a clean bowl and press with a ladle to make a vibrant pink purée. Discard the seeds. Sweeten the purée with the sugar to taste.", "Set six tall glasses or tumblers on a tray. Put a spoonful of the whipped cream and whisky mixture in the base of each glass. Sprinkle half of the oats and almonds and half the whole raspberries on top.", "Drizzle over half of the raspberry purée. Repeat the layers once more. Keep the layers as loose as possible. You can assemble all the ingredients well ahead of time but make sure you serve the puddings as soon as they are layered."]}, {"isVegetarian": true, "title": "Cranachan", "url": "www_bbc_co_uk_food_recipes_cranachan_49732", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cranachan_49732_16x9.jpg", "ingredients": ["knob of butter", "100g/3½oz light muscovado sugar", "100g/3½oz jumbo oats", "250g/9oz mascarpone ", "300ml/½ pint double cream", "75ml/2½fl oz whisky", "450g/1lb raspberries"], "serves": "Makes 8", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Put the butter, sugar and oats in a saucepan and stir over a high heat for 4–5 minutes, or until toasted and crunchy. Set aside to cool.", "Measure the mascarpone and cream into a bowl and whisk until soft peaks form when the whisk is removed from the bowl.  ", "Add the whisky, 300g/10½oz raspberries and two-thirds of the cooled oats. Mix until combined, but try to keep the raspberries fairly whole.", "Spoon into glasses and top with the remaining raspberries and crunchy oats."]}, {"isVegetarian": true, "title": "Cranachan", "url": "www_bbc_co_uk_food_recipes_cranachan_66101", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cranachan_66101_16x9.jpg", "ingredients": ["570ml/1 pint double cream", "85g/3oz porridge oats", "7 tbsp whisky", "3 tbsp honey", "450g/1lb raspberries", "fresh mint, to garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Toast the oats in a frying pan, being careful not to burn them.   ", "Lightly whip the cream until it reaches the soft peak stage, then fold in the whisky, honey, oatmeal and raspberries. ", "Serve in dessert glasses garnished with a few raspberries and mint."]}, {"isVegetarian": false, "title": "Cranachan cheesecake", "url": "www_bbc_co_uk_food_recipes_cranachan_cheesecake_54836", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cranachan_cheesecake_54836_16x9.jpg", "ingredients": ["250g/9oz finely-milled oatcakes", "125g/4½oz unsalted butter, melted, plus extra for greasing", "3 tbsp honey", "60g/2¼oz pinhead (coarse) oatmeal", "100g/3½oz caster sugar", "350g/12oz crowdie or ricotta", "350g/12oz full-fat cream cheese", "4 medium free-range eggs", "200g/7oz fresh raspberries", "500g/1lb 2oz fresh raspberries", "50g/1¾oz icing sugar"], "serves": "Serves 8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Butter a deep 23cm/9in springform tin.", "To make the base, put the oatcakes in a food processor and process until they are finely ground. Add the melted butter and honey and process again until thoroughly combined. Press this mixture evenly into the base of the tin and put it in the fridge to set (about an hour).", "Preheat your oven to 180C/350F/Gas 4.", "Heat a small frying pan over a medium heat. Add the oatmeal and one teaspoon of the sugar. Toast them, tossing frequently, until golden. Tip onto a plate to cool.", "Put the crowdie or ricotta, cream cheese, eggs and remaining caster sugar in a food processor and blend until smooth. Stir in the cooled, toasted oatmeal. Pour onto the set base and scatter over the raspberries.", "Bake for 35-40 minutes or until the cheesecake is set around the edges but still a bit wobbly in the middle. Turn off the oven and leave the cheesecake inside with the door ajar until the cheesecake is cool. (This will take a few hours but helps prevent the top of cheesecake from cracking.)", "Meanwhile, to make the raspberry coulis, purée the raspberries and icing sugar together in a blender, or with a stick blender. Push the purée through a sieve to remove the pips.", "Serve the cooled cheesecake with pouring cream and the raspberry coulis."]}, {"isVegetarian": true, "title": "Cranachan with raspberry sauce", "url": "www_bbc_co_uk_food_recipes_cranachanwithraspber_86047", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["85g/3oz pinhead oatmeal", "300ml/10½fl oz double cream", "3 tbsp whisky", "50g/2oz icing sugar", "450g/1lb raspberries", "150g/5oz raspberries", "½ lemon, juice only", "2 tbsp icing sugar", "sprig fresh mint, to garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to a medium heat.", "For the cranachan, place the oatmeal onto a baking tray and place under the grill to lightly toast. Take care not to burn it. Remove from the heat and set aside to cool.", "Meanwhile, place the cream into a bowl, add the whisky and icing sugar and whisk until it forms soft peaks when the whisk is removed.", "Place four 6cm/3½in deep chefs' rings onto four plates. Spoon a little of the cream mixture into each ring to about 1cm/½in depth. Smooth down the top of the cream in the ring with a spoon to ensure a clean edge.", "Layer some raspberries over each layer of cream, then repeat a layer of cream.", "Repeat with a layer of raspberries followed by a layer of cream, until the ring is full. Be sure to finish with a layer of cream, smoothing the top over with a palette knife.", "Dust the top and bottom of the filled rings with the toasted oatmeal, then place each ring into the centre of a serving plate. Carefully remove the chefs' ring from each cranachan, using a mini-blowtorch to heat and loosen the rings first if necessary.", "For the raspberry sauce, place the raspberries, lemon juice and icing sugar into a food processor and blend until smooth. Pass the sauce through a sieve into a bowl.", "To serve, top each cranachan with a couple of raspberries and a sprig of mint and spoon the raspberry sauce around the edge."]}, {"isVegetarian": true, "title": "Cranberry and coconut energy bars", "url": "www_bbc_co_uk_food_recipes_cranberry_and_coconut_69378", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cranberry_and_coconut_69378_16x9.jpg", "ingredients": ["200g/7oz butter, softened", "200g/7oz light muscovado sugar", "100g/3½oz golden syrup", "50g/1¾oz sunflower seeds", "50g/1¾oz dried cranberries, chopped if large", "100g/3½oz sultanas", "50g/1¾oz desiccated coconut", "100g/3½oz crisped rice cereal", "150g/5½oz rolled oats"], "serves": "Makes 18 bars", "time": {"preparation": "over 2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["Line a 23x30cm/9x12in traybake tin with cling film.", "Add the butter, sugar and golden syrup to a large saucepan and stir over a medium heat until melted. Pour into a large bowl, stir in all the remaining ingredients until well combined.", "Put the mixture into the prepared tin and spread with the back of a spoon into an even layer. Transfer to the fridge to chill, uncovered, for about 2 hours, or until firm.", "Remove from the traybake tin and cut into 18 even-sized bars. Keep in an airtight container until needed."]}, {"isVegetarian": false, "title": "Cranberry and orange marshmallows", "url": "www_bbc_co_uk_food_recipes_cranberry_and_orange_84364", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75ml/3fl oz cranberry juice", "50ml/2fl oz orange juice ", "2 x 12g sachets gelatine powder", "450g/1lb caster sugar", "150ml/¼ pint golden syrup", "50g/1¾oz icing sugar", "2 tbsp cornflour", "1 orange, finely grated zest only", "1 tsp cranberry powder"], "serves": "Makes 25 marshmallows", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Line a 20cm/8in square tin with cling film, leaving an overhang so the mixture can be removed easily once set.", "Pour the orange juice and cranberry juice into the bowl of a stand mixer and sprinkle over the gelatine. Set aside to allow the gelatine to soften and absorb the liquid.", "Meanwhile, put the sugar, golden syrup and 150ml/¼ pint water in a saucepan. Cook over a low heat, stirring all the time, until the sugar has dissolved, then immediately bring the mixture to the boil. Using a sugar thermometer, boil until the syrup reaches 130C, then remove from the heat. Leave to cool for a minute, until it is no longer bubbling. ", "Whisk the gelatine mixture in a food mixer on a medium speed. Add the sugar syrup, slowly pouring it down the side of the mixer bowl. Try to avoid pouring directly onto the whisk or you will get grainy lumps of sugar in the marshmallow. The marshmallow mixture should become pale and grow in volume like a very stiff meringue.", "Once all the syrup has been added, continue to whisk for 5-10 minutes, or until the marshmallow is really thick and cools a bit more. It is ready when the outside of the bowl is only slightly warm and the marshmallow starts to get really sticky. ", "Use an oiled spatula, scrape the marshmallow into the prepared tin, keeping the spatula clean using boiling water when it gets too sticky. Leave to set at room temperature for 1-2 hours, or until firm.", "Sieve the icing sugar and cornflour together into a small bowl and stir in the orange zest. Use some of this mixture to coat the top of the marshmallow. Using the overhang to lift the marshmallow up, remove it from the tin. Cut it into 4cm/1½in cubes then dust each cube in the remaining icing sugar mixture and cranberry powder. Serve on a plate or board."]}, {"isVegetarian": true, "title": "Cranberry and orange sweet soda bread", "url": "www_bbc_co_uk_food_recipes_cranberry_and_orange_15393", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400g/14oz plain flour", "1 tsp table salt ", "2 tsp baking powder", "50g/1¾oz caster sugar ", "1 tsp caraway seeds", "50g/1¾oz unsalted butter, chilled and diced ", "100g/3½oz dried cranberries", "1½ unwaxed oranges, zest only", "1 large free-range egg ", "175ml/6fl oz buttermilk"], "serves": "Makes 1 loaf", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. Line a baking tray with baking parchment.", "In a large bowl, mix together the flour, salt, baking powder, caster sugar and caraway seeds. Using your fingers, rub in the butter until the mixture resembles breadcrumbs.  Mix in the cranberries and orange zest.", "Mix the egg and buttermilk together then stir into the dry mixture using a wooden spoon. Use your hands to bring the dough together, then turn out onto a lightly floured surface and shape into a ball. ", "Place the dough on the prepared baking tray and cut a cross into the top using a sharp knife. Bake for 30–35 minutes, or until risen and golden-brown. Cool completely on a wire rack before serving. "]}, {"isVegetarian": true, "title": "Cranberry and orange bagels", "url": "www_bbc_co_uk_food_recipes_cranberry_and_orange_97135", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["600g/1lb 5oz strong white bread flour, plus extra for dusting", "10g/¼oz fast-action yeast", "3 tbsp golden caster sugar", "1 tbsp mixed spice", "310ml/½ pint warm water", "3 tsp sea salt flakes", "2 large oranges, zest only", "2 tsp vegetable oil", "75g/2½oz dried cranberries, chopped", "50g/2oz candied orange peel, chopped ", "3 tbsp light brown sugar, for the poaching water", "1 free-range egg, lightly beaten, for glazing", "4-5 brown sugar cubes, lightly crushed"], "serves": "Makes 12 bagels", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the dough, preheat the oven to 180C/350F/Gas 4. Lightly oil a large bowl and grease two large baking sheets.", "In a large clean bowl, mix the flour, yeast, golden caster sugar and mixed spice together. In a separate bowl, mix the water, salt, orange zest and vegetable oil, then gradually incorporate this mixture into the dry ingredients.", "On a floured surface, knead the dough until smooth and elastic. Transfer to the oiled bowl, cover with a damp cloth and leave for 10 minutes. Briefly knead the dough again for a minute, cover again and leave to prove for a further 10 minutes. ", "Add the cranberries and candied peel to the dough and knead until evenly distributed. Cover and set aside to prove for 30 minutes.", "Divide the dough into 12 equal pieces and roll each piece into a neat ball. Cover with a damp tea towel and set aside to prove for 20 minutes.", "Shape the dough balls into rings by inserting a wooden spoon handle into the centre and using your fingers to gently stretch the dough.", "To prepare the poaching water, fill two large pans with water, distribute the brown sugar between them and bring to the boil. Poach the bagels two or three at a time for 30 seconds on each side. Lift them out with a slotted spoon, shake off any excess water and lay them on the prepared baking trays.", "Brush lightly with egg, sprinkle over the crushed sugar cubes and bake in the oven for 20-25 minutes until golden-brown."]}, {"isVegetarian": false, "title": "Cranberry and pheasant sausage rolls", "url": "www_bbc_co_uk_food_recipes_cranberry_and_pheasant_51675", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz dried cranberries, soaked in port", "250g/9oz minced pheasant ", "250g/9oz minced pork belly or shoulder ", "1 garlic clove, peeled and crushed", "½ tsp thyme leaves ", "pinch allspice ", "1 juniper berry, finely crushed ", "salt and freshly ground black pepper", "plain flour, for dusting", "1 x 375g packet ready-rolled puff pastry ", "1 free-range egg, lightly beaten OR 2 free-range egg yolks, lightly beaten", "1 tbsp black sesame seeds ", "1 tbsp white sesame seeds ", "250g/9oz cranberry sauce, to serve"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Drain and chop up the cranberries. Mix them with the minced meats in a large bowl. Add the garlic, thyme, allspice and crushed juniper and season with salt and pepper.", "Roll the meat into a log shape and wrap in cling film. Allow to rest in the fridge for at least an hour. ", "Sprinkle some flour on the work surface and place the pastry on top. Lay the sausage on the pastry and roll up tightly. Seal the edge with beaten egg. Transfer to the fridge to chill for 10 minutes. ", "Preheat the oven to 200C/180C Fan/Gas 6.", "Put the sesame seeds in two separate bowls. Brush the sausage roll all over with beaten egg and roll in both bowls of sesame seeds. ", "Bake for 20-25 minutes, or until golden and cooked through.", "Serve the sausage rolls warm cut into slices with a dollop of cranberry sauce. "]}]