[{"ingredients": ["100 g / 3½ oz de extensión para hornear", "100 g / 3½ oz de azúcar en polvo", "2 huevos grandes de gallinas camperas", "100g / 3½ oz de harina de auto crianza", "1 cucharadita de polvo de hornear de nivel", "1 naranja, ralladura solamente", "3 cucharadas de cuajada de naranja", "50g / 1¾oz de mantequilla suave", "100 g / 3½ oz tamizado azúcar glas", "azúcar glas, al polvo"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4 (ventilador de 160 ° C).", "Ponga todos los ingredientes de la torta en un tazón grande y bata bien durante 2-3 minutos, o hasta que la mezcla esté bien mezclada y suave. Llene cada caja de papel con aproximadamente 35 g / 1¼ oz de la mezcla.", "Hornee en el horno precalentado durante unos 15-20 minutos, o hasta que los pasteles estén bien alzados y dorados. Levante las cajas de papel fuera del molde y enfríe las tortas en una rejilla de alambre.", "Cuando esté frío, corta un disco de la parte superior de cada pastel dejando un pequeño espacio alrededor del borde y corta esta rebanada por la mitad. Ponga media cucharadita de cuajada de naranja en cada una.", "Para hacer la guinda, bata la mantequilla y el azúcar glas juntos hasta que estén bien mezclados. Pase la cuchara o cuchara un remolino de crema de mantequilla en la parte superior de la cuajada de naranja y coloque las medias rebanadas de pastel en la parte superior para que se asemejen a las alas de mariposa. Espolvorea los pasteles con azúcar glas para terminar."], "url": "www_bbc_co_uk_food_recipes_orange_butterfly_cakes_82059", "title": "Tortas de mariposa naranja", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/orange_butterfly_cakes_82059_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 naranjas cortadas en cubitos (incluidas las pieles), sin pepitas", "Margarina de 115g / 4oz, más extra para engrasar", "115g / 4 oz de azúcar", "2 huevos medianos de granja, golpeados", "3 cucharaditas de polvo de hornear", "175g / 6oz de sémola"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase una lata profunda de 20 cm / 8 in con margarina.", "Puré las naranjas en cubos en un procesador de alimentos, y reservarlas.", "Bata la margarina y el azúcar en un tazón hasta que esté suave y esponjoso. Mezcle los huevos y luego agregue el polvo de hornear y la sémola. Revuelva para combinar, luego doble la pulpa de naranja a través de la mezcla.", "Vierta la mezcla en la lata preparada y coloque en el horno. Después de los primeros 10 minutos, baje la temperatura del horno a 170C / 325F / Gas 3 y hornee por otros 40 minutos, o hasta que la torta esté dorada en la parte superior y una brocheta insertada en el centro salga limpia.", "Retire la torta del horno y déjela enfriar en la lata. Una vez que esté frío, pasa un cuchillo por el borde de la lata para soltar el pastel y luego gíralo. Para servir, corta el pastel en 12 rebanadas."], "url": "www_bbc_co_uk_food_recipes_orange_cake_57974", "title": "pastel de naranja", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/orange_cake_57974_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 naranjas", "225 g / 8 oz de azúcar en polvo", "6 huevos de gallinas camperas", "Almendras molidas 250 g / 9 oz", "50 g / 1¾oz de mantequilla sin sal", "1 naranja, ralladura y jugo", "2 naranjas, solo jugo", "1 naranja, segmentado", "3 cucharadas de azúcar en polvo", "2 cucharadas de licor de naranja", "2 cucharadas de aguardiente", "helado"], "method": ["Para la torta de naranja, cocine a fuego lento las dos naranjas enteras en una cacerola de agua hirviendo durante 45-60 minutos, o hasta que estén muy suaves. Retire la sartén del fuego y deje que las naranjas se enfríen en el agua.", "Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase una lata de torta con forma de resorte suelta de 23 cm / 9 in.", "Escurre las naranjas y pique más o menos, descartando las pepitas.", "En un procesador de alimentos, mezcle 450 g / 1 libra de naranja picada en un puré. Agregue el azúcar, los huevos y las almendras molidas y mezcle hasta que quede suave.", "Vierta la mezcla en la lata de la torta.", "Hornee en el horno por 25 minutos, luego cúbralo ligeramente con papel de aluminio y hornee por otros 25-35 minutos, o hasta que esté bien cocido (un pincho insertado en el medio debe salir limpio). Retirar del horno y reservar para enfriar.", "Para la salsa de caramelo y naranja, caliente una sartén hasta que esté caliente, agregue la mantequilla, la ralladura de naranja y el jugo y el azúcar impalpable. Agregue el licor de naranja y el brandy y el flambeado inclinando lentamente la sartén hacia la llama o encendiéndola con una cerilla. Deje que las llamas se enciendan y luego se apaguen. (PRECAUCIÓN: Mantenga la cara y el cabello alejados de las llamas. No los deje solos).", "Cocine por unos minutos hasta que espese y burbujee, luego agregue los segmentos y retire la sartén del fuego.", "Para servir, corte un pedazo de pastel y coloque en un plato y vierta la salsa sobre el pastel y alrededor del plato. Sirva inmediatamente con una bola de helado."], "url": "www_bbc_co_uk_food_recipes_orange_cake_with_a_18847", "title": "Pastel de naranja con salsa de caramelo y naranja", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 naranjas grandes, solo cáscara", "75 g / 2½ oz de azúcar en polvo", "500ml / 17fl oz de leche entera", "Azúcar granulada 120g / 4oz", "3 huevos de gallinas camperas", "4 yemas de huevo de gallinas camperas"], "method": ["Mezcle la ralladura y el azúcar en polvo con un polvo fino en un procesador de alimentos.", "Ponga la ralladura de naranja y la mezcla de azúcar en una cacerola, agregue la leche y caliente juntos, de vez en cuando revolviendo, hasta que esté justo por debajo del punto de ebullición. Apague el fuego, cúbralo con una tapa y déjelo en infusión durante al menos una hora.", "Ponga el azúcar granulado en una cacerola de base pesada y agregue 3-4 cucharadas de agua fría. Deje que hierva a fuego lento y cocine lentamente hasta que el azúcar se convierta en un caramelo rico color.", "Vierta el caramelo en la base de los cuatro moldes dariole y déjelo enfriar.", "Precalentar el horno a 150C / 300F / Gas 2.", "Coloque los huevos y las yemas en un recipiente espacioso, bata ligeramente y luego cuele sobre la leche infundida de naranja. Batir suavemente la mezcla hasta que esté bien combinada. Elimine cualquier espuma de la superficie con una cuchara y cuele la mezcla para que quede suave.", "Vierte la mezcla en los moldes recubiertos de caramelo y llénala hasta el borde. Colóquelos en una lata para asar profunda y llénelos con agua caliente (no hirviendo), de modo que sobresalga del exterior de los moldes a aproximadamente tres cuartas partes de la altura. Coloque con cuidado la lata en el horno y coloque holgadamente una hoja de papel de aluminio sobre la superficie de los moldes, pero no la asegure. Hornee en el horno hasta que las natillas estén listas (aproximadamente 40 minutos) - presione levemente un dedo sobre la superficie o sacúdalas un poco; deberían tambalearse suavemente.", "Retirar del horno, sacar de la lata de tostado y dejar enfriar. Cubra cada molde con una pequeña hoja de film transparente y deje enfriar en la nevera durante al menos dos horas.", "Para deshacer el molde, pase un cuchillo pequeño por el borde de la crema pastelera y colóquelo en platos individuales y poco profundos."], "url": "www_bbc_co_uk_food_recipes_orange_caramel_custard_43115", "title": "Flan de caramelo de naranja", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/orange_caramel_custard_43115_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1.2kg / 2lb 8 oz de harina", "630 ml / 22 fl oz de agua tibia", "2 cucharaditas de sal", "120ml / 4fl oz de aceite de oliva", "375 g / 13 oz de mantequilla", "375g / 13oz de azúcar glas", "3 huevos de gallinas camperas", "375 g / 13 oz de almendras finamente molidas", "3 vainas de cardamomo, aplastadas", "2 naranjas sin cera, ralladura y jugo de 30 ml / 2 cucharadas", "50g / 1¾oz de fechas, piedras removidas, picadas", "50g / 1¾oz de almendras en copos", "azúcar en polvo, para quitar el polvo", "almendras copos, al gusto", "5-6 pistachos, aplastados"], "method": ["Para la pasta filo, tamice la harina y la sal juntas. Agregue el agua y el aceite y mezcle hasta que se forme una masa pegajosa. Amasar durante aproximadamente 10 minutos, o hasta que quede suave y menos pegajoso.", "Coloque en un tazón, cúbralo con una película adhesiva y déjelo reposar durante una hora.", "Cuando la masa repose, córtela en 10 porciones iguales.", "Genere generosamente una superficie de trabajo grande, comience a extender una porción de masa utilizando un rodillo. Una vez que lo tienes relativamente delgado, puedes usar una varilla o varilla de 2 cm / 1 pulgada de diámetro en su lugar (esto hará que sea más fácil lograr la masa más fina). Extienda la masa lo más finamente posible y luego estírela aún más delgada pasando las manos por debajo y tirando suavemente de la masa. Repita para todas las piezas restantes, manteniendo el filo cubierto con un paño húmedo mientras trabaja.", "Para el relleno, unte la mantequilla y el azúcar glas juntos. Mezcle los huevos uno a la vez, asegurándose de que se combinen antes de agregar el siguiente. Agregue las almendras molidas y mezcle bien.", "En una sartén pequeña, caliente las vainas de cardamomo y el jugo de naranja para infundir. Cocine a fuego lento durante unos minutos, luego deje enfriar.", "Cuando esté frío, retire las cápsulas de cardamomo y agregue el jugo a la mezcla de mantequilla y huevo junto con las tres cuartas partes de la ralladura de naranja, las fechas y las almendras en copos. Mezclar bien.", "Precalentar el horno a 180C / 350F / Gas 4.", "Coloque las hojas de filo en una mesa larga (de aproximadamente 2 m de largo) una al lado de la otra, con los bordes superpuestos entre sí para formar un rectángulo muy largo de aproximadamente 2 m de largo.", "Coloque el relleno en una línea recta cerca del borde de un lado largo de la masa. Luego, al igual que un rollo suizo, comience a enrollar la masa hasta que tenga un rollo de pastelería muy largo y delgado. Envuélvete en un remolino, para parecerse a una serpiente enrollada.", "Coloque en la bandeja de horno y hornee en el horno durante 40-45 minutos, o hasta que la masa esté dorada y crujiente.", "Para servir, espolvorear con azúcar glas y espolvorear con almendras en copos. Termine con la cáscara de naranja reservada y algunos pistachos triturados."], "url": "www_bbc_co_uk_food_recipes_orange_cardamom_and_date_40276", "title": "Naranja, cardamomo y fecha m'hanncha (pastel de serpiente)", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["90 g / 3¼ oz de mantequilla, ablandada, más extra para engrasar", "Galletas digestivas de 325 g / 11½ oz", "3 naranjas", "250 g / 9 oz de azúcar en polvo", "350g / 12oz de queso crema, suavizado", "Queso cuajada de 350g / 12oz, ablandada", "150ml / 5fl oz de crema agria", "4 huevos de gallinas camperas", "120 g / 4½ oz de miel que moquea", "Pistachos sin cáscara 30g / 1oz"], "method": ["Engrase muy ligeramente la base y los lados de una lata con forma de resorte de 23cm / 9pulg de aproximadamente 5 cm / 2 pulgadas de profundidad. Coloque la lata en una bandeja para hornear.", "Derrita la mantequilla en una olla pequeña y déjela enfriar.", "Precaliente el horno a 190C / 170C Fan / Gas 5.", "Triture los bizcochos en migajas finas en un procesador de alimentos, o colóquelos en una bolsa de plástico resistente y golpee con un rodillo.", "En un tazón, mezcle los bizcochos triturados con la mantequilla derretida hasta que estén completamente combinados. Incline la mezcla en la lata preparada y extiéndala para formar una capa uniforme, presionándola firme y uniformemente con los nudillos aplanados.", "Hornee durante 12 minutos, o hasta que la base se haya endurecido como una capa de hojaldre. Poner a un lado en la bandeja para hornear para enfriar.", "Baje la temperatura del horno a 160 ° C / 140 ° Ventilador / Gas 3.", "Usando un pelador giratorio, corte finamente la ralladura de una naranja en tiras, luego córtelas en juliana larga y delgada.", "En una cacerola pequeña, disuelva 75 g / 2½ oz de azúcar en 100 ml / 3½ fl oz de agua a fuego medio y luego llévelo a ebullición.", "Agregue la ralladura de naranja en juliana, reduzca el fuego a fuego lento y cocine a fuego lento la ralladura en el almíbar durante 10 minutos. Retirar del fuego y reservar para enfriar por completo. Una vez enfriada, drene la ralladura en juliana y deseche el jarabe.", "Frote las pieles de las naranjas restantes contra la superficie de rejilla más fina de un rallador de cajas para producir un puré de ralladura húmeda. Raspe en un tazón pequeño y déjelo a un lado.", "Juice todas las naranjas, luego cuele el jugo a través de un fino chino o tamiz.", "Coloque el queso crema, el queso cuajado, la crema agria y el azúcar restante en un tazón grande y mezcle hasta que quede suave.", "En otro tazón, bata los huevos hasta que estén livianos y espumosos, luego cuela a través de un chinois fino o un colador en la mezcla de queso crema. Mezcle bien con una cuchara de madera, luego agregue el jugo de naranja y el puré de ralladura y mezcle para combinar.", "Vierta la mezcla sobre la base de galleta enfriada y hornee durante 1 hora y media. Apague el horno y deje la tarta de queso adentro durante una hora más, con la puerta ligeramente abierta. Retire la tarta de queso del horno y deje que se enfríe por completo. Una vez que se haya enfriado, refrigere durante al menos 2-3 horas antes de servir,", "Cuando esté listo para servir, pase un cuchillo por el interior de la lata y libere suavemente los lados de la lata. Con cuidado, transfiera la tarta de queso a un plato de servir.", "Usando una espátula, extiende la miel sobre la tarta de queso. Espolvoree un poco de la juliana de la ralladura de naranja confitada encima y esparza sobre los pistachos.", "Use un cuchillo muy filoso sumergido en agua caliente para cortar la tarta de queso en rodajas, volviendo a colocar el cuchillo en el agua caliente entre las rebanadas."], "url": "www_bbc_co_uk_food_recipes_orange_cheesecake_with_15249", "title": "Tarta de queso naranja con miel y pistachos", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Sirve 8-10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["170g / 6oz de mantequilla, suavizada", "80g / 3oz de azúcar en polvo de oro", "20 g / 1 oz de azúcar de lavanda, más extra para rociar", "110 g / 3½ oz de almendras molidas", "Harina normal de 200g / 7oz", "½ naranja, ralladura solamente, finamente rallada"], "method": ["Precalentar el horno a 160 C / 325 / Gas 3.", "Bata la mantequilla y los azúcares en un tazón con una batidora eléctrica portátil hasta que estén suaves, esponjosos y pálidos.", "Mezcle las almendras molidas, la harina y la ralladura de naranja en la mezcla. Revuelva hasta que esté bien mezclado. Si la habitación está tibia y la mezcla se siente demasiado suave, envuélvala en una película adhesiva y déjela reposar en la nevera durante 10 minutos.", "Divida la mezcla en dieciocho piezas iguales y enrolle cada una en una bola. En una superficie enharinada, aplana cada bola en un círculo de 1 cm / ½ pulgadas de espesor con un tenedor o con un sello de galleta.", "Colóquelos en una bandeja para hornear antiadherente a una distancia mínima de 2,5 cm.", "Hornee durante 20-25 minutos, hasta que las galletas apenas estén coloreadas.", "Retire del horno y deje enfriar durante 10 minutos antes de transferirlo a una rejilla para que se enfríe completamente.", "Cuando esté frío, espolvorea los bizcochos con el azúcar de lavanda adicional antes de ponerlos en un plato de servir."], "url": "www_bbc_co_uk_food_recipes_orange_lavender_20492", "title": "Galletas de mantequilla de lavanda naranja", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 18 galletas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 naranjas de sangre, jugo y cáscara reservadas", "75 g / 2½ oz de azúcar en polvo", "150ml / 5fl oz de crema doble", "1 vaina de vainilla, dividida longitudinalmente", "2 hojas de gelatina, remojadas en agua durante unos minutos hasta que estén blandas", "300ml / 10fl oz de suero de leche", "Ruibarbo 300 g / 10 oz, cortado en piezas de 2 cm / ¾ in", "1 cucharada de azúcar en polvo", "jugo de naranja, reservado desde arriba", "2 ramitas grandes de menta fresca, hojas recogidas y desgarradas"], "method": ["Para panna cotta, precalentar el horno a 140C / 275F / Gas 1.", "Coloque la cáscara de naranja en una bandeja de horno y hornee en el horno durante 20 minutos, o hasta que esté completamente seco.", "En una sartén pequeña, caliente la corteza seca con el azúcar, la crema y la vainilla. Cocine a fuego lento hasta que el azúcar se haya disuelto. Retire la cáscara de naranja y la vainilla.", "Exprima el exceso de agua de las hojas de gelatina ablandadas, luego agregue a la mezcla de crema y continúe cocinando a fuego lento hasta que se disuelva. Retire del fuego y agregue el suero de leche.", "Coloque cuatro moldes dariole o moldes en una bandeja para hornear y vierta la mezcla de panna cotta. Enfríe en la nevera durante 1-2 horas, o hasta que esté listo.", "Para el ruibarbo tostado con menta, precaliente el horno a 200C / 400F / Gas 6.", "Coloque el ruibarbo en una lata para asar, espolvoree el azúcar y luego rocíe sobre el jugo de naranja y la menta. Asar el ruibarbo en el horno durante 8-12 minutos, o hasta que esté tierno.", "Para servir, retire la panna cotta de la nevera. Para quitar la panna cotta de los moldes, sumerja brevemente la base de cada molde en un recipiente con agua hervida. Con cuidado, desliza un cuchillo por el borde de cada panna cotta y colócalo en el centro de un plato para servir. Coloque el ruibarbo asado en un lado y rocíe sobre el jugo que queda en la lata de asar."], "url": "www_bbc_co_uk_food_recipes_orange_panna_cotta_with_25558", "title": "Panna cotta naranja con ruibarbo asado a la menta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100g / 3½ oz de ralladura de naranja", "50ml / 2fl oz de jugo de naranja recién exprimido", "150ml / 5fl oz de aceite de oliva virgen extra", "20 g / oz de azúcar en polvo", "pizca de sal", "pizca de cayena"], "method": ["Ponga a hervir a fuego alto una olla de agua y la ralladura de naranja. Reduzca el fuego hasta que el agua esté hirviendo a fuego lento, luego cocine a fuego lento durante 15 minutos. Escurra la ralladura, reemplace el agua y repita tres veces más (esto eliminará el sabor amargo de la ralladura de naranja).", "Escurra la ralladura de naranja y transfiéralo a un procesador de alimentos. Mezcle la ralladura, el jugo de naranja y la mitad del aceite en un puré suave. Continúe agregando el aceite, pulsando después de cada adición, hasta que el puré alcance la consistencia que desea.", "Sazonar, al gusto, con azúcar, sal y pimienta, luego tapar y enfriar en la nevera hasta que sea necesario."], "url": "www_bbc_co_uk_food_recipes_orange_pure_21320", "title": "Puré de naranja", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Hace 300 g / 10½ oz", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1.7 litros / 3 pintas de leche", "1 vaina de vainilla", "½ limón, ralladura solamente, en pedazos grandes", "200g / 7 oz de azúcar", "Arroz arborio 300 g / 10½ oz", "5 huevos grandes de gallinas camperas, separados", "Licor de naranja 50ml / 2fl oz", "40 g / 1½ oz pasas", "1 naranja, solo ralladura, rallado, más extra para servir"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase y forre una lata de torta de fondo suelto de 24 cm / 10 pulgadas con papel antigrasa.", "Coloque la leche, la vaina de vainilla, la ralladura de limón y el azúcar en una olla grande y deje que hierva. Agregue el arroz y cocine a fuego lento a fuego medio durante 20-25 minutos, hasta que el arroz esté al dente y haya absorbido la leche, pero aún tenga una consistencia cremosa. Retirar del fuego y dejar enfriar. Retire la vaina de vainilla y la ralladura de limón.", "En un tazón, bata las yemas de huevo y el licor hasta que estén cremosos. En otro recipiente, bata las claras de huevo hasta que se formen picos rígidos cuando se quite el batidor.", "Agregue la mezcla de yema de huevo al arroz enfriado, luego doble las claras de huevo endurecidas, seguido de las pasas y la ralladura de naranja. Vierta la lata preparada y hornee en el horno durante una hora. Servir caliente o frío, espolvoreado con un poco de ralladura de naranja adicional para terminar."], "url": "www_bbc_co_uk_food_recipes_orange_rice_cake_29449", "title": "Pastel de arroz", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 8-10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/orange_rice_cake_29449_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 350g / 12oz, más extra para espolvorear", "1 x 7 g bolsita de levadura de acción rápida", "250ml / 9fl oz de leche entera, suavemente calentada a temperatura ambiente", "4 huevos grandes de gallinas camperas", "40 g / 1½ oz de azúcar en polvo", "1 naranja grande, solo ralladura", "1 cucharada de extracto de vainilla", "½ cucharadita de sal de mesa", "150 g / 5½ oz de mantequilla sin sal, derretida, más extra para engrasar", "aceite vegetal, para engrasar", "6 cucharadas de jugo de naranja recién exprimido", "4 cucharadas de licor de naranja, como Grand Marnier", "150 g / 5½ oz de azúcar en polvo", "300ml / 10½ fl oz crema doble", "½ cucharadita de canela molida", "50 g / 1 oz de azúcar en polvo", "2 naranjas grandes (opcional)", "25 g / 1oz de pistachos sin caparazón descascarillados, picados"], "method": ["Engrase una lata de savarin de 25cm / 10in con mantequilla y polvo con harina.", "Para la masa, tamice la harina en un tazón grande, agregue la levadura y mezcle. Vierta la leche y mezcle aproximadamente con una cuchara de madera.", "En otro recipiente, bata los huevos y el azúcar hasta que estén pálidos y esponjosos. Luego agregue la ralladura de naranja, el extracto de vainilla, la sal y la mantequilla derretida. Mezcle hasta que esté bien combinado y viértalo en la mezcla de harina. Batir hasta que la masa alcance una consistencia suave. Cubra y deje crecer durante 15-20 minutos.", "Cuando la masa haya demostrado, use una cuchara de madera para golpearla y eliminar el aire. Vierta la mezcla en la lata preparada. Engrase un lado de un trozo grande de película adhesiva y cubra el lado con aceite de estaño hacia abajo. Déjelo a un lado en una habitación tibia durante aproximadamente 1 ½ horas hasta que la masa casi llegue a la parte superior de la lata.", "Precalentar el horno a 200C / 400F / Gas 6.", "Retire la película adhesiva y hornee el savarin durante aproximadamente 40 minutos. Deje que se enfríe durante unos minutos y luego conviértalo en una bandeja de horno poco profunda.", "Para el almíbar, caliente el jugo de naranja, el licor, 250 ml / 9 fl oz de agua y el azúcar en una sartén. Cocine a fuego lento durante cinco minutos, o hasta que el azúcar se disuelva. Vierta lentamente el jarabe sobre el savarin, permitiendo que se absorba mientras vierte. Coloque el savarin en un plato de servir.", "Para el relleno, batir la crema con azúcar y canela hasta que se formen picos cuando se quite la batidora. Transfiera a una manga pastelera con una boquilla estrella y coloque la crema en el medio del savarin hasta que llegue a la parte superior de la torta.", "Para decorar, corte las naranjas muy finas y colóquelas en la parte superior de la torta (si se usa). Espolvorea los pistachos y sirve."], "url": "www_bbc_co_uk_food_recipes_orange_savarin_with_16473", "title": "Savarin naranja con crema de canela", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Hace 1 torta grande", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["160g / 5½oz de almendras blanqueadas", "4 grandes naranjas sin cera", "420 g / 15 oz de azúcar en polvo", "Harina normal de 350g / 12oz, más extra para espolvorear", "3 cucharaditas de polvo de hornear", "3 huevos grandes de gallinas camperas", "4 ramitas de romero, hojas recogidas y finamente picadas", "100g / 3½oz de arándanos secos", "3 yemas de huevo grandes de gallinas camperas", "35 g / 1 oz de azúcar en polvo", "pellizcar canela molida", "2 cucharadas de vino Marsala", "2 cucharadas de licor con sabor a naranja, como Cointreau", "50ml / 2fl oz crema batida"], "method": ["Para las galletas, precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4. Incline las almendras en una bandeja para hornear y tápelas por unos minutos hasta que queden fragantes.", "Con un pelador de verduras, despegue 1cm / ½ en tiras anchas de cáscara de las naranjas. Corta las tiras en pedazos de 5 mm / ¼. Coloque en una fuente de agua y deje hervir durante unos minutos. Drene y repita este proceso de blanqueado 3 veces.", "Llene una bandeja con 150ml / 5fl de agua y 300g / 10½ oz de azúcar en polvo y hierva las tiras de cáscara hasta que estén suaves. Drene la cáscara, reservando el líquido.", "Ponga el agua azucarada con sabor a naranja en una sartén grande y hierva rápidamente hasta que esté caramelizada. Vierta con cuidado la mezcla en una bandeja antiadherente para hornear y deje enfriar lo más rápido posible, luego transfiera a la nevera. Una vez frío, retírelo de la bandeja de hornear y divídalo en una licuadora. Mezcle hasta que se convierta en azúcar fina. Mida 200 g / 7 oz de este azúcar y mezcle con 100 g / 3½ oz de la harina.", "En un tazón grande, mezcle la mezcla de azúcar / harina, los restantes 250 g / 9 oz de harina, el polvo de hornear y el azúcar impalpable residual. Agregue los huevos, el romero, las almendras blanqueadas, los arándanos secos y la cáscara de naranja. Use sus manos para mezclarlas en una masa bastante sólida; es posible que se requiera un poco de harina adicional.", "Divide la masa en 2 piezas. Use sus manos para enrollar cada pieza en una forma de salchicha de aproximadamente 5 cm de grosor. Coloque cada pedazo de masa en una bandeja para hornear forrada y use la palma de su mano para aplanarlos ligeramente. Hornea por 30 minutos. Retire del horno y deje enfriar por unos minutos.", "Baje el horno a 160 ° C / 140 ° Ventilador / Gas 3. Pique el biscotti en la diagonal en rodajas de aproximadamente 1 cm / ½ pulgadas de espesor. Separe las rebanadas, colóquelas en bandejas forradas y hornee por otros 20 minutos. Transfiera a una rejilla para enfriar.", "Mientras los biscotti están en el horno por segunda vez, prepare la salsa de zabaglione. Batir las yemas de huevo, el azúcar y la canela en un recipiente para mezclar a prueba de calor.", "Una vez que la mezcla esté pálida, coloque el recipiente sobre una fuente de agua hirviendo. Agregue el vino y el licor Marsala y bata durante unos 5 minutos hasta que quede suave y cremoso. Batir la crema a los picos suaves en un recipiente aparte y luego doblar en la mezcla de huevo.", "Sirve el biscotti con el baño de zabaglione al lado."], "url": "www_bbc_co_uk_food_recipes_orange_rosemary_and_56653", "title": "Biscotti de naranja, romero y almendras con salsa de zabaglione", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Hace 32 biscotti", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 naranjas, peladas, toda la ralladura y la médula quitadas", "8 aceitunas negras, en rodajas", "1 bombilla de hinojo grande, finamente cortada en rodajas (reserva las hojas plumosas)", "8 filetes de anchoa", "4 cucharadas de aceite de oliva virgen extra", "2 cucharaditas de vinagre de vino tinto", "sal y pimienta negra recién molida"], "method": ["Tome una naranja en la palma de su mano y con un cuchillo pequeño, muy filoso corte los segmentos de entre las membranas, descartando las pepitas y cualquier médula aún unida. Repita con las naranjas restantes.", "Coloque los segmentos de naranja y las aceitunas en rodajas en un recipiente, luego agregue el hinojo y las anchoas. Condimentar con sal y pimienta. Mezcle el aceite de oliva y el vinagre, deje macerar durante 1 o 2 minutos y luego sirva. Decora con las hojas verdes y plumosas del hinojo."], "url": "www_bbc_co_uk_food_recipes_orangeandfennelsalad_67842", "title": "Ensalada de naranja e hinojo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["125g / 4½oz de mantequilla sin sal, ablandada", "125g / 4½oz de azúcar glas, dividido en porciones de 100 g / 3½ oz y 25 g / 1oz, ambos tamizados", "25 g / 1 oz de almendras molidas", "3 huevos de gallinas camperas, solo para blancos", "165g / 5¾oz de harina común, tamizada", "1 a 2 naranjas (dependiendo del tamaño), solo cáscara", "1 cucharadita de extracto de naranja", "200g / 7oz de chocolate blanco, finamente picado", "1 cucharadita de vainas de cardamomo, solo semillas, molidas"], "method": ["Precalentar el horno a 170C / 350F / Gas 4.", "Batir la mantequilla hasta que esté muy, muy suave (preferiblemente con una batidora eléctrica) y no haya grumos, luego batir en 100 g / 3½ oz de azúcar glas por un minuto.", "Tamice las almendras molidas y el azúcar glas restante sobre la mezcla y mezcle.", "Continúa mezclando, agregando las claras de huevo de a una por vez.", "Luego mezcle la harina.", "Agregue la ralladura de naranja y el extracto de naranja.", "Deje la mezcla para descansar por 20 minutos.", "Mientras tanto, marque líneas de 7cm / 2¾, separadas por al menos 3 cm / 1 in, en un pergamino para hornear, para guiar dónde colocar los bizcochos. Voltee el papel y pinte en el lado no marcado (las líneas se mostrarán).", "Llene una manga pastelera con boquilla lisa de 1 cm / ½ en la mezcla de galletas y extráigala. Alise las puntas hacia abajo al final de la línea con un dedo mojado en agua.", "Hornee por 8-9 minutos hasta que las galletas pálidas estén solo coloreando y el centro sea marrón dorado, con los bordes ligeramente más oscuros. Esto puede tomar hasta 10-12 minutos.", "Retire los bizcochos del horno y déjelos en la bandeja durante 1-2 minutos. Con una espátula, transfiera las galletas a una rejilla para que se enfríen. De forma alternativa, puede dejar que los bizcochos se sequen y enfríen en la bandeja si se los ha dejado poco.", "Para decorar, combine las semillas picadas de chocolate y de cardamomo molido.", "Derretir dos tercios del chocolate blanco picado muy suavemente en un tazón a prueba de calor en la parte superior de una olla de agua hirviendo a fuego lento. Caliente el chocolate a no más de 45C / 113F (use un termómetro para medir esto), retírelo del fuego y luego agregue el chocolate blanco restante, revolviendo continuamente hasta que la temperatura baje a 32C / 90F. Transfiera a un tazón pequeño estrecho o empinado.", "Mitad cada galleta en el chocolate y luego recójala en el pergamino para secar."], "url": "www_bbc_co_uk_food_recipes_orange_white_chocolate_24330", "title": "Langues de chat de naranja, chocolate blanco y cardamomo", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Hace 30", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 naranjas grandes", "200 g / 7 oz de azúcar en polvo", "200 g / 7¼ oz de almendras molidas", "½ cucharadita de polvo de hornear", "6 huevos enteros", "½ limón, solo jugo", "crema fresca, al gusto", "1 cestito pequeño de frambuesas"], "method": ["Pon todas las naranjas en una sartén y cúbrelas con agua fría. Llevar a ebullición, baje el fuego y cocine a fuego lento por hasta dos horas. Verifique el agua para asegurarse de que no hierva en seco. Después de dos horas, retírelo del fuego y déjelo enfriar.", "Precalentar el horno a 200C / 400F / Gas 6.", "Retire las naranjas del agua. Cortar por la mitad y quitar las pepitas.", "Colóquelos en un procesador de alimentos, piel y todo, con todos los ingredientes restantes y mezcle hasta que se mezclen.", "Ponga la mezcla en una lata de pastel engrasada y forrada (20cm / 8in) y hornee durante 45 minutos.", "Deje que la torta se enfríe antes de servir con una cucharada de crema fresca y una dispersión de frambuesas."], "url": "www_bbc_co_uk_food_recipes_orangeandalmondcake_72383", "title": "Pastel de naranja y almendra", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 200g / 7oz", "2 huevos de gallinas camperas", "suficiente leche para unir", "mantequilla, para engrasar pan", "3 yemas de huevo de gallinas camperas", "2 cucharadas de azúcar en polvo", "50g de ciruelas pasas, picadas", "1 naranja, médula eliminada, picada", "4 claras de huevo de gallinas camperas"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para las crepas, mezcle la harina y los huevos, agregue suficiente leche para que la masa conserve la crema doble.", "Caliente una sartén de crepe y derrita un poco de mantequilla.", "Ponga suficiente mezcla de crep en la sartén para cubrir la sartén de manera uniforme y fina y cocine durante uno o dos minutos por cada lado.", "Retire la crepe y coloque sobre una hoja de toalla de cocina. Repita con la masa restante.", "Para el relleno, bata las yemas de huevo con el azúcar y dobla las ciruelas y las naranjas.", "En un tazón limpio, bata las claras de huevo hasta que estén firmes. Dobla esto en la mezcla de yema.", "Alinee los crepes en una bandeja para hornear e igualmente divida la mezcla de relleno en la mitad de cada crepe. Dobla cada lado vacío para crear formas de media luna.", "Coloque en el horno de ocho a diez minutos, o hasta inflado.", "Transfiera a platos y sirva caliente."], "url": "www_bbc_co_uk_food_recipes_orangeandprunecrepes_78108", "title": "Soufflé de panqueques de naranja y ciruela", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Rinde 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["225g / 8oz de mantequilla, más extra para engrasar", "225g / 8oz de azúcar en polvo de oro", "4 huevos de gallinas camperas, golpeados", "225g / 8oz de harina de auto crianza, tamizada", "1 naranja grande, solo ralladura", "Frambuesas frescas de 300 g / 9 oz", "2 cucharadas de jugo de naranja fresco", "1 cucharada colmada de azúcar en polvo de oro", "Mantequilla 250g / 9oz, ablandada", "250g / 9oz de azúcar glas, tamizado", "½ naranja, solo jugo", "1 naranja grande, solo ralladura, más un poco de ralladura para decorar"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para la torta, engrase y forme dos latas tipo sándwich de 20cm / 8 pulgadas con papel para horno y polvo con harina.", "En un mezclador de alimentos, unte la mantequilla y el azúcar hasta que estén pálidos y esponjosos.", "Poco a poco golpee los huevos, luego agregue la harina y la ralladura de naranja y mezcle hasta que estén bien combinados.", "Divida la mezcla de manera uniforme entre las dos latas de pastel, luego hornee en el horno durante 25-30 minutos, o hasta que estén doradas y ligeramente elásticas al tacto. Retire del horno y deje que se enfríe un poco en las latas antes de ponerlo en una rejilla para que se enfríe completamente.", "Mientras tanto, para la mermelada, coloque las frambuesas, el jugo de naranja y el azúcar impalpable en una cacerola pequeña a fuego lento. Cocine por 15-20 minutos, o hasta que las frambuesas comiencen a descomponerse. Retire la sartén del fuego y déjela enfriar por completo.", "Para la guinda, bata la mantequilla, el azúcar glas, el jugo de naranja y la ralladura en un bol hasta que quede suave.", "Para servir, coloque una esponja en un plato para servir o en un soporte para pasteles, y extienda la mitad del glaseado en la parte superior. Cuchara sobre la mermelada, cubra con la segunda esponja y termine con la crema de mantequilla restante. Decore con un poco más de ralladura de naranja si lo desea."], "url": "www_bbc_co_uk_food_recipes_orangeandraspberryvi_93622", "title": "Esponja Victoria naranja y frambuesa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 1 torta", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 naranjas", "un buen manojo de berros", "2 cucharadas de aceite de oliva", "azúcar pizca", "sal", "pimienta recién molida"], "method": ["Rallar finamente la ralladura de dos de las naranjas, evitando cualquier médula, luego pelarlas con un cuchillo afilado, eliminando toda la médula.", "Pase una cuchilla afilada a cada lado de las membranas delgadas, liberando segmentos enteros de a uno por vez. Déjelos caer en un tazón junto con cualquier jugo que gotee mientras realiza esta operación.", "Prepare un aderezo mezclando el aceite de oliva con 1 cucharada de jugo guardado, la ralladura finamente rallada, una pizca de azúcar y un poco de sal y pimienta.", "Mezcle las hojas con este aderezo justo antes de servir y esparza los segmentos de naranja entre las hojas."], "url": "www_bbc_co_uk_food_recipes_orangeandwatercresss_13958", "title": "Ensalada de naranja y berros", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 2-4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 naranjas grandes", "1 cucharadita de mantequilla", "1 cucharadita de harina común", "6 huevos de gallinas camperas", "Almendras molidas 250 g / 9 oz", "250 g / 9 oz de azúcar en polvo", "1 cucharada de levadura en polvo"], "method": ["Lave las naranjas a fondo. Llévalos a ebullición en una olla grande de agua y cocina suavemente durante dos horas.", "Precalienta el horno a 175 ° C / 325 ° F / Gas 3 y enmantequilla y enharina una lata de torta de 23 cm.", "Deje que las naranjas se enfríen, antes de cortar en cuartos y quitar las pepitas.", "Pulpe las naranjas en un procesador de alimentos.", "Batir los huevos y mezclar gradualmente todos los ingredientes restantes, incluida la pulpa de naranja. Vierta en la lata de la torta y cocínelo durante aproximadamente una hora, hasta que la tarta tenga un color dorado y se haya levantado.", "Transfiera a una rejilla de enfriamiento para cables, manteniendo la torta en la lata. Cuando el pastel se haya enfriado, quítelo cuidadosamente de la lata y sirva cortado en rebanadas."], "url": "www_bbc_co_uk_food_recipes_orangecake_83870", "title": "Pastel de naranja y almendra", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/orangecake_83870_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 vaina de vainilla, cortada a la mitad, semillas raspadas", "300ml / 11fl oz de leche entera", "2 yemas de huevo de gallinas camperas", "75g / 3oz de azúcar en polvo", "20g / ¾oz de harina de maíz", "300 ml / 11 fl oz crema doble", "2 naranjas, solo cáscara", "3 cucharadas de licor de naranja", "250ml / 9fl oz de agua fría", "110g / 4oz de mantequilla fría, cortada en cubitos", "1 cucharadita de azúcar en polvo", "Harina normal 150g / 5oz", "4 huevos de gallinas camperas", "50 g / 2 oz de azúcar en polvo", "50 ml / 2 fl oz de agua", "175g / 6oz de chocolate negro, aproximadamente picado", "3 naranjas, peladas y segmentadas", "6 cucharadas de azúcar en polvo"], "method": ["Para la crema de naranja, primero haga una crema pastelera. Coloque las semillas de vainilla y la vaina en una sartén. Agregue la leche y deje que hierva.", "Coloque las yemas de huevo, el azúcar y la harina de maíz en un bol y mezcle.", "Una vez que la leche esté hirviendo, vierta sobre la mezcla de huevo y mezcle bien. Regrese la mezcla a la sartén y vuelva a hervir, revolviendo todo el tiempo.", "Una vez que la mezcla hierva, retire la sartén del fuego, retire la cápsula de vainilla y deje que la crema se enfríe.", "Mientras tanto, coloca la crema doble en un tazón con la ralladura de naranja y el licor. Batir hasta que se formen picos suaves y luego doblar en la crema enfriada. Coloque la cuchara en una manga pastelera equipada con una boquilla de tamaño mediano.", "Para la pasta choux, precaliente el horno a 220C / 430F / Gas 7.", "Coloque el agua, la mantequilla y el azúcar en una sartén y deje que hierva. Hervir por un minuto.", "Retire del fuego y agregue la harina de una sola vez. Batir la mezcla a fondo hasta que esté suave y se desprende limpiamente de los lados de la sartén.", "Regrese al fuego por un minuto o dos y cocínelo.", "Retirar del fuego y dejar enfriar ligeramente. Agregue los huevos, uno a la vez, batiendo bien entre cada adición. Coloque la mezcla en una bolsa de plástico con una boquilla grande y lisa.", "Pase seis rondas grandes por una bandeja engrasada para hornear y empuje cualquier bache hacia abajo con la yema del dedo mojada.", "Coloque en el horno, junto con una taza de agua colocada en el estante inferior (esto ayuda a crear vapor).", "Cocine durante cinco minutos, abra la puerta del horno y permita que salga el vapor. Retire la taza de agua.", "Cocine los bollos choux durante 20 minutos más hasta que estén crujientes y dorados.", "Retire los bollos del horno y, con la punta de un cuchillo afilado, perfore un agujero en el fondo de cada panecillo. Colóquelos a los lados y vuelva al horno por otros cinco minutos para permitir que los panecillos se vuelvan secos y crujientes. Retire del horno y deje enfriar en una rejilla de alambre.", "Para la salsa de chocolate, coloque el azúcar y el agua en una sartén y deje que hierva. Cocine a fuego lento durante 1-2 minutos hasta que el azúcar se haya disuelto por completo, luego agregue el chocolate y revuelva bien hasta que quede suave. Retire del fuego.", "Para las naranjas caramelizadas, coloque los segmentos de naranja en un plato para servir y espolvoree con el azúcar. Use un mini soplete para calentar las naranjas hasta que el azúcar se haya caramelizado (o colóquelo bajo una parrilla caliente).", "Para servir, vierta la crema de naranja en los bollos choux, a través del orificio en el fondo de cada panecillo. Coloque junto a las naranjas caramelizadas. Vierta la salsa de chocolate sobre los bollos de choux y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_orangecreamfilledcho_86214", "title": "Bollos de choux rellenos de crema de naranja con salsa de chocolate y naranjas caramelizadas", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]