[{"ingredients": ["3 cucharadas de aceite de oliva", "1 cucharada de vinagre de vino tinto", "1 cucharadita de mostaza Dijon", "sal y pimienta negra recién molida", "dash salsa Tabasco", "2 cucharadas de cebolletas frescas picadas", "1 cucharada de perejil de flatleaf fresco picado", "1 cucharada de perifollo fresco picado", "1 patata, pelada, cortada en cubos y hervida hasta que esté tierna"], "method": ["Coloque todos los ingredientes excepto la papa en un tazón grande y mezcle bien.", "Agregue los cubos de papa al cuenco mientras todavía está caliente y mezcle bien para cubrir con el aderezo. Deje marinar durante diez minutos.", "Para servir, transfiéralo a un plato de servir."], "url": "www_bbc_co_uk_food_recipes_vinaigrettepotatoesw_85690", "title": "Vinagreta de papas con hierbas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 cucharadas de aceite de oliva", "500g / 1lb 2 oz rebanados de porcini fresco o un puñado generoso de porcini secos", "2 dientes de ajo, en rodajas", "150g / 5½ oz de jamón de Parma, en rodajas finas", "150 g / 5½ oz de mantequilla, más extra para engrasar", "60g / 2¼ oz de harina común", "1,5 litros / leche de 2½ pintas", "Crema doble de 200 ml / 7 fl oz", "2 cucharadas de perejil fresco picado", "1kg / 2lb 4oz masa de pasta fresca, enrollada en hojas de lasaña", "400g / 14oz de queso parmesano, rallado", "aceite de trufa blanca o una trufa fresca", "100g / 3½oz de mantequilla sin sal", "sal y pimienta negra recién molida, al gusto"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Calentar el aceite de oliva y freír los champiñones con el ajo durante dos minutos.", "Agregue el jamón de Parma, revuelva y retire del fuego.", "Cocine la mantequilla y la harina en una sartén a fuego lento hasta que desprenda un aroma a nuez. Agregue la leche, poco a poco hasta que se combine y espese.", "Agregue la crema doble y deje que hierva.", "Incline los champiñones cocidos en la salsa, sazone bien con sal y pimienta y agregue el perejil.", "Unte con mantequilla un plato gratinado de 24 cm / 9½ pulgadas y coloque una hoja de pasta en su interior.", "Vierta la salsa y añada un generoso puñado de queso parmesano. Salpique con aceite de trufa o desmigaje un poco de la trufa fresca.", "Repita para hacer seis capas, y termine con más queso parmesano y salpique con mantequilla.", "Hornee en el horno durante 25-30 minutos, o hasta que burbujee y se dore."], "url": "www_bbc_co_uk_food_recipes_vincisgrassi_75129", "title": "Vincisgrassi (lasaña de jamón y prosciutto)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6-8 hojas grandes de vid (empacadas al vacío o en salmuera)", "Feta de 200g / 7oz (en un bloque)", "1 limón no encerado", "2 cucharadas de aceite de ajo", "1 tsp pul biber chilli flakes (también conocido como Aleppo pepper)", "4 ramitas de tomillo, hojas recogidas o 1 cucharadita de tomillo seco"], "method": ["Precaliente el horno a 220C / 200C Fan / Gas 7 y forre una bandeja para hornear con papel de hornear.", "Coloque todas menos una de las hojas de vid sobre una tabla de cortar, asegurándose de que se superpongan entre sí ligeramente. Coloque el queso feta en el centro. Rallar el limón directamente sobre el queso asegurándose de que caiga uniformemente sobre la superficie. Rocíe suavemente el aceite de ajo tratando de mantenerlo en la misma superficie del queso en lugar de permitir que se derrame sobre los bordes. Espolvorea sobre los copos de chile y luego se va el tomillo.", "Cuidadosamente envuelva el queso feta en las hojas de la vid para hacer un paquete ordenado. Envuelva con la hoja de vid restante para asegurar el paquete.", "Coloque en la bandeja preparada y hornee durante 22-25 minutos. Sirve el paquete entero y comparte."], "url": "www_bbc_co_uk_food_recipes_vine-baked_feta_26601", "title": "Feta horneado de vid", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/vine-baked_feta_26601_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["6 coronas de paloma (los dos senos unidos al hueso, pídale a su carnicero que los prepare)", "sal y pimienta negra recién molida", "50g / 2oz de mantequilla", "1 cucharada de aceite vegetal", "pizca maza en polvo", "1 chalote, finamente picado", "2 cucharadas de vinagre de jerez", "2 cucharadas de vinagre de vino blanco", "150ml / ¼ pinta de caldo de pollo o de paloma", "25g / 1oz de mantequilla", "sal y pimienta negra recién molida", "1 cucharada de perejil fresco de flatleaf, picado", "1 cucharada de perifollo fresco, picado", "Papas de 450g / 1lb, peladas, cortadas en cilindros, luego cortadas finamente en discos", "110 g / 4 oz de mantequilla clarificada", "sal y pimienta negra recién molida", "8 cebollas de primavera", "50g / 2oz de mantequilla", "Guisantes 225 g / 8 oz, cocidos"], "method": ["Precalentar el horno a 180C / 365F / Gas 4.", "Para la paloma, se sazona la paloma con sal y pimienta negra recién molida, luego se frota cada corona con la mantequilla y la maza y se reserva durante 30 minutos.", "Calentar una sartén grande a prueba de horno hasta que esté caliente, agregar el aceite y dorar las coronas de paloma en cada lado, hasta que estén doradas, colocar en el horno y asar durante 12-15 minutos, o hasta que estén cocidos a su gusto. Retirar del horno, retirar de la sartén y dejar reposar en un lugar cálido durante cinco minutos.", "Para la salsa, vierta el exceso de grasa de la sartén, agregue los chalotes y fría a fuego medio durante 2-3 minutos.", "Agregue el vinagre de jerez y el vinagre de vino blanco. Llevar a ebullición y reducir el líquido a la mitad.", "Agregue el caldo y hierva nuevamente para reducir el líquido en un tercio.", "Agregue la mantequilla y sazone, al gusto, con sal y pimienta negra recién molida.", "Mientras tanto, corte cuidadosamente los pechos de paloma del hueso.", "Cuele la salsa en una sartén limpia y use la mitad para hilvanar los pechos de paloma.", "Agregue el perejil y el perifollo a la salsa restante en la sartén y revuelva.", "Para la torta de papa, aumente la temperatura del horno a 200C / 400F / Gas 6.", "Coloque las papas en un tazón y agregue la mantequilla clarificada y sazone bien con sal y pimienta negra recién molida.", "Caliente cuatro sartenes a prueba de horno de 15 cm / 6 pulgadas de diámetro y coloque las rodajas de patata en la base de las fuentes, de modo que cubran la base de cada bandeja, superponiéndose entre sí ligeramente. Repita para tres capas de discos de patata en cada bandeja, luego transfiéralos al horno para cocinar durante 10-15 minutos, o hasta que las papas estén doradas y cocidas. (Puede usar una sartén más grande para crear una sola tarta de papa más grande. Nota: esto puede tomar más tiempo para cocinar).", "Para los guisantes, coloque las cebolletas en una sartén con agua hirviendo y blanquee durante un minuto. Escurra las cebolletas y revuelva en agua helada, luego drene nuevamente.", "Calentar una sartén, hasta que esté tibia, luego agregar la mantequilla, los guisantes y las cebolletas blanqueadas. Cocine por dos minutos a fuego lento.", "Para servir, cuidadosamente coloque las tortas de papa en el centro de cada una de las cuatro placas. Coloque una cucharada de guisantes y cebolletas en el centro de cada pastel de papa. Coloque tres pechugas de paloma encima de cada pila de cebollas / guisantes y vierta la salsa restante."], "url": "www_bbc_co_uk_food_recipes_vinegarglazedpigeonb_86629", "title": "Pechuga de paloma glaseada con vinagre en pastel de patata crujiente con guisantes y cebolletas", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "2 cebollas, más o menos picadas", "3 zanahorias, más o menos picadas", "½ cabeza de apio, más o menos picada", "½ apionabo, aproximadamente picado", "2 puerros, más o menos picados", "½ hinojo, más o menos picado", "1 cabeza de ajo, cortado por la mitad", "4 granos de pimienta blanca", "1 pequeño racimo de tomillo fresco", "1 manojo pequeño de romero fresco", "1 manojo pequeño de perejil fresco de flatleaf", "2 cucharadas de aceite de oliva", "75g / 3oz de mantequilla", "1 chalote, finamente picado", "1 diente de ajo, aplastado", "1 cucharadita de hojas de tomillo, finamente picadas", "250g / 9 oz de carnaroli risotto de arroz", "50ml / 2fl oz de vino blanco", "1 litro / 1¾pint stock de verduras", "2 alcachofas violetas bebé, recortadas", "25g / 1oz mascarpone", "50g / 2oz de queso parmesano, recién rallado (o alternativa de queso duro vegetariano)", "sal y pimienta negra recién molida", "2 alcachofas violetas bebé, recortadas", "½ limón, solo jugo", "1 cucharada de vinagre de vino blanco", "1 cucharadita de mostaza inglesa", "3 cucharadas de aceite de oliva virgen extra", "sal y pimienta negra recién molida", "½ cabeza de escarola"], "method": ["Para el caldo, caliente una sartén grande hasta que esté caliente y luego agregue el aceite de oliva. Agregue las cebollas, las zanahorias, el apio, el apionabo, los puerros, el hinojo, el ajo y los granos de pimienta y cocínelos durante unos cinco minutos hasta que estén coloreados, pero no dorados.", "Cubra con agua y hierva, antes de bajar la temperatura y dejar hervir a fuego lento durante 15 minutos.", "Agregue el tomillo, el romero y el perejil y cocine por otros cinco minutos. Apague el fuego y permita que el caldo se enfríe en la sartén.", "Transfiera el caldo a un recipiente grande (o guárdelo en la sartén si tiene espacio en el refrigerador) y colóquelo en el refrigerador para que se enfríe toda la noche, tapado. Cuele el caldo al día siguiente, cuando esté listo para cocinar.", "Para el risotto, vierta 1 litro / 1¾ pintas del caldo de verduras caseras en una cacerola y coloque sobre el fuego. Traiga a fuego lento.", "Calentar una sartén hasta que esté caliente. Agregue el aceite de oliva y la mitad de la mantequilla. Agregue los chalotes y el ajo y el sudor durante dos minutos.", "Dispersar sobre las hojas de tomillo y agregar el arroz a la sartén. Cocine por un minuto hasta que comience a brindar.", "Agregue el vino blanco y cocine hasta que casi todo el vino haya sido absorbido. Poco a poco agregue el caldo varios cucharones a la vez, revolviendo todo el tiempo.", "Cuando se absorba cada adición de material, agregue más caldo, revolviendo una vez más.", "Continúe cocinando hasta que el arroz esté solo tierno y casi todo el caldo se haya absorbido. Cuando el arroz haya llegado a este punto, corta finamente las alcachofas (ya sea a mano o en una mandolina).", "Agregue las alcachofas al risotto y cocine por 2-3 minutos con el resto del caldo.", "Agregue el mascarpone, la mantequilla restante y el parmesano y revuelva para combinar. Sazonar con sal y pimienta negra recién molida.", "Para la ensalada, corte las alcachofas muy finas y colóquelas en un tazón con la mitad del jugo de limón.", "Batir el vinagre de vino blanco, la mostaza y el aceite de oliva juntos para hacer un aderezo. Sazonar con sal y pimienta negra recién molida. Escurra las alcachofas y colóquelas en una ensaladera. Agregue el aderezo y la escarola al cuenco y mezcle bien.", "Para servir, vierta un poco del risotto en cada plato y cubra con la ensalada."], "url": "www_bbc_co_uk_food_recipes_violetartichokerisot_87983", "title": "Risotto de alcachofa violeta con ensalada de alcachofas", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200ml / 7fl oz de puré de tomate", "2 cebollas tiernas, finamente picadas", "1 limón, jugo", "½ cucharadita de salsa Tabasco", "½ cucharadita de salsa Worcestershire", "Cubitos de hielo de 55 g / 2 oz", "1 cucharada de cebollín, picado"], "method": ["En una licuadora, mezcle la passata, cebollas tiernas, jugo de limón, salsa Worcestershire, salsa Tabasco y cubitos de hielo. Mezcle durante dos minutos o hasta que quede suave.", "Verter en un vaso alto y decorar con cebolletas picadas."], "url": "www_bbc_co_uk_food_recipes_virginmary_78294", "title": "Virgen María", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/virginmary_78294_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200 ml / 7oz pasados", "1 lima, solo jugo", "½ cucharadita de salsa Tabasco", "½ cucharadita de salsa Worcestershire", "1 cucharadita de mostaza Dijon", "puñado de cubitos de hielo", "sal y pimienta negra recién molida"], "method": ["Coloque todos los ingredientes en un procesador de alimentos y mezcle.", "Para servir, vierta en un vaso lleno de cubitos de hielo y sazone al gusto con sal y pimienta negra recién molida."], "url": "www_bbc_co_uk_food_recipes_virginmary_84288", "title": "Virgen María", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1litre / 1¾ pintas de aceite vegetal", "1kg / 2lb 4oz goteo de carne", "400 g / 14 oz astillas patatas, peladas, cortadas en porras", "15 g / oz de levadura fresca", "pizca de sal", "azúcar pizca", "175ml / 6fl oz de agua tónica", "Harina normal de 200g / 7oz", "Vodka de 25ml / 1fl oz", "1 cucharadita de vinagre de sidra", "4 x 175g / 6oz de bacalao (u otro pescado blanco como el coley o abadejo) filetes, despellejados, deshuesados", "250ml / 9fl oz de vinagre de vino tinto", "1 hoja de laurel", "½ cucharadita de cilantro molido", "½ cucharadita de canela molida", "Azúcar moreno suave ligero 75g / 3oz", "1,6 kg / 3 lbs 8 oz de tomates enlatados picados", "1 cucharadita de sal", "1 cucharada de mostaza inglesa en polvo", "1 diente de ajo, aplastado", "salsa de tabasco", "2 cucharadas de puré de tomate", "1-2 cucharadas de harina de maíz"], "method": ["Para el bacalao, caliente el aceite vegetal y la carne goteando en una freidora a 170C / 325F. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Freír las papas picadas en el aceite por 2-3 minutos, o hasta que estén tiernas, pero no coloreadas. (Es posible que deba hacer esto en lotes). Drene las papas en papel de cocina e incremente la temperatura del aceite en la sartén o freidora a 190C / 375F / Gas5.", "Mientras tanto, mezcle la levadura, la sal y el azúcar en un bol hasta que estén bien combinados.", "Vierta el agua tónica en la mezcla de levadura y mezcle la harina, el vodka y el vinagre. Deje que la mezcla fermente; está lista para usar cuando la mezcla comience a burbujear.", "Cubra los filetes de bacalao en la mezcla y freír en el aceite durante 3-4 minutos, o hasta que estén dorados y crujientes. Retire el bacalao maltratado con una cuchara ranurada y escurra sobre papel de cocina.", "Freír los chips semicocidos en el aceite por segunda vez durante 2-3 minutos, o hasta que estén dorados y crujientes.", "Para el ketchup de tomate, caliente el vinagre, las especias y el azúcar en una sartén de base pesada hasta que esté hirviendo a fuego lento.", "Agregue los ingredientes restantes, lleve a ebullición y revuelva para evitar que la mezcla se pegue al lateral de la sartén.", "Una vez que la mezcla haya alcanzado el punto de ebullición, reduzca la temperatura a fuego lento y cocine por otros 30 minutos, revolviendo ocasionalmente.", "Mezcle la mezcla en una licuadora hasta que quede suave, luego empuje el ketchup a través de un colador.", "Sirva el bacalao junto con las patatas fritas con una buena porción de salsa de tomate."], "url": "www_bbc_co_uk_food_recipes_vodka_and_tonic_battered_64040", "title": "Bacalao malteado con vodka y tónica con patatas fritas y ketchup de tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de levadura fresca", "pizca de sal", "azúcar pizca", "175ml / 6fl oz de agua tónica", "Harina normal de 200g / 7oz", "Vodka de 25ml / 1fl oz", "1 cucharadita de vinagre de sidra", "8 cangrejos de caparazón blando", "6 dientes de ajo, pelados y dejados enteros", "250ml / 9fl oz de vino blanco", "2 yemas de huevo de rango medio", "1 cucharada de vinagre de vino blanco", "1 cucharada de mostaza Dijon", "pizca de sal", "125ml / 4fl oz de aceite de colza", "½ cucharadita de azafrán, remojado en 25ml / 1fl oz de agua caliente", "1 limón, solo jugo (al gusto)", "25 g / 1 oz de ensalada de sangre de toro hojas", "25 g / 1 oz de lechuga de cordero", "2 cabezas de lechuga Little Gem, hojas separadas", "3 cucharadas de aceite de oliva", "1 cucharada de vinagre de vino blanco", "1 limón, solo jugo", "2 cebolletas, finamente picadas, para adornar"], "method": ["Para el cangrejo de caparazón blando vodka y tónico, precaliente una freidora a 190C / 370F. (PRECAUCIÓN: no lo deje sin supervisión. El aceite caliente puede ser peligroso).", "Mezcle la levadura, la sal y el azúcar en un recipiente hasta que estén bien combinados. Vierta el agua tónica y mezcle la harina, el vodka y el vinagre. Dejar de lado para fermentar - está listo para usar cuando la mezcla comience a burbujear.", "Sumerja los cangrejos en la mezcla y colóquelos en la freidora durante 3-4 minutos, volteándolos dos o tres veces, hasta que estén dorados y crujientes. Retire con cuidado los cangrejos del aceite caliente con una cuchara ranurada, coloque en un plato forrado con papel de cocina y sazone con sal.", "Para el alioli de azafrán, coloque el ajo y el vino blanco en una sartén y cocine por unos minutos. Escurrir y reservar el ajo.", "Coloque las yemas de huevo en un procesador de alimentos, agregue el vinagre, la mostaza de Dijon y la sal. Licúe hasta que quede suave, luego con el motor en marcha, agregue gradualmente el aceite en un lento chorrito hasta que la mezcla se parezca a la mayonesa. Agregue el azafrán y el ajo y mezcle para combinar. Agregue jugo de limón al gusto.", "Para la ensalada de temporada, coloque todas las hojas en un tazón grande y mezcle. Coloque el aceite, el vinagre y el jugo de limón en un tazón pequeño y bata. Vierta sobre la ensalada y mezcle.", "Para servir, coloque el cangrejo en platos para servir con la ensalada al lado y el aioli de azafrán en un plato pequeño. Esparce las cebolletas sobre el cangrejo."], "url": "www_bbc_co_uk_food_recipes_vodka_and_tonic_soft_10369", "title": "Vodka y tonic soft shell-cangrejo con aioli de azafrán y ensalada de temporada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Vodka 100 ml / 3½ fl oz", "1 cucharada de azúcar en polvo", "1 cucharadita de pasta de frijoles de vainilla", "Fresas de 400g / 4oz, descuartizadas y pinchadas con un tenedor", "botón de mantequilla, para engrasar", "Galletas de 300 g / 10½ oz, como galletas digestivas", "pizca de sal", "½ cucharadita de canela", "150 g / 5½ oz de mantequilla sin sal, derretida", "Queso cuajada de 500 g / 1 lb 2 oz (disponible en algunos supermercados grandes)", "375 ml / 13 fl oz crema doble", "1 limón, jugo y ralladura solamente", "200 g / 7 oz de azúcar en polvo", "1 cucharadita de pasta de frijoles de vainilla", "50g / 1¾oz de harina de maíz", "5 huevos de gallinas camperas, golpeados", "100g / 3½ oz de mermelada de fresa", "Fresas de 200g / 7oz, partidas por la mitad", "crema batida, para servir"], "method": ["Para las fresas de vodka, vierta el vodka en un tazón grande, agregue el azúcar y la pasta de frijoles de vainilla. Agregue las fresas y deje en infusión durante aproximadamente 4 horas.", "Precalentar el horno a 180 ° C / 160 ° Ventilador / Gas 4. Mantee generosamente una lata profunda de 23 cm / 9 pulg.", "Mientras tanto, divida los bizcochos en migajas en un procesador de alimentos, o póngalos en una bolsa y golpee con un rodillo. Mezcle la sal y la canela. A continuación, agregue la mantequilla derretida. Revuelva bien y empaquete uniformemente en la lata de hornear preparada. Hornee en el horno por 10 minutos. Deja enfriar.", "En un tazón, bata el requesón, la crema doble, el jugo y la ralladura de limón, el azúcar impalpable, la pasta de frijoles de vainilla, la harina de maíz y los huevos.", "Escurra las fresas de vodka con un colador, reservando el jugo de vodka de fresa. Dobla las fresas en la mezcla de tarta de queso.", "Vierta la mezcla sobre la base de la galleta. Cubra el fondo de la bandeja para hornear con dos capas de papel de aluminio y colóquelo en una lata honda. Vierta en agua hirviendo para llegar a unos 2 cm / ¾in de la lata de pastel de queso. Hornee en el horno durante 1 hora y 15 minutos, o hasta que la tarta de queso se dore por la parte superior y se cocine solo. Dejar de lado para enfriar completamente, preferiblemente durante la noche.", "Mientras tanto, en una sartén caliente la mermelada de fresa. Agregue la mitad del jugo de fresa de vodka y mezcle. Deja enfriar. Con un pincel de pastelería, coloque una capa de mermelada infusión de vokda sobre la tarta de queso y péguela en las fresas cortadas a la mitad con el lado del corte hacia abajo en un hermoso diseño. Deje en la nevera hasta que esté listo para servir. Sirve con crema batida."], "url": "www_bbc_co_uk_food_recipes_vodka_strawberry_89729", "title": "Tarta de queso de fresa y vodka", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Sirve 10-12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/vodka_strawberry_89729_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["aceite vegetal, para engrasar", "250ml / 9fl oz de agua", "250 g / 9 oz de azúcar en polvo", "250ml / 9fl oz de jugo de arándano", "Vodka de 25ml / 1fl oz", "3 hojas de gelatina, empapadas en 3 cucharadas de agua fría", "100 g / 3½ oz de arándanos", "8 hojas frescas de albahaca", "200ml / 7fl oz de vino Marsala", "125g / 4oz de azúcar glasé", "1 vaina de vainilla, semillas raspadas", "250 g / 9 fl oz zarzamoras", "crema doble, para servir"], "method": ["Engrase ocho moldes de gelatina pequeños de su elección y alinee con la película adhesiva.", "Coloque el agua, el azúcar y el jugo de arándano en una sartén y deje que hierva. Reduzca el fuego y cocine a fuego lento durante cinco minutos, luego retírelo del fuego.", "Agregue el vodka y revuelva para combinar.", "Retire las hojas de gelatina de su agua de remojo y coloque en la sartén con la mezcla de arándano.", "Revuelva la mezcla de arándanos hasta que comience a espesar, luego vierta la mezcla en un tazón.", "Coloque unos arándanos en la parte inferior de cada molde de jalea forrado.", "Rellene los moldes con la mezcla de gelatina, luego coloque una hoja de albahaca en la parte superior de cada uno.", "Transfiera las gelatinas al refrigerador para enfriar durante la noche y establecer.", "Para la salsa, mezcle las semillas de Marsala, azúcar y vainilla en un tazón limpio. Agregue las moras y déjelas durante dos horas.", "Para servir, coloca cada gelatina en un plato pequeño. Cuchara cantidades iguales de la fruta marinada alrededor de cada gelatina y rociar con un poco de crema doble."], "url": "www_bbc_co_uk_food_recipes_vodkaandcranberryjel_89316", "title": "Vodka y jalea de arándano", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Rinde 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Vermut de 15 ml / ½ fl oz", "Vodka de patata Tyrrells 60 ml / 2 fl oz, u otro vodka de patata", "tuerza la cáscara de limón para adornar"], "method": ["Vierta el vermut y el vodka en un vaso mezclador y llénelo con cubitos de hielo. Revuelva bien y luego cuele en un vaso pequeño de Martini.", "Adorne con un toque de cáscara de limón y sirva."], "url": "www_bbc_co_uk_food_recipes_vodkamartini_88568", "title": "Vodka Martini", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/vodkamartini_88568_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 tomate cherry en cilantro", "¼ pinta / 150ml de vodka con sabor a chile", "½ limón, jugo de", "1 cucharada de jerez seco", "6 gotas de salsa Tabasco", "1 cucharadita de salsa Worcestershire", "sal de apio, al gusto"], "method": ["Pincha los tomates por todas partes con un palito de cóctel. Remoje los tomates en una mezcla de los siguientes siete ingredientes.", "Enfríe hasta que esté listo para comer. Cuando coma, espolvoree con sal de apio. El líquido restante se puede beber como tomas o como base para un excelente Bloody Mary."], "url": "www_bbc_co_uk_food_recipes_vodkasoakedcherrytom_70018", "title": "Tomates cherry empapados de vodka", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de sultanas", "100ml / 3½fl oz de vodka de limón", "Galletas de carbón 225g / 8oz (disponibles de grandes supermercados y proveedores de queso)", "150g / 5oz de mantequilla, derretida", "30g / 2oz de azúcar glas", "750g / 1½lb de queso ricotta", "400g / 13oz de queso crema", "6 huevos de gallinas camperas", "150 g / 5 oz de azúcar", "1 vaina de vainilla, semillas raspadas", "30 g / 1½ oz de semillas de amapola", "crema batida, mezclada con un chupito de vodka"], "method": ["Remojar las sultaninas en el vodka de limón durante la noche.", "Para la base, tritura las galletas en un bol. Agregue la mantequilla derretida y el azúcar glas y revuelva para combinar.", "Presione la mezcla de galletas en la base de una lata de torta en forma de resorte de 23cm / 9in.", "Precalentar el horno a 180C / 355F / Gas mark 4.", "Para el relleno, coloque la ricota, el queso crema, los huevos, el azúcar y las semillas de vainilla en un procesador de alimentos y mezcle hasta que estén combinados y suaves.", "Transfiera la mezcla de queso a un tazón limpio. Escurrir las sultanas del vodka y agregar las sultaninas al queso y mezclar bien.", "Con una cuchara, coloque la mezcla de queso sobre la base de la galleta y espolvoree sobre las semillas de amapola para cubrir completamente la parte superior.", "Transfiera al horno para hornear por una hora. La superficie aún debe estar un poco tambaleante en el centro de la tarta de queso cuando esté hecha. Se reafirmará a medida que se enfríe.", "Una vez que se haya enfriado, sirva rebanadas del pastel de queso en platos con una cucharada de crema batida de vodka."], "url": "www_bbc_co_uk_food_recipes_vodkasultanaandpoppy_85437", "title": "Tarta de queso de vodka, sultana y amapola", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Sirve 12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["450 g / 1 libra de hojaldre confeccionado", "6 comiendo manzanas, como Golden Delicious, peladas, sin corazón y reducidas a la mitad", "50 g / 2 oz de mantequilla, derretida en una olla, más extra para engrasar", "110 g / 4 oz de membrillo o pasta de membrillo (disponible en las tiendas de alimentos Continental o en algunos supermercados)", "Miel líquida, para lloviznar", "25 g / 1 oz de azúcar en polvo", "ramita de menta, para adornar", "150ml / 5fl oz de crema doble", "Nueces 25g / 1oz, picadas", "3 cucharadas de miel líquida"], "method": ["En una superficie enharinada, extender la masa de hojaldre finamente (a aproximadamente 3-4 mm) y pinchar la superficie con un tenedor. Recorta cuatro discos de 20-23 cm / 8-9 pulgadas. Coloque en la nevera para descansar.", "Precalentar el horno a 200C / 400F / Gas 6.", "Corta las manzanas finamente con un cuchillo afilado. Retire la masa de la nevera y colóquela en una bandeja para hornear con mantequilla antiadherente. Cepille ligeramente los bordes de los discos de hojaldre con mantequilla derretida y extienda el membrillo en el medio de cada disco. Arregle las rebanadas de manzana en la parte superior.", "Rocíe la manzana con un poco de miel y vierta sobre el azúcar y hornee en el horno durante 5-6 minutos, hasta que estén doradas.", "Mientras tanto, haz la crema de miel y nuez. Batir la crema doble hasta que espese, luego doblar las nueces y la miel.", "Retire las tartas del horno y glasee con un poco de la mantequilla restante. Sirva con una cucharada de la mezcla de crema de nueces y adorne con una ramita de menta."], "url": "www_bbc_co_uk_food_recipes_waferthinmembrilloan_81024", "title": "Membrillo fino como una oblea y tarta de manzana con crema de miel y nuez", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Hojaldre de 250g / 9oz, listo para rodar", "1 huevo de gallinas camperas", "25g / 1oz de mantequilla", "3 cebollas rojas grandes, en rodajas finas", "6 dientes de ajo, pelados", "4 ramitas de tomillo fresco", "sal y pimienta negra recién molida", "250g / 9oz de crema de grasa completa", "2 cucharadas de aceite de oliva, para lloviznar", "2 cucharadas de vinagre balsámico", "5 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "Cohete fresco de 100 g / 3½ oz"], "method": ["Si usa pastelería congelada, permita que se descongele.", "Precalentar el horno a 220C / 430F / Gas Mark 7.", "Ruede la masa de hojaldre hasta un grosor de 3 mm. Cortar en cuatro círculos redondos, cada uno del tamaño de una placa lateral.", "Con un cuchillo afilado, corte un borde pequeño alrededor de la masa y coloque esta pieza alrededor del borde exterior de la tarta, para hacer un marco de doble capa.", "Rompe el huevo en un bol y bate con un tenedor. Cepille los círculos de pastelería con el lavado de huevos alrededor de los bordes.", "Usando un tenedor, perfore las bases de la pasta un par de veces y luego colóquelas en el horno para hornear durante 15-20 minutos, hasta que las bases de la masa estén doradas y cocidas.", "Mientras tanto, derrita la mantequilla en una sartén grande. Agregue las cebollas, el ajo y el tomillo y cocine suavemente durante 15 minutos, hasta que se dore bien y caramelice.", "Sazone al gusto con sal y pimienta negra recién molida.", "Retire las bases de pasta cocidas del horno y unte con la crème fraîche.", "Cubra con las cebollas caramelizadas, rocíe con aceite de oliva y vuelva al horno por unos minutos.", "Mientras tanto, en un tazón grande y limpio, mezcle el vinagre balsámico con el aceite de oliva y un poco de sal y pimienta negra recién molida. Agregue las hojas de ensalada y mezcle bien para cubrir.", "Para servir, retire las tartas del horno y colóquelas en un plato grande para servir. Rocíe con un poco de aceite de oliva y sirva con una pequeña pila de ensalada en el centro de cada tarta."], "url": "www_bbc_co_uk_food_recipes_waferthinredonioncre_79305", "title": "Wafer cebolla roja fina y crème fraîche tarta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Rinde 4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["450ml / 16fl oz de leche entera", "3 huevos grandes de gallinas camperas, separados", "125ml / 4fl oz de aceite vegetal", "1 cucharadita de extracto de vainilla", "Harina normal 225g / 8oz", "2 cucharaditas de polvo de hornear", "3 cucharadas de azúcar en polvo", "¼ de sal marina fina", "jarabe de arce, arándanos u otras bayas, para servir"], "method": ["Caliente la plancha de gofres de acuerdo con las instrucciones (algunas necesitan un poco de aceite antes de comenzar).", "Vierta la leche en una jarra medidora grande, agregue las yemas de huevo, el aceite y la vainilla y bata al mismo tiempo. Combine la harina, el polvo de hornear, el azúcar y la sal en un tazón grande. Vierta la jarra de ingredientes húmedos en el recipiente con los secos, y mezcle, asegurándose de que no queden grumos.", "Poner las claras de huevo en un recipiente limpio y batir a los picos rígidos. Lentamente doble las claras de huevo en la masa, hasta obtener una consistencia espesa, suave y aireada.", "Llene un lado de su waflera calentada con 250ml / 9fl de masa batida, cierre y cocine durante 1 minuto, luego gire la plancha de wafles y cocine en el otro lado durante 2 minutos. Si está usando una waflera eléctrica, obviamente no la volteará, por lo que es posible que tenga que cocinar durante un minuto o más. Simplemente siga las instrucciones que vienen con la plancha en todos los casos.", "Libera el waffle cocido del waffle iron. Repita hasta que se agote toda la pasta. Si no mantienes los waffles calientes en el horno bajo (mira la punta de la receta), cada waffle debe comerse tan pronto como salga de la plancha. Vierta generosamente jarabe de arce sobre su waffle, y revuelva algunas bayas a su lado si lo desea."], "url": "www_bbc_co_uk_food_recipes_waffles_82356", "title": "Waffles", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Hace 20 gofres", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/waffles_82356_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["260g / 9½oz de harina natural", "1 cucharada de levadura en polvo", "1 cucharadita de copos de sal marina", "1 cucharada de azúcar granulada", "3 huevos de gallinas camperas, ligeramente golpeados", "425ml / 15fl oz de leche entera", "110 g / 4oz de mantequilla sin sal, derretida", "175g / 6¼oz de chocolate blanco, roto en pedazos", "50 g / 1 oz de azúcar en polvo", "4 plátanos, pelados y partidos a la mitad", "50g / 2oz de mantequilla", "50 g / 2 oz de azúcar en polvo", "4 cucharadas de helado de vainilla, para servir"], "method": ["Para los waffles, precaliente un wafle maker en un ajuste medio y precaliente el horno a 140C / 275F / Gas 1. Coloque un estante de alambre grande en una bandeja de horno y manténgalo caliente.", "Mezcle la harina, el polvo de hornear, la sal y el azúcar granulada en un tazón grande. Agregue los huevos, la leche y la mantequilla hasta que estén bien combinados.", "Vierte un poco de la mezcla en cada pocillo de la máquina para hacer gofres, cierra la tapa y cocina por cinco minutos, o hasta que esté dorada y crujiente. Repite el proceso hasta que la masa se agote. Mantenga los waffles calientes en la bandeja de horno en el horno.", "Para la salsa de chocolate caliente, derrita el chocolate en un recipiente colocado sobre una fuente de agua hirviendo (asegúrese de que el fondo del recipiente no toque el agua).", "En otra sartén, caliente el azúcar y 100 ml / 3½ onzas de agua, revolviendo hasta que el azúcar se disuelva. Llevar a ebullición.", "Mezcle el jarabe de azúcar en el chocolate hasta que quede suave y brillante.", "Para los plátanos fritos, caliente una sartén hasta que esté caliente, luego mezcle la mantequilla y el azúcar.", "Agregue las bananas y fría por 1-2 minutos en cada lado, o hasta que estén doradas por todas partes.", "Coloque los waffles en un plato y cubra con salsa de chocolate y sirva los plátanos y el helado en un lado."], "url": "www_bbc_co_uk_food_recipes_waffles_with_hot_14908", "title": "Waffles con salsa de chocolate caliente, plátanos fritos y helado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/waffles_with_hot_14908_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 250g / 9oz", "1 cucharada de levadura en polvo", "1 cucharadita de sal", "1 cucharada de azúcar en polvo", "3 huevos de gallinas camperas, ligeramente golpeados", "425ml / 15fl oz de leche entera", "115g / 4oz de mantequilla sin sal, derretida", "125g / 4½oz de mantequilla, derretida", "2 cucharaditas de jugo de limón", "2 cucharaditas de vinagre de vino blanco", "2 huevos grandes de gallinas camperas, solo yemas", "sal marina y pimienta negra recién molida", "2 cucharadas de vinagre de vino blanco", "4 huevos de gallinas camperas", "12 rebanadas de tocino rayado", "2-3 cucharadas de cebollín, finamente picado"], "method": ["Para los waffles, precaliente un waflera en un ajuste medio. Precaliente el horno a 140C / 275F / Gas 1. Coloque una rejilla de alambre grande en una bandeja para hornear y colóquela en el horno para que se caliente.", "Mezcle la harina, el polvo de hornear, la sal y el azúcar en un tazón grande. Agregue los huevos, la leche y la mantequilla hasta que estén bien combinados.", "Ponga un poco de la mezcla en cada pocillo de la máquina para hacer gofres, cierre la tapa y cocine durante cinco minutos o hasta que esté dorada y crujiente. Repita el proceso hasta que se agote la pasta, manteniendo los waffles cocidos calientes en la rejilla del horno.", "Para el holandés, derrita la mantequilla en una olla y cocine a fuego lento.", "Coloque el jugo de limón y el vinagre en una olla pequeña separada y caliente hasta que hierva.", "Coloque las yemas de huevo en un procesador de alimentos con una pizca de sal. Con el motor en marcha, agregue el limón caliente y el vinagre en un flujo constante y luego agregue lentamente la mantequilla derretida hasta que esté todo incorporado. Retire la salsa del procesador y sazone con sal marina y pimienta negra recién molida.", "Para los huevos escalfados, ponga a hervir un sartén de agua con sal y agregue el vinagre. Batir el agua para crear una bañera de hidromasaje y, una vez que se haya asentado, romper con cuidado un huevo en el agua. Cocine a fuego lento durante 2-3 minutos, retire el huevo escalfado con una cuchara ranurada y colóquelo en un plato para drenar. Repita el proceso con los huevos restantes.", "Caliente una sartén hasta que esté caliente, agregue el tocino y cocine hasta que esté crujiente en ambos lados. Escurra el tocino en papel de cocina.", "Para servir, coloque los gofres en los platos de servir, cubra con los huevos escalfados y el tocino y termine con una llovizna de salsa holandesa y el cebollino picado."], "url": "www_bbc_co_uk_food_recipes_waffles_with_hollandaise_19899", "title": "Waffles con holandesa, huevos escalfados y tocino", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal de 250g / 9oz", "1½ cucharadita de polvo de hornear", "1 cucharadita de sal", "1 cucharada de azúcar en polvo", "3 huevos de gallinas camperas, ligeramente golpeados", "425 ml / ¾ pinta leche entera", "110 g / 4oz de mantequilla derretida, más extra para engrasar", "75g / 3oz de azúcar en polvo", "25g / 1oz de mantequilla", "Fresas de 250g / 9oz, descascaradas", "1 limón, ralladura solamente", "Helado de vainilla 500ml / 18fl oz, para servir", "4-8 cucharadas de jarabe de arce, para servir"], "method": ["Para los waffles, precaliente un wafle maker en un ajuste medio y precaliente el horno a 140C / 275F / Gas 1.", "Mezcle la harina, el polvo de hornear, la sal y el azúcar en un tazón grande. Agregue los huevos, la leche y la mantequilla hasta que estén bien combinados.", "Cepille la máquina de hacer gofres con un poco de mantequilla derretida y luego vierta un poco de la mezcla en cada uno de los pocillos de la máquina para hacer gofres. Cierre la tapa y cocine durante cinco minutos, o hasta que estén dorados y crujientes. Retire y coloque en una bandeja en el horno para mantener el calor, mientras usa el resto de la mezcla.", "Para la compota de fresa, coloca el azúcar y las cinco cucharadas de agua con la mantequilla en una cacerola. Agregue las fresas y la ralladura de limón. Cocine a fuego lento durante cinco minutos.", "Para servir, apile los gofres en cada uno de los cuatro platos, cubra con un poco de compota de fresa y una cucharada de helado de vainilla. Termine con una llovizna de jarabe de arce."], "url": "www_bbc_co_uk_food_recipes_waffles_with_strawberry_51757", "title": "Waffles con compota de fresa y helado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]