[{"ingredients": ["2 rebanadas de hígado de ternera 225g / 8oz cada una, 4cm / 2in de espesor", "sal y pimienta negra recién molida", "100g / 3½ oz de harina natural, condimentada con sal y pimienta recién molida", "30g / 1oz de mantequilla sin sal", "25ml / 1fl oz de vinagre balsámico de buena calidad", "6 rebanadas de tocino ahumado, a la parrilla, picadas en tiras", "puñado de berros", "puñado de cohetes", "100 g / 3½ oz de pepino, sin semillas, cortado en cubos pequeños", "8 tomates tomados por el sol, finamente picados"], "method": ["Sazonar bien el hígado con sal y pimienta negra recién molida, luego dragar con la harina sazonada, sacudiendo el exceso de harina.", "Derrita la mantequilla en una sartén a fuego medio hasta que espume.", "Agregue el hígado a la sartén de mantequilla derretida y cocínelo durante tres minutos, hasta que el hígado se haya tornado ligeramente marrón, luego voltee el hígado y cocínelo por otros tres minutos.", "Voltee el hígado otra vez, reduzca un poco el calor y rocíe el hígado con el vinagre balsámico. Cocine por otros 2-3 minutos o hasta que esté cocido a su gusto.", "Agregue el tocino, el berro, el cohete, el pepino y los tomates bañados por el sol a la sartén y mezcle bien durante diez segundos.", "Para servir, coloque un trozo de hígado en cada plato y coloque los zumos y las verduras alrededor del plato."], "url": "www_bbc_co_uk_food_recipes_liverandbaconsalad_86845", "title": "Ensalada de hígado y tocino", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2kg / 4lb 8oz de patatas, descuartizadas", "200g / 7oz de mantequilla", "150ml / 5fl de leche en oz", "50g / 1¾oz de harina natural, para recubrimiento", "8 rebanadas delgadas terneros hígado", "sal y pimienta negra recién molida", "1 cucharadita de levadura fresca", "400ml / 14fl oz de cerveza", "Harina normal de 200g / 7oz", "2 cebollas pequeñas, cortadas finamente en anillos", "100g / 3½oz de alcaparras para bebés, drenadas", "50 g / 1¾oz de mantequilla sin sal", "2 chalotes, en rodajas", "2 cucharaditas de hojas frescas de tomillo", "100 ml / 3½ fl oz de vino tinto", "300ml / 10 fl oz beef jus o caldo", "2 cucharadas de vinagre de jerez", "2 cucharadas de hojas frescas de perifollo"], "method": ["Hervir las papas en agua con sal durante 15 minutos o hasta que estén tiernas. Drene y vuelva a colocar en la cacerola sobre el fuego para eliminar el exceso de humedad. Mash las patatas.", "Caliente 150 g / 5½ oz de la mantequilla y la leche en una cacerola hasta que la mantequilla se derrita. Agregue al puré y bata bien hasta que esté suave y cremoso. Condimentar con sal y pimienta.", "Para los aros de cebolla, coloca la levadura y la cerveza en un bol y mezcle. Agregue la harina y mezcle con batido suave. Dejar de lado por 5 minutos.", "Llene una freidora con grasa o una sartén grande, profunda y de fondo grueso, dos tercios llena con aceite vegetal. Caliente el aceite a 180 ° C o hasta que la miga de pan chisporrotee y se ponga dorada cuando se la deje caer. (Precaución: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Sumerja los aros de cebolla en la mezcla y luego bájelos con cuidado en el aceite caliente (puede necesitar hacer esto en lotes). Cuando los aros de cebolla estén dorados, quítelos con una espumadera y sazone con sal y pimienta. Drene en el rollo de cocina.", "Agregue las alcaparras a la freidora y cocine durante 1-2 minutos. Retire y escurra sobre papel de cocina.", "Para la salsa, caliente la mantequilla en una sartén a fuego medio. Cuando la mantequilla esté espumante, agregue los chalotes y fría por 2-3 minutos, o hasta que se ablanden.", "Agregue el tomillo y el vino tinto, mezcle bien y ponga la mezcla a ebullición. Reduzca el fuego a fuego lento y luego cocine a fuego lento hasta que el volumen de líquido se haya reducido en un tercio.", "Agregue el jus y devuelva la mezcla a ebullición. Reduzca ligeramente el fuego y cocine a fuego lento durante 15-20 minutos, o hasta que el líquido se haya espesado. Agregue el vinagre de jerez, el perifollo y sazone con sal y pimienta. Mantenga caliente hasta que esté listo para servir.", "Para el hígado, sazone la harina común con sal y pimienta. Coloque las rebanadas de hígado de ternera en la harina y sacuda el exceso.", "Caliente la mantequilla restante en una sartén a fuego medio. Cuando la mantequilla esté espumosa, agregue el hígado y fría por 1-2 minutos en cada lado, o hasta que se dore por ambos lados.", "Coloque el puré en los platos y el hígado al lado. Vierta sobre la salsa y cubra con los aros de cebolla y las alcaparras."], "url": "www_bbc_co_uk_food_recipes_liver_mash_and_onion_54291", "title": "Hígado, puré y aros de cebolla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["115g / 4oz de polenta", "40 g / 1½ oz de mantequilla sin sal", "75g / 2¾oz de queso parmesano, finamente rallado", "sal", "600g / 1lb 5oz de hígado de ternera, cortado y cualquier membrana delgada eliminada, cortada longitudinalmente en rodajas", "aceite de oliva, para freír", "450 g / 1 libra de cebollas pequeñas, en rodajas finas", "30g / 1oz de mantequilla sin sal", "4 cucharadas de perejil de flatillo picado", "sal y pimienta negra recién molida"], "method": ["Ponga a hervir 900 ml / 1½ pinta de agua en una cacerola grande. Vierta la polenta en un flujo lento y constante, revolviendo o batiendo todo el tiempo. Deje que hierva a fuego lento y deje que se cocine suavemente, revolviendo con frecuencia, durante 20 minutos hasta que esté cocido. Agregue la mantequilla, el parmesano y un poco de sal y mezcle.", "Mientras tanto, corte las rodajas de hígado en un ligero ángulo en tiras cortas, de aproximadamente 2.5 cm de ancho.", "Caliente 3 cucharadas de aceite en una sartén grande de base pesada a fuego medio-alto. Agregue las cebollas y cocine durante 10 minutos, revolviendo con frecuencia, hasta que estén suaves y doradas. Poner en un recipiente y mantener el calor.", "Agregue 1½ cucharaditas de aceite a la sartén y caliente a fuego alto. Cuando el aceite esté hirviendo, agregue un cuarto del hígado, sazone con sal y pimienta y cocine por 30 segundos, revolviendo constantemente, hasta que se dore ligeramente. Incline sobre un plato y repita tres veces con el resto del hígado.", "Regrese todo el hígado a la sartén con las cebollas y los jugos del plato y mezcle a fuego alto durante otros 30 segundos. Cuchara en un plato caliente.", "Agregue la mantequilla a la sartén y retire cualquier trozo dorado de la base. Retire del fuego y agregue el perejil picado. Cuchara sobre el hígado y la cebolla.", "Para servir, ponga la polenta en platos calientes y espolvoree un poco de hígado y jugos de manteca en la parte superior."], "url": "www_bbc_co_uk_food_recipes_liver_with_parmesan_17265", "title": "Hígado con polenta de parmesano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina de pasta 500g / 1lb 2oz '00', más extra para quitar el polvo", "2 cucharaditas de sal", "5 huevos de gallinas camperas", "1 cucharada de aceite de oliva", "3 cucharadas de aceite de oliva", "500 g / 1lb 2 oz de carne picada de cerdo", "3 dientes de ajo, finamente picados", "1 cebolla, finamente picada", "1 tallo de apio, cortado, finamente picado", "2 huevos de gallinas camperas", "3 cucharadas de perejil fresco picado", "3 cucharadas de queso parmesano rallado, más extra para decorar", "3 cucharadas de salsa de tomate (ver a continuación)", "3 cucharadas de aceite de oliva", "3 dientes de ajo, finamente picados", "1 tallo de apio, cortado, finamente picado", "1 cebolla, finamente picada", "700g / 1½lb pasado", "2 cucharadas de albahaca fresca picada", "2 cucharaditas de orégano seco", "1 cucharadita de azúcar en polvo", "pizca de sal, al gusto"], "method": ["Para la pasta, apile la harina en una tabla de cortar o limpie la superficie de trabajo y haga un pozo en el centro. Vierta la sal, los huevos y el aceite en el pozo. Mezcle cuidadosamente los ingredientes secos y húmedos con una cuchara de madera, luego mezcle la masa con las manos y agregue un poco de agua si la masa se siente seca.", "Convierta la masa de pasta en una superficie de trabajo ligeramente enharinada y amasar durante 12-15 minutos hasta que esté suave y brillante sin parches secos o húmedos. Enrolle la masa en una bola, envuélvala en una película adhesiva y déjela reposar durante 30 minutos.", "Mientras tanto, para el relleno, caliente el aceite en una cacerola a fuego medio. Agregue la carne picada de cerdo, el ajo, la cebolla y el apio y fríe suavemente durante 12-15 minutos, o hasta que el cerdo se dore y las verduras se hayan ablandado. Retirar del fuego y reservar para enfriar.", "Para la salsa de tomate, caliente el aceite en una sartén separada a fuego medio. Agregue el ajo, el apio y la cebolla y fría por 6-8 minutos, o hasta que estén coloreados. Agregue la passata y 300ml / 10½ fl oz de agua, mezcle bien la mezcla y lleve a ebullición.", "Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento y cocine a fuego lento durante 30 minutos, luego mezcle la albahaca, el orégano, el azúcar y la sal. Mantener caliente", "Cuando la mezcla de llenado se haya enfriado, mézclelo hasta obtener una pasta áspera en un procesador de alimentos y luego transfiéralo a un recipiente. Batir los huevos, el perejil, el parmesano y 3 cucharadas de salsa de tomate hasta que estén bien combinados.", "Para hacer los raviolis, corte la masa en trozos del tamaño de satsuma. Polvo de los rodillos de una máquina de pasta con harina.", "Trabajando con una pieza de masa a la vez, aplana la masa y aliméntala dos veces a través de una máquina de pasta en su configuración más amplia. Ajuste la máquina de pasta de modo que los rodillos estén en el segundo ajuste más ancho, luego enrolle la masa de nuevo en la máquina. Continúe ajustando la máquina hasta que haya enrollado la masa en su posición más estrecha. Coloque la hoja de pasta a un lado (córtela en longitudes más pequeñas si es inmanejablemente larga).", "Repita el proceso de laminado con las piezas restantes de masa.", "Cuando toda la pasta se haya enrollado finamente, coloque una hoja de pasta sobre un molde de ravioles. Ponga un poco de la mezcla de relleno en el centro de cada ravioli (use los pocillos del molde como guía). Cepille los bordes de cada raviolo con agua con un pincel de pastelería o con su dedo.", "Coloque otra hoja de pasta encima de los raviolis, luego presione las hojas de pasta juntas para sellar los bordes de cada raviolo, exprimiendo tanto aire como sea posible en el proceso. Voltea los ravioles fuera de la bandeja y corta los bordes sellados para separarlos.", "Repita el proceso de llenado y corte con las hojas de pasta y la mezcla de relleno restantes.", "Llevar a ebullición una sartén grande de agua salada. Con cuidado, baje los ravioles en el agua, en tandas, y cocine durante 3-4 minutos; están cocidos cuando flotan en la superficie del agua.", "Sirva los raviolis en tazones para servir cubiertos con la salsa de tomate tibia y una pizca de queso parmesano."], "url": "www_bbc_co_uk_food_recipes_lizs_pork_and_parmesan_68228", "title": "Ravioles de cerdo y parmesano", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lizs_pork_and_parmesan_68228_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 cebollas tiernas, peladas y muy finamente cortadas", "3 cucharadas de aceite de oliva ligero", "sal y pimienta recién molida", "40 g / 1½ oz de mantequilla", "8 rebanadas delgadas de hígado de ternera, cortadas en pequeños cuadrados", "1 cucharada de perejil picado", "2 cucharadas de vinagre de vino"], "method": ["A fuego lento, freír las cebollas en el aceite de oliva hasta que estén coloreadas y muy suaves, esto puede demorar hasta 30 minutos. Sazonar con sal y pimienta recién molida e introducir en un bol.", "En una sartén, caliente la mantequilla hasta que forme espuma. Sazone el hígado del ternero con sal y pimienta recién molida, y cocine brevemente la carne en la mantequilla durante unos 20 segundos. Transfiera a un colador y drene.", "Incline las cebollas cocidas nuevamente dentro de la sartén del hígado y mezcle brevemente hasta que estén doradas y ligeramente chamuscadas.", "Regrese el hígado a la sartén con el perejil y finalmente agregue el vinagre. Servir."], "url": "www_bbc_co_uk_food_recipes_liverveneziana_83809", "title": "Hígado veneciano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 panecillos multiseed (cada uno con un peso de aproximadamente 75g / 2¾oz), reducidos a la mitad", "1 berenjena grande, corte medio ancho en 4 rebanadas de 2cm / ¾ de espesor", "1½ cucharada de aceite de oliva virgen extra", "½ cucharadita de comino molido", "½ cucharadita de cilantro molido", "1 pimiento rojo pequeño, sin semillas y finamente cortado", "1 pimiento amarillo pequeño, sin semillas y finamente cortado", "1 cebolla roja, finamente rebanada", "1½ cucharadas de vinagre de vino tinto", "1 cucharada de azúcar moreno claro", "25 g / 1 oz de hojas frescas de rúcula o ensalada de hojas de bebé", "1 tomate grande de res, cortado en cuatro rodajas gruesas", "ramitas de cilantro, para adornar (opcional)", "1 aguacate maduro pequeño, pelado, apedreado y toscamente picado", "2 cucharaditas de jugo de lima fresco", "1 diente de ajo pequeño, aplastado", "copos de sal marina y pimienta negra recién molida"], "method": ["Precalentar una sartén a fuego medio.", "Mientras tanto, para hacer la mayonesa de aguacate, coloque todos los ingredientes en un tazón pequeño y sazone bien. Mash con un tenedor hasta lo más suave posible y dejar de lado.", "Tueste los rollos con el lado del corte hacia abajo en la bandeja de la plancha durante 1 minuto y déjelos a un lado. Cepille las rodajas de berenjena en ambos lados con la mitad del aceite de oliva y espolvoree con el comino y el cilantro. Coloque en la bandeja de la plancha y cocine durante 4-5 minutos en cada lado, o hasta que esté blando y ligeramente chamuscado.", "Mientras tanto, caliente el aceite restante en una sartén grande y antiadherente y saltee los pimientos y la cebolla roja durante 8-10 minutos, o hasta que estén bien suavizados y ligeramente dorados. Agregue el vinagre y el azúcar y sazone. Cocine por unos segundos más, revolviendo constantemente.", "Coloque las cuatro bases del panecillo entre cuatro platos y cubra cada uno con un pequeño puñado de rúcula, luego una rodaja de tomate. Divida la mezcla de pimienta entre los panecillos y cubra con la berenjena. Coloque la mayonesa de aguacate encima, adorne con unas ramitas de cilantro, si está usando, y cúbralo con las tapas del rollo. Asegúrelo con un pincho de madera si lo desea. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_loaded_aubergine_burgers_44288", "title": "Hamburguesas de berenjena con mayonesa de aguacate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/loaded_aubergine_burgers_44288_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 cucharadas de aceite de oliva", "1 cebolla roja, finamente picada", "2 dientes de ajo, aplastados", "2 remolachas crudas, peladas y ralladas", "1 calabacín, rallado", "2 zanahorias grandes, peladas y ralladas", "100 g / 3½ oz de avena porridge", "400 g de garbanzos de lata, escurridos", "3 cucharadas de tahini", "1 yema de huevo grande de gallinas camperas", "4 cebollas de primavera, en rodajas finas", "3 cucharadas de cilantro fresco finamente picado", "sal marina y pimienta negra recién molida", "aceite de oliva virgen extra, para lloviznar", "2 patatas dulces grandes, peladas y cortadas en rondas de 1cm / ½ pulgadas", "Halloumi de 200 g / 7 oz, cortado en rodajas de 1 cm / ½ pulgada de espesor", "3 dientes de ajo grandes, en rodajas finas", "2 chiles rojos, en rodajas finas", "6 puñados de hojas de ensalada mixtas", "2 remolachas cocidas, cortadas en cubos de 1cm / ½ en cubitos", "puñado de albahaca fresca, finamente picada", "1 diente de ajo, aplastado", "1 lima, solo jugo", "3 cucharadas de aceite de oliva virgen extra", "6 panecillos de masa fermentada de trigo integral, cortados a la mitad", "Hummus de 230g / 8oz", "2 aguacates, en rodajas", "puñado de alubias listas para comer", "½ repollo rojo, rallado"], "method": ["Para hacer la hamburguesa de remolacha, caliente 1 cucharada de aceite en una sartén grande a fuego medio. Freír la cebolla y el ajo durante 4-5 minutos, o hasta que estén suaves. Agregue las verduras ralladas y cocine, revolviendo a menudo, durante 5 minutos o hasta que estén suaves. Escurra el exceso de líquido liberado por las verduras.", "Coloque la avena, los garbanzos, el tahini y la yema de huevo en un procesador de alimentos y pulse para combinar. Incline la mezcla en un tazón y mezcle las verduras ralladas, las cebolletas y el cilantro. Sazone generosamente con sal y pimienta.", "Divida la mezcla en seis y forme hamburguesas. Cubra y refrigere durante al menos 30 minutos (o hasta 24 horas).", "Mientras tanto, para hacer la ensalada, coloque una sartén a fuego alto o precaliente una barbacoa.", "Rocíe el aceite de oliva virgen extra sobre las batatas y las rodajas de halloumi, espolvoree el ajo y los chiles y sazone con pimienta negra. Cocine en la plancha caliente o en la barbacoa, volteándolas una vez, hasta que estén bien cocidas.", "Mientras tanto, mezcla todos los ingredientes del aderezo en un tazón. Mezcle con las hojas de ensalada y remolachas cocidas y reserve.", "Caliente 2 cucharadas de aceite en una sartén a fuego medio. Cocine las hamburguesas, en lotes si es necesario, durante 2-3 minutos en cada lado, o hasta que estén doradas y calientes.", "Para servir, tueste ligeramente los panecillos de masa fermentada y cubra cada base con hummus, aguacate, brotes de soja, repollo rojo, una hamburguesa de remolacha y la tapa del moño. Sirva cada hamburguesa con un puñado de hojas de ensalada cubiertas con batatas a la plancha y halloumi."], "url": "www_bbc_co_uk_food_recipes_loaded_beetroot_burgers_73370", "title": "Hamburguesas de remolacha cargadas con halloumi y ensalada de patata dulce", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/loaded_beetroot_burgers_73370_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2-3 cucharadas de aceite de oliva", "1,2 kg / 2½ lb de ternera guisada, picada", "2 huesos de médula ósea (pregunte a su carnicero por estos)", "1 cebolla, pelada, picada", "3 papas, peladas, picadas", "1 colinabo, pelado, picado", "2 puerros, cortados, picados", "2 zanahorias, peladas, en rodajas", "2 hojas de laurel", "sal y pimienta negra recién molida", "1.5 litros / 2½ pintas de caldo de carne", "pan crujiente, para servir (opcional)"], "method": ["Precaliente el horno a 150C / 300F / Gas 2.", "Caliente el aceite de oliva en una cazuela grande a fuego medio. Agregue las piezas de carne y cocine durante 4-5 minutos, revolviendo ocasionalmente, o hasta que se doren por todos lados.", "Agregue los huesos de médula a la sartén y continúe cocinando durante 2-3 minutos más.", "Retire la carne de res y los huesos de médula de la sartén y déjelos a un lado en un plato caliente.", "Agregue las cebollas picadas a la cazuela en la que se cocinó la carne de res. Fría en los jugos de la sartén durante 1-2 minutos o hasta que se ablanden.", "Agregue las papas y la nata y continúe cocinando durante 2-3 minutos más.", "Agregue los puerros picados, las zanahorias y las hojas de laurel y condimente al gusto con sal y pimienta negra recién molida. Continúe cocinando durante 1-2 minutos o hasta que se ablanden.", "Regrese la carne de res y los huesos de la médula a la cazuela, luego vierta sobre suficiente caldo de carne para cubrir el contenido de la cazuela.", "Cubra la cazuela con una tapa, luego transfiérala al horno y cocínela durante 2½-3 horas, o hasta que la carne esté tierna.", "Para servir, espolvorea un poco de la cazuela de cocción en el centro de cuatro a seis platos para servir y sírvelo con pan crujiente, si así lo deseas."], "url": "www_bbc_co_uk_food_recipes_lobscousecasserole_91838", "title": "Cazuela Lobscouse", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["aceite vegetal, para cocinar", "2 cebollas, finamente picadas", "8 dientes de ajo rallados", "4 cm / 1½ en pieza de jengibre fresco de raíz, pelado y rallado", "2 cucharaditas de copos de sal marina", "1 cucharadita de jengibre molido", "1 cucharadita de cúrcuma molida", "1 cucharadita de comino molido", "1 cucharadita de canela molida", "1 cucharadita de chile en polvo", "400 ml puede leche de coco", "200g / 7oz de tomates picados", "50g / 1¾oz de coco desecado", "2 chiles verdes calientes, en rodajas finas", "1 limón, solo jugo", "2 langostas cocidas, cortadas en trozos de 2cm / ¾in", "6 cucharadas de cilantro fresco tostado", "4 cucharadas de chiles verdes en escabeche picados", "sal y pimienta negra recién molida"], "method": ["Vierta un poco de aceite en una olla grande de fondo grueso. Agregue las cebollas y cocine a fuego lento durante 10-15 minutos, o hasta que comiencen a colorear. Agregue el ajo y cocine, revolviendo, durante 4-5 minutos, o hasta que las cebollas estén doradas. Agregue el jengibre, la sal y todas las especias secas, revuelva y cocine por 2-3 minutos, o hasta que estén fragantes.", "Vierta la leche de coco y los tomates picados y revuelva. Llevar a ebullición, luego reduzca el fuego y cocine a fuego lento durante 10-15 minutos, o hasta que la salsa se haya espesado un poco (no se preocupe si se ve dividida).", "Freír el coco desecado en una sartén hasta que estén dorados. Agregue al curry con los chiles frescos y cocine durante 3-4 minutos, o hasta que espese.", "Sazone con jugo de limón, sal y pimienta. Agregue la langosta y cálida. Agregue el cilantro y los chiles en vinagre. Sirva en tazones calientes."], "url": "www_bbc_co_uk_food_recipes_lobster_and_coconut_78690", "title": "Langosta y coco al curry", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 langosta, cocida y enfriada", "2 cucharadas de aceite de oliva", "2 filetes de filete de x 175g / 6oz", "100g / 3½oz de mantequilla sin sal", "25g / 1oz dulse o berro fresco", "1 limón, ralladura solamente", "aceite vegetal, para freír", "2 patatas fritas grandes, peladas y cortadas en papas fritas", "2 lechugas Little Gem, hojas separadas", "3 cucharadas de aceite sin sabor", "1 cucharada de vinagre de estragón", "1 cucharadita de mostaza Dijon", "1 cucharadita de estragón recién picado", "pellizcar granos de pimienta rosa, aplastados"], "method": ["Para la langosta y el filete, precaliente la parrilla a altura. Corta la langosta por la mitad y quita la cola y la carne de la garra, córtala y colócala en los caparazones de la cola.", "Caliente una sartén hasta que caliente y ligeramente aceite la carne. Cocine a cada lado por 3 minutos o hasta que esté cocido a su gusto. Reserve para descansar en un lugar cálido.", "Mientras tanto, coloque la mantequilla y el dulse (o berros) en un recipiente y mezcle. Coloque las colas de langosta en la bandeja de la parrilla, coloque un poco de mantequilla en la parte superior y colóquela debajo de la parrilla durante 1-2 minutos o hasta que la mantequilla se derrita y la carne de langosta esté caliente.", "Para las papas fritas y la ensalada, caliente una freidora a 180 ° C, o la mitad llene una sartén grande con aceite vegetal y caliente hasta que un pedazo de pan se dore cuando se deje caer en el aceite. (PRECAUCIÓN: El aceite caliente puede ser muy peligroso. No lo deje sin supervisión).", "Baje las virutas en la freidora y cocine durante 5 minutos, o hasta que estén doradas y crujientes. Escurrir sobre papel de cocina.", "Coloque la lechuga Little Gem en un tazón grande. Mezcle los ingredientes restantes de la ensalada y luego vierta sobre la lechuga.", "Para servir, coloque las colas de langosta en platos para servir con el bistec al costado. Coloque las papas fritas en tazones junto con la ensalada. Ponga un pomo de mantequilla en cada bistec justo antes de servir."], "url": "www_bbc_co_uk_food_recipes_lobster_and_fillet_steak_43951", "title": "Langosta y solomillo con papas fritas y ensalada verde", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ naranja, ralladura quitada y cortada en tiras muy finas, carne segmentada", "250 g / 9 oz de hojas de ensalada mixtas (como rúcula, frissée, berro, capuchina o diente de león)", "2 cucharadas de azúcar", "1 cucharada de vinagre Moscatel", "2 cucharadas de aceite de colza", "1x 550 g / 1 libra de langosta precocida de 4 oz", "100 g / 3½ oz de mantequilla", "sal", "1 limón, solo jugo", "1 mango, pelado, apedreado y rebanado", "berro de mostaza, para adornar"], "method": ["Para la ensalada de ralladura de naranja, pula las tiras de ralladura en agua hirviendo tres veces para eliminar el amargor. Escurra bien la ralladura y déjela a un lado sobre papel de cocina.", "Mezcle las hojas de ensalada con los segmentos de naranja. Dejar de lado.", "Para la langosta y el mango, pula la langosta en agua hirviendo con sal, dos minutos para las colas y tres minutos para las garras.", "Retire la carne de langosta de las conchas, corte la cola por la mitad y quite las garras.", "En una sartén, caliente la mantequilla hasta que esté espumosa, vierta la langosta y caliente, hilvanando todo el tiempo. Sazonar, al gusto, con sal y jugo de limón.", "Retire la langosta de la sartén y agregue las rebanadas de mango a la mantequilla. Cocine hasta que el mango esté suave y caliente. Reserve la mantequilla.", "Para la ensalada de ralladura de naranja, coloque la ralladura en una sartén pequeña con el azúcar. Caliente hasta que el azúcar esté caramelizado y cubra la cáscara. Dejar enfriar un poco, mezclar con el vinagre y el aceite. Vierta sobre las hojas de ensalada y revuelva para cubrir.", "Coloque la ensalada en el centro de los platos para servir con la langosta alrededor y el mango en la parte superior. Rocíe la mantequilla y decore con berro de mostaza."], "url": "www_bbc_co_uk_food_recipes_lobster_and_mango_salad_99292", "title": "Ensalada de langosta y mango con un noisette beurre", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 x 800 g / 1 libra de langostas cocidas de 12 oz (o 3 más pequeñas)", "250ml / 9fl oz crema", "2 cucharadas de aguardiente", "125ml / 4fl oz de vino blanco dulce", "Queso Roquefort 100 g / 3½ oz, desmenuzado", "sal marina y pimienta negra recién molida", "220 g / 8oz de mantequilla sin sal", "1 cucharada de vinagre de vino blanco", "1 cucharada de pimienta blanca agrietada", "4 yemas de huevo de gallinas camperas", "30g / 1oz de mantequilla sin sal", "1 manojo de berros", "50 g / 1¾oz de espinaca baby"], "method": ["Para el gratinado de la langosta, abre las langostas y selecciona cuidadosamente toda la carne. Cortar en pequeños bocados y reservarlos. Rompe las conchas con un rodillo o mazo, coloca en la cacerola con la mitad de la crema, agrega el brandy y el vino y sazónalo con sal y pimienta. Cocine a fuego lento durante 20 minutos, luego colar a través de un colador fino. Deseche las cáscaras y mezcle el queso con la salsa.", "Para el sabayon, ponga la mantequilla en una olla pequeña y cocine lentamente a fuego lento. Elimine la espuma de la superficie, luego elimine del fuego y deje que se asiente. Con cuidado, vierta la mantequilla líquida en un recipiente, teniendo cuidado de no incluir nada del sedimento lechoso.", "Combine 4 cucharadas de agua con el vinagre y la pimienta en una cacerola pequeña de espesor. Hierva a fuego medio hasta que reduzca el volumen en un tercio, deje enfriar. Agregue las yemas de huevo y ponga a fuego lento, batiendo continuamente y asegurándose de que el batidor entre en contacto con toda la superficie inferior de la sartén. La mezcla debe emulsionarse y volverse cremosa en 8-10 minutos. Retire del fuego y vierta lentamente la mantequilla clarificada, batiendo vigorosamente. Controle el condimento y luego cúbralo con un colador fino.", "Para el berro y las espinacas, caliente una sartén mediana y agregue la mantequilla. Una vez derretido agregue el berro y la espinaca y cocine hasta que se marchite.", "Para terminar la langosta, caliente una parrilla a fuego alto. Batir la crema restante a los picos suaves. Dobla la salsa de langosta y el sabayon. No mezcle demasiado o perderá su ligereza. Caliente la carne de langosta en un horno de vapor o caliente. Coloque en un plato a prueba de horno, cubra con la salsa y colóquelo inmediatamente debajo de la parrilla. El sabayon y el queso harán que el glaseado de salsa tenga un color dorado caramelo.", "Sirva con el berro y las espinacas al lado."], "url": "www_bbc_co_uk_food_recipes_lobster_and_roquefort_60668", "title": "Langosta y gratinado roquefort", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 langostas cocidas, carne seleccionada, conchas reservadas", "4 vieiras, sin cáscara, limpiadas y removidas", "1 cucharada de aceite de colza", "2½ cucharadas de aceite de colza", "1 cucharadita de semillas de comino", "2 cucharaditas de semillas de sésamo", "200g / 7 oz de raíz de jengibre, en rodajas finas", "1 guindilla verde, hendidura abierta", "1 stick lemongrass, fuera quitado y finamente picado", "4 hojas de lima, más o menos picadas", "Azúcar de palma 100g / 3½oz", "100g / 3½oz de pasta de tamarindo", "pellizcar asafoetida", "1 chile rojo seco, aplastado", "½ cucharadita de semillas de mostaza", "5-6 hojas de curry", "1 manojo kai lan (brócoli chino), o alternativamente brócoli Tenderstem", "1 cucharada de aceite de colza", "1 manojo de cebollas de primavera, cortado en el ángulo"], "method": ["Para el chutney de jengibre, caliente una sartén grande y agregue dos cucharaditas de aceite. Una vez caliente, agrega el comino y las semillas de sésamo. Una vez que comiencen a soltar, agregue el jengibre, el chile, el limoncillo, las hojas de lima y cocine durante unos minutos.", "Agregue el azúcar de palma, el tamarindo, la asafétida y un poco de agua y cocínelos durante 30-40 minutos.", "En una sartén separada, agregue el resto del aceite y fría el chile seco, las semillas de mostaza y las hojas de curry por un par de minutos. Ponga a un lado hasta que esté listo para servir.", "Para las vieiras y la langosta, caliente una sartén y agregue un poco de aceite. Una vez caliente, agregue las vieiras y cocine durante aproximadamente un minuto en cada lado. En el último minuto agregue la carne de langosta.", "Para las verduras, coloque una olla de agua hirviendo sobre el fuego y agregue el kai lan y cocine brevemente. Luego sumérgelo en agua helada y escúrrelo.", "Caliente una sartén grande y agregue el aceite, una vez caliente, agregue las cebollas tiernas y la kai lan y fríalos suavemente sin colorear por un par de minutos.", "Cuando esté listo para servir, precaliente la parrilla a alto. Coloque las verduras cocidas en la base de las cáscaras de langosta y agregue la vieira y la carne de langosta. Coloque la salsa picante en la parte superior y colóquela debajo de la parrilla por un par de minutos y termine con el chile frito, las semillas y las hojas de curry."], "url": "www_bbc_co_uk_food_recipes_lobster_and_scallops_45414", "title": "Langosta y vieiras con jengibre chutney y salteado de verduras", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 langostas cocidas", "50g / 2oz de mantequilla", "1 cebolla, más o menos picada", "50 g / 2 oz de raíz de jengibre fresco, finamente picado", "4 ramitas de tomillo", "1 cucharada de puré de tomate", "75ml / 3floz de vino blanco", "300ml / 11fl oz de caldo de pollo", "Crema doble 75ml / 3fl oz", "sal y pimienta negra recién molida", "Filete de lubina de 4 piezas de 250g / 9 oz, pin-boned", "sal", "75g / 3oz de mantequilla", "1 cucharada de aceite de oliva", "3 zanahorias, peladas y cortadas en tiras de juliana", "2 puerros, cortados, lavados y cortados en tiras de juliana", "pimienta negra recién molida"], "method": ["Para la salsa de langosta, corte las langostas por la mitad a lo largo y saque la carne. Rompe las garras y quita la carne de la garra en una sola pieza.", "Deje a un lado la carne de langosta y corte las conchas.", "Caliente una sartén grande hasta que esté caliente, agregue la mitad de la mantequilla, la cebolla, el jengibre y el tomillo y cocine por 2-3 minutos, o hasta que se suavice pero no se coloree.", "Agregue las cáscaras de langosta y el puré de tomate y cocine por un minuto.", "Agregue el vino blanco y el caldo de pollo, lleve a ebullición, luego reduzca el fuego y cocine a fuego lento durante 10 minutos.", "Coloque en una licuadora de alimentos en lotes y mezcle hasta obtener un puré.", "Presione a través de un colador fino en una olla, bata la crema y revise el condimento, agregue sal y pimienta si es necesario.", "Cuando esté listo para servir, mezcle la salsa con una batidora para crear una espuma ligera.", "Corta la cola de la langosta en dados grandes.", "Caliente una sartén hasta que esté medianamente caliente, agregue la mantequilla restante y la carne y las pinzas de la langosta y cocine a cada lado durante 1-2 minutos, o hasta que estén recién coloreados y calientes.", "Sazone con sal y pimienta negro.", "Para la lubina, sazone la lubina con un poco de sal. Calentar una sartén hasta que esté medio caliente, agregar un poco de mantequilla y el aceite de oliva y calentar hasta espumar.", "Agregue la lubina, con la piel hacia abajo y fríe en sartén durante dos minutos hasta que la piel esté crujiente y el pescado casi cocido.", "Voltee y cocine en el lado de la carne durante un minuto, rociando con la mantequilla. Retire del fuego y deje reposar por un minuto.", "Caliente una sartén por separado hasta que esté medianamente caliente, agregue la mantequilla restante y la zanahoria y el puerro y saltee durante unos minutos, o hasta que las verduras estén blandas y simplemente marchitas. Sazonar con sal y pimienta negra recién molida.", "Para servir, amontone la juliana en el centro del plato y luego cubra con la lubina. Coloque los pedazos de la langosta alrededor del plato y luego espolvoree la salsa espumosa.", "Termina con la pinza de langosta en la parte superior de la lubina."], "url": "www_bbc_co_uk_food_recipes_lobster_and_sea_bass_94004", "title": "Langosta y lubina con zanahoria juliana", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["25g / 1oz de mantequilla", "1 cebolla, finamente picada", "1 chile verde, en rodajas finas", "1 cucharadita de comino molido", "½ cucharadita de cúrcuma molida", "1 cucharadita de sal masala", "1 cucharadita de cilantro molido", "Lentejas rojas 350g / 12oz, enjuagadas", "1 cucharada de eneldo fresco finamente picado", "1 cucharada de cilantro fresco finamente picado", "1 cucharada de aceite vegetal", "1 ramita de canela", "3 vainas de cardamomo, aplastadas", "3 dientes", "1 cucharadita de semillas de hinojo", "1 chile verde, finamente picado", "2 chalotes, finamente picados", "2 dientes de ajo, aplastados", "Jengibre fresco de la raíz de 2.5cm / 1in, finamente rallado", "1 cucharadita de comino molido", "1 cucharadita de cilantro molido", "1 cucharadita de cúrcuma molida", "1 cucharadita de curry en polvo", "3 tomates de carne de vacuno maduros grandes, picados", "1 langosta cocida, partida por la mitad, carne extraída y cortada en trozos, cáscaras reservadas", "2 cebollas de primavera, en rodajas finas", "puñado de berro fresco"], "method": ["Para hacer las lentejas con especias, derrita la mantequilla en una cacerola grande a fuego medio. Agregue la cebolla y las especias y sude suavemente durante 5-10 minutos, hasta que estén suaves.", "Agregue las lentejas y simplemente cúbralas con agua. Llevar a ebullición y cocinar a fuego lento durante 30 minutos, o hasta que toda el agua se haya evaporado y las lentejas estén blandas. Agregue el eneldo y el cilantro.", "Mientras tanto. Para hacer la salsa de masala, caliente el aceite en una sartén a fuego medio. Agregue la canela, cardamomo, clavo de olor, hinojo, chile, chalotes, ajo y jengibre y cocine por 2-3 minutos.", "Agregue el comino, el cilantro, la cúrcuma, el polvo de curry, los tomates y 300 ml / 10 fl oz de agua y cocine durante 10 a 15 minutos. Mezcle en un procesador de alimentos hasta que quede suave.", "Regrese la salsa a la sartén y agregue la langosta. Cocine a fuego lento durante 5 minutos, hasta que se caliente.", "Para servir, coloque la langosta masala nuevamente dentro de las cáscaras de langosta y adorne con berros de cilantro y cebollas cortadas en rodajas. Sirve con las lentejas con especias."], "url": "www_bbc_co_uk_food_recipes_lobster_masala_with_74873", "title": "La langosta masala con lentejas con especias", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Macarrones 300 g / 10½ oz", "sal al gusto", "4 colas de langosta cocinadas, concha en", "100ml / 3½fl oz de vino blanco", "750 ml / 1¼ de leche de pinta", "1 hoja de laurel", "cortar la cebolla", "1 cucharada de aceite vegetal", "50g / 1¾oz de mantequilla", "1 cebolla, finamente picada", "Tocino tocino 50g / 1oz", "2 dientes de ajo, en rodajas", "1 ramita de tomillo, solo hojas", "60g / 2¼ oz de harina común", "1 cucharadita de mostaza en polvo", "¼ cucharadita de pimienta de cayena", "Queso cheddar de 75 g / 2½ oz, rallado", "Gruyère 75 g / 2½ oz, rallado", "50g / 1¾oz de pan rallado fresco", "2 colas de langosta cocinadas", "botón de mantequilla", "2 cucharadas de aguardiente"], "method": ["Precalentar el horno a 200 ° C / 180 ° Ventilador / Gas 6. Poner a hervir una olla grande de agua y salarla generosamente. Agregue los macarrones y cocine durante 8-10 minutos, o hasta que esté a punto de al dente. Escurrir bien.", "Separar la carne de la langosta de las colas, picar en trozos del tamaño de un bocado y dejar de lado. Pon las conchas en una olla y calienta a fuego alto. Vierta el vino blanco y deje burbujear ferozmente. Retirar del fuego y colar, descartar las cáscaras y reservar el vino.", "Coloque la leche, la hoja de laurel y la rodaja de cebolla en una cacerola. Calienta lentamente, hasta que la leche esté justo por debajo del punto de ebullición, luego retira del fuego. Dejar de lado. Deje la leche para infundir con la hoja de laurel y la cebolla.", "Caliente el aceite y la mantequilla en una olla grande. Agregue la cebolla picada y el tocino y fría hasta que la cebolla esté ligeramente caramelizada y el tocino esté crujiente y dorado.", "Agregue el ajo y el tomillo, luego mezcle la harina, la mostaza en polvo y la pimienta de Cayena. Revuelva hasta que tenga un roux (estará lleno de bultos debido a la cebolla y el tocino), luego agregue gradualmente la leche, revolviendo entre cada adición, hasta que esté todo incorporado y tenga una salsa bechamel. Agregue 50g / 1¾oz de cada uno de los dos tipos de quesos y el vino reservado y revuelva a fuego lento hasta que el queso se haya derretido.", "Mezcle la salsa con los macarrones y agregue la carne de langosta. Vierta en un plato grande y poco hondo para horno.", "Mezcle las migas de pan con el queso restante. Espolvorea esto sobre los macarrones. Hornee en el horno durante 30-35 minutos o hasta que esté bien caliente, dorado y burbujeante.", "Para decorar, caliente una sartén a fuego alto. Cuando esté caliente agregue la mantequilla y las colas de langosta. Cocine por 1 minuto en cada lado hasta que se caliente. Agregue el brandy y la luz con un fósforo para flamear. (PRECAUCIÓN: Mantenga el pozo alejado de las llamas y permita que se apague antes de servir.) Retire las colas de la langosta de la sartén y córtelas a lo largo. Coloque sobre el queso macarrones y sirva."], "url": "www_bbc_co_uk_food_recipes_lobster_mac_n_cheese_90457", "title": "Langosta mac y queso", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lobster_mac_n_cheese_90457_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["175g / 6oz de mantequilla", "2 chalotes, finamente picados", "150ml / ¼ pinta de vermut", "150ml / ¼ litro de caldo de pescado", "Crema doble de 150 ml / 1/4 de pinta", "Camarón de la bahía de Morecambe 250 g / 9oz", "2 tomates, cortados en cubitos", "2 cucharadas de perejil fresco picado", "4 langostas cocidas", "450 g / 1lb de patatas nuevas recién cocidas", "25g / 1oz de mantequilla", "sal y pimienta negra recién molida", "1 cucharadita de mostaza Dijon", "1 cucharada de vinagre de vino blanco", "4 cucharadas de aceite de colza", "1 tomate, cortado en cubitos", "¼ de pepino, cortado en cubitos", "2 lechugas Little Gem, picadas"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Derrita 25 g / 1 oz de mantequilla en una olla. Agregue los chalotes y cocine hasta que estén suaves pero no coloreados.", "Agregue el vermut, hierva y cocine a fuego lento hasta que el volumen del líquido se haya reducido en dos tercios. Agregue el caldo de pescado y reduzca nuevamente el volumen de líquido en dos tercios.", "Agregue la crema doble y cocine hasta que se reduzca a una consistencia de salsa espesa. Picar 50 g / 1¾oz de las gambas y agregar a la salsa con 50 g / 1¾oz de mantequilla, revolviendo bien. Agregue el tomate, el perejil y 100 g / 3½ oz de gambas enteras, retire del fuego, reserve y mantenga caliente.", "Para el hash, triture las papas y mezcle en 25 g / 1 oz de mantequilla. Agregue el resto del camarón. Condimentar con sal y pimienta. Caliente una sartén grande y cocine el hash a fuego medio hasta que esté dorado y crujiente.", "Retire la carne de langosta de las conchas, pero manténgase en forma. Coloque la carne de langosta en una bandeja para hornear con la mantequilla restante de 100 g / 3½ oz, cubra con papel de aluminio y vuelva a calentar suavemente en el horno durante 2 o 3 minutos, o hasta que esté bien caliente.", "Para la ensalada, mezcle la mostaza, el vinagre y el aceite en un tazón pequeño para hacer un aderezo. Mezcle el tomate, el pepino y la lechuga en un tazón. Antes de servir vierte el aderezo sobre la ensalada.", "Para servir, coloque el hash de papa en el plato, cubra con la langosta y la cuchara sobre la salsa. Sirve la ensalada al lado."], "url": "www_bbc_co_uk_food_recipes_lobster_on_morecambe_bay_74761", "title": "Langosta en hasch de camarones de la bahía de Morecambe", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["5 chiles rojos calientes y secos, empapados en 75 ml / 3 fl oz de agua tibia", "2 chalotes grandes, picados", "2 dientes de ajo picados", "2 cm / 1 en pieza de raíz de jengibre fresco, picado", "1 tallo de limoncillo, finamente picado", "4 piezas de raíz de cilantro, toscamente picada", "2 hojas de lima Kaffir, más o menos picadas", "¼ cucharadita de pasta de camarón", "½ cucharadita de comino molido", "½ cucharadita de cilantro molido", "200ml / 7fl oz de leche de coco", "1 cucharada de salsa de pescado", "1 cucharada de pasta de tamarindo", "1 lima, solo jugo", "1 cucharadita de azúcar de palma", "4 langosta cocida, dividida por la mitad longitudinalmente", "2 cucharadas de hojas de cilantro, picadas", "1 cucharada de aceite vegetal", "1 chalote de plátano grande, finamente cortado", "1 chile rojo, en rodajas", "2 dientes de ajo, finamente picados", "1 cucharada de jengibre fresco rallado", "150g / 5oz de gambas peladas cocidas", "400g / 14oz de fideos de arroz cocidos", "125g / 4½oz de brotes de soja", "2 cucharadas de pasta de tamarindo", "2 cucharadas de salsa de pescado", "1 cucharada de salsa de soja", "1 lima, solo jugo", "3 cucharadas de cilantro fresco tostado", "2 cucharadas de cacahuetes salados tostados, aplastados"], "method": ["Para la pasta de curry rojo tailandés, coloque todos los ingredientes, incluido el agua de remojo, en un mortero, o procesador de alimentos, y mezcle hasta formar una pasta fina.", "Para el curry de langosta, caliente un wok o sartén hasta que esté caliente, agregue tres cucharadas de la pasta de curry y cocínelo hasta que comience a cambiar el color, luego agregue la leche de coco.", "Deje que hierva a fuego lento y cocine durante cinco minutos, luego agregue la salsa de pescado, el tamarindo, la lima y el azúcar. Compruebe el condimento y agregue sal y pimienta negra recién molida según sea necesario.", "Retire con cuidado la carne de las langostas cocidas, reserve las conchas y coloque la carne en la salsa de curry y cocine a fuego lento hasta que esté bien caliente.", "Agregue el cilantro y revuelva, luego coloque la carne de la langosta dentro de las cáscaras.", "Para el taco Thai, caliente un wok hasta que esté caliente, agregue el aceite, el chalote, el chile, el ajo y el jengibre y saltee por un minuto.", "Agregue las gambas y cocine por otro minuto.", "Agregue los fideos y los brotes de soja y saltee para calentar. A continuación, agregue la pasta de tamarindo, salsa de pescado, salsa de soja y jugo de lima y revuelva para cubrir todo uniformemente.", "Cocine por 1-2 minutos, hasta que esté caliente, luego agregue el cilantro picado.", "Para servir, apile la almohadilla tailandesa en cada plato y espolvoree con cacahuates triturados.", "Coloque la langosta junto a la almohadilla tailandesa y cuchara sobre la salsa de curry para terminar."], "url": "www_bbc_co_uk_food_recipes_lobster_red_thai_curry_84326", "title": "Langosta de curry tailandés con tailandeses Thai", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 langosta cocinada, cáscara eliminada, cola cortada en trozos y garras dejadas enteras", "50g / 1¾oz de harina natural", "50g / 1¾oz de polenta molida", "pizca de pimentón ahumado caliente", "botón de mantequilla", "sal y pimienta negra recién molida", "1 aguacate, pelado, removido de piedra, toscamente picado", "1 chile verde, finamente picado", "pellizcar el comino molido", "1 lima, solo jugo", "2 cucharadas de aceite de oliva", "1 mango maduro, aproximadamente picado", "1 cucharadita de hojas de estragón fresco picado", "2 cebollas tiernas, finamente picadas", "1 cucharadita de jengibre fresco de raíz finamente picado", "1 diente de ajo, aplastado", "splash mirin", "splash light salsa de soja", "salpicar aceite de sésamo", "2 rollos de brioche, cortados a la mitad", "Salsa de chile Sriracha"], "method": ["Para hacer la mantequilla de aguacate, coloque todos los ingredientes en un procesador de alimentos y mezcle hasta lograr un puré suave.", "Para hacer el chutney de mango, coloque todos los ingredientes en un tazón grande y mezcle bien.", "Precaliente una freidora a 180 ° C. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Mezcle la harina, la polenta y el pimentón en un tazón poco profundo. Espolvoree la carne de la cola en la mezcla y sacuda el exceso. Freír a fuego lento durante 2-3 minutos, hasta que estén dorados.", "Mientras tanto, caliente la mantequilla en una sartén y saltee las pinzas durante 2-3 minutos, o hasta que estén doradas.", "Para servir, tueste los rollos de brioche y unte con la mantequilla de aguacate. Rellena los panecillos con la cola crujiente y la carne de garra y el chutney de mango. Termina con un apretón de Sriracha."], "url": "www_bbc_co_uk_food_recipes_lobster_roll_with_13362", "title": "Rollos de langosta con mantequilla de aguacate y chutney de mango fresco", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["40 g / 1½ oz de mantequilla", "1 cebolla, más o menos picada", "2 zanahorias grandes, más o menos picadas", "4 ramitas de tomillo fresco", "50ml / 2fl oz de brandy", "750ml / 1pint 6fl oz de caldo de pollo", "Crema doble 110ml / 4fl oz", "Harina de pasta 300g / 11oz '00', más extra para quitar el polvo", "4 huevos de gallinas camperas", "Filete de salmón 125 g / 4½ oz, pelado", "Crema doble 50ml / 2fl oz", "¼ limón, solo jugo", "sal y pimienta negra recién molida", "1 x 750 g / 1 libra de langosta cocida de 11oz, carne retirada y en rodajas, caparazón reservado", "1 cucharada de aceite de oliva", "2 cucharadas de perifollo fresco picado", "50g / 2oz de mantequilla", "2 puerros, cortados en cintas de 7.5cmx1cm / 3inx1in", "2 calabacines, cortados en cintas de 7.5cmx1cm / 3inx1in", "12 espárragos finos", "1 centavo micro berro"], "method": ["Para la salsa, caliente una sartén, agregue la mantequilla y la cáscara de langosta reservada y fríe durante 5-6 minutos. Agregue las verduras y fría por 3-4 minutos.", "Agregue el brandy, deje calentar brevemente, luego incline lentamente la sartén hacia la llama, o enciéndala con una cerilla. Deje que las llamas se enciendan y luego se apaguen. Cocine por 2-3 minutos más, luego agregue el caldo. Llevar la mezcla a ebullición y cocinar por otros 20 minutos.", "Cuele la salsa en una cacerola limpia, agregue la crema y cocine por un minuto más. Sazonar, al gusto, con sal y pimienta negra recién molida. Mantener caliente", "Para los ravioles de langosta, coloque la harina y tres de los huevos en un procesador de alimentos y pulse hasta que se formen pequeñas migas. Incline la mezcla sobre una superficie de trabajo ligeramente enharinada y agréguela para formar una masa. Amasar ligeramente durante 2-3 minutos, o hasta que la masa esté suave y elástica.", "Envuelva la masa en una película adhesiva y déjela enfriar en la nevera durante 20 minutos.", "Mientras tanto, mezcle el filete de salmón y la crema en un pequeño procesador de alimentos con un puré. Sazonar con el jugo de limón, sal y pimienta negra recién molida.", "Coloque la masa de pasta sobre una superficie de trabajo limpia y plana espolvoreada con harina. Enrolla la masa en un rectángulo áspero, luego rocía con harina.", "Divida la pasta en dos piezas, luego pase cada pieza a través de una máquina de pasta varias veces, reduciendo gradualmente el grosor hasta llegar a la configuración más delgada y la pasta se siente elástica. (Cubra cualquier masa de pasta que no esté usando con película adhesiva para que no se seque).", "Coloque una hoja de pasta en la superficie de trabajo y coloque cucharadas de la mezcla de salmón a intervalos a lo largo de la hoja, dejando un espacio de 6 cm / 2½ pulgadas entre cada pila. Ponga ocho montones de salmón y cubra cada montón con la carne de langosta rebanada.", "Batir el huevo restante en un recipiente. Ligeramente cepille el huevo batido alrededor de las pilas de langosta. Cubra con una segunda hoja de pasta y presione ligeramente alrededor de los bordes de la langosta. Usando un cortador de pasteles, elimine ocho raviolis en círculos de 6cm / 2½ pulgadas.", "Ponga a hervir una olla grande de agua con sal y cocine los raviolis durante 1-2 minutos, o hasta que floten en la parte superior de la sartén. Escurrir, luego mezclar con el perifollo, el aceite de oliva y sazonar con sal y pimienta negra recién molida.", "Para los calabacines salteados y los puerros, caliente una sartén hasta que esté caliente, agregue la mantequilla y las verduras y fría por 2-3 minutos, o hasta que se ablanden. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Mientras tanto, pula los espárragos en una cacerola con agua hirviendo con sal durante 2-3 minutos, o hasta que estén tiernos.", "Para servir, coloca los calabacines salteados y los puerros en el centro de los platos para servir. Cubra con los ravioles de langosta y las espárragos. Rocíe la salsa y termine con una dispersión de berros."], "url": "www_bbc_co_uk_food_recipes_lobster_ravioli_with_90812", "title": "Raviolis de langosta con calabacines salteados y puerros", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]